{"id": "S01E16_001", "text": "THE ONE WITH TWO PARTS, PART 1\nWritten by: Marta Kauffman & David Crane Transcribed by: Mindy Mattingly With Minot Adjustments by: Tennant Stuart", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 1, "scene_id": "S01E16_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S01E16/scenes/S01E16_001"}}
{"id": "S01E16_002", "text": "[Scene: Rifts Restaurant, as seen in Mad About You, Joey and Chandler are there.]\nChandler: This is unbelievable. Its been like a half an hour. If this was a cartoon, youd be looking like a ham right about now.\n(Ursula Buffay, Phoebes identical twin sister, is waiting on tables in her inimitable manner.)\nJoey: Theres the waitress. Excuse me, Miss. Hello, Miss?\n(Ursula spins around looking puzzled, quite unable to tell where the sound is coming from.)\nChandler: Its Phoebe! Hi!\n(Ursula notices Joey waving his hand, and comes over.)\nUrsula: Hi. Okay, will that be all?\nChandler: Wait, wait! Wh-what are you doing here?\nUrsula: Yeah, um, I was over there, then you said, \"Excuse me, hello Miss,\" so now Im here.\nJoey: No, no... how come you are working here?\nUrsula: Right, yeah, cause its close to where I live, and the aprons are really cute.\nChandler: Can we start over?\nUrsula: Yeah. Okay great. Im gonna be over here. (She wanders away.)\nChandler and Joey: No, no, no!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 2, "scene_id": "S01E16_002", "location": "Rifts Restaurant", "scene_description": "as seen in Mad About You, Joey and Chandler are there.", "characters": ["Chandler", "Chandler and Joey", "Joey", "Ursula"], "firestore_path": "/episodes/S01E16/scenes/S01E16_002"}}
{"id": "S01E16_003", "text": "[Scene: A wintry February day in New York City, snowplows are clearing the streets. Inside Central Perk, all three girls are paying court to Ross.]\nRoss: I dont know whether hes testing me, or just acting out, but my monkey is out of control. But, he keeps erasing the messages on my machine, \"supposedly\" by accident.\nRachel: No, yeah, Ive done that.\nRoss: And then, like three days in a row he got to the newspaper before I did, and peed all over the crossword.\nRachel: Ive never done that.\n(Outside in the street, Joey and Chandler arrive, to peer through the window at Phoebe, by bending down to look underneath the shops signa large steaming cup of coffee.)\nChandler: All right, now look at her and tell me she doesnt look exactly like her sister.\nJoey: Im sayin I see a difference.\nChandler: Theyre twins!\nJoey: I dont care. Phoebes Phoebe. Ursulas... hot!\n(Joey and Chandler come indoors.)\nChandler: You know that thing, when you and I talk to each other about things?\nJoey: Yeah.\nChandler: Lets not do that any more.\n(They hang up their coats and scarves, then approach their friends on the main sofa.)\nAll: Hey guys! Hey!\nJoey: Hey Pheebs, guess who we saw today.\nPhoebe: Ooh, ooh, fun! Okay... um, Liam Neeson.\nJoey: Nope.\nPhoebe: Morly Safer.\nJoey: Nope.\nPhoebe: The woman who cuts my hair!\nMonica: Okay, look, this could be a really long game.\nChandler: Your sister Ursula.\nPhoebe: (Her face dropping) Oh, really.\nChandler: Yeah, yeah, she works over at that place, uh...\nPhoebe: Rifts. Yeah, I know.\nChandler: Oh, you do? Because she said you guys havent talked in like years.\nPhoebe: Hmmm? Yeah. So, um, is she fat?\nJoey: Not from where I was standin.\nPhoebe: (Turning to Chandler) where were you standing?\nRachel: Um, Pheebs, so, you guys just dont get along?\nPhoebe: Its mostly just dumb sister stuff, you know, I mean, like, everyone always thought of her as the pretty one, you know... Oh, oh, she was the first one to start walking, even though I did it... later that same day. But, to my parents, by then it was like \"yeah, right, well what else is new?\"\nRoss: Oh, Pheebs, Im sorry, Ive got to go. Ive got Lamaze class.\nChandler: Oh, and Ive got Earth Science, but I'll catch you in Gym.\nRachel: So, is this just gonna be you and Carol?\nRoss: No, Susans gonna be there too. Weve got dads, weve got lesbians, the whole parenting team.\nRachel: Well, isnt, isnt that gonna be weird?\nRoss: No, no. (Distractedly putting on a jacket to go out) I mean, it mighta been at first, but by now I, I think Im pretty comfortable with the whole situation.\nMonica: Ross, thats my jacket.\nRoss: I know.\n(Rachel grins as Ross removes the girlie jacket, grabs his own, and rushes out.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 3, "scene_id": "S01E16_003", "location": "A wintry February day in New York City", "scene_description": "snowplows are clearing the streets. Inside Central Perk, all three girls are paying court to Ross.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S01E16/scenes/S01E16_003"}}
{"id": "S01E16_004", "text": "[Scene: The Lamaze class, several couples and one trio sit on the floor, introducing themselves to the teacher, whos got as far as a woman sitting next to Ross, Carol, and Susan.]\nWoman: Hi, were the Rostins. Err, Im J.C., and hes Michael, and were having a boy, and a girl.\nTeacher: Good for you. Alrighty, next?\nRoss: Hi, um, Im err, (has to clear his throat) Im Ross Geller, and err ah... (pats Carols bulge) ..thats, thats my boy in there, and uh, (points) this is Carol Willick, and this... is Susan Bunch. Susan is um Carols, just, com... (embarrassment finally overwhelms the poor fellow, who becomes incoherent until) ..whos next?\nTeacher: Im sorry, I didnt get... Susan is?\nRoss: Susan is Carols, Carols, Carols, friend...\nCarol: Life partner.\nRoss: Like buddies.\nSusan: Like lovers.\nRoss: You know how close women can get.\n(The teacher smiles, but her eyebrows go up. Susan and Carol pat each other affectionately.)\nCarol: Susan and I live together.\nRoss: Although I was married to her.\nSusan: Carol, not me.\nRoss: Err, right.\nCarol: Its a little complicated.\nRoss: A little.\nSusan: But were fine.\nRoss: Absolutely. (Turns back to the woman next to him.) So, twins... hah! Thats like two births. (He struggles again.) Ouch.\n[Scene : Chandler's Office, Chandler is working.]\n(Helens buzzer is heard on the intercom, so Chandler presses his button, too.)\nChandler: And (he imitates the buzzer) to you too, Helen.\nHelen: (Over the intercom) Nina Bookbinder is here to see you.\nChandler: Oh, okay. Send her in.\n(He hurriedly checks his hair in his computer screen, before taking a sporting trophy from a drawer to place ostentatiously on his desk. An attractive young woman opens the door.)\nNina: Hi.\nChandler: Hi, Nina. Come on in.\nNina: You wanted to see me?\nChandler: Uh, Yes. Yes. Ive just been going over your data here, and little thing, youve been post-dating your Friday numbers.\nNina: Which is bad, because?\nChandler: Well, it throws my WENUS out of whack.\nNina: Your... excuse me?\nChandler: WENUS. (Coughs) Weekly Estimated Net...\nNina: Oh, Net Usage Statistics, right. Gotcha, gotcha. Wont happen again. I wouldnt want to do anything to hurt your... \"wenus.\"\n(Nina beams flirtatiously at Chandler, who catches her drift, but for once hes lost for something to say &ndash; so she nods her head to tell him that hes thinking correctly...)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 4, "scene_id": "S01E16_004", "location": "The Lamaze class", "scene_description": "several couples and one trio sit on the floor, introducing themselves to the teacher, whos got as far as a woman sitting next to Ross, Carol, and Susan.", "characters": ["Carol", "Chandler", "Helen", "Nina", "Ross", "Susan", "Teacher", "Woman"], "firestore_path": "/episodes/S01E16/scenes/S01E16_004"}}
{"id": "S01E16_005", "text": "[Scene: Monica and Rachel's, Ross, Chandler, and the girls are dividing some Chinese takeout, while the sitcom Family Matters is playing on the TV.]\nChandler: Its not just that shes cute, okay. Its just that... shes really really cute.\nRoss: It doesnt matter. You dont dip your pen in the company ink.\n(Marcel scampers about, interfering with the neatness.)\nMonica: Ross, your little creatures got the remote again.\nRoss: Marcel, Marcel, give Rossie the remote. Marcel. Marcel, you give Rossie the remote right now... Marce... you give Rossie the remote...\n(Marcel points the remote at Monicas television, pressing a particular combination of keys. The logo SAP appears on the screen, and suddenly the dialogue is dubbed into Spanish.)\nMonica: Great.\nRoss: Relax, Ill fix it.\nRachel: (Looking at the television) Cool... \"Urkel\" in Spanish is \"Urkel.\"\nRoss: (looking at the remote) How did he do this?\nChandler: (Looking out at the balcony) So tell me something, is leaving the Christmas lights up part of your plan to keep us merry all year long?\n(Rachel slowly spins around, finally noticing that the lights have outstayed their welcome.)\nMonica: Ah no, you see, someone was supposed to take them down around New Years... but obviously someone forgot.\nRachel: Well, someone was supposed to write \"Rach, take down the lights\" and put it on the re... frigerate... (finally noticing Monicas note stuck to the refrigerator) How long has that been there?\n(Joey enters, looking extremely pleased with himself.)\nChandler: Hey, where you been?\nJoey: I went back to Riffs. I think Ursula likes me. All I ordered was coffee, she brought me a tuna meltt and four plates of curly fries.\nChandler: Score.\nJoey: She is so hot!\nChandler: Yeah, listen. Okay, before you do anything Joey-like, you might wanna run it by err... (he indicates Phoebe, who is helping Ross understand the remote control.)\nJoey: Pheebs?\nPhoebe: (Jumping up) Yeah?\nJoey: You think it would be okay if I asked out your sister?\nPhoebe: Why? Why would you wanna... do that? Why?\nJoey: So that if we went out on a date, shed be there.\nPhoebe: Well, I mean, Im not my sisters, you know, whatever, and um... I mean, its true, we were one egg, once, but err, you know, weve grown apart, so, um... I dont know, why not? Okay.\nJoey: Cool, thanks.\n(He happily gestures at Chandler that there was nothing to worry about, then exits. Rachel and Monica are concerned for poor Phoebe, who slides back down next to Ross.)\nRoss: You okay?\nPhoebe: Yeah Im fine.\nRoss: You wanna watch Laverne y Shirley?\n(The sitcom begins with its familiar refrain, yet with a Latin lilt. Rachel and Monica do a little dance with their chopsticks, and Phoebe has to grin as Ross joins in the rhythm.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 5, "scene_id": "S01E16_005", "location": "Monica and Rachel's", "scene_description": "Ross, Chandler, and the girls are dividing some Chinese takeout, while the sitcom Family Matters is playing on the TV.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S01E16/scenes/S01E16_005"}}
{"id": "S01E16_006", "text": "[Scene: Lamaze class. Susan is there. Each couple has a doll, for they have just finished learning how to change a diaper. As Ross rushes in, stepping on the Rostins pretend baby, squashing its head flat. It bleats, in protest. He performs emergency surgery, then hands the doll back to J.C.]\nRoss: Sorry.\nRoss: Hi. Sorry Im late. Wheres, wheres Carol?\nSusan: Stuck at school. Some parent-teacher thing. You can go. Ill get the information.\nRoss: No... No... No. I think I should stay, I think we should both know whats going on.\nSusan: Oh, good. Thisll be fun.\nTeacher: Alrighty. Were gonna start with some basic third stage breathing exercises, so Mummies, why dont you get on your back? And... coaches, you should be supporting Mummys head.\n(Ross and Susan each gesture for the other to lie down.)\nRoss and Susan: What? What? What?\nSusan: I am supposed to be the mommy?\nRoss: Okay, Im gonna play my sperm card one more time.\nSusan: Look, I dont see why I should have to miss out on the coaching training just because Im a woman.\nRoss: I see. So what do you propose to do?\nSusan: I will flip you for it.\nRoss: Flip me for it? No, no, no... heads, heads, heads!\nSusan: (Triumphantly) On your back... Mom.\n(Ross gets down like all the other mothers, cradled in Susans lap like all the other fathers.)\nTeacher: Alright, Mommies, take a nice deep cleansing breath.\n(Forgetting herself, Susan does the \"Mommy\" action with Ross.)\nTeacher: Good. Now imagine your vagina is opening like a flower.\n(Ross comes out of character to glare into the distance.)\n[Scene: Chandler's Office. Chandler is playing with a toy as his boss Mr. Douglas knocks and opens the door.]\nChandler: Mr. D, hows it going, sir?\nMr. Douglas: Ohh, its been better. The Annual Net Usage Statistics are in.\nChandler: And?\nMr. Douglas: Its pretty ugly. We havent seen an ANUS this bad since the seventies.\nChandler: So what does this mean?\nMr. Douglas: Well, were gonna be layin off people in every department.\nChandler: Hey, listen, I know I came in late last week, but I slept funny, and my hair was very very &ndash;\nMr. Douglas: Not you. Relax. Ever have to fire anyone?", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 6, "scene_id": "S01E16_006", "location": "Lamaze class. Susan is there. Each couple has a doll", "scene_description": "for they have just finished learning how to change a diaper. As Ross rushes in, stepping on the Rostins pretend baby, squashing its head flat. It bleats, in protest. He performs emergency surgery, then hands the doll back to J.C.", "characters": ["Chandler", "Ross", "Ross and Susan", "Susan", "Teacher"], "firestore_path": "/episodes/S01E16/scenes/S01E16_006"}}
{"id": "S01E16_007", "text": "[Scene: Chandler's Office, later that day, Nina is in his office.]\nChandler: Nina? Nina. (He goes around his desk to where she is sitting.) Nina. (In pain) Nina.\n(She sympathetically reaches out to fondle the inner thigh of his left leg.)\nNina: Are you okay?\nChandler: (Looking down at her hand) Yes, yes I am. Err, listen, the reason that I called you in here today was, err... please dont hate me.\nNina: (Taking her hand away) What?\nChandler: (Suddenly bright) Would you like to have dinner sometime?\n(Nina gasps in surprise and relief.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 7, "scene_id": "S01E16_007", "location": "Chandler's Office", "scene_description": "later that day, Nina is in his office.", "characters": ["Chandler", "Nina"], "firestore_path": "/episodes/S01E16/scenes/S01E16_007"}}
{"id": "S01E16_008", "text": "[Scene: Central Perk, Rachel is at the counter, serving coffee to Phoebe.]\nRachel: So Pheebs, what do you want for your birthday?\nPhoebe: Well, what I really want is for my mom to be alive and enjoy it with me.\nRachel: Okay... Let me put it this way. Anything from Crabtree and Evelyn?\nPhoebe: Ooh! Bath salts would be nice.\nRachel: Ooh, okay... good.\n(Jamie Buchman and Fran Devanow enter the coffee house. They look about them as Jamie removes her coat and scarf.)\nJamie: What is this place?\nFran: Look, youre cold, I have to pee, and... (indicating the sign) ..theres a cup of coffee on the window. How bad could it be?\n(Jamie notices Phoebe sitting at the counter.)\nJamie: I think we have an answer.\nFran: Whats she doing here?\nJamie: This could be Gods way of telling us to eat at home.\nFran: Think she got fired at Riffs?\nJamie: No, no, no. We were there last night. She kept... (shuddering at the memory) ..bringing swordfish. (Indicating the ladies bathroom) are you gonna go to the, um?\nFran: Im gonna wait till after we order. Its her, right.\nJamie: It looks like her.\n(Phoebe walks by, ignoring the two strangers.)\nJamie: Um, excuse me.\nPhoebe: Yeah?\nJamie: Hi, its us.\nPhoebe: (Smiling blankly) Right, and its me.\nJamie: So, so youre here too?\nPhoebe: Much as you are.\nJamie: (Without moving her lips) Your turn.\nFran: Err... we know what we want.\nPhoebe: (Philosophically) Oh, thats good.\nJamie: All we want is two Caffe Lattes.\nFran: And some biscottie cookies.\nPhoebe: Good choice.\n(Phoebe turns away so that the two weird women wont see the face she pulls, and sits down.)\nJamie: Definitely her.\nFran: Yeah.\nCommercial break", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 8, "scene_id": "S01E16_008", "location": "Central Perk", "scene_description": "Rachel is at the counter, serving coffee to Phoebe.", "characters": ["Fran", "Jamie", "Phoebe", "Rachel"], "firestore_path": "/episodes/S01E16/scenes/S01E16_008"}}
{"id": "S01E16_009", "text": "[Scene: Monica and Rachels, Phoebe is watching a Spanish version of The Waltons. At a nearby table sit Monica knitting, Rachel winding a ball of wool, and Chandler supplying them both from a skein which is spread between his hands.]\n(Phoebe uses the remote to stop the Spanish by turning off the television.)\nMonica: I cant believe you. You still havent told that girl she doesnt have a job yet?\nChandler: Well, you still havent taken down the Christmas lights.\nMonica: Congratulations, I think youve found the worlds thinnest argument.\nChandler: Im just trying to find the right moment, you know?\nRachel: Oh, well, that shouldnt be so hard, now that youre dating. (Imitating men at their worst) \"Sweetheart, youre fired, but how bout a quickie before I go to work?\"\n(Joey lets himself in, carrying a large paper shopping bag.)\nJoey: Hey.\nRachel and Chandler: Hey.\n(There is a loud knocking at the door through which Joey has just entered.)\nChandler: You know, once youre inside, you dont have to knock any more.\nMonica: Ill get it.\n(She rises, dragging Chandler along by the wool. Rachel has to leap over a chair to follow them. Monica opens the door to find Mr. Heckles standing there.)\nMonica: Oh. Hi, Mr.Heckles.\nMr.Heckles: Youre doing it again.\nMonica: Were not doing anything. Were just sitting around talking, quietly.\nMr.Heckles: I can hear you through the ceiling. My cats cant sleep.\nRachel: You dont even have cats.\nMr.Heckles: I could have cats.\nMonica: (Closing the door) Goodbye Mr.Heckles.\nRachel: Well try to keep it down.\n(The wool-bound trio returns to the table. Rachel has to rush ahead to avoid becoming tangled. Joey brings the shopping bag over to Phoebe, and takes out a nice cardigan.)\nJoey: Phoebe, could you do me a favour? Could you try this on? I just wanna make sure it fits.\nPhoebe: Ooh, my first birthday present... (delightedly examining the cardigan in her lap) ..oh, this is really...\nJoey: Oh, no no no. Its for Ursula. I just figured, you know, size-wise.\nPhoebe: Ohhh... Sure, yeah... (disgustedly dropping the cardigan back into the bag) ..okay, it fits.\n(The others have been taking all this in.)\nRachel: Are you seein her again tonight?\nJoey: Yep. Ice Capades.\nChandler: Wow, this is serious. Ive never known you to pay money for any kind of capade.\nJoey: I dont know. I like her, you know. Shes different. Theres uh, somethin about her.\nPhoebe: That you like, (snappily confronting Joey over the heads of the knitting circle) we get it. You like her. Great!\n(The circle freezes in apprehension.)\nJoey: Hey, Phoebe, I asked you, and you said it was okay.\nPhoebe: Alright, well, maybe now its not okay.\nJoey: Okay... Well maybe now Im not okay with it not being okay.\nPhoebe: Okay.\n(An embarrassed silence... finally broken by)\nChandler: Knit, good woman, knit, knit!\n(Monica frantically bursts into action as Rachel resumes winding, tangling Chandlers wool.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 9, "scene_id": "S01E16_009", "location": "Monica and Rachels", "scene_description": "Phoebe is watching a Spanish version of The Waltons. At a nearby table sit Monica knitting, Rachel winding a ball of wool, and Chandler supplying them both from a skein which is spread between his hands.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Rachel and Chandler"], "firestore_path": "/episodes/S01E16/scenes/S01E16_009"}}
{"id": "S01E16_010", "text": "[Scene: Chandler's Office, Chandler & Nina are locked in a passionate embrace. Someone knocks, so they hurriedly separate to stare out of the window. Chandlers boss opens the door.]\nChandler: And thats the Chrysler Building right there.\nMr. Douglas: Nina.\nNina: Mr.Douglas... (flirting defensively) ..cool tie.\n(She escapes, fortunately so distracting Mr. Douglas, that he misses Chandlers expression of alarm & guilt.)\nMr. Douglas: (Shutting the door, then pointing vaguely at Ninas shapely departure) Shes still here.\nChandler: Yes, yes she is. Didnt I memo you on this? See, after I let her go, err, I got a call from her psychiatrist, Dr. Flanen-nen, Dr. Flanen, Dr. Flan. \n(Thinking quickly, Chandler desperately tries to remember anything to do with schizophrenia....) \nChandler: And err, he informed me that uh, she took the news rather badly, in fact, he uh, mentioned the word frenzy.\nMr. Douglas: Youre kidding? She seems so...\nChandler: Oh, no, no. Nina... (miming fairies twinkling around his head) ..she is whooo wewee-woo whoo whoo! In fact, if you asked her right now, she would have no recollection of being fired at all, none at all.\nMr. Douglas: Thats unbelievable.\nChandler: And yet, believable. So I decided not to fire her again until I can be assured that she will be no threat to herself, or others.\nMr. Douglas: I see. I guess you never really know whats goin on inside a persons head.\nChandler: Well, I guess thats why they call it psychology, sir.\n(Mr. Douglas screws up his eyes, trying to credit what Bing has just said, but turning to follow Nina down the corridor, he realises Bing must be telling the truth, since he would not have any personal interest in the girl, would he?)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 10, "scene_id": "S01E16_010", "location": "Chandler's Office", "scene_description": "Chandler & Nina are locked in a passionate embrace. Someone knocks, so they hurriedly separate to stare out of the window. Chandlers boss opens the door.", "characters": ["Chandler", "Nina"], "firestore_path": "/episodes/S01E16/scenes/S01E16_010"}}
{"id": "S01E16_011", "text": "[Scene: Lamaze class, Ross is again on the floor, cradled in Susans lap, but now Carol is cradled in his lap, and she has a pretend baby, on her lap. The teacher is showing her class a video, which is about to end.]\nSoothing male voice: ..a sound Mom and Dad never forget. For this after all, is the miracle of birth.\nTeacher: Lights please? And thats having a baby. Next week is our final class.\n(People start getting up. Ross grabs Carols doll to hold it upside down like a football, slapping it with his other hand.)\nRoss: Susan, go deep.\n(Susan just glares back, as Rosss inappropriate joke falls flat. Meanwhile, a bubble is about to burst...)\nCarol: This is impossible. Its just impossible.\nSusan: What is, honey?\nCarol: What that woman... did. I am not doin that. Its just gonna have to stay in, thats all, everything will be the same, itll just stay in.\nRoss: Carol, honey, shhh, shhh, everythings gonna be alright.\nCarol: (screaming at Ross) Oh, what do you know? No one's going up to you and saying, \"Hi, is that your nostril? Mind if we push this pot roast through it?\"\nSusan: Carol, Carol, sweetie. Cleansing breath.\n(Both women gulp in air. Ross looks at his \"football,\" then manipulates the head & limbs back into place, until it resembles what it represents.)\nSusan: I know its frightening, but, big picture. The birth part is just one day, and when its over, were all gonna be parents for the rest of our lives.\n(Ross is staring blankly into space.)\nSusan: I mean, thats what this is all about, right? Ross? Ross?\n[Scene 13: Central Perk, the gang is gathered around Monica comforting her brother, who in a slight state of shock is cuddling a cushion for security.]\nRoss: Im gonna be a father.\nRachel: This is just occurring to you?\nRoss: I always knew I was havin a baby, I just never realised the baby was having me.\nRachel: (She comforts him too) Oh, youre gonna be great!\nRoss: Aw, how can you say that? I cant even get Marcel to stop eating the bath mat. How am I gonna raise a kid?\nChandler: You know, Ross, some scientists are now saying that, that monkeys and babies are actually different.\n(Joey tires of this, so he gets up to leave.)\nPhoebe: Wherere you going?\nJoey: Out.\nPhoebe: With?\nJoey: (Spreading his arms wide) Yes.\nPhoebe: Alright, could I just ask you one question?\n(Joey nods his head.)\nPhoebe: Have you two, you know... like... you know... you know... yet?\nJoey: Well, not that its any of your business, but, no, we havent, okay?\n(Joey walks toward the door, then hesitates and turns back.)\nJoey: You meant sex, right?\n(Phoebe buttons her lip, while the rest of the gang pretend theyre not there.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 11, "scene_id": "S01E16_011", "location": "Lamaze class", "scene_description": "Ross is again on the floor, cradled in Susans lap, but now Carol is cradled in his lap, and she has a pretend baby, on her lap. The teacher is showing her class a video, which is about to end.", "characters": ["Carol", "Chandler", "Joey", "Phoebe", "Rachel", "Ross", "Soothing male voice", "Susan", "Teacher"], "firestore_path": "/episodes/S01E16/scenes/S01E16_011"}}
{"id": "S01E16_012", "text": "[Scene: Chandler's Office, Chandler is working as Nina knocks, then opens the door.]\nNina: Do you have a sec?\nChandler: Ah, sure, Nina. Whats up?\nNina: I dont know. For the past couple days, people have been avoiding me and giving me these really strange looks.\nChandler: Oh, well, ah... maybe thats because theyre ah... jealous, of us.\nNina: Maybe. But that doesnt explain why they keep taking my scissors.\nChandler: Ah, well, maybe thats, ah, because youre getting a big raise.\nNina: I am?\nChandler: Sure, why not?\nNina: Oh my god! (Rushing over to give him a big hug) Youre amazing!\nChandler: Oh, you dont know. (Presses a button.) Helen, could you make sure we put through the paperwork on Miss Bookbinders raise?\nHelen: (Over the intercom) So you still want me to send her psychological profile to Personnel?\nNina: What?\nChandler: Helen drinks. (Insincerely) Will you marry me?\n(Nina puts her hands on her hips, then gives Chandler a quizzical look.)", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 12, "scene_id": "S01E16_012", "location": "Chandler's Office", "scene_description": "Chandler is working as Nina knocks, then opens the door.", "characters": ["Chandler", "Helen", "Nina"], "firestore_path": "/episodes/S01E16/scenes/S01E16_012"}}
{"id": "S01E16_013", "text": "[Scene: Monica and Rachels, Ross, Rachel, Chandler, and Phoebe are sharing a bowl of popcorn, while Monica carefully reads the instruction manual for her television set.]\nChandler: Well, I ended up telling her everything.\nRachel: Oh, howd she take it?\nChandler: Pretty well. Except for the stapler thing. (He holds up a bandaged hand.) Little tip: if youre ever in a similar situation, never ever leave your hand... (he mimes Nina taking her revenge) ..on the desk.\nMonica: Okay, I think I get how to do this.\n(Monica points the remote at her TV, and punches out a key combination from the book, but the dreaded SAP logo remains and Spanish still comes forth.)\nPhoebe: Alright, so, can we turn this off? Can we just make it... make them go away? Because I cant, I cant watch.\nMonica: (Remotely turning off the television) okay, Pheebs, theyre gone.\nPhoebe: Okay.\nMonica: Are you alright?\nPhoebe: Yeah. Its just, you know, its this whole stupid Ursula thing, its...\nRachel: Okay, Pheebs, can I ask? So, hes going out with her. I mean, is it really so terrible?\nPhoebe: Um, yeah. Look, I mean, Im not saying shes like evil or anything. She just, you know, shes always breaking my stuff. When I was eight, and I wouldnt let her have my Judy Jetson thermos, so she threw it under the bus. And then, oh, and then there was Randy Brown, who was like... Have you ever had a boyfriend who was like your best friend?\nMonica and Rachel: (Wistfully, shaking their heads) No.\nPhoebe: Well, but thats what he was for me. And she you know, kind of stole him away, and then... broke his heart... and then he wouldnt even talk to me any more. Because he said he didnt wanna be around... anything that looked like either one of us.\nRachel: Oh... Oh, Pheebs.\nPhoebe: I mean, I know Joey is not my boyfriend, or my thermos, or anything, but...\nChandler: Youre not gonna lose him.\nMonica: Hon, you gotta talk to Joey.\nPhoebe: Yeah. Okay.\nRoss: No, come on, he doesnt know this stuff. If he knew how you felt.\nPhoebe: But hes falling in love with her.\nRachel: Oh please, theyve been going out a week. They havent even slept together yet, I mean, thats not serious.\nPhoebe: Okay... Okay.\n(Monica and Ross indicate that they mean right now.)\nPhoebe: Oh, okay, oh.\n(Phoebe gets up and walks across the hallway, but the door to Chandler and Joeys apartment is shut. She knocks, and anxiously waits for Joey to come, but instead her identical twin sister emerges wearing one of Joeys shirts.)\nUrsula: (Surprised) Oh.\n(Phoebe reels back in shock, while Ursula defiantly leans against the doorpost as though she owns the place.)\nUrsula: Yeah, um, may we help you?\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 13, "scene_id": "S01E16_013", "location": "Monica and Rachels", "scene_description": "Ross, Rachel, Chandler, and Phoebe are sharing a bowl of popcorn, while Monica carefully reads the instruction manual for her television set.", "characters": ["Chandler", "Monica", "Monica and Rachel", "Phoebe", "Rachel", "Ross", "Ursula"], "firestore_path": "/episodes/S01E16/scenes/S01E16_013"}}
{"id": "S01E16_014", "text": "[Scene: Monica and Rachel's Balcony, Rachel is taking down the Christmas lights. Monica sees her, so she leans out of the small side window.]\nMonica: Rachel, what are you doing? Its freezing out here. Would you come back inside?\nRachel: No no no no no. You wanted me to take them down, so... (she climbs onto the railing to reach the top of a pole) ..Im takin em down. Okay? Whoa! (Screams.)\n(Rachel slips, loses her balance, and falls over the edge..)\nMonica: Oh-my-god Rachel! (Rushing out to look over the edge) Rachel!\n(In the apartment below, Mr.Heckles is trying to relax and read his newspaper, but Rachel is helplessly dangling upside-down with her ankle wrapped up in the Christmas lights.)\nRachel: (To Monica) Im okay! Im okay! (She knocks on Mr. Heckles's window.) Mr. Heckles, Mr. Heckles could you help me please?\nMr.Heckles: See, this is just the kind of thing I was talking about.\nEnd", "metadata": {"chunk_type": "scene", "season": 1, "episode_number": 16, "episode_id": "S01E16", "episode_title": "THE ONE WITH TWO PARTS, PART 1", "scene_number": 14, "scene_id": "S01E16_014", "location": "Monica and Rachel's Balcony", "scene_description": "Rachel is taking down the Christmas lights. Monica sees her, so she leans out of the small side window.", "characters": ["Monica", "Rachel"], "firestore_path": "/episodes/S01E16/scenes/S01E16_014"}}
