{"id": "S03E14_001", "text": "THE ONE WITH PHOEBE'S EX-PARTNER\nWritten by: Wil Calhoun Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 1, "scene_id": "S03E14_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E14/scenes/S03E14_001"}}
{"id": "S03E14_002", "text": "[Scene: Central Perk, the gang, except Rachel, is watching a new singer.]\nSinger: (singing) Cause every time I see your face, I cant help but fall from grace. I know.....\nJoey: Wow! This girl is good.\nPhoebe: Oh-ho yeah! A song with rhyming words. Oo, I never thought of that before.\nChandler: I like her.\nPhoebe: (to Chandler) Why? Because she can sing and play guitar and do both at the same time?\nChandler: Well, thats pretty much all Im looking for from these people.\nMonica: (to Phoebe) Look at you. All jealous.\nRoss: Yeah Pheebs, come on, you two have completely different styles. Y'know, shes more..(shakes his shoulders, like hes dancing) y'know, and youre more (sees the look from Phoebe and stops)\nSinger: (singing) beside meeeee-eeee-ee. (everyone applauds her).\nPhoebe: Okay, see, see, everyone else is happy shes done.\nSinger: Okay, my next songs called: Phoebe Buffay, What Can I Say. I Really Loved When We Were Singing Partners, And I Shouldnt Have Left You That Way.\n(The gang all looks at Phoebe.)\nPhoebe: Oh no, one of those look for the hidden meaning songs.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 2, "scene_id": "S03E14_002", "location": "Central Perk", "scene_description": "the gang, except Rachel, is watching a new singer.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross", "Singer"], "firestore_path": "/episodes/S03E14/scenes/S03E14_002"}}
{"id": "S03E14_003", "text": "[Scene: Central Perk, later.]\nSinger: Hey Phoebe.\nPhoebe: Hey Leslie, howd you know Id be here?\nLeslie: I ran into Vlad at the place where they sell the big fish, and he said you played here a lot, so umm....\nChandler: (to Ross) All right listen, I have to go to the bathroom, but if the place with the big fish comes up again. Id like know whether thats several big fish or just one big fish.\nJoey: (to Leslie) So ah, Phoebe tells us you write jingles.\nPhoebe: Actually I said she abandoned me to write jingles.\nJoey: (to Leslie) Ah, anything we might of heard of?\nLeslie: Ah, yeah, umm. (singing) Home is never far away..\nMonica, Ross, and Joey: (joining in) Home is Home Star stew.\nLeslie: Yeah, but, I dont do that anymore. I got kinda sick of it, and then I couldnt come up with anything good, so they fired me.\nPhoebe: Hmm, bummer.\nLeslie: Well, I y'know, I was just, umm, I was just thinking and hoping, that umm, maybe youd want to get back together?\nPhoebe: No. But thanks.\nLeslie: Aw come on Phoebe would you just think about it?\nPhoebe: Okay. No. But thanks.\nLeslie: Okay, ah, see ya Pheebs. (leaves)\nJoey: (to Phoebe) Wow, that was kinda brutal.\nPhoebe: Well okay, let this be a lesson to all of you, all right. Once you, once you betray me, I become like the ice woman, yknow. Very cold, hard, unyielding, y'know nothing, nothing can penetrate this icy exterior. (to Monica) Can I have a tissue, please?\nMonica: Yeah, sure.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 3, "scene_id": "S03E14_003", "location": "Central Perk", "scene_description": "later.", "characters": ["Chandler", "Joey", "Leslie", "Monica", "Phoebe", "Singer"], "firestore_path": "/episodes/S03E14/scenes/S03E14_003"}}
{"id": "S03E14_004", "text": "[Scene: Outside the bathroom, Chandler is pacing back and fourth, waiting is use it.]\nGunther: (to Chandler) Someone in there?\nChandler: No. This is just part of a dare devil game that I play called wait until the last moment before I burst and die.\n(The door opens.)\nChandler: Jeez, man did you fall..(sees its a beautiful woman coming out of the mens room) Hi! So ah, did ya, did-did-did ya fall high?\nWoman: Someone was in the lady's room, I couldnt wait. I left the lid up for ya though.\n(Gunther walks up)\nChandler: (to Gunther) Y'know what Gunther, go ah, go ahead, Im-Im talking to ah, (tries to get her to say her name). (to her) This is the part where you say your name.\nWoman: Ginger.\nChandler: Ginger. Im talking to Ginger, so.... \nGinger: Dont you have to use the bathroom?\nChandler: Nope, nope, Id just ah, Id rather talk to you. (pause) Yes, I do. Yes, I do have to go to the bathroom. (knocks on the door)\nGunther: Someone in here.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 4, "scene_id": "S03E14_004", "location": "Outside the bathroom", "scene_description": "Chandler is pacing back and fourth, waiting is use it.", "characters": ["Chandler", "Ginger", "Gunther", "Woman"], "firestore_path": "/episodes/S03E14/scenes/S03E14_004"}}
{"id": "S03E14_005", "text": "[Scene: Central Perk, the gangs putting their coats on to leave.]\nPhoebe: Wheres Chandler?\nJoey: Ah, he cant make it, he said he had to his... (sees Ginger) Whoa-oh! (hides behind the coat rack.)\nGinger: Joey? Joey Tribbiani? \n(She walks over behind the coat rack, but Joey picks it up and moves it so that hes still behind it, and she cant see him.) \nGinger: Joey I can see you okay? Youre hiding behind the coats.\n(Joey puts his finger over his mouth to tell Ross to keep quiet. Ginger looks at Monica who looks away and leave.)\nJoey: Phew, close one.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 5, "scene_id": "S03E14_005", "location": "Central Perk", "scene_description": "the gangs putting their coats on to leave.", "characters": ["Ginger", "Joey", "Phoebe"], "firestore_path": "/episodes/S03E14/scenes/S03E14_005"}}
{"id": "S03E14_006", "text": "[Scene: Rachels office, Mark is packing his stuff into a box.]\nRoss: Hi.\nRachel: Hi, sweetie!\nRoss: Hello. \nMark: Hi, Ross.\nRoss: Yeah, huh. \nRachel: Ive got some bad news.\nRoss: What?\nRachel: I can get a quick bite to eat, but then I have to come back up here.\nRoss: Come on sweetie! Youve had to work late every night for the past two weeks, what is it this time?\nMark: Actually, its kinda my fault. I-I quit today.\nRoss: (to Rachel) But work comes first! (to Mark) Oh hey, but thats sad about you though, what happened? Burn out? Burn all out, did ya?\nRachel: Nooo, hes leaving for a better job.\nRoss: Oh well thats great, so I guess this is ah, this is good bye then. Huh? (picks a pad up off Rachels desk and tosses it into his box) Good bye.\nMark: Okay, then.\nRoss: Okay.\nRachel: Well were gonna miss you around here.\nMark: Yeah, me too.\n(Rachel goes to hug him but Ross is holding one of her hands and doesnt let go, so she can only put one arm around him.)\nMark: So, see ya on Saturday.\nRachel: Yeah, you bet.\n(Ross is shocked, but Rachel drags him out of the office.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 6, "scene_id": "S03E14_006", "location": "Rachels office", "scene_description": "Mark is packing his stuff into a box.", "characters": ["Mark", "Rachel", "Ross"], "firestore_path": "/episodes/S03E14/scenes/S03E14_006"}}
{"id": "S03E14_007", "text": "[Scene: Monica and Rachel's, Phoebe and Monica are playing with a Ouija board, Phoebes beeper goes off and Monica screams.]\nPhoebe: Oh. (takes her beeper puts in a pot, covers it, and puts the pot in the oven)\nMonica: Y'know those are a delicacy in India.\nPhoebe: Yeah, that was Leslie calling again to see if we can get back together. Thats the twentieth time today! And good luck Leslie!\nMonica: Wow, she must have hurt you pretty bad, huh?\nPhoebe: Well, yeah. Y'know, we were best friends, ever since we were little, our Moms worked on the barge together.\nMonica: Oh, you two must have been so cute running around on a barge.\nPhoebe: You never run on a barge!\nJoey: (entering) Hey.\nPhoebe and Monica: Hey.\nJoey: Is ah, is Chandler around?\nMonica: No, umm, he met some girl at the coffee house.\nJoey: Oooh.\nMonica: Yeah, Ginger something.\nJoey: Nooo. No, no, ah, are you sure it wasnt something that sounded like Ginger, like ah, Gingeer?\nMonica: No, it was Ginger. I remember, because when he told me, I said, (singing) the movie star.\nJoey: Aww, man. Thats the girl I was hiding from. When she finds out hes my roommate, shes gonna tell him what I did.\nMonica: Well, what did you do?\nJoey: What, oh, oh, oh, no, no, I cant, I cant tell you that, its like the most awful, horrible thing Ive ever done my whole life.\nMonica: Y'know what, dont tell us. Well just wait until Chandler gets home, (to Phoebe) because itll be more fun that way.\nJoey: All right!! Okay, it was like four years ago. Okay, Ginger and I had gone out a few times, and then this one weekend, we went up to her Dads cabin. Just me, her, and her annoying little dog Pepper. Well that night, I cooked this really romantic dinner....\nMonica: You gave her food poisoning!?\nJoey: I wish. No. After dinner, me, her, and Pepper all fell asleep in front of the fire. Well I woke up in the middle of the night and I saw that the fire was dying out. So, I picked up a log and threw it on. Or, at least what I thought was a log.\nPhoebe: Oh my God!! You threw Pepper on the fire!\nJoey: I wish. See, I guess another thing I probably shouldve told you about Ginger is that she kinda has a ah, artificial leg.\n(Phoebe and Monica both stand up and gasp.)\nMonica: Oh my God! Joey, what did you do after you threw her leg on the fire?\nJoey: I ran!!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 7, "scene_id": "S03E14_007", "location": "Monica and Rachel's", "scene_description": "Phoebe and Monica are playing with a Ouija board, Phoebes beeper goes off and Monica screams.", "characters": ["Joey", "Monica", "Phoebe", "Phoebe and Monica"], "firestore_path": "/episodes/S03E14/scenes/S03E14_007"}}
{"id": "S03E14_008", "text": "[Scene: A street, Chandler is kissing Ginger.]\nChandler: Well, thats the best kiss Ive had with anyone Ive ever met in a mens room.\nGinger: Actually, me too.\nChandler: (sees her foot is in a slush puddle) Op, foot in a puddle, foot all in a puddle.\nGinger: Oh damn, I hate that.\nChandler: Yeah, were gonna have to get you out of those shoes.\nGinger: Oh, dont worry about it.\nChandler: No, really youre gonna freeze.\nGinger: No, Im not.\nChandler: Youre not, what do you, what do you got a bionic foot?\nGinger: Some day, maybe.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 8, "scene_id": "S03E14_008", "location": "A street", "scene_description": "Chandler is kissing Ginger.", "characters": ["Chandler", "Ginger"], "firestore_path": "/episodes/S03E14/scenes/S03E14_008"}}
{"id": "S03E14_009", "text": "[Scene: Rosss bedroom, Rachel getting into bed while Ross is reading and laughs.]\nRachel: Funny book?\nRoss: Hmmm. Oh, no, no, I just thinking about something funny I heard today. Umm, Mark, Mark saying Ill see you Saturday.\nRachel: Yeah, at the lecture, I told you that last week, you said you didnt mind.\nRoss: Oh, no, no, no, its-its not the lecture ah, I mind, umm....\nRachel: Oh, please tell me its not because Im going with Mark.\nRoss: Oh, well...\nRachel: Oh my God!!! Ross!!\nRoss: Well, Im sorry, but ah, look if youre not working with him anymore, why do you have to still do stuff with him?\nRachel: Because, hes my friend.\nRoss: Okay, but do you really need another friend? I mean...\nRachel: Okay, well if I stop playing with Joey and Chandler, can I play with Mark?\nRoss: Is that funny? Am I supposed to be laughing?\nRachel: I dont know, you thought See you Saturday was funny. Look honey, Mark is in fashion okay, I like having a friend that I can share this stuff with. You guys would never want to go to a lecture with me.\nRoss: Pa-haa!! I would love to go with you.\nRachel: Really!?\nRoss: Yeah, hey I-I have clothes, I even pick them out. I mean for, for all you know I could be a fashion..... monger.\nRachel: Okay. Honey, I would love for you to go with me. (Ross has a worried look on his face) What?\nRoss: What should I wear, now Im all nervous.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 9, "scene_id": "S03E14_009", "location": "Rosss bedroom", "scene_description": "Rachel getting into bed while Ross is reading and laughs.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E14/scenes/S03E14_009"}}
{"id": "S03E14_010", "text": "[Scene: Monica and Rachel's, Phoebe is looking at her beeper still in the pot. She takes it out, shakes it, and puts it back in.]\nMonica: Y'know they say a watched pot never beeps.\nPhoebe: Its just y'know, been a couple of hours, and she hasnt called. Not that I even care, y'know.\nMonica: Phoebe why dont you just call her? You obviously want to.\nPhoebe: You think you know me so well.\nMonica: Well, dont cha wanna?\nPhoebe: Yeah.\nMonica: Okay, well I do know you.\nPhoebe: Thats what I said.\nMonica: Well so?\nPhoebe: I cant. I cant. She dumped me, I mean I totally trusted her and then one day it was Okay, bye Pheebs gone. Y'know what the saddest part is, when we were playing together, that was like the most fun Ive ever had in like all my lives.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 10, "scene_id": "S03E14_010", "location": "Monica and Rachel's", "scene_description": "Phoebe is looking at her beeper still in the pot. She takes it out, shakes it, and puts it back in.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E14/scenes/S03E14_010"}}
{"id": "S03E14_011", "text": "[Scene: Central Perk, Leslie is singing.]\nLeslie: (singing) My best shoes, so good to me. I wear them everyday. Down at the heel, holes in the toes. Dont care what people say. My feets best friends, pals to the end. With them Im one hot chicky. Though late one night, not much light, I....\n(Phoebe runs in and joins her.)\nPhoebe: (singing) I stepped in something icky.\nPhoebe and Leslie: (singing) Sticky shoes, sticky shoes, always make me smile. Sticky shoes, sticky shoes, next time Ill.... avoid the..... pillleeeee.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 11, "scene_id": "S03E14_011", "location": "Central Perk", "scene_description": "Leslie is singing.", "characters": ["Leslie", "Phoebe", "Phoebe and Leslie"], "firestore_path": "/episodes/S03E14/scenes/S03E14_011"}}
{"id": "S03E14_012", "text": "[Scene: The lecture, Rachel is listening closely, Ross is bored out of his mind.]\nLecturer: Were beginning to see a lot of layering of sheer fabrics and colours. For instance a sheer navy blouse over a pink....\nRoss: (to Rachel) Im really glad we came. (Rachel smiles and rubs his arm) Youre so pretty. I love you.\nRachel: Oh. (puts her hand over his mouth)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 12, "scene_id": "S03E14_012", "location": "The lecture", "scene_description": "Rachel is listening closely, Ross is bored out of his mind.", "characters": ["Lecturer", "Rachel", "Ross"], "firestore_path": "/episodes/S03E14/scenes/S03E14_012"}}
{"id": "S03E14_013", "text": "[Scene: Central Perk, Phoebe is teaching Leslie how to sing Smelly Cat.]\nPhoebe: (singing) Smelly cat, smelly cat, what are they feeding you? Smelly cat, smelly cat, its not your fault.\nLeslie: Wow, thats great.\nPhoebe: Oh, yeah!\nLeslie: Y'know you could totally sell this. Itd be perfect for like umm, a kitty litter campaign.\nPhoebe: I..., a jingle? No, no-no-no, no.\nLeslie: What? Why not? You could make a ton of money.\nPhoebe: Okay, well if I was in this for the money, Id be a millionaire by now, y'know. You just got to get out of that jingle head sweetie.\nLeslie: Aw, youre right, youre right. Im sorry.\nPhoebe: Thats okay. All right, Im gonna play song thats really, really sad. Its called Magician Box Mix Up. (she turns her guitar upside down to play it.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 13, "scene_id": "S03E14_013", "location": "Central Perk", "scene_description": "Phoebe is teaching Leslie how to sing Smelly Cat.", "characters": ["Leslie", "Phoebe"], "firestore_path": "/episodes/S03E14/scenes/S03E14_013"}}
{"id": "S03E14_014", "text": "[Scene: The lecture, Ross is passed out against Rachels shoulder.]\nLecturer: ....oversized bracelets, oversized earrings, oversizing of accessories in general are very popular now.\n(Ross wakes up with a start and startles Rachel. The guy next to him starts laughing, which starts Ross laughing, Rachel gives him a look and he stops.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 14, "scene_id": "S03E14_014", "location": "The lecture", "scene_description": "Ross is passed out against Rachels shoulder.", "characters": ["Lecturer"], "firestore_path": "/episodes/S03E14/scenes/S03E14_014"}}
{"id": "S03E14_015", "text": "[Scene: Chandler and Joey's, Chandler is reading the newspaper.]\nMonica: (entering) Hi!\nChandler: Hey.\nMonica: Oh, can I borrow this? (points to his milk) My milks gone bad.\nChandler: Oh, I hate that. I once had a thing of half and half, stole my car.\nMonica: So umm, how was your date with Ginger?\nChandler: Great. It was great. Shes ah, shes great, great looking, great personality, shes greatness.\nMonica: Sounds like shes got the ah, whole package.\nChandler: Joey told you about the leg, huh?\nMonica: Uh-huh.\nChandler: Oh God, it freaked me out. Okay, I know it shouldnt have, but it did. I mean I like her, I dont want to stop seeing her, but every so often its like Hey, y'know what, wheres your leg? I mean Im the smallest person in the world arent I? Im the smallest person in the world.\nJoey: (entering from his bedroom) Morning.\nChandler: (to Monica) Actually hes the smallest person in the world.\nJoey: (to Chandler) Heard about the leg burnin huh?\nChandler: It came up.\nJoey: Listen, I ah, I know its a longshot. But, by any chance did she find that funny?\n(Both Chandler and Monica walk away in disgust.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 15, "scene_id": "S03E14_015", "location": "Chandler and Joey's", "scene_description": "Chandler is reading the newspaper.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S03E14/scenes/S03E14_015"}}
{"id": "S03E14_016", "text": "[Scene: Monica and Rachel's, Ross and Rachel are getting back from the lecture.]\nRoss: (entering) So I nodded off a little.\nRachel: Nodded off!! Ross you were snoring. My fathers boat didnt make that much noise when it hit rocks!\nRoss: Come on! Forty-five minutes! Forty-five minutes the man talked about strappy backed dresses.\nRachel: Well okay, how about four hours in a freezing museum auditorium listening to Professor Pitstains and hes Hey everybody! Remember that thing thats been dead for a gazillion years. Well theres this little bone we didnt know it had!\nRoss: First of all its Professor Pittain! And second of all, that little bone, proved that, that particular dinosaur had wings, but didnt fly.\nRachel: Okay, see now, what I just heard: blah-blah-blah, blah-blah-blah-blah-blah, blah-blah-blah, blah, blah.\nRoss: Y'know what, 100 million people went to see a movie about what I do, I wonder how many people would go see a movie called, Jurassic Parka.\nRachel: Oh, that is so...\nRoss: No-no-no, a bunch of out of control jackets take over an island. (Makes an unusual sound, then he realises that he still has his jacket on and quickly tries to shake it off, thinking its alive and attacking him.)\nRachel: Y'know if what I do is so lame, then why did you insist on coming with me this morning? Huh? Was it so I just wouldnt go with Mark?\nRoss: No. I... I wanted to be with you. I dont know, I feel like lately, I feel like youre slipping away from me, y'know. With this new job, and all these new people, and youve got this whole other life going on. I-I-I know its dumb, but I hate that Im not a part of it.\nRachel: Its not dumb. But, maybe its okay that youre not a part of it. Y'know what I mean? (Ross looks confused) I mean its like, I-I-I like that youre not involved in that part of my life.\nRoss: Thats a little clearer.\nRachel: Honey see, it doesnt mean that I dont love you. Because I do. I love you, I love you so much. But my work its-its for me y'know, Im out there, on my own, and Im doing it and its scary but I love it, because its mine. I, but, I mean is that okay?\nRoss: Sure, I-I-I... (hugs her and mouths No!!)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 16, "scene_id": "S03E14_016", "location": "Monica and Rachel's", "scene_description": "Ross and Rachel are getting back from the lecture.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E14/scenes/S03E14_016"}}
{"id": "S03E14_017", "text": "[Scene: Chandler and Joey's, Chandler and Ginger are eating dinner.]\nGinger: Your thinking about my leg arent you?\nChandler: No. No. Actually I forgot, what is the deal with that again?\nGinger: Its okay if it bothers you. Really. I mean the only thing I need to know is: How much it bothers you? because I dont like wasting my time. Am I wasting my time?\nChandler: No. No. I dont think so.\nGinger: Okay. Its just like anything else, you just have to get used to it.\n(They start making out. She opens his shirt and feels inside and stops.)\nGinger: Whats that?\nChandler: Thats-thats my nubbin.\nGinger: Whats a nubbin?\nChandler: Its kinda a ah, a third nipple kinda thing.\nGinger: You have three nipples?\nChandler: Well, y'know two regulars. And ah one that barely qualifies as... (starts to kiss her again, but she gets up.) Ahh, what?\nGinger: Nothing. I, I just remembered I have to leave.\nChandler: You ah, you have, you have to leave, now? How come?\nGinger: Ah well, its nubbin. Nothing! Umm. Y'know what, Ill see you later. Okay. (She leaves and in the hall we see her shake her shoulders like when someone runs their fingernails across a blackboard.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 17, "scene_id": "S03E14_017", "location": "Chandler and Joey's", "scene_description": "Chandler and Ginger are eating dinner.", "characters": ["Chandler", "Ginger"], "firestore_path": "/episodes/S03E14/scenes/S03E14_017"}}
{"id": "S03E14_018", "text": "[Scene: Central Perk, Phoebe is getting ready to sing as Leslie enters.]\nPhoebe: (to Leslie) Oh, I thought you werent coming. What? Where were you?\nLeslie: Come here, come here. (they go to the side of the stage) Okay, dont get mad, okay.\nPhoebe: Okay, dont give me a reason to get mad, okay\nLeslie: I played Smelly Cat for the people at my old ad agency, they went nuts.\nPhoebe: No, look, I told you that I didnt want you to try and sell it, and you just, you big fat did it anyway. God, y'know what, I think five years ago I probably wouldve done anything to play with you but, I can do it by myself. And if I cant trust you then just forget it. \nLeslie: No, no, I dont want to forget it.\nPhoebe: Okay y'know what you have to choose. All right, if-if the most important thing on the planet to you is this cat poopy thing then, okay you can have Smelly Cat, but we wont be partners. So whats it gonna be?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 18, "scene_id": "S03E14_018", "location": "Central Perk", "scene_description": "Phoebe is getting ready to sing as Leslie enters.", "characters": ["Leslie", "Phoebe"], "firestore_path": "/episodes/S03E14/scenes/S03E14_018"}}
{"id": "S03E14_019", "text": "[Scene: Monica and Rachel's, Phoebe, Monica, and Joey are watching TV.]\nCommercial: (in the background their singing Smelly Cat) Problem odour in the litter box? Dont change your kitty, change your kitty litter.\n(Monica gets up and shuts off the TV.)\nMonica: Sorry, Pheebs.\nJoey: Yeah. You okay?\nPhoebe: Yeah. I actually am, yeah. Y'know life-lifes gonna had you all kinds of stuff, y'know you learn your little lessons and hopefully you grow. Wanna hear a new song?\nJoey: Yeah.\nMonica: Wed love too.\nPhoebe: Okay. (singing) Jingle bitch screwed me over! Go to hell jingle whore! Go to hell Go to hell. Go to hell-hell-hell. Thats all I have so far.\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 19, "scene_id": "S03E14_019", "location": "Monica and Rachel's", "scene_description": "Phoebe, Monica, and Joey are watching TV.", "characters": ["Commercial", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E14/scenes/S03E14_019"}}
{"id": "S03E14_020", "text": "[Scene: Monica and Rachel's, the whole gang except Chandler is there.]\nChandler: (entering, happily) Well hello!\nJoey: Where have you been?\nChandler: The doctor.\nRoss: Is everything okay?\nChandler: Oh yes! Just had me a little nubbin-ectomy. Yep! Two nipples, no waiting.\nMonica: Wow! Its like Rachel in High School.\nRachel: What?!!\nMonica: Come on! Come on, I was kidding! It was such an obvious joke!\nChandler: That was an obvious joke, and I didnt think of it. Why didnt I think of it? The source of all my powers. Oh dear God, what have I done!\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 14, "episode_id": "S03E14", "episode_title": "THE ONE WITH PHOEBE'S EX-PARTNER", "scene_number": 20, "scene_id": "S03E14_020", "location": "Monica and Rachel's", "scene_description": "the whole gang except Chandler is there.", "characters": ["Chandler", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S03E14/scenes/S03E14_020"}}
