{"id": "S03E16_001", "text": "THE ONE THE MORNING AFTER\nWritten by: Marta Kauffman & David Crane Transcribed by: Eric Aasen \nJoey: (Voice Over) Previously on Friends.\n[A montage of scenes from The One Where Ross and Rachel Take A Break follows.]", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 1, "scene_id": "S03E16_001", "location": "", "scene_description": "", "characters": ["Joey", "Written by"], "firestore_path": "/episodes/S03E16/scenes/S03E16_001"}}
{"id": "S03E16_002", "text": "[Scene: Monica and Rachel's, Ross is eating the picnic as Rachel comes home from work.]\nRoss: I mean, I dont feel like I even have a girlfriend anymore.\nRachel: You want me to just quit my job so that you can feel like youve got a girlfriend?\nRoss: Is this about Mark?\nRachel: (shocked) Oh my God.\nRoss: Okay, its not, its not.\nRachel: Oh my God. I cannot keep having this same fight with you Ross! Look, urrgh, maybe we should take a break.\nRoss: Fine, youre right. Lets ah, lets take a break, (goes to the door) lets cool off, okay, lets get some frozen yoghurt, or something.. (opens the door)\nRachel: No. A break from us.\n(Ross looks at her, then leaves slamming the door behind him.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 2, "scene_id": "S03E16_002", "location": "Monica and Rachel's", "scene_description": "Ross is eating the picnic as Rachel comes home from work.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_002"}}
{"id": "S03E16_003", "text": "[Scene: Monica and Rachel's, Mark is there, opening Chinese food boxes.]\nRachel: Then, we had this big, stupid fight, and I said I wanted to take a break, I dont want to take a break.\nRoss: (on the phone) Ive been thinking, this is crazy, I mean dont, dont you think we can work on this? \nMark: Hey, what do you want to drink?\nRoss: Whos that?\nRachel: Nobody.\nRoss: Is that Mark?\nRachel: Umm, honey, look he just came over to....\nRoss: Yeah! Got it! (slams down the phone)\n[Scene: The Philly.]\nChloe: Hey, come dance. What? Are you married? Cause thats okay.\n[Cut to Chloe and Ross dancing, and their kiss.]\nThe Next Morning", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 3, "scene_id": "S03E16_003", "location": "Monica and Rachel's", "scene_description": "Mark is there, opening Chinese food boxes.", "characters": ["Chloe", "Mark", "Rachel", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_003"}}
{"id": "S03E16_004", "text": "[Scene: Monica and Rachel's, Monica is making a fruit drink in the blender, Rachel has just finished her shower and is coming out of the bathroom.]\nMonica: Hey.\nRachel: Hey.\nMonica: Hows the big anniversary dinner?\nRachel: Well, we never actually got to dinner.\nMonica: Ohhh, nice.\nRachel: No, we kinda broke up instead.\nMonica: What?! (She accidentally starts the blender without the lid on it and fruit flies everywhere.)\nRachel: (looking up at the ceiling) God, Monica its on the ceiling.\nMonica: Thats okay, this is more important than fruit (pause) (angrily) on my ceiling! You broke up?!\nRachel: Yeah, but its okay, because when Ross left Mark came over.\nMonica: Oh no!! \nRachel: No.\nMonica: Rachel, you and Mark?!\nRachel: No, no-no, its okay, calm down. Mark and I talked, and I realised how much I love your stupid brother, and, yeah, we got our problems, but I really want to make it work.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 4, "scene_id": "S03E16_004", "location": "Monica and Rachel's", "scene_description": "Monica is making a fruit drink in the blender, Rachel has just finished her shower and is coming out of the bathroom.", "characters": ["Monica", "Rachel"], "firestore_path": "/episodes/S03E16/scenes/S03E16_004"}}
{"id": "S03E16_005", "text": "[Scene: Rosss Bedroom, Ross is waking up. He straightens himself out on the bed and puts the covers over his head.]\nChloe: (entering from bathroom) Morning!\n(Ross sits bolt upright, without moving the covers.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 5, "scene_id": "S03E16_005", "location": "Rosss Bedroom", "scene_description": "Ross is waking up. He straightens himself out on the bed and puts the covers over his head.", "characters": ["Chloe"], "firestore_path": "/episodes/S03E16/scenes/S03E16_005"}}
{"id": "S03E16_006", "text": "[Scene: Rosss Kitchen, Ross is taking some aspirin and checking his messages.]\nRachel: (on answering machine) Hi, its me. Ive been trying to reach you all night. I feel awful. Please, Ross, you gotta know there is nothing between me and Mark. This whole break-up thing is just stupid. \nRoss: Yeah!!\nRachel: Eh, Im just so sorry I put you through it. And, I y'know, I dont want to get back together over a machine.\nRoss: Na-huh.\nRachel: So, I love you.\nRoss: I love you.\nRachel: And y'know what, Im gonna, Im gonna go to bed now, but ah, on my way to work tomorrow morning, Im gonna stop by around 8:30.\nRoss: Okay. (Ross starts frantically looking for a clock.)\nRachel: Bye.\n(Ross finds a clock, sees its almost 8:30, and silently screams.)\nRoss: Chloe, Chloe hows it coming?!!\nChloe: (entering from bedroom) Hey, what kind of puppy do you think I should get?\nRoss: Umm, oh, hey, I dont know. How about a big one?\nChloe: But my apartment is so...\nRoss: Well then a small one!! Listen, lets, we kinda have to get going!\nChloe: Wait! Wheres my shoes?\nRoss: You, you sure you need shoes? (Chloe nods her head) Okay. (reaches down and picks up a shoe)\nChloe: Do I know why were rushing?\nRoss: Yeah, y'know the ah, the girlfriend I told you about last night? (Hes frantically throwing the cushions off of the couch looking for her other shoe) Well it turns out she ah, she wants to get back together with me. Oh, I found it!! \nChloe: Thats so great for you guys!\nRoss: Yeah! \nChloe: You must be so happy!\nRoss: Yes, yes I am, one of the many things Im feeling. Well.... (picks up her coat)\nChloe: Good luck, with your girlfriend. \nRoss: Oh, thank you. (She goes to kiss him, but he holds her coat up between their faces to stop her.) Hey, hey. (opens the door, sees Rachel, and hides Chloe behind the door) Rachel!!!!\nRachel: Hi. Ohhh, you got my message.\nRoss: Yeah, oh hey, you are right on time.\nRachel: So what do you say? Can I be your girlfriend again?\nRoss: Yes, you can, very much.\n(Chloe gives Ross the thumbs up while still standing behind the door.)\nRoss: (seeing the thumbs up) Ahhhh!! (Hugs Rachel tighter.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 6, "scene_id": "S03E16_006", "location": "Rosss Kitchen", "scene_description": "Ross is taking some aspirin and checking his messages.", "characters": ["Chloe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_006"}}
{"id": "S03E16_007", "text": "[Scene: Monica and Rachel's, Phoebe is entering carry a large box, Monica is mopping the ceiling.]\nPhoebe: Hey!\nMonica: Hey.\nPhoebe: Hey, why are you mopping your ceiling?\nMonica: Oh, theres banana on it.\nPhoebe: Wow, I have the spirit of an old Indian women living in mine.\nMonica: So then you know? (Phoebe nods her head)\nPhoebe: The mailman was downstairs, so I brought up your mail.\nMonica: Oh, good. Thanks.\nPhoebe: Now what is Fabutec?\nMonica: Okay, all right dont judge me to much. Okay? Um, but I saw this info-mercial, and um, I swear to you I have never-ever bought anything on TV before, except for this mop. But there was this stuff on leg waxing, it just, it looked so amazing....\nPhoebe: Waxine!!\nMonica: Yes! Have you seen it?\nPhoebe: Oh, its incredible! I so want to be a Waxine girl.\nMonica: I know!!\nPhoebe: God. Do think it really doesnt hurt? Cause how can they do that?\nMonica: Hello! Organic substances recently discovered in the depths of the rain forest!\nPhoebe: They have the best stuff in there.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 7, "scene_id": "S03E16_007", "location": "Monica and Rachel's", "scene_description": "Phoebe is entering carry a large box, Monica is mopping the ceiling.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E16/scenes/S03E16_007"}}
{"id": "S03E16_008", "text": "[Scene: Chandler and Joey's, Ross has told Chandler and Joey his terrible act.]\nChandler: Oh my God! Oh my God!\nJoey: Yeah. We figured when we couldnt find you, youd gone home to make up with Rachel. Which is probably what you shoulda done. Huh?\nRoss: You think?! God, I, ah, Im in hell. I mean what, what am I gonna do? Rachels all like, I love you and, and lets work on this. And all I can think about is, What is she gonna do? What is she gonna say? when I tell her what I did.\nChandler: Well, before we answer that, I think we should address the more important question. How dumb are you?\nRoss: What?! Look, were trying to rebuild a relationship here, right. How am I supposed to do that here, without being totally honest with each other?\nJoey: Look, Ross look, Im on board about this totally honesty thing, I am, just not about stuff thats gonna get you in trouble.\nChandler: Hes right. Nobodys gonna benefit, and youre just gonna hurt her.\nJoey: Yeah, and there wont be a relationship left to rebuild.\nRoss: Yeah, but dont you think....\nChandler: All right look, if you absolutely have to tell her, at least wait until the timings right. And thats what deathbeds are for.\nRoss: Yeah, okay. (he plops down into one of the leather chairs, with the footrest extended.)\nJoey: All right, okay, now, we just have to make sure she doesnt find out some other way. (spins the chair around so that Ross is facing him) Did you think about the trail?\nRoss: What trail?\nJoey: (stomps on the footrest which pops Ross up into a sitting position) The trail from the woman you did it with to the woman you hope never finds out who did it! (slapping his hands with each word) You always have to think about the trail!\nRoss: Oh, I-I dont think theres any trail.\nChandler: Okay, okay-okay, ah, Chloe works with that guy Issac. Issacs sister is Jasmine. And Jasmine works at that message place with Phoebe. And Phoebes friends with Rachel. And thats the trail, I did it!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 8, "scene_id": "S03E16_008", "location": "Chandler and Joey's", "scene_description": "Ross has told Chandler and Joey his terrible act.", "characters": ["Chandler", "Joey", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_008"}}
{"id": "S03E16_009", "text": "[Scene: Monica's Bedroom, Monica and Phoebe are waxing their legs.]\nPhoebe: (reading from the instructions) After applying the Waxine and linen strips to leg number one, \nMonica: Did that!\nPhoebe: Grasp one of the linen strips by its easy grab tab and pull it off in one quick pain free motion.\nMonica: Okay. (Does so.) Ow!!!!! Ow-oh-oh!\nPhoebe: Was it not pain-free?\nMonica: No. It was painful. Oh my God , they should call it Pain-zine, now with a little wax.\nPhoebe: Huh, well, the girls in the satin nighties on the commercial dont seem to think its that bad.\nMonica: Thats because their nerves are probably deadened from being so stupid. But hey, y'know if you dont believe me, please, by my guest.\nPhoebe: (Removing one of the strips) Ow-ow-ow-ow! Oh my God!!!\nMonica: Now, are you glad we didnt start with the bikini strips?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 9, "scene_id": "S03E16_009", "location": "Monica's Bedroom", "scene_description": "Monica and Phoebe are waxing their legs.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E16/scenes/S03E16_009"}}
{"id": "S03E16_010", "text": "[Scene: The Xerox Place, Ross is trying to break the trail.]\nRoss: (entering) Chloe? Hi.. \nChloe: Is this about me taking your watch?\nRoss: You took my watch?\nChloe: Im sorry, I do that.\nRoss: Just you keep it, listen did you, did you tell anyone about us?\nChloe: Oh no. I feel it isnt really anybodys business, y'know.\nRoss: Exactly. So you didnt, didnt mention anything to Issac right?\nChloe: Oh, well I tell Issac everything.\nRoss: You tell, of course you do. Issac. Issac. Hey, Issac. Issac, hi! Y'know we havent actually met...\nIssac: You dog!\nRoss: Yes, I suppose I am a dog. But Issac, see I-I happen to have a girlfriend.\nIssac: Oh right, that Rachel chick from the coffee place.\nRoss: Yeah, thats the one. Listen, I dont want to hurt her.\nIssac: Oh, hey, man I know, doesnt matter how much we love em, monogamy is too cruel a rule.\nRoss: Yeah. Listen, can you keep this information to yourself?\nIssac: Aw, no problem dude. Y'know we got to look out for each other. Were the same, you and me.\nRoss: Actually, no, were not.\nIssac: Yeah, we are.\nRoss: No, were not.\nIssac: Yeah, we are.\nRoss: No, were not!!\nIssac: Okay, were not.\nRoss: Right.\nIssac: But, we are.\nRoss: Fine. I just need to know that youre not gonna tell your sister.\nIssac: I can promise not to tell her again.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 10, "scene_id": "S03E16_010", "location": "The Xerox Place", "scene_description": "Ross is trying to break the trail.", "characters": ["Chloe", "Issac", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_010"}}
{"id": "S03E16_011", "text": "[Scene: Phoebes Work, Ross is now trying to stop Jasmine from telling Phoebe.]\nRoss: (entering out of breath) Jasmine? \nJasmine: Uh-huh.\nRoss: We met at Phoebes birthday party, Im, Im Ross Geller.\nJasmine: You did a bad thing!\nRoss: Yes, I did.\nJasmine: Very bad!\nRoss: Very bad.\nJasmine: Very, very bad.\nRoss: Im agreeing with you. Did you, listen, did you happen to tell Phoebe yet?\nJasmine: No.\nRoss: Okay, Jasmine, please, please dont. I love my girlfriend very much, and I want more than anything to just work it out with her. Okay?\nJasmine: All right.\nRoss: Thank you, thank you.\nJasmine: But you should probably talk to my roommate, because I told him and he knows Phoebe too.\nRoss: (angrily) Whos your roommate?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 11, "scene_id": "S03E16_011", "location": "Phoebes Work", "scene_description": "Ross is now trying to stop Jasmine from telling Phoebe.", "characters": ["Jasmine", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_011"}}
{"id": "S03E16_012", "text": "[Scene: Central Perk, Gunther is wiping down the counter as Ross rushes in.]\nRoss: Gunther! Gunther. Gunther, please tell me you didnt say anything to Rachel about me and the girl from the Xerox place.\nGunther: Im sorry. Was I not supposed to?\n(Ross turns around and sees Rachel sitting by the window. She is just glaring at him.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 12, "scene_id": "S03E16_012", "location": "Central Perk", "scene_description": "Gunther is wiping down the counter as Ross rushes in.", "characters": ["Gunther", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_012"}}
{"id": "S03E16_013", "text": "[Scene: Monicas Bedroom, Monica and Phoebe are removing the rest of their wax strips.]\nMonica: Ow!\nPhoebe: Oh!!\nMonica: Ow!! Ow!!\nPhoebe: Ow!!!\nMonica and Phoebe: Ow!!!!!!! Ow-ow-ow-ow!\n(Hearing the screaming Chandler and Joey rush in. Joey has a pan, Chandler has a tea kettle.)\nPhoebe: Were all right.\nMonica: Its okay, its okay.\nPhoebe: Were all right.\nMonica: We were just waxing our legs.\nChandler: Off?!!\nPhoebe: For your information, this happens to be a pain like no man will ever experience.\nChandler: Yeah, well I dont think you can make that statement, unless youve been kicked in an area that God only meant to be treated nicely.\nJoey: Yeah, I-I think that women just have a lower threshold of pain than men, thats all. I mean, come on, its just a little wax.\nPhoebe: Oh yeah, come here. (Puts a little wax on Joeys arm and puts a strip on it.)\nChandler: Oh, thats mature.\nJoey: Okay, fine, so now what, I just pull it off?\nPhoebe: Uh-huh.\nMonica: Thats right.\n(Joey laughs, pulls it off, then does a high-pitched whine.)\n[Cut to Living Room, Rachel is trying to close the door on Ross.]\nRoss: (forcing the door open) Come on, Rachel, come on! Talk to me! Please!!\n[Cut to Monica's bedroom, Chandler slowly closes the door, and we hear Rachel from the living room.]\nRachel: I cant talk to you. I cant even look at you right now!\nMonica: What?\nChandler: Nothing, nothing.\nMonica: (going over to listen at the door) Rachel said everything was okay.\nPhoebe: (to Joey) What, what are they talking about?\nRoss: Rachel?\n[Cut to Living Room]\nRachel: Just get away from me!\nRoss: No, it was a mistake! I made a mistake! Okay?\nRachel: A mistake?! What were you trying to put it in? Her purse?!\n[Cut to Monica's bedroom]\nPhoebe: Whe-where did he put it?!\n[Cut to Living Room]\nRachel: Ross, you had sex with another woman!\n[Cut to Monica's bedroom, both Monica and Phoebe gasp.]\nMonica: Oh my God.\nPhoebe: Oh, I knew something had to be wrong, because my fingernails did not grow at all yesterday.\nChandler: Yeah, well, I guess they had a fight, and he got drunk....\nMonica: Oh!! (hits Chandler and Joey in the head) You guys knew about this and you didnt tell us?!\nChandler: (to Joey) He has sex, and we get hit in our heads.\n[Cut to Living Room]\nRachel: (opening the door) Y'know what, I want you to leave! Get outta here! \nRoss: No!!\nRachel: Just get out! Now!!\nRoss: No!! No!! I wanna stay. I wanna talk about this.\nRachel: Okay! All right! How was she?\n[Cut to Monica's bedroom]\nChandler: Uh-oh.\n[Cut to Living Room]\nRoss: What?\nRachel: Was she good?\n[Cut to Monica's bedroom]\nJoey: Dont answer that.\n[Cut to Living Room]\nRachel: Come on Ross! You said you wanted to talk about it, lets talk about it!! How was she?\nRoss: She was...\n[Cut to Monica's bedroom]\nJoey: Awful! Horrible!\nChandler: She was not good. Not good.\nJoey: She was nothing compared to you.\n[Cut to Living Room]\nRoss: She, she was different.\n[Cut to Monica's bedroom]\nJoey: Ewwwww!\nChandler: Uh-oh.\n[Cut to Living Room]\nRachel: Good different?\nRoss: Nobody likes change.\n(Rachel picks up a newspaper and starts beating him with it.)\nRoss: What? Okay, okay, okay, okay.\n[Cut to Monica's bedroom]\nPhoebe: Should we do something?\nChandler: Yeah, never cheat on Rachel.\n[Cut to Living Room]\nRoss: Im sorry, okay, Im sorry. I wa-I was disgusted with myself, and this morning I was so, I was so upset and then I got your message and I was so happy, and all I wanted was to get her out of my apartment as fast as possible.\nRachel: Whoa!! Whoa, whoa, wait a minute. What time did your little friend leave? (Ross cant answer that) Oh my God. She was there? She was still there? She was in there, when I was in there?!\n(Ross hands Rachel back the newspaper, and she starts beating him with it again.)\nRoss: Listen. Oh hey, hey, the important thing was that she meant, she meant nothing to me!\nRachel: And yet she was worth jeopardising our relationship!! \n(She throws the paper at him, misses and hits Monicas door, they all jump back at the sound.)\nRoss: Look, I didnt think there was a relationship to jeopardise. I thought we were broken up. \nRachel: We were on a break!\nRoss: That, for all I knew would, could last forever. That to me is a break-up.\nRachel: You think youre gonna get out of this on a technicality?\nRoss: Look, Im not trying to get out of anything, okay. I thought our relationship was dead!\nRachel: Well, you sure had a hell of a time at the wake!\n[Cut to Monica's bedroom]\nJoey: Y'know what, I dont think we should listen to this anymore. (Goes to open the door)\nMonica: (stopping him) What, what are you doing? You cant go out there.\nJoey: Why not?! (to Chandler) Im hungry.\nMonica: Because theyll know weve been listening.\n[Cut to Living Room]\nRachel: God! And to have to hear about it from Gunther!!\nRoss: Come on! Like I wanted him to tell you, I ran all over the place trying to make sure that didnt happen!\nRachel: Oh, that is so sweet. I think Im falling in love with you all over again.\n[Cut to Monica's bedroom]\nChandler: Y'know what, I think we can go out there. I mean they have more important things to worry about.\nJoey: Yeah, well be fine.\n[Cut to Living Room]\nRoss: Look Rachel, I wanted to tell you, I thought I should, I-I did, and then Chandler and Joey convinced me not to.\n[Cut to Monica's bedroom]\nChandler: (handing Monica the wax) Wax the door shut, were never leaving, ever.\n[Later, Phoebe is on the phone, theyre all still trapped in Monicas bedroom.]\nPhoebe: Hi, its Phoebe. Listen someones gonna have to take my 9:00 with Mr. Rehack, cause its like 9:15 now, and Im not there.\n[Cut to Living Room]\nRoss: Dont you realise none of this wouldve ever happened if I didnt think at that same moment you werent having sex with Mark?\nRachel: All right. Lets say I had slept with Mark. Would you have been able to forgive me?\nRoss: (pause) Yes I would.\nRachel: Youd be okay if you knew that Mark had kissed me, and been naked with me, and made love to me?\nRoss: (less sure) Yes.\nRachel: You knew that our hot, sweaty, writhing bodies were....\nRoss: (covering his ears and screaming) La-la-la-la-la-la-la-la-la-la! Okay, okay, yeah, I would have been devastated but, I would still want to be with you. Because its, I mean its you.\n[Cut to Monica's bedroom]\nAll: Ohhhhh!\n[Later, Ross and Rachel are sitting in the kitchen.]\nRoss: What? Come on Rach, tell me what youre thinking?\nRachel: Im thinking, Im gonna order a pizza.\nRoss: Order a pizza like, I forgive you?\n(She turns around and glares at him, he turns away.)\n[Cut to Monica's bedroom]\nJoey: Oh man, pizza? I like pizza. (makes like he is trying to send a telepathic message to Rachel) Put olives on the pizza.\nPhoebe: We could eat the wax! Its organic.\nChandler: Oh great, food with hair on it.\nPhoebe: No, not the used wax.\nChandler: Because that would be crazy?\n[Cut to Living Room]\nRoss: Hey, can I, can I get in on that? Because Im kinda hungry myself.\nRachel: Fine. (on phone) Hi! Yes, Id like to order a large pizza.\nRoss: No anchovies.\nRachel: With ah, extra anchovies.\nRoss: Thats okay, Ill just pick em off.\nRachel: Yeah, and could you please chop some up and just put it right there in the sauce?\n[Cut to later, they are finishing up the pizza, theres one piece left.]\nRoss: You can have the last piece, if you want.\nRachel: Well, I should think so. You slept with someone.\n[Cut to Monica's bedroom, theyre all eating the wax, Chandler and Phoebe, dont like it. Joey tries some and makes a face like: Hey, thats not so bad.]\nPhoebe: Theyre gonna get through this, arent they?\nChandler: Yeah, come on, its Ross and Rachel, theyve got too.\nMonica: What if they dont?\n(Long pause.)\nJoey: You think I need a new walk?\nChandler: What?\nJoey: Well y'know, Ive been walking the same way since high school. Y'know, y'know how some guys they walk into a room and everybody takes notice. I think I need a take notice walk.\nChandler: Are you actually saying these words?\n[Later, in the living room, Rachel is sitting on the couch, Ross is on the chair.]\nRoss: What, now youre not even taking to me? (moves over to the coffee table) Look Rachel, I-Im sorry, okay, Im sorry, I was out of my mind. I thought Id lost you, I didnt know what to do. Come on! Come on, how insane must I have been to do something like this? Huh? I-I dont cheat right, I, thats not me, Im not Joey!\n[Cut to Monica's bedroom]\nJoey: Whoa-ho-ho! (He looks at Chandler, who gives him a come on look.) Yeah, okay.\nMonica: Hey. Its three in the morning. They dont know that Ive come home yet. You notice how neither one of them are wondering where I am.\nPhoebe: Yeah, y'know, people can be so self-involved.\n[Cut to Living Room]\nRoss: Y'know what, y'know what, Im-Im not the one that wanted that, that break, okay. Youre the one that bailed on us. Youre the one that, that ran when things got just a little rough!\nRachel: Thats....\nRoss: Thats what?!\nRachel: That is neither here nor there.\nRoss: Okay, well here we are. Now were in a tough spot again, Rach. What do you want to do? How do you want to handle it? Huh? Do you wanna fight for us? Or, do you wanna bail? (sits down next to her) Look, I, (on the verge of tears) I did a terrible, stupid, stupid thing. Okay? And Im sorry, I wish I could take it back, but I cant. (We see Monica and Phoebe are almost in tears.) I just cant see us throwing away something we know is so damn good. Rachel, I love you so much.\n(He kisses her on her shoulder, then her neck, then the side of her face, then just before he kisses her on the lips....)\nRachel: No Ross!! (stands up and moves away from him) Dont! You cant just kiss me and think youre gonna make it all go away, okay? It doesnt work that way. It doesnt just make it better. Okay?\nRoss: Okay, okay, okay.\nRachel: (softly) I think you should go.\nRoss: What?\nRachel: (softly) I really think you need to go now.\nRoss: (moving over to stand in front of her) Okay, okay. This morning you said there was nothing so big that we couldnt work past it together...\nRachel: Yeah, what the hell did I know!\nRoss: Look, look, theres got to be a way we can work past this. Okay, (takes a hold of one of her arms.) I cant imagine, I cant imagine my life without you. (Both of them are starting to cry.) Without, without these arms, and your face, and this heart. Your good heart Rach, (drops to his knees and hugs her around her waist) and, and....\nRachel: (crying) No. I cant, youre a totally different person to me now. I used to think of you as somebody that would never, ever hurt me, ever. God, and now I just cant stop picturing with her, I cant, (Ross stands up and backs away) it doesnt matter what you say, or what you do, Ross. Its just changed, everything. Forever.\n[We see the rest of them are now crying.]\nRoss: (crying) Yeah, but this cant be it, I mean.\n(Pause)\nRachel: Then how come it is?\nClosing Credits\n[Scene: Monicas bedroom.]\nPhoebe: Theyve been quiet for a long time.\nJoey: Maybe she killed him?\nChandler: Lets go.\n[Cut to Living Room, Rachel is sleeping on the couch, Ross is gone, the rest of them can finally emerge from their cell. They all wave good bye, and start to walk quietly out, as Monica goes and puts a blanket on Rachel. Joey starts walking all hunched over and bobbing his shoulders as he goes.]\nChandler: (to Joey) Is that your new walk?\nJoey: (whispering) No, I really have to pee.\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 16, "episode_id": "S03E16", "episode_title": "THE ONE THE MORNING AFTER", "scene_number": 13, "scene_id": "S03E16_013", "location": "Monicas Bedroom", "scene_description": "Monica and Phoebe are removing the rest of their wax strips.", "characters": ["All", "Chandler", "Joey", "Monica", "Monica and Phoebe", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E16/scenes/S03E16_013"}}
