{"id": "S03E23_001", "text": "THE ONE WITH ROSS'S THING\nWritten by: Andrew Reich & Ted Cohen Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 1, "scene_id": "S03E23_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E23/scenes/S03E23_001"}}
{"id": "S03E23_002", "text": "[Scene: Chandler and Joey's, Chandler and Joey are playing with the duck and the chick.]\nJoey: Hey, wouldn't be cool if our duck and chick had a little baby? We could call it Chuck.\nChandler: Or... Dick.\nRoss: (entering) Hey.\nChandler and Joey: Hey.\nRoss: Listen, I-I need a favor. Umm, I was in the shower, and as I was cleansing myself, I ah, I-I, well I felt something.\nChandler: Was it like a sneeze only better?\nRoss: No, no, I mean, I mean a thing on my body.\nJoey: (with a disgusted look) What was it?\nRoss: Well, I don't know, it's-it's kinda in a place that's not... It's not visually accessible to me, and I was hoping maybe you guys could-could help me out. (starts to take off his pants)\nChandler and Joey: Whoa!!!\nChandler: No!!\nRoss: Come on you guys, it's no big deal! (He turns around and shows him his thing.)\nChandler: Whoa-heeeiiiiii-iiiii-ah!! (sees it) Huh.\nRoss: Well what is it? Is it a mole? (He moves closer to them, and they jump back.)\nJoey: No, it's too wrinkly to be a mole.\nRoss: Well, eww. What? Is it a pimple?\nChandler: No, it's... fancier than a pimple. Look Ross, why don't you just go see a \nRachel: (entering, interrupting them) Hey guys! What's... (sees what they're doing and stops, the guys are stunned)\nChandler: Okay, well, it's definite, two more weeks of winter.\nRoss: Ahhh.\nJoey: Yeah, right.\n(Rachel backs out with a confused look on her face.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 2, "scene_id": "S03E23_002", "location": "Chandler and Joey's", "scene_description": "Chandler and Joey are playing with the duck and the chick.", "characters": ["Chandler", "Chandler and Joey", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_002"}}
{"id": "S03E23_003", "text": "[Scene: Central Perk, Chandler, Joey, and Rachel are there, as Phoebe enters with her date.]\nPhoebe: (to her date) Okay, and then this is the coffee house. This is where I play my music. (points to the stage)\nVince: Good deal.\nPhoebe: Yeah, and these are my friends. People. This is Vince, Vince the people.\nRachel: Hi!\nChandler: Hey!\nVince: Hey!\nPhoebe: Vince is a fireman.\nRachel: Wow! Have you ever rescued anyone from a burning building before?\nVince: 98 hot saves, highest in the force.\nChandler: Well, y'know if Joey and I played with matches we could get you up to an even hundred. \nVince: (dead serious) Fire safety is not a joke, son.\nChandler: You're right, I know.\nVince: (to Phoebe) Look, I gotta go. I'm on call tonight. (kisses her) See you Saturday. (leaves)\nPhoebe: Okay. (watches him leave)\nRachel: Wow, he's cute, Pheebs! But I thought you just started dating that Kindergarten teacher.\nPhoebe: Oh, Jason? Yeah, uh-huh, we're seeing each other tonight.\nRachel: What-Pheebs?! Two dates in one day? That's so unlike you.\nPhoebe: I know, I know! I'm like playing the field. Y'know? Like, juggling two guys, I'm sowing my wild oats. Y'know? Y'know, this kind've like y'know oat-sowin', field-playin' juggler.\nJoey: So Pheebs, do they know about each other?\nPhoebe: Does a dog's lips move when he reads? (Joey makes an `I don't know' face, and looks to Chandler and Rachel, who're also stumped) Okay, no they don't.\nRoss: (entering) Hey guys!\nJoey: Hey.\nRachel: Hi!\n(He goes over and sits down at the counter, all depressed.)\nJoey: (going over to him) Well?!\nChandler: (joining them) Okay, how'd it go at the doctor's?\nRoss: Well, he said there's definitely nothing to worry about, it's totally benign.\nJoey: Well what is it?!\nRoss: He couldn't even tell me! He said it was just some sort of skin... abnormality. And the worst thing is he-he-he said, he said, without being able to identify it, he was reluctant to remove it.\nChandler: Y'know what? You should go to my guy, because when I went in there with my third nipple. He just lopped it right off. Y'know? So I guess I'm lucky. I mean not as lucky as people who were born with two nipples.\nRoss: At least they knew what yours was. Y'know, yours had a name.\nJoey: Oh! Maybe they'll name yours after you! Y'know, they'll call it, The Ross. And then people would be like, \"Awww, he's got a Ross.\"\nRoss: (sarcastic) Yeah, that'd be cool!\n[cut to Phoebe and Rachel as Monica returns from the bathroom]\nMonica: Pete's breaking up with me.\nAll: What?!\nMonica: I just checked my messages, and he said that when he gets back from Atlanta, we need to talk.\nRachel: And?\nMonica: Well that's it. People never say `We need to talk' unless it's something bad.\nJoey: Whoa, that doesn't necessarily mean that he's breaking up with you.\nMonica: Really?!\nJoey: Yeah, maybe he just cheated on you.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 3, "scene_id": "S03E23_003", "location": "Central Perk", "scene_description": "Chandler, Joey, and Rachel are there, as Phoebe enters with her date.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Vince"], "firestore_path": "/episodes/S03E23/scenes/S03E23_003"}}
{"id": "S03E23_004", "text": "[Scene: A Street, Phoebe is walking with her second date, Jason.]\nJason: ...and I know I'll never miss doing it, but I gotta tell you, it's pretty cool knowing that you're making a difference in a kid's life.\nPhoebe: That is so great! Oh, I... (sees that a parked car near them has caught on fire) Oh my God!\nJason: Whoa!\nPhoebe: (the fire has worsened) Oh my God!!!\nJason: Ahh-ahh, we'd better call the fire department!\nPhoebe: (stopping him) No! No! \nJason: No, no?\nPhoebe: Well, we don't n-n-n-n-need a fireman, we'd, we'd like a good mechanic. (hears the sound of approaching sirens) Oh my God, here they come! Well, we gotta get out of here!\nJason: W-w-w-wait! Why?!\nPhoebe: Well look, if I wanted to see a fireman, I would date one. Okay? (she drags him away)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 4, "scene_id": "S03E23_004", "location": "A Street", "scene_description": "Phoebe is walking with her second date, Jason.", "characters": ["Jason", "Phoebe"], "firestore_path": "/episodes/S03E23/scenes/S03E23_004"}}
{"id": "S03E23_005", "text": "[Scene: A Doctor's Office, Ross is having his thing looked at by Dr. Rhodes.]\nRoss: Th-th-that's all it is, a third nipple. Y'know? Just your run-of-the-mill third nipple. Y'know? You can take it off. Just slice that baby right off!\nDr. Rhodes: Take your shirt off, and let's see what we're dealing with here. (Ross starts to take off his pants) What are you doing?\nRoss: Just showing you my run-of-the-mill-slice-it-right-off third nipple.\nDr. Rhodes: Well that's not a third nipple.\nRoss: No?\nDr. Rhodes: First of all, it's on your ass.\nRoss: Well then, what is it?!\nDr. Rhodes: Wait a minute, hold it. (He goes to the door and opens it.) Johnson! Will you come in here a moment?\nDr. Johnson: I'm with Hamilton!\nDr. Rhodes: He's good with rear things, bring him in too.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 5, "scene_id": "S03E23_005", "location": "A Doctor's Office", "scene_description": "Ross is having his thing looked at by Dr. Rhodes.", "characters": ["Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_005"}}
{"id": "S03E23_006", "text": "[Scene: Central Perk, Chandler, Monica, and Joey are there.]\nMonica: (starting to get up) I gotta go water Pete's plants. (stops) Y'know what, if he's gonna break up with me, maybe I won't water his plants.\nChandler: Well, if he's gonna break up with you, maybe Joey and I should water his plants. If y'know what I mean.\nJoey: Or ha-ha, we could go over there and pee on them.\nPhoebe: (entering with Rachel) and I-I can't take it! Y'know? I'm just, always afraid one of them is gonna catch me with the other one. It's making me crazy.\nRachel: Well honey, then why don't you break up with one of them?\nPhoebe: (disgusted) Uh.\nJoey: Whoa-whoa-whoa. What ah, what happened to playing the field?\nPhoebe: Well, it just, it doesn't feel like playing anymore, it feels like work. It's like I'm working in the field.\nRachel: So Pheebs, pick one of them.\nMonica: Yeah. Which one do you like more?\nPhoebe: Well, Vince is great, y'know `cause, he's like a guy, guy. Y'know? He's so burly, he's sooo very burly. (giggles)\nJoey: Okay, good, so there you go. Go with Vince.\nPhoebe: Yeah, but Jason's really sensitive.\nChandler: Well sensitive is important, pick him.\nPhoebe: Yeah.\nJoey: Oh sure, go with the sissy.\nPhoebe: Jason is not a sissy!\nJoey: Oh no-no-no-no, I meant Chandler.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 6, "scene_id": "S03E23_006", "location": "Central Perk", "scene_description": "Chandler, Monica, and Joey are there.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E23/scenes/S03E23_006"}}
{"id": "S03E23_007", "text": "[Scene: Dr. Rhodes's Office, a rather large group of doctors has now gathered to take a look at Ross's thing. Ross is none too pleased with the developments, he has a disgusted look on his face.]\nRoss: Y'know I have dinner plans!!\nDr. Rhodes: Thank you soo much for coming on such a short notice. Ladies and gentlemen, I've-I've-I've been practicing medicine for twenty-three years, and I'm stumped. \n(He removes the blanket covering the thing.)\nAll: Whoa. (they all lean in to get a closer look, Ross isn't pleased)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 7, "scene_id": "S03E23_007", "location": "Dr. Rhodes's Office", "scene_description": "a rather large group of doctors has now gathered to take a look at Ross's thing. Ross is none too pleased with the developments, he has a disgusted look on his face.", "characters": ["All", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_007"}}
{"id": "S03E23_008", "text": "[Scene: Pete's apartment, Monica is there to water the plants, and is showing the gang around.]\nMonica: Okay, this is the den. All right, check this out. Lights! (the lights turn on automatically, but are very bright) Whoa! All right. Less lights! Bad lights! Lights go away! (they dim) Oh, see you just need to find the right command.\nRoss: Yes, and the dimmer switch.\nJoey: Whoa! For a rich guy he's got, that's a pretty small TV.\nMonica: No-no-no, that's a video-phone. But hey guys you're not supposed to be here, so please, do not touch anything.\nChandler: (sitting down on the couch) I-kea! This is comfortable.\nRachel: (entering with Phoebe) This place is amazing.\nPhoebe: God, that is the nicest kitchen.\nMonica: I know.\nPhoebe: No! But it's the nicest kitchen, the refrigerator told me to have a great day.\nJoey: Look at this! A millionaire's checkbook.\nMonica: Joey, put that down! (the phone rings) Oh my God! It's Pete. Okay, get out!! How the hell do you answer a video-phone! (steps in front of it, and automatically answers it)\nPete: Monica? (the gang ducks and hides)\nMonica: I guess that's how.\nPete: Hey Monica, how's it going.\nMonica: Oh its umm, good! It's umm, its good, just here watering the plants.\nPete: Well don't forget that fiches over there by Rachel.\nRachel: (standing up) Ahh... Chandler's on the couch!!\nPete: I see him, you guys are just the worst hiders ever.\nAll: (standing up) Hey Pete.\nJoey: Hi, how ya doing?\nMonica: Ahh, Pete, the other day when you said you needed to talk, umm, just so I know, is it good news or bad news.\nPete: Oh, it's good news. No, it's definitely good news. Hold on a second, I have another call. (clicks his remote) (to his other call) Hey, how's it going?\nMonica: Oh no-no-no, it's still me.\nPete: Ah, no it's not. I've got picture-in-picture here. (to other caller) Yeah. (listens) Yeah, okay. I'm gonna have to call you back later. (pause) Monica? You. I'm gonna have to call you back.\nMonica: Oh, oh, okay umm, so I'll see you soon.\nPete: Okay, I love you.\nMonica: I love you.\nAll: I love you, love you.\nMonica: Okay. Well, it's good news. It's good news.\nChandler: So, what do you thing the good news is?\nJoey: (looking at the checkbook) Wow! Look at this! He wrote a check for 50,000 dollars to Hugo Ligrens Ring Design. (Monica is stunned) Oh, sorry, what do you think the good news is?\n[pause]\nMonica: Oh my.\nRachel: Monica's gonna marry a millionaire!!!\nRoss: Hey, you gotta get Mom on the phone. Call Mom! Call Mom!\n(Pete's computer automatically calls Mom, Pete's Mom.)\nPete's Mom: Hello.\nMonica: And that's Pete's Mom. \n(The gang quickly hides again.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 8, "scene_id": "S03E23_008", "location": "Pete's apartment", "scene_description": "Monica is there to water the plants, and is showing the gang around.", "characters": ["All", "Chandler", "Joey", "Monica", "Pete", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_008"}}
{"id": "S03E23_009", "text": "[Scene: Monica and Rachel's, the gang is returning from Petes.]\nRachel: Mon you definitely have to make it a theme wedding, and the theme could be, Look how much money weve got! Y'know, I mean you could put, you could put money in-in the invitations! You-you could have like little money place settings. And ah, you could start with a money salad! I mean itll be dry, but people will like it.\nMonica: Would you stop? Weve only been going out a couple of weeks, I mean we dont even know if hes gonna propose.\nChandler: Yes, but this is Pete. Okay? Hes not like other people, on your first date he took you to Rome. For most guys thats like a third or fourth date kinda thing.\nMonica: Well if-if thats what it is, then its-its crazy.\nRoss: Monicas right. Were talking about getting married here. Okay? She-she cant just rush into this.\nRachel: Oh please, what do you know! You married a lesbian!\n(Joey laughs, Ross glares at him, and Joey stops.)\nPhoebe: All right. I gotta go. I have break up with Vince.\nChandler: Oh, so youre going with the teacher, huh?\nPhoebe: Yeah, I like Vince a lot, y'know? But, its just Jasons so sensitive, y'know? And in the long run, I think sensitive its just better than having just like a really, really, really nice (pause) butt. (Her eyes glaze over thinking about the butt.) (pause) Jason! Definitely Jason! Okay, wish me luck!\nAll: Good luck!\n(pause)\nRachel: OH MY GOD!!! (She holds her hands up in triumph and the gang all look at her.) Sorry, I was just imagining what itd be like to catch the money bouquet.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 9, "scene_id": "S03E23_009", "location": "Monica and Rachel's", "scene_description": "the gang is returning from Petes.", "characters": ["All", "Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_009"}}
{"id": "S03E23_010", "text": "[Scene: A Fire House, Phoebe has gone to break up with Vince.]\nPhoebe: Excuse me. Umm, is Vince here?\nFireman: Oh sure. Vince?!\nVince: Yo!! (slides down that pole that fire stations have)\nPhoebe: Wow! I didnt know you guys actually used those. \nVince: So, whats up?\nPhoebe: Umm, wow. This-this isnt gonna be easy. Umm, I dont think we should see each other anymore.\nVince: Uh-huh. G-good deal.\nPhoebe: Im sorry.\nVince: No-no its okay. Its just that ah, I thought we had something pretty special here. And y'know I-I felt like you were someone I could finally open up to, and (starts choking up) That theres so much in me I have to share with you yet.\nPhoebe: Oh my God, I didnt\nVince: (starting to cry) Im sorry, I cant talk. Im gonna go write in my journal. (walks away)\nPhoebe: (running after him) Wait-wait-wait! Wait!!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 10, "scene_id": "S03E23_010", "location": "A Fire House", "scene_description": "Phoebe has gone to break up with Vince.", "characters": ["Fireman", "Phoebe", "Vince"], "firestore_path": "/episodes/S03E23/scenes/S03E23_010"}}
{"id": "S03E23_011", "text": "[Scene: Central Perk, Phoebe, Ross, and Monica are there.]\nPhoebe: (to Ross) Im telling you, if you want to take care of that thing, you should go to my herbal guy.\nRoss: Thank you, but I want to remove it Pheebs. I dont want to make it savory.\nMonica: Y'know when girls sleep with guys with weird things on their body, they tell their friends about it.\nRoss: Gimme this. (Grabs the herbalists card and leaves.)\nRachel: (entering) Hi! Okay, dont be mad at me, but I couldnt resist.\nMonica: Brides magazines?\nRachel: Yes, and I know that youd say no if he asked you, but Im sorry; how great would you look walking down the aisle in this Donna Carin. (shows her the picture.)\nPhoebe: (gasps) Oh, you so would! Oh, you should get that anyway. (They both look at her.) Like for clubbing. \nMonica: It is so weird, I know what I said, but uh, this morning, I was lying in bed I was, I was imagining what it would be like to say yes. (Rachel slams the magazine shut in amazement.) I know its a little sudden, and its a little rushed, and its totally not like me to do something like this, but that doesnt mean I cant. Right? I mean Im-Im crazy about Pete, and I know that we want the same things, and when I thought about saying yes, it made me really happy.\nRachel: Oh my God. (starting to cry) \nMonica: I know. (pause) I need more pie. (goes and gets some)\nPhoebe: Hey Mon umm, if you do get married, can I bring two guests?\nRachel: You didnt break up with that fireman?\nPhoebe: No, that was my way of telling you. Well, it turns out hes incredibly sensitive, he keeps a journal and he paints. He even showed me charcoal drawings that he drew of me.\nRachel: Wow!\nPhoebe: Yeah, well hed prefer water colors, but y'know, he has easy access to a lot of charcoal.\nMonica: So then, are you going to dump Jason?\nPhoebe: Well, yeah, because I have to break up with someone, and Okay so Jason is sensitive, (holds up one finger) but now sos Vince (holds up one finger on her other hand) Plus, Vince has the body y'know? (holds up two more fingers on the Vince side) So Its really just about the math.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 11, "scene_id": "S03E23_011", "location": "Central Perk", "scene_description": "Phoebe, Ross, and Monica are there.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_011"}}
{"id": "S03E23_012", "text": "[Scene: Jasons apartment, Phoebe has gone to break up with Jason.]\nPhoebe: (knocks on the door) Jason?\nJason: Yeah, come on in.\n(She goes in, and sees Jason without his shirt. It turns out that he has a great body too, and is at a loss for words.)\nJason: So Phoebe, you ah, sounded kinda serious on the phone, is ah, is anything wrong?\nPhoebe: Nah-ha!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 12, "scene_id": "S03E23_012", "location": "Jasons apartment", "scene_description": "Phoebe has gone to break up with Jason.", "characters": ["Jason", "Phoebe"], "firestore_path": "/episodes/S03E23/scenes/S03E23_012"}}
{"id": "S03E23_013", "text": "[Scene: Phoebes Herbal Guys office, Ross is there about his thing. Ross is looking around the exam room, and he goes over to a large bank of drawers, pulls one out and almost spills it as the herbalist, Guru Saj, enters.]\nGuru Saj: You must be Ross.\nRoss: Hi.\nGuru Saj: I am Guru Saj. (takes the drawer back and replaces)\nRoss: Listen, I got to tell you Ive-Ive never been to a guru before, so...\nGuru Saj: Well, relax. If it makes you feel better, Ive attended some of the finest medical schools in Central America. Well then, lets take a look at this skin abnormality of yours. (motions to the table) Come on, have a seat. (looks at it) Eeh, huh. As I suspected, its a koondis!\nRoss: Whats a koondis?\nGuru Saj: I dont know, whats a koondis with you? (starts laughing as if that joke was funny, Ross only looks at him, and he stops) Please, lie down! Ive got a sav that oughta shrink that right up.\nRoss: I guess its worth a try.\nGuru Saj: Oh sure, we should see resultsWhoa!! Clearly not the way to go!! (quickly wipes it off)\nRoss: What?! What?!\nGuru Saj: We appear to have angered it.\nRoss: We?! We angered it?!\nGuru Saj: Oh, I think I see the problem. And Im afraid were gonna have to use a much stronger tool. (Ross gives him a What? look) Love.\nRoss: Oh God!\nGuru Saj: (He starts moving his hands around in circles above the thing.) Ross, there is absolutely no way this is going to come off unless you start to\nRoss: Ow!! \nGuru Saj: Oops.\nRoss: What was, what was that?\nGuru Saj: Well its gone.\nRoss: What?! Hows that?\nGuru Saj: It got caught on my watch.\nRoss: Hey! (congratulates him)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 13, "scene_id": "S03E23_013", "location": "Phoebes Herbal Guys office", "scene_description": "Ross is there about his thing. Ross is looking around the exam room, and he goes over to a large bank of drawers, pulls one out and almost spills it as the herbalist, Guru Saj, enters.", "characters": ["Guru Saj", "Ross"], "firestore_path": "/episodes/S03E23/scenes/S03E23_013"}}
{"id": "S03E23_014", "text": "[Scene: Petes apartment, Pete and Monica are coming back from a date.]\nPete: Lights. (The lights turn on, once again theyre too bright.) Uh, romantic lights. (The lights dim.)\nMonica: Ooh, nice.\nPete: So ah, there was this thing I wanted to talk to you about.\nMonica: Oh, right! I completely forgot about that.\nPete: Well ah, Ive been doing a lot of thinking, and I look at my life\nMonica: Yeah?\nPete: And I feel like Ive conquered the business world, and I feel like Ive conquered the intellectual world, and now I-I have the most beautiful woman in the world.\nMonica: Wow.\nPete: Theres one thing missing.\nMonica: Whats that?\nPete: Its time for me to conquer the physical world.\nMonica: Okay. (not sure of herself)\nPete: Monica, I want to become (pause) the Ultimate Fighting Champion.\nMonica: You wanna what?!\nPete: I want to become the Ultimate Fighting Champion! Its the most intense physical competition in the world, its banned in 49 states!\nMonica: What are you talking about?\nPete: Okay, my trainer, Ho Chi, is teaching me a combination of Gee Koon Doe and Brazilian street fighting, Ive even had my own octagon training ring designed.\nMonica: And I suppose you used a ring designer for that.\nPete: Yeah. Monica, I want you there in the front row when I win. I want you close enough to smell the blood. What do you think?\nMonica: My parents will be so happy.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 14, "scene_id": "S03E23_014", "location": "Petes apartment", "scene_description": "Pete and Monica are coming back from a date.", "characters": ["Monica", "Pete"], "firestore_path": "/episodes/S03E23/scenes/S03E23_014"}}
{"id": "S03E23_015", "text": "[Scene: Central Perk, Phoebes singing, Vince is also there.]\nPhoebe: (singing) Crazy underwear, creepin up my butt. (Jason enters) Crazy underwear, always in a rut. Crazy under-(sees Jason)-wear (In her head) Oh No! What is he doing here? All right, just keep playing, just keep playing. Youll get through this; youll be fine. (She tries to continue the song, but she has lost the ability to pronounce words, and the lyrics come out as gibberish.) (giving up on the song) Okay, thank you. And, as always no one talk to me after the show.\n(They all applaud her.)\nJason: (going up to her) Hey. I was\nPhoebe: Hey!\nJason: I was passin by and I saw that you were playing tonight, its kinda cool seeing you up there. (kisses her)\nVince: (running over) Whoa! Hey-hey! Whats going on here? Who is this guy?\nPhoebe: I dont know, he just started kissing me. Get him! Get him, Vince!\nVince: What?!\nJason: What?!\nPhoebe: Yeah, okay, Ive-Ive been dating both of you, and its been really horrible. Cause y'know its been a lot of fun, for me. Umm, but I-I like you both, and I, and I didnt know how to chose, so... Im sorry, Im just, Im terrible, Im a terrible person. Im terrible.\nVince: Phoebe, Phoebe relax, its okay. I mean we never said this was exclusive.\nJason: Yeah, and neither did we. Give yourself a break.\nPhoebe: Really?!\nJason: Yeah. I mean y'know, we havent been going out that long. Come on, we havent even slept together yet. Huh.\nVince: You havent?\nJason: You have?\nPhoebe: Well, this is none of my business. (starts to walk away)\nJason: (to Phoebe) I-I cant believe this! You-youve slept with him?!\nPhoebe: Well, I made you a candle light dinner in the park.\nJason: Y'know Phoebe, Im gonna make this real easy for you. (walks out)\nPhoebe: (to Vince) Well, that couldve been really awkward.\nVince: You made him a candle light dinner in the park?\nPhoebe: Yeah, but I-I-I-I can do that for you, Im gonna do that for you.\nVince: Uh yeah, I cant believe I ever went out with somebody who would actually have an open flame in the middle of a wooden area. (walks out)\nClosing Credits\n[Scene: Guru Sajs office: Joey and Chandler have taken the duck to see the guru.]\nChandler: (comforting the duck) Everythings gonna be all right. Okay, Dick?\nGuru Saj: (entering) Hello, I am Guru Saj-(sees the duck)-Whoa!! (to Joey) Thats supposed to be a duck right? Cause otherwise, this is waaay out of my league.\nJoey: Yeah, yeah. Hes got a, hes got a really bad cough, and our vet, he cant do anything about it. Is there something you can do?\nGuru Saj: Hmm, let me see. Let me see. Do you think you could get him to eat a bat?\n(The duck starts to frantically flap his wings, while Joey is holding him, in an attempt to get away.)\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 23, "episode_id": "S03E23", "episode_title": "THE ONE WITH ROSS'S THING", "scene_number": 15, "scene_id": "S03E23_015", "location": "Central Perk", "scene_description": "Phoebes singing, Vince is also there.", "characters": ["Chandler", "Guru Saj", "Jason", "Joey", "Phoebe", "Vince"], "firestore_path": "/episodes/S03E23/scenes/S03E23_015"}}
