{"id": "S03E25_001", "text": "THE ONE AT THE BEACH\nStory by: Pan-ni Landrum & Mark J. Kunerth Teleplay by: Adam Chase Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 1, "scene_id": "S03E25_001", "location": "", "scene_description": "", "characters": ["Story by"], "firestore_path": "/episodes/S03E25/scenes/S03E25_001"}}
{"id": "S03E25_002", "text": "[Scene: Central Perk, everyone except Phoebe is there. Bonnie is telling them of her sex-capades.]\nChandler: (to Bonnie) So ah, your first sexual experience was with a woman?!\nBonnie: All right, I was 15, it was my best friend, Ruth, and we got drunk on that hard cider, and then suddenly, I dont know, we were, we were making out.\nChandler: Tell it again. (pause, we see Rachel is not amused.) Seriously.\n[cut to Rachel and Monica at the counter.]\nRachel: (to Monica) I mean is that woman capable of talking about anything else but sex?\nJoey: Yeah, sure. Well y'know, earlier she was talking about geography.\nMonica: Joey, she was listing the countries shes done it in.\nJoey: Well, I think we all learned something.\nPhoebe: (entering, hurridly) Hey, you guys! Look what I found! Look at this! (She hands Chandler a picture) Thats my Moms writing! Look.\nChandler: (reading the back of the picture) Me and Frank and Phoebe, Graduation 1965.\nPhoebe: Y'know what that means?\nJoey: That youre actually 50?\nPhoebe: No-no, thats not, thats not me Phoebe, thats her pal Phoebe. According to her high school yearbook, they were like B.F.F. (Ross and Bonnie look at her quizzically) Best Friends Forever.\nAll: Oh!\nRachel: That is so cool.\nPhoebe: I know! So this woman probably could like have all kinds of stories about my parents, and she might even know like where my Dad is. So I looked her up, and she lives out by the beach. So maybe this weekend we could go to the beach?\nAll: Yeah! Yeah, we can!\nBonnie: (to Ross) Shoot! I cant go, I have to work!\nRoss: Thats too bad.\nRachel: (sarcastic) Ohh, big, fat bummerrr.\nPhoebe: So great! Okay! Tomorrow were gonna drive out to Montauk.\nJoey: Hey, Bonnie had sex there!\n(Rachel turns and gives him a look, and Joey quickly apologises.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 2, "scene_id": "S03E25_002", "location": "Central Perk", "scene_description": "everyone except Phoebe is there. Bonnie is telling them of her sex-capades.", "characters": ["All", "Bonnie", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_002"}}
{"id": "S03E25_003", "text": "[Scene: Outside Central Perk, Chandler and Monica are waiting for Phoebe to arrive with the cab.]\nMonica: (watching a happy couple walk by, arm in arm) Would you look at them. Am I ever gonna find a boyfriend again? I gonna die an old maid.\nChandler: Youre not gonna die an old maid, maybe an old spinster cook.\nMonica: (sarcastic) Thanks!\nChandler: Hey now besides, if worst comes to worst, Ill be your boyfriend.\n(At that suggestion Monica starts laughing.)\nMonica: Yeah right.\nChandler: Why is that so funny?\nMonica: You made a joke right? So I laughed.\nChandler: Ha-ha-ha. A little to hard. What am I not ah, boyfriend material?\nMonica: Well, no. Youre Chandler. Y'know, Chandler! (hits him on the arm)\nChandler: Okay, so weve established my name, and hit me. But theoretically y'know, I mean say we werent friends, say its a blind date. I show up at your door, and Im like (in a fake voice) Hey, nice to meet, ya. Hey, oh-hey.\nMonica: Well Id probably be scared of a guy using a fake voice.\nJoey: (walking up carrying a brown paper bag) Hey!\nMonica: Oh, hey! Oh good, you brought food!\nJoey: No, its just my luggage.\n(Phoebe drives up.)\nChandler, Monica, and Joey: Hey!!\nJoey: Woo-hoo! All right! Yeah!\nPhoebe: Oh, I am having the best karma this week. First, I find this woman who knew my parents, and then my client with the fuzzy back gives me his beach house.\nRoss: Yeah? What about ah, that bike messenger you hit?\nPhoebe: Oh, I wasnt talking about his karma.\nRachel: (approaching) Hey! \nChandler: Hey!\nJoey: Hey-hey, check out the hat!\n(She is wearing this giant straw hat, the brim on it must be at least, least foot wide.)\nChandler: What a minute, I know that hat! I was taken aboard that hat! They did experiments on me! I cant have children!!\nMonica: Seriously, where did you get the hat?\nRachel: Ross gave it to me.\nRoss: Yeah, I think she looks good.\nRachel: Ohh, thank you.\nChandler: Buy it for ya, or win it for ya?\nRachel: Well excuse me, my fashion-impaired friends, I am here to tell you that hats are back.\nPhoebe: And this time, theyve ganged up to form one giant, super hat.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 3, "scene_id": "S03E25_003", "location": "Outside Central Perk", "scene_description": "Chandler and Monica are waiting for Phoebe to arrive with the cab.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_003"}}
{"id": "S03E25_004", "text": "[Scene: At the Beach, its raining cats and dogs as the gang arrives. Chandler and Monica are taking shelter under Rachels hat.]\nRoss: Go, go, go!\nRachel: Oh yeah, now everybody wants to be under this hat!\n(They get inside and notice on small problem.)\nPhoebe: Oy!!\nMonica: Whats with all this sand? (picking a handful of sand off of the floor, which is covered in sand)\nPhoebe: Oh, yeah, Bob said there might be flood damage.\nRoss: Yeah, either that, or he has a really big cat.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 4, "scene_id": "S03E25_004", "location": "At the Beach", "scene_description": "its raining cats and dogs as the gang arrives. Chandler and Monica are taking shelter under Rachels hat.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_004"}}
{"id": "S03E25_005", "text": "[Scene: Phoebe Sr. house, she is a real estate agent and is trying to sell a house over the phone. By the way, its still raining outside.]\nPhoebe Sr: Well, yes, its kindve an unusual house. It has umm, three beautiful bedrooms and ah, no baths. But y'know, the ocean is right there.\nPhoebe: (at the door) Knock, knock, knock.\nPhoebe Sr: (on phone) Ah, oh, hang on a second. (to Phoebe) Come in, come in. (on phone) All right, so think about it, and call me back. (hangs up)\nPhoebe: (entering) Are you ah, Phoebe Abott?\nPhoebe Sr: Ahh, yes.\nPhoebe: Hi Phoebe Abott, Im your best friends daughter!\nPhoebe Sr: Youre Erwins daughter?!\nPhoebe: No, I-I mean your-your old best friend, here. (hands her the picture) Lily, from high school. Remember?\nPhoebe Sr: Oh gosh, Lily, yes. Of course I remember Lily. I... Then you must be?\nPhoebe: (points to herself) Phoebe. (points to her) Phoebe. Phoebe, yeah. She named me after you I guess.\nPhoebe Sr: Uh-huh. Wow! Well, look! Theres Frank. (points to the picture.)\nPhoebe: Yes!! Yes! Yes! Yes!! Thats my Dad, thats Frank! Yeah! Im sorry Im getting all flingy.\nPhoebe Sr: Take it easy--if you want, theres cookies on the counter, or, or--sangria! (jumps up) I can make sangria!\nPhoebe: No-no, sorry. Cookies are good, thanks. \nPhoebe Sr: Oh.\nPhoebe: (goes and gets some cookies) Well, so, umm, anyway umm, Ive been, Ive been looking for my Father, and umm, have you heard from him, or seen him?\nPhoebe Sr: Oh no, I-Im sorry, I guess we lost track of everybody after high school.\nPhoebe: (disappointed) Oh, okay. Well, so tell me everything about my parents. Everything.\nPhoebe Sr: Ohh, well. Y'know we were always together, in fact the had a nickname for the three of us.\nPhoebe: Oh, what? What was it?\nPhoebe Sr: The three losers. Oh, poor Lily. (Phoebe notices a picture on the fridge, takes it, and puts it in her pocket.) Ohh, y'know I-I heard about what happened, that must have been just terrible for you, losing your mother that way.\nPhoebe: (happily) Yeah, no, it was great.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 5, "scene_id": "S03E25_005", "location": "Phoebe Sr. house", "scene_description": "she is a real estate agent and is trying to sell a house over the phone. By the way, its still raining outside.", "characters": ["Phoebe", "Phoebe Sr"], "firestore_path": "/episodes/S03E25/scenes/S03E25_005"}}
{"id": "S03E25_006", "text": "[Scene: The beach house, its still raining. Chandler is building a sand castle, Rachel is doing Monicas nails, and theyre all drinking margaritas, obviously bored.]\nJoey: (getting an idea) Hey, y'know what a really good rainy day game is?\nMonica: What?!\nJoey: I mean naked game. Strip poker, we should totally play strip poker.\nAll: No, no!\nMonica: What are you crazy?!\nJoey: Come on! When you go away, you-you have to play, its like a law!\nRachel: (to Monica) Allll done!\nMonica: Aww, thank you.\nRachel: Okay, whos next?! (She looks around the room, and stops when she comes to Ross.)\nRoss: No-o-o! (Rachel gives him a Please? look.) No way! \nRachel: Come on, please?! Im boredddd! You let me do it once before.\n(Ross shoots Joey a look, who shoots Chandler a look, who gives Joey an Oh my God. look back.)\nRoss: Yeah well, if ah, if thats the rule this weekend... (She gets up) No!\nRachel: Yes! (she starts creeping up on him)\nRoss: Get away!\nRachel: Just once! \nRoss: Stay away!\nRachel: Take it like a man, Ross!\nRoss: (he gets up and starts to run away from her) No! (in his escape attempt he crushes Chandlers sand castle) No!\nRachel: Oh, come on!\nChandler: Big bullies!!\n(Ross dives over the couch, Rachel goes the other way, and lands up top of him.)\nRoss: Ow! Ow! Oh, no-no-no!\n(They get into a wrestling match, that ends with Ross making Rachel paint her forehead with the nail polish. They both end up lying next to each other, stop, and look at each other for a moment.)\nPhoebe: (entering) Oh, hey!\nChandler: Hey!\nRoss: Hey!\nPhoebe: Oh, so, how are we doing?\nChandler: Bored and bored!\nJoey: Hey, you know what naked card game is never boring?\nAll: Noo!!\nMonica: (to Phoebe) So whats Phoebe like?\nPhoebe: Im kind, caring, and sweet. Whats Monica like?\nMonica: Ah no, the other Phoebe, the one you went to go see.\nPhoebe: Ohh, I think she knows where my Dad is.\nJoey: What?\nRachel: Really?!\nMonica: Oh well, where is he?!\nPhoebe: She was acting, she was pretending like she hasnt heard from him on years, but I found this picture on her fridge, and look (shows Monica)! Isnt this what he would look like now?\nMonica: (gasps) Totally familiar. (Phoebe shows the rest of them.)\nRachel: Oh, yeah.\nThe Guys: Yeah!\nMonica: Well, why would she lie to you?\nPhoebe: I dont know, but were having dinner tomorrow night, so I figured, shes gonna tell me then. Y'know maybe she just wanted to give him time to, buy me presents, I dont know! So, youre all bored?\nAll: Ohh!!\nChandler: Yes!\nPhoebe: All right, Im gonna close my eyes and point to someone, and you, whoever I point has to come up with something fun for us to do, and we have to do it. \nJoey: Okay, all right. \nPhoebe: Okay.\nJoey: Fan out! Fan out!\n(They do so, and Phoebe gets in the middle, closes her eyes, and starts spinning in a circle.)\nPhoebe: Okay. (Starts to spin) Ooh, y'know we could just do this. (She stops at Chandler)\nChandler: Okay, umm, we all have to play strip poker.\nJoey: (jumping in triumph) OH YES!!!!!\n[cut to later]\nMonica: Strip Happy Days Game?\nJoey: Yeah, well, I couldnt find any cards, so it was either this or Strip Bag Of Old Knitting Stuff.\n(Monica rolls, and Ross goes first.)\nRoss: Okay, (reading the card) Fonzy gives you two thumbs up, collect two cool points. Yeah.\nPhoebe: Monica, if you get five cool points, you get to make somebody take off one item of clothing. It hasnt happened yet, but were all very excited.\nRoss: Okay, come on! (blows on the dice) Daddy needs a new pair of electromagnetic microscopes for the Prehistoric Forensics Department! (They all look at him, and he shuts up and rolls the dice.) (he moves his piece) Okay. (reading a card) Take Pinky Tuscadero up to Inspiration Point, collect three cool points!! Yeah! Which gives me five, and lets see who is gonna lose their clothes. Ummmm, I think I pick our strip poker sponsor Mr. Joey Tribianni.\nThe Girls: Woo-hooooo!!!!\nJoey: All right, relax. Its just a shoe.\nAll: Wooooo!!!!\n[cut to later in the game]\nRachel: (reading a card) Okay, your band is playing at Arnolds, collect three cool points. Which means, I have five, and that means I get Joeys boxers!\nJoey: Fine. Gang up on me! I got you all right where I want you.\nPhoebe: Come on, take em off!!\nJoey: Actually, y'know its kinda cold, so how about I keep my boxers on, and give you all a peek at the good stuff?\nRachel: (getting up) All right, Im gonna make more margaritas! (She pours the rest of the pitcher into Rosss glass.)\nRoss: Whoa, hey! What are doing? Trying to get me drunk?\nRachel: Im just making margaritas.\nRoss: Okay.\nMonica: I think Ill help her out. (She gets up to go over and help Rachel, and reveals she has no pants.) (to Rachel) What is going on here?\nRachel: What?! \nMonica: You painting his toenails?\nRachel: Oh, come on!\nMonica: Chasing him all around the room?\nRachel: Monica, please?\nMonica: Hes totally flirting with you too.\nRachel: (pause) He is, isnt he? I dont know, I dont know, I mean maybe its just being here at the beach together or, I dont know. But its like something... (shes interrupted by the sound of Bonnie entering)\nBonnie: Hey!\nRoss: Hey! (Rachel is shocked) Hi Bonnie!\nBonnie: Hi! My boss let me off early, so I took the train. \nRoss: Oh.\nBonnie: What are you guys doing?!\nJoey: Were playing Strip Happy Days Game!\nBonnie: Cool! Ill catch up! (She takes off her sweater.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 6, "scene_id": "S03E25_006", "location": "The beach house", "scene_description": "its still raining. Chandler is building a sand castle, Rachel is doing Monicas nails, and theyre all drinking margaritas, obviously bored.", "characters": ["All", "Bonnie", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "The Girls", "The Guys"], "firestore_path": "/episodes/S03E25/scenes/S03E25_006"}}
{"id": "S03E25_007", "text": "[Scene: The beach house, the next morning. Chandler and Monica are in the kitchen eating breakfast.]\nChandler: So, you still dont think Im boyfriend material?\nMonica: Huh?\nChandler: I saw you checking me out during the game last night.\nMonica: You didnt even take off your pants.\nChandler: Yeah, well, lucky for you.\nMonica: What?\nChandler: I dont know.\nRachel: (entering) Well! Is everybody else having just the best time?!\nPhoebe: Shhh! Shhhh! Joeys asleep.\n(Joey is sleeping on the floor and is buried in sand that has been carved into a mermaid complete with breasts.)\nPhoebe: After he passed out, we put the sand around him to keep him warm.\nRachel: Well I assume the ah, happy couple isnt up yet. Did you guys hear them last night?\nChandler: Oh, yeah, I dont know what they were doing, but at one point sea turtles actually came up to the house.\n(Ross and Bonnie enter)\nRoss: Good morning.\nAll: Hey.\nBonnie: Hey! How did everybody sleep?\nRachel: Oh, great.\nMonica: Like a log.\nRoss and Bonnie: Us too.\nRachel: Im going for a walk.\n(Joey finally wakes up.)\nRoss: (to Joey) Good morning. Nice breasts by the way.\n(Joey looks down and his look turns from shock to satisfaction.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 7, "scene_id": "S03E25_007", "location": "The beach house", "scene_description": "the next morning. Chandler and Monica are in the kitchen eating breakfast.", "characters": ["All", "Bonnie", "Chandler", "Monica", "Phoebe", "Rachel", "Ross", "Ross and Bonnie"], "firestore_path": "/episodes/S03E25/scenes/S03E25_007"}}
{"id": "S03E25_008", "text": "[Scene: The porch, Bonnie is coming back from swimming, Rachel is reading.]\nBonnie: Hey, what happened to you?\nRachel: Oh, ah nothin. I just felt like hangin out here and reading.\nBonnie: Oh, the water was sooo great! We jumped off this pier and my suit came off.\nRachel: Ohhhh, sorry I missed that.\nBonnie: Yeah, Joey and Chandler sure are funny. \nRachel: Ohh-ha-ha!\nBonnie: I think I brought back half of the beach in my hair. It was so much easier when I used to shave my head.\nRachel: Y'know, I gotta tell ya, I just loved your look when you were bald.\nBonnie: Really?!\nRachel: Ohh!\nBonnie: Because I think about shaving it all off again sometime.\nRachel: Really?!\nBonnie: Yeah!\nRachel: I mean you definitely should do that.\nBonnie: Y'know what, I should do it.\nRachel: Yeah!\nBonnie: Yeah, thank you Rachel, you are soo cool.\nRachel: Awww, stop. Come on. Now go shave that head!\nBonnie: All right.\n(As Bonnie goes to do just that, Rachel smiles to herself, proud of what shes done.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 8, "scene_id": "S03E25_008", "location": "The porch", "scene_description": "Bonnie is coming back from swimming, Rachel is reading.", "characters": ["Bonnie", "Rachel"], "firestore_path": "/episodes/S03E25/scenes/S03E25_008"}}
{"id": "S03E25_009", "text": "[Scene: The beach house, at night. Phoebe is hangs up the phone, and gently pushes one of the stools over.]\nJoey: Whats the matter, Pheebs?\nPhoebe: She cancelled! My namesake cancelled on me!\nJoey: What?!\nPhoebe: Yeah, she clamed she had to go out of town suddenly. Shes avoiding me, she doesnt want to tell me where my Father is. She knows, and she wont tell me.\nRachel: Aww Pheebs, that sucks!\nPhoebe: Yeah, well, dont Aww Pheebs, that sucks! me yet. (she starts to leave)\nChandler: Where ya going?\nPhoebe: Well, shes out of town so, theres gotta be something in her house that tells me where my Father is.\nRoss: Uh, Pheebs, some people call that breaking and entering.\nPhoebe: Well, are any of those people here?!\nAll: Oh, no!! No, no!\nPhoebe: Okay, look I-I-I do something nice, okay? Ill-Ill fill her ice trays.\n(She exits just as Bonnie comes down the stairs, as bald as Michael Jordan.)\nBonnie: Hey, everybody!\nAll: Wow!! (they all recoil in shock and horror)\nRoss: Wh-haa-haa! Look what cha did! (Rachel has her hand over her mouth to keep from laughing.)\nBonnie: You wanna touch it?\nRoss: Nooo, but it, but its great.\nBonnie: Come on, touch it!\nRoss: Okay. (He gently touches it.) You can feel all the bones in your skull.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 9, "scene_id": "S03E25_009", "location": "The beach house", "scene_description": "at night. Phoebe is hangs up the phone, and gently pushes one of the stools over.", "characters": ["All", "Bonnie", "Chandler", "Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_009"}}
{"id": "S03E25_010", "text": "[Scene: Outside the beach house, Ross is coming out to talk to Rachel.]\nRoss: Hi.\nRachel: Hi!\nRoss: I was having a little chat with ah, Bonnie, and ah, guess what, she-she happened to bring up y'know, who was behind the um, whole head shaving idea, and now, who was it? Oh, thats right, thats right, it was you!\nRachel: That was her idea, I just gave her a nudge.\nRoss: She said you gave her the razor!\nBonnie: (joining them) Hey guys.\nRachel: Hey!\nBonnie: So, anyone up for a midnight dip in the ocean?\nRoss: Ahh, no, Im good.\nBonnie: Okay, Ill see you in a bit.\nRoss: Okay, have fun! Wooo!!\nRachel: Come on see, she doesnt look that bad.\nRoss: You can see the moonlight bouncing off her head! What the hell were you thinking?!!\nRachel: I dont know.\nRoss: You dont know?! Rach, you balded my girlfriend!\nRachel: All right! Ross, do you think its easy for me to see you with somebody else?\nRoss: Y'know, hey! Youre the one who ended it, remember?\nRachel: Yeah, because I was mad at you, not because I stopped loving you!\nRoss: You still love me?\nRachel: Noo.\nRoss: You still love me.\nRachel: Oh, y-yeah, so, you-you love me!\nRoss: Noo, nnnnn. What does this mean? What do you, I mean do you wanna, get back together?\nRachel: Noo! Maybe! I, I dont know. Ross, I still cant forgive you for what you did, I cant, I just, but sometimes when Im with you I just, I feel so...\nRoss: What?!\nRachel: I just, I feel, I-I just...\nRoss: What?\nRachel: I feel...\n(Ross leans in and kisses her. They both look at each other for a moment, and then embrace in a more passionate kiss, only to be interrupted by Joey and Chandler coming outside.)\nChandler: (to Joey) Noo!! I dont care! Im not, Im not gonna playing one-on-one strip poker with you for practice! \n(Rachel and Ross both stop kissing, and quickly step back from each other.)\nJoey: But I made cards!!\nRachel: Well! Good night. (to Ross) Im going upstairs.\nJoey and Chandler: Gnight.\n(Rachel walks inside, stops, and turns back to look at Ross for a moment then goes upstairs.)\nJoey: (to Ross) Wanna play strip poker for practice?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 10, "scene_id": "S03E25_010", "location": "Outside the beach house", "scene_description": "Ross is coming out to talk to Rachel.", "characters": ["Bonnie", "Chandler", "Joey", "Joey and Chandler", "Rachel", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_010"}}
{"id": "S03E25_011", "text": "[Scene: Phoebe Sr.s house, Phoebe is breaking in through a window.]\n(She throws her bag inside, and starts to climb through the window. She gets halfway in and the window slams shut on her butt.)\nPhoebe: Ow! My ass. Okay. Okay. (She manages to climb completely inside and the window slams shut.) Oh, shhh!\n(She starts walking across the darkened room and hits her head on a wind chime hanging from the ceiling, to stop it from making a noise she grabs it and Shhhs it. She goes into the kitchen and finds Phoebe Sr.s appointment book, to read it she opens the freezer. Just as she starts to read, Phoebe Sr. jumps out from her bedroom with a coat hanger, startling Phoebe.)\nPhoebe: No! No!! Its me! Its me! I-I didnt want to make any noise!\nPhoebe Sr: Then don't break in!!\nPhoebe: Im sorry.\nPhoebe Sr: What are you doing here?!\nPhoebe: I-I, came to fill your ice cube trays.\nPhoebe Sr: What?!\nPhoebe: Umm, okay, okay, look. I took this picture from your fridge. Okay, because I know that this is my Father. Yeah, this is Frank Buffay and you are standing right there next to him. Now, look I deserve to know where I came from. All right? So if you can help me find my Father then you should! Otherwise, youre just mean! (pause) So, just tell me the truth!\nPhoebe Sr: All right, the man in the picture is Chuck Magioni. \nPhoebe: My Father is Chuck Magioni?\nPhoebe Sr: No, no, thats just Chuck Magioni, I-I sold him a house last year! And Im very sorry, but I dont know where your Father is, and thats the truth.\nPhoebe: Oh.\nPhoebe Sr: But umm, youre right. I think that a person should know where they come from. Wh-which is why I ah, (pause) ahh, (pause) okay. Im your mother.\nPhoebe: Heh?\nPhoebe Sr: Y'know I wanted to tell you yesterday, but I just, I kinda felt all floopy, and... \n(At that Phoebes eyes open in shock.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 11, "scene_id": "S03E25_011", "location": "Phoebe Sr.s house", "scene_description": "Phoebe is breaking in through a window.", "characters": ["Phoebe", "Phoebe Sr"], "firestore_path": "/episodes/S03E25/scenes/S03E25_011"}}
{"id": "S03E25_012", "text": "[Scene: Outside the beach house, Ross is telling Joey and Chandler what happened with Rachel.]\nJoey: Im telling ya, you guys are totally getting back together!\nRoss: Thats not true! Her, she doesnt even know what she wants! Rachels still mad about the whole thing.\nChandler: Okay, then you gotta back away, all right? You dont need that kindve hurt. Take it from a guy whos never had a long term relationship......\nRoss: I know, but ahhhhhh!! I really wanna go up there and finish that kiss!\nBonnie: (coming back from her swim) Hey!\nChandler: Ahhhh! (Steps away from her.)\nBonnie: You guys, the waters great. You should really go in.\nChandler: Oh, ahh, no thanks, I just had an M&M.\nBonnie: Okay, well gnight.\nRoss: Good night.\nBonnie: (kisses Ross) Dont be too long.\nRoss: Okey-dokey!\nChandler: There is not one hair on that head.\nRoss: Hey, itll grow back, right? And she-shes really fun, and shes cool, and-and Im finally moving on. Y'know? I mean getting over Rachel was so (makes an incoherent nasal sound), y'know? Y'know, and Im finally feeling sane again. And now if I go up there, and-and I kiss her, and, Gooood I wanna kiss her, and-and-and it doesnt work out, right? Do I really wanna put myself through that again?\nJoey: So let me get this straight. If you go with Bonnie tonight, youre doing the smart, healthy thing and moving on.\nRoss: Yeah.\nJoey: Right, and you go with Rachel, Bonnies free tonight?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 12, "scene_id": "S03E25_012", "location": "Outside the beach house", "scene_description": "Ross is telling Joey and Chandler what happened with Rachel.", "characters": ["Bonnie", "Chandler", "Joey", "Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_012"}}
{"id": "S03E25_013", "text": "[Scene: The hallway between the bedrooms. Ross is coming upstairs and stops between two doors. He looks at the one on the right, then he looks at the one on his left, thinks about it, and goes in the one on his right.]\nRoss: (entering the bedroom) Hi. (closes the door)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 13, "scene_id": "S03E25_013", "location": "The hallway between the bedrooms. Ross is coming upstairs and stops between two doors. He looks at the one on the right", "scene_description": "then he looks at the one on his left, thinks about it, and goes in the one on his right.", "characters": ["Ross"], "firestore_path": "/episodes/S03E25/scenes/S03E25_013"}}
{"id": "S03E25_014", "text": "[Scene: The beach house, Chandler is simulating hes coming to pick up Monica for a date. Chandler knocks on the door, and Monica answers it.]\nChandler: (in a fake voice) Hi there.\nMonica: Thats that weird voice again.\nChandler: Okay! Okay! Let me try it again, youre gonna wanna date this next guy, I swear!\n(Monica closes the door, Chandler knocks, and Monica opens it to reveal Chandler on his knees.)\nChandler: Hi! Im Dorf! Youre date for the evening. (Monica walks away in disgust) Oh come on! Dorf on dating, thats good stuff!!\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 25, "episode_id": "S03E25", "episode_title": "THE ONE AT THE BEACH", "scene_number": 14, "scene_id": "S03E25_014", "location": "The beach house", "scene_description": "Chandler is simulating hes coming to pick up Monica for a date. Chandler knocks on the door, and Monica answers it.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S03E25/scenes/S03E25_014"}}
