{"id": "S03E21_001", "text": "THE ONE WITH A CHICK. AND A DUCK\nWritten by: Chris Brown Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 1, "scene_id": "S03E21_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E21/scenes/S03E21_001"}}
{"id": "S03E21_002", "text": "[Scene: Outside Central Perk, Rachel and Phoebe are helping Monica learn how to roller skate by rolling her between themselves.]\nRachel: So whos idea was it to put everybody in the diner on skates?\nMonica: Oh, some idiot customer put a suggestion in the suggestion box.\nPhoebe: Oh my God, they took my idea!\nMonica: That was you?!\nPhoebe: Yeah! Okay, here you go. (rolls her back to Rachel)\nGunther: (bringing Rachel a mug) Rachel, I made you a cocoa. \n[He distracts her from catching Monica and Monica slams into her, knocking her down. Monica then falls on top of her.]\nPhoebe: Oh my God, are you guys okay?\nGunther: Are you all right?\nJoey: (leaving Central Perk and seeing Monica laying on top of Rachel who is moaning in pain.) Oh my.\n(They both turn and give him a dirty look.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 2, "scene_id": "S03E21_002", "location": "Outside Central Perk", "scene_description": "Rachel and Phoebe are helping Monica learn how to roller skate by rolling her between themselves.", "characters": ["Gunther", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E21/scenes/S03E21_002"}}
{"id": "S03E21_003", "text": "[Scene: Chandler and Joey's, Joey is watching Quincy M.E. as Chandler is walking into the living room from his bedroom.]\nChandler: (sporting a goatee) Hey.\nJoey: Hey. Y'know with that goatee you kinda look like Satan.\nChandler: Oh, so thats why the priest threw holy water on me. (theres no reaction from Joey) Okay, listen, you have to cheer up! Okay? You should come out with Ross and me, I mean anything is better than sitting around here crying all day about Kate.\nJoey: Hey I was crying because, because nobody believed Quincys theory. Okay?\nRoss: (entering) Hey!\nChandler: Hey.\nRoss: (triumphantly) Im gonna be on TV!!\nChandler: No way!\nRoss: Yeah! Theyre putting together this panel to talk about these fossils they just found in Peru and The Discovery Channels gonna film it!\nChandler: Oh my God! Whos gonna watch that?!\nRoss: Thanks. You ready to go?\nChandler: Yeah. (they start to leave)\nJoey: Saw a girl with that vest.\nChandler: Thanks. (He takes off the vest and throws it on the floor.)\nAnchorwoman: (on TV) While most of us think of chocolate bunnies and baskets as traditional Easter gifts. Some people insist on giving live chicks as presents. (Joey is intrigued by the idea) Unfortunately, the sad fact remains that most of these little guys wont live to see the fourth of July. (Joey starts to call a place to buy a little baby chick) Because of as a result of improper care, they will be dead.\nJoey: (on phone) Yeah, hi. You guys got any of those baby chicks? Cause I was watching this ah, commercial on TV and man, those guys are cute!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 3, "scene_id": "S03E21_003", "location": "Chandler and Joey's", "scene_description": "Joey is watching Quincy M.E. as Chandler is walking into the living room from his bedroom.", "characters": ["Anchorwoman", "Chandler", "Joey", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_003"}}
{"id": "S03E21_004", "text": "[Scene: The Moondance Diner, Pete is entering, Monica is on roller skates.]\nPete: Hi!\nMonica: Hi! Hey, Pete youre back! Hey, check this out. (She starts to skate over to him)\nPete: Wow! Skates! \n(She gets just about all the way over to him and falls into his arms.)\nMonica: Wow! Youre a lot sturdier that Chandler. He crumpled like a piece of paper. So how was youre trip?\nPete: Well... (he holds up a gift he brought her)\nMonica: Oh, whatd ya bring me?! (She opens the gift) Awww, hotel toiletries from Japan. Oh, these are gonna go in my permanent collection. You want some coffee?\nPete: Yeah, sure, thatd be great.\n(She starts to go and get the coffee and falls behind the counter.)\nMonica: (popping back up) Regular or decaf?\nPete: Ah, which ever is closest. \nMonica: Okay. (hands him a cup)\nPete: So ask me what I did today.\nMonica: So what did you do today Pete?\nPete: I bought a restaurant and I would like you to be the head chef.\nMonica: What?! Oh.(She turns around quickly and falls)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 4, "scene_id": "S03E21_004", "location": "The Moondance Diner", "scene_description": "Pete is entering, Monica is on roller skates.", "characters": ["Monica", "Pete"], "firestore_path": "/episodes/S03E21/scenes/S03E21_004"}}
{"id": "S03E21_005", "text": "[Scene: Monica and Rachel's, Monica is telling Rachel about Petes offer.]\nMonica: Can you believe he just offered me a restaurant?\nRachel: What a jerk! You want me to kick his ass?\nMonica: I mean this has been like my dream since I got my first Easy Bake Oven and opened Easy Monicas Bakery. I mean I would kill for this job. I mean I can totally do this job, and God knows I paid my dues. (She removes her fake breasts) But Petes just doing this because he has a crush on me.\nRachel: And youre still not attracted to him at all?\nMonica: Hmm, no. I mean how can I accept a restaurant from him? I-I-I-I cant. I couldnt even accept a necklace from Stu Vincent in the seventh grade.\nRachel: Yeah, but Mon thats totally different. He was youre health teacher.\nMonica: Oh, please. \n(She slaps Rachels side and Rachel screams in pain.)\nMonica: What? Honey.\nRachel: Oh, I am, my side still hurts from when you crashed into me yesterday.\nMonica: Oh God, Im so sorry.\nRachel: I know. \n(Monica hugs her goes and hugs her)\nRachel: Ow!!\nMonica: Oh God!\nRoss: (entering, wearing a white suit with a little red bow tie) Hey, you guys! Guess what?\nRachel: (looking at the outfit) Got a job on a river boat?\nRoss: Y'know what I didnt wear this suit for a year because you hated it. Well, guess what? Youre not my girlfriend anymore so...\nRachel: Oh I see, so this suit is making a point.\nRoss: Right.\nRachel: Now that youre on youre own, youre free to look as stupid as you like.\nRoss: (to Monica) You like it right?\nMonica: Oh absolutely. I like it even more on you than I did on Colonel Sanders. (Ross starts to leave) Ross! Ross! Im kidding!\nRachel: Yeah, come here!\nMonica: What-what was it you were gonna tell us? \nRachel: Yeah. Oh! Was how you invented the cotton gin?!\nRoss: Okay, good bye! (leaves)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 5, "scene_id": "S03E21_005", "location": "Monica and Rachel's", "scene_description": "Monica is telling Rachel about Petes offer.", "characters": ["Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_005"}}
{"id": "S03E21_006", "text": "[Scene: Chandler and Joey's, Chandler is talking to Phoebe about her suggestion.]\nChandler: So um, after you put the suggestion in the box, how long did it take for the roller skating thing to happen.\nPhoebe: Umm, oh, about three months.\nChandler: Okay, so I guess thats about ah, two weeks before the topless thing kicks in.\nJoey: (entering carrying a box) Hey!!\nChandler: Hey!\nJoey: I got you something! Open it! Open it!\nChandler: Okay. (He opens it and its a baby chick) Its a chicken.\nJoey: Its cute, huh?\nPhoebe: Whoa-whoa-whoa, you guys, do you know anything about chicks?\nChandler: Fowl? No. Women? Nooo.\nPhoebe: Okay, well they are a huge responsibility, especially at this age. They require constant care. They-they need just the right food, and lots and lots of love.\nJoey: Oh, well no problem there. (He picks up the chick, hugs it really tight, and talks to it like its a little baby.)\nChandler: Easy Lenny.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 6, "scene_id": "S03E21_006", "location": "Chandler and Joey's", "scene_description": "Chandler is talking to Phoebe about her suggestion.", "characters": ["Chandler", "Joey", "Phoebe"], "firestore_path": "/episodes/S03E21/scenes/S03E21_006"}}
{"id": "S03E21_007", "text": "[Scene: The Moondance Diner, Pete is talking to Monica about the restaurant.]\nPete: So? I mean have you thought about it?\nMonica: Okay. Heres the thing.\nPete: Oh no, not the thing. I hate the thing. Whats the thing?\nMonica: I cant do it. Im sorry, I wish I could, but umm, see you have these feelings for me....\nPete: Wait, wait, wait, wait, thats-thats what youre worried about? If thats the problem, weve got no problem.\nMonica: Huh?\nPete: No! Look, I was gonna tell you this over dinner, but I met somebody else. On my trip.\nMonica: Oh?\nPete: Her names Ann, shes a journalist. Ahh, we met on the plane. She asked me if she could finish off my peanuts, I thought she said something else, we had a big laugh. Yeah, I just, I mean I got, I got tired of waiting.\nMonica: Oh, thats great! I mean Im-Im sorry, but Im so happy for you. And now I can work for you!\nPete: I guess you can.\nMonica: Oh my God! Oh, this is incredible! Ohh! (she rolls over and kisses him on the cheek) All right, y'know what? Im just gonna roll right into that office and-and quit!\nPete: All right.\nMonica: Okay. (she gets ready to go) Can you give me a little push?\nPete: Yeah, sure. Good luck!\nMonica: (rolling towards the office) Im quitting!! Woo-hoo! (She rolls through a doorway and out of sight. We then hear a big crash, and see Monica roll past the door the other way.) Im okay!! Im all right!!\nPhoebe: (to Pete) Wow! Thats exciting, you went to Japan, made up a woman.\nPete: What?\nPhoebe: Im just saying, this woman, I mean shes fictitious. No?\nPete: Why would you say that?\nPhoebe: Cause youre still into Monica. So you told her there was somebody else so she would agree to work with you, so cause you figure oh if you spent a lot of time together, maybe something might happen, and...\nPete: Youre good. Youre good!\nPhoebe: Yeah, no, Im fairly intuitive and psychic. Its a substantial gift.\nPete: Listen, can you promise me that you wont tell her though?\nPhoebe: Absolutely, oh I promise. Tell her what?\nPete: Thanks a lot.\nPhoebe: No Im serious. I mean Im intuitive, but my memory sucks.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 7, "scene_id": "S03E21_007", "location": "The Moondance Diner", "scene_description": "Pete is talking to Monica about the restaurant.", "characters": ["Monica", "Pete", "Phoebe"], "firestore_path": "/episodes/S03E21/scenes/S03E21_007"}}
{"id": "S03E21_008", "text": "[Scene: Chandler and Joey's, Chandler is baby-chick sitting.]\nChandler: Okay, but this is the last time. (singing) With a chick-chick here, and a chick-chick there. Here a chick, there a chick, everywhere a chick-chick-(Joey enters)-chickeeeen.\nJoey: Hey.\nChandler: Hey.\nJoey: Hows she doing?\nChandler: She?\nJoey: Well yeah, dont-dont you think its a she?\nChandler: I dont know. (He picks the chick up and turns it over, trying to determine the sex of the chick, and blows on it.) I cant tell, what ever it was went back in too quickly.\nJoey: Well, anyway, I got to go change, Im ah, meeting some of the cast for drinks.\nChandler: Excuse me?\nJoey: What?\nChandler: I stayed home from work today while you were at rehearsal so somebody could be here with our chick!\nJoey: Hey! Who was up from 2 oclock this morning until 5 oclock this morning trying to get her back to sleep?\nChandler: You dont think I get up when you get up?\nJoey: Ohhh, here it comes.\nChandler: Yes, here it comes! Im stuck here all day, and then you come in and spend two seconds with us and then expect to go off gallivanting with your friends? Well I dont think so mister!\nJoey: Hey!! I need to relax! Okay? I was working all day!\nChandler: And you dont think taking care of our chick is work?\nJoey: Thats not what I said. Okay, I just meant...\nChandler: I know what you meant!! (pause) You notice that ever since we got this chick, weve been fighting a lot more than we used too?\nJoey: I dont know, maybe we werent ready to have a chick.\nChandler: Ill take her back tomorrow.\nJoey: Do you think well get our three bucks back?\nRoss: (entering carrying a garment bag) Hey!\nChandler: Hey!\nRoss: (sees the chick) Ohhh, hey! All right, listen, I-I have that TV thing in like two hours, and I need your help, okay? What do you think? (takes out two suits) This blue suit, or this brown one?\nJoey: Well, the brown one brings out your eyes, but your butt looks great in the blue one.\nRoss: Really? (Joey gives him a Like I would know look)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 8, "scene_id": "S03E21_008", "location": "Chandler and Joey's", "scene_description": "Chandler is baby-chick sitting.", "characters": ["Chandler", "Joey", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_008"}}
{"id": "S03E21_009", "text": "[Scene: Monica and Rachel's, Rachel is trying to take some aspirin.]\nRachel: (she reaches for the bottle) Oww! (She grabs the bottle, but has trouble opening it. She pops the top off and aspirins fly all over the place as Ross enters.)\nRoss: Wow! That aspirin dance really works!\nRachel: (She bends over to try and pick up the aspirin) Oww!\nRoss: Oh my God, is that still...\nRachel: Im fine, Im fine.\nRoss: No youre not.\nRachel: Yes I am! \nRoss: Rach!\nRachel: Look, Im fine. Watch. (She picks up an aspirin between her toes) Look at that. (She lifts her leg to grab the aspirin with her hand and almost falls over.) Whoa-whoa!\nRoss: (stopping her from falling) Okay, okay. Look, you have got to go to a doctor! Okay?\nRachel: No. I have got to get ready and go to a dinner at my bosses house. Its a very big deal, theres a lot of people there I have to meet.\nRoss: And Im sure youre gonna make a big impression. Hi! Im Rachel Green. Its nice to meet you. (He lifts his leg and imitates shaking hands with it, just like how Rachel was trying to pick up the aspirin with her feet.) Come on, you probably have a broken rib!\nRachel: Well, I will go to the hospital tomorrow, itll still be broken then.\nRoss: Rach...\nRachel: But y'know, I could use a hand getting ready.\nRoss: Rachel...\nRachel: Look, either help me or go.\nRoss: Fine. Ill go.\nRachel: (with a hurt expression on her face) Okay, but before you go, could you help me first?\nRoss: (He checks his watch) Sure. Ill help you.\nChandler: (rushing in) Oh, good! Good! Do you guys know how to get a chick out of a VCR?!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 9, "scene_id": "S03E21_009", "location": "Monica and Rachel's", "scene_description": "Rachel is trying to take some aspirin.", "characters": ["Chandler", "Rachel", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_009"}}
{"id": "S03E21_010", "text": "[Scene: Rachels bedroom, Rachel is trying to put on eye liner with her left hand, as Ross is setting out her shoes.]\nRachel: (She drops the brush) Y'know what? I cannot do this with my left hand! Would you please, help me with this too?\nRoss: Ohh. (He drops the shoes, takes the brush from her, and licks the tip. He doesnt like how it tastes.)\nRachel: (taking the brush back) Okay. Lets use this brush. (Hands him another one.)\nRoss: Okay. This stuff? \nRachel: Yeah.\nRoss: All right.\nRachel: Careful. Light. Okay, do you know how, just sweep it across the lid. Okay? Just sweep it.\nRoss: Oke-dokey. (He pokes her in the eye with the brush.)\nRachel: Oh-ho!\nRoss: Sorry.\nRachel: Hey! Thats just poking me in the eye!\nRoss: Sorry, Im sorry. Close, close, close...\nRachel: Okay, just sweep it.\nRoss: Im sweeping...\nRachel: Right.\nRoss: Sweep, sweep....(He starts to paint it on her eye, making it look like she has a black eye.)\nRachel: Okay, now make it even, cause we dont...\nRoss: What? What?\nRachel: We dont want it-it to be too much, we want it to be subtle.\n(Of course its too late for that.)\nRoss: No. No, y'know you dont, you dont wear enough of this. (Rachel is shocked) What?\nRachel: Since when, since when do you think I dont wear enough of this?\nRoss: Well I, close your eyes, I just think youre gonna like this a little better, cause, close-close... (He gets some more on the brush)\nRachel: Blow it.\nRoss: (blows it) Sorry. Cause umm, I think this will make you a little more sophisticated.\nRachel: Sophisticated like a hooker?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 10, "scene_id": "S03E21_010", "location": "Rachels bedroom", "scene_description": "Rachel is trying to put on eye liner with her left hand, as Ross is setting out her shoes.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_010"}}
{"id": "S03E21_011", "text": "[Scene: Central Perk, Monica is entering, Phoebe is already there.]\nMonica: Hey!\nPhoebe: Hey! \nMonica: Hey, guess what Im doing tonight.\nPhoebe: What?\nMonica: Im checking out the restaurant with Pete.\nPhoebe: Ohh, Monica, I am so excited for you.\nMonica: I know.\nPhoebe: Ooh, I have to tell you something.\nMonica: What?\nPhoebe: But I cant tell you.\nMonica: Okay, but wouldnt it be easier if you had to tell me something that you could tell me.\nPhoebe: Well, sure in a perfect world. But, no, I promised I wouldnt tell, and I swore to like all my gods.\nMonica: Okay. Does it have to do with Ross and Rachel?\nPhoebe: No.\nMonica: Does it have to do with Joey?\nPhoebe: No.\nMonica: Does it have to do with-with Chandler and that sock that he keeps by his bed?\nPhoebe: No, but lets come back to that later!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 11, "scene_id": "S03E21_011", "location": "Central Perk", "scene_description": "Monica is entering, Phoebe is already there.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E21/scenes/S03E21_011"}}
{"id": "S03E21_012", "text": "[Scene: Rachels Bedroom, Ross is finishing up her make-up.]\nRoss: There you go! Good enough for your party, huh?\n(She turns and looks in the mirror, and its way, way over done. She looks like she has two black eyes.)\nRachel: Sure.\nRoss: Yep?\nRachel: Sure, Ill just sit next to the trans-sexual from purchasing.\nRoss: Okay, come on! All right, I gotta go! So good luck at the party. Okay?\nRachel: Oh wait, Ross, would you just stay and help me get dressed?\nRoss: (checks his watch) Sure, okay.\nRachel: Okay. Okay, great! Umm, okay, just turn around.\nRoss: What?\nRachel: I dont want you to see me naked!\nRoss: Rachel, Ive seen you naked a million times. I ate hot fudge off you naked. Remember, I-I sucked that mini-marshmallow out of your belly button?\nRachel: Yeah, but that was different. Yknow? I mean, we were, we were going out then, now I think its weird.\nRoss: Rach, y'know I can see you naked any time I want.\nRachel: What?\nRoss: All I have to do is close my eyes. See? (closes his eyes) Woo-hoo!!\nRachel: Ross! Stop that!\nRoss: Ah, Im sorry.\nRachel: Come on! I dont want you thinking of me like that any more!\nRoss: Ahh, sorry, nothing you can do about it. Its one of my ah, rights as the ex-boyfriend. (closes his eyes again) Oop, oh yeah!\nRachel: Stop it! Cut it out! Cut it out!\nRoss: Okay, okay, Im sorry, it will never happen... (closes eyes) Uh-oh! Wait a minute! Wait-wait, now there are a hundred of you and Im the king. \nRachel: Rosss...\nRoss: Come on, would you grow up? Its no big deal.\nRachel: All right. (She starts to take off her robe) Fine.\nRoss: Yowzah!!!\nRachel: O-kay!! See what you did, Im gonna be doing it by myself now. Okay? \nRoss: Aww, come on.\nRachel: Thats it. (She crawls onto the bed) Ow!!! \nRoss: Oh my God!\nRachel: Oh-ow!\nRoss: All right.\nRachel: Ow!\nRoss: Look...\nRachel: Ow!\nRoss: Okay.\nRachel: Ow!\nRoss: Rach?\nRachel: Ow! Ow!\nRoss: Easy. Easy. You have to go to the hospital. Okay?\nRachel: Okay, I do. \nRoss: Okay.\nRachel: I really do.\nRoss: Okay, Im gonna get your coat and then Ill-Ill put you in a cab.\nRachel: Okay. Oh wait, wait-wait, youre not gonna come with me?\nRoss: (He thinks about it) Of course I am. I just have to make a call.\nRachel: Okay.\nRoss: Okay? (goes into the living room)\nRachel: Thank you. (She goes to take off her make-up and screams in pain) Oww!!!! God!\nRoss: (rushing back in) What?! I wh-, whats wrong?\nRachel: Im sorry, I just cant go to the hospital lookin like this.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 12, "scene_id": "S03E21_012", "location": "Rachels Bedroom", "scene_description": "Ross is finishing up her make-up.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_012"}}
{"id": "S03E21_013", "text": "[Scene: Central Perk, Monica is trying to find out what Phoebe wont tell her.]\nMonica: Does it involve travel?\nPhoebe: Noo!\nMonica: Does it involve clogs?\nPhoebe: Oh, wait, wait. Clogs, or claws?\nMonica: Clogs.\nPhoebe: No.\nMonica: Claws?!\nPhoebe: No.\nMonica: Okay, so it doesnt involve Ross or Rachel or Chandler or Joey. But, what about Pete?\nPhoebe: (Shaking her head yes) No!\nMonica: What is it?! What about Pete?\nPhoebe: I dont know! (frantically points at Monica)\nMonica: Okay, I feel like Im talking to Lassie. All right, Phoebe would you just tell me!\nPhoebe: I cant!!\nMonica: Okay, I gotta go. (gets up)\nPhoebe: I, but youre so close! No!\nMonica: Okay, does it involve something to do with Petes computer company?\nPhoebe: Oh, just go. Youre never gonna get it!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 13, "scene_id": "S03E21_013", "location": "Central Perk", "scene_description": "Monica is trying to find out what Phoebe wont tell her.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E21/scenes/S03E21_013"}}
{"id": "S03E21_014", "text": "[Scene: Chandler and Joey's, Chandler is watching Baywatch with the baby chick. Hes on one leather chair, the chick is on the other. Its watching Yasmine Bleeth run and is chirping.]\nChandler: I know. See, yes. Thats Yasmine Bleeth, shes a completely different kind of chick. I love you both. But in very different ways.\nJoey: (entering) Hey!\nChandler: Hey!\nJoey: (sees hes watching Baywatch) Ohhh. (sees he still has the chick) Ahh! What are you doing?! I thought you were gonna take her back to the store today.\nChandler: I did! But the store wouldnt take her back! So then I took her to the shelter, and you know what I found out? \n(Joey wants to know, but Chandler doesnt want to discuss it by the chick, so he and Joey move over to the windows and away from the chick.) \nChandler: If they cant find a home for her, they kill her! And Im not gonna let that happen to little Yasmine!\nJoey: Okay, good, good, good, cause, good, cause I was kinda having second thoughts too. \nChandler: Okay. And its not just chicks y'know? Its all kinds of other animals!\nJoey: Thats horrible! Well, you did the right thing man.\nChandler: Thanks, Im glad you see it that way.\n(He hear a duck start quacking, and see it waddle into the living room from the bathroom. Joey wants to know whats with the duck.)\nChandler: Ohhh-hoo, funny story!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 14, "scene_id": "S03E21_014", "location": "Chandler and Joey's", "scene_description": "Chandler is watching Baywatch with the baby chick. Hes on one leather chair, the chick is on the other. Its watching Yasmine Bleeth run and is chirping.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E21/scenes/S03E21_014"}}
{"id": "S03E21_015", "text": "[Scene: Petes Restaurants Kitchen, Pete is showing Monica around the kitchen.]\nMonica: I dont believe this! Wow, look at this refrigerator! Its gigantic! I mean I could live in this thing! Id be cold, but Im always cold. Oh my God, look at these spider burners! I love spider burners.\nPete: So you like it?\nMonica: Oh, it is sooo perfect. Thank you so much. (runs over and hugs him)\nPete: Oh, youre welcome. (He takes a deep breath)\nMonica: Did you just smell my hair?\nPete: Nooo. Uh-huh, no way. What? No.\nMonica: Oh God.\nPete: What?\nMonica: You still have feelings for me dont you?\nPete: Now, nooo! Im just excited about the restaurant, thats all.\nMonica: Pete.\nPete: Okay, I love you. Is that so bad?\nMonica: No, its not bad. Its not bad at all. Its-its really nice.\nPete: Look, the only who stands to get hurt is me. And Im okay with that.\nMonica: You may be okay about getting hurt, but I am not okay with being the one who hurts you. Thats why I cant take this job.\nPete: What?\nMonica: And well, we probably shouldnt see each other anymore. Im sorry.\nPete: Okay, yeah. I mean... If thats, if thats really what you want, okay.\nMonica: Okay, bye. \n(She kisses him on the cheek, and he kisses her back on the mouth.)\nPete: Im sorry things didnt work out...\nMonica: All right shut up for a second and let me just see something. (She kisses him back on the lips) Oh, wow! (They then hug and kiss, very passionately.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 15, "scene_id": "S03E21_015", "location": "Petes Restaurants Kitchen", "scene_description": "Pete is showing Monica around the kitchen.", "characters": ["Monica", "Pete"], "firestore_path": "/episodes/S03E21/scenes/S03E21_015"}}
{"id": "S03E21_016", "text": "[Scene: The Hallway Between The Apartments, Ross and Rachel are coming back from the hospital. Ross is helping her up the stairs.]\nRachel: Okay, youd tell me the truth. Right?\nRoss: Rach, you cant look fat in an x-ray.\nRachel: Okay.\n(As they approach the door, Chandler comes out carrying his duck.)\nChandler: Okay! Now you stay out here, and you think about what you did!!\nRoss: (to Chandler) Thats a duck.\nChandler: Thats a bad duck!!! (to Ross) Howd the thing go tonight, Ross?\nRoss: Oh, it was, nah, well....\nRachel: What thing? What thing?\nRoss: Nothing, ah there was this thing at the museum. Come on. (they go into her apartment) Easy.\nChandler: (to the duck) Okay, now when you come back I hope you remember that, that chick is not a toy! (He goes back into the apartment)\n[cut to inside Monica and Rachels]\nRachel: What thing? What is this thing?\nRoss: I was kinda, supposed to be on TV tonight for The Discovery Channel.\nRachel: Oh my God! \nRoss: Yeah.\nRachel: Ross, why didnt you tell me that?\nRoss: Eh, cause I knew that if I told you, youd make me go, and I knew you needed someone to be with you tonight. Come on. Come on.\nRachel: I cannot believe you.\nRoss: What?\nRachel: That is the sweetest thing, I just....\n(They both look at each other for a while)\nRoss: (breaking the silence) You should get some sleep.\nRachel: Okay.\nRoss: So, Ill umm...\nRachel: Oh, Im sorry I spoiled youre evening.\nRoss: No, thats, no, as long as youre okay. So Ill ah, Ill see you tomorrow.\nRachel: Um-hmm, yeah.\n(He leaves)\nRachel: (After he closes the door) See ya.\n(In the hallway, Ross all dejected, sits down on the step.)\nChandler: (coming out of his apartment and seeing Ross) What did you do?\nClosing Credits\n[Scene: Chandler and Joeys Bathroom: Chandler is watching the duck swim in the bathtub.]\nJoey: What cha doing?\nChandler: Having a swim.\nJoey: What about the chick?\nChandler: Chicks dont swim.\nJoey: Are you sure?\nChandler: I dont know. Should we try it?\nJoey: Sure.\n(Chandler picks up the chick and drops it in the water.)\nChandler: See, I told you they dont swim. (He goes to take it out)\nJoey: (stopping him) Wait. Give him a minute.\nChandler: Noo! (takes him out) Oh, its okay, its okay, baby, baby, baby.\n(Joey picks up and turns on a hair dryer.)\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 21, "episode_id": "S03E21", "episode_title": "THE ONE WITH A CHICK. AND A DUCK", "scene_number": 16, "scene_id": "S03E21_016", "location": "The Hallway Between The Apartments", "scene_description": "Ross and Rachel are coming back from the hospital. Ross is helping her up the stairs.", "characters": ["Chandler", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S03E21/scenes/S03E21_016"}}
