{"id": "S03E13_001", "text": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS\nWritten by: Michael Borkow Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 1, "scene_id": "S03E13_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E13/scenes/S03E13_001"}}
{"id": "S03E13_002", "text": "[Scene: A Video Store, Monica is running in to return a video.]\nMonica: (to clerk) Hi.\n(The clerk enters the video into the computer.)\nClerk: Six dollars, please.\nMonica: Six? I just had it for one night. Its three.\nClerk: Eight oclock is the cut-off and, (looks at his watch) aww, its 8:02.\nMonica: Y'know in a weird way, you have too much power. Look, youre gonna have to help me out here, cause I only have three.\nRichard: (standing behind her, without his moustache) I can help with that.\nMonica: Oh my God. Richard? (turns around) Hi!\nRichard: Hi!\nMonica: Wow! Your lip went bald. (Richard pays the clerk) Hey, thanks.\nRichard: So, you look great.\nMonica: Right.\nRichard: No you do. You... just...\nMonica: What?\nRichard: Youve got panties stuck to your leg.\nMonica: (removes them) Thats because I-I was just grabbing some things out of the dryer, and its static cling. Or maybe its just that God knew Id be running into you and saw an opportunity.\nRichard: Its good to see you.\nMonica: Its good to see you too.\n(They hug, and Richard notices a stocking stuck to Monicas back, which he removes for her.)\nOpening Credits\n[Scene: continued from earlier.]\nMonica: You see that guy? Hes in classics now, but y'know as soon as we leave hes going straight to the porn.\nRichard: Hes gonna go up to the counter with Citizen Kane, Vertigo, and Clockwork Orgy. (they both laugh) This is nice.\nMonica: Yeah.\nRichard: I missed this.\nMonica: Me too.\nRichard: So, you wanna get a hamburger or something?\nMonica: Oh, um, I dont know if thats a good idea.\nRichard: Oh. Look, just friends, I wont grope you. I promise.\nMonica: No, I just I think that its too soon.\nRichard: No its not too soon, I had lunch at a eleven.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 2, "scene_id": "S03E13_002", "location": "A Video Store", "scene_description": "Monica is running in to return a video.", "characters": ["Clerk", "Monica", "Richard"], "firestore_path": "/episodes/S03E13/scenes/S03E13_002"}}
{"id": "S03E13_003", "text": "[Scene: Monica and Rachel's, Chandler, Ross. Joey, and Rachel are eating breakfast. Chandler is holding a bottle of Herseys Syrup.]\nChandler: Yeah, baby!\nRoss: What are you doing?\nChandler: Making chocolate milk. Do you want some?\nRoss: No thanks. Im 29.\nRachel: (looking at her watch) Oh my God, I gotta go to work!\nRoss: Oh sweetie, when do you think youre going to get off tonight?\nRachel: Oh I dont know honey. Its gonna be really late.\nRoss: Oh come on, not again.\nRachel: I know. Im sorry. Look, Ill make a deal with you all right? Okay?\nRoss: Hmm.\nRachel: For every night that youre asleep before I get home from work...\nRoss: Yeah.\nRachel: I will wake you up in a way thats proved very popular in the past.\nRoss: Now, if you need to stay late, I want to be supportive of that.\nRachel: Right.\nPhoebe: (entering, holding a pair of Roller Blades) Hi.\nAll: Hey.\nJoey: (to Phoebe) Look at you. Since when do you roller blade?\nPhoebe: Oh! Since tomorrow. I met this really cute guy in the park and he like y'know, jogs, and blades, and swims, and so y'know we made a deal thats hes going to teach me all sorts of jock stuff.\nRoss: And what are you going to do for him?\nPhoebe: Im going to let him.\nRoss: Okay.\nJoey: Cool.\nMonica: (entering from her bedroom) Morning.\nAll: Hey.\nRachel: Somebody got in late last night.\nMonica: Yeah well, I ran into Richard. \n(They all gasp)\nRachel: When did this happen?\nMonica: Oh, um, around 8:02. We ah, talked for a little while, and then um, we went out for an innocent burger.\nPhoebe: Oh, theres no such thing as an innocent burger.\nRoss: So, are you gonna see him again?\nMonica: Tomorrow night.\nRachel: Monica, what are you doing?\nChandler: Well, she spent the last six months getting over him, and now shes celebrating that by going on a date with him.\nMonica: Its not a date, okay. Im just gonna teach him how to make lasagne for some pot luck dinner he has.\nJoey: Well, you might wanna make a little extra, y'know youll probably be hungry after the sex.\nMonica: Were not gonna have sex! Okay, nothings changed here. He still doesnt want children and I still do, so thats why were just gonna be friends.\nRoss: Naked friends.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 3, "scene_id": "S03E13_003", "location": "Monica and Rachel's", "scene_description": "Chandler, Ross. Joey, and Rachel are eating breakfast. Chandler is holding a bottle of Herseys Syrup.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E13/scenes/S03E13_003"}}
{"id": "S03E13_004", "text": "[Scene: Chandler and Joey's, Joey is watching TV.]\nRachel: (entering) Hey.\nJoey: Hey.\nRachel: Do you have any ice?\nJoey: Check the freezer. If theres none in there, then were probably out. Are you just getting in from work? Its late.\nRachel: Yeah, I know. I had the greatest day though, I got to sit in on the meeting with the reps from Calvin Klien. I told my boss I liked this line of lingerie, she ordered a ton of it. How was your day?\nJoey: I discovered Im able to count all of my teeth using just my tongue.\nRachel: Hmm. (she opens the freezer) Umm, why do you have a copy of The Shining in your freezer?\nJoey: Oh, I was reading it last night, and I got scared, so.\nRachel: But ah, youre safe from it if its in the freezer?\nJoey: Well, safer. Y'know, I mean I never start reading The Shining, without making sure weve got plenty of room in the freezer, y'know.\nRachel: How often do you read it?\nJoey: Havent you ever read the same book over and over again?\nRachel: Well, umm, I guess I read Little Women more than once. But I mean thats a classic, whats so great about The Shining?\nJoey: The question should be Rach, what is not so great about The Shining. Okay? And the answer would be: nothing. All right? This is like the scariest book ever. I bet its way better than that classic of yours.\nRachel: Okay. Ah, well well just see about that, okay. I will read The Shining, (she tries to take the book away from him but he doesnt want to let it go) and you will read Little Women. \nJoey: All right, you got it.\nRachel: All right.\nJoey: Okay.\nRachel: Okay.\nJoey: Ah, now Rach, these ah, these little women.\nRachel: Yeah.\nJoey: How little are they? I mean, are they like scary little?", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 4, "scene_id": "S03E13_004", "location": "Chandler and Joey's", "scene_description": "Joey is watching TV.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S03E13/scenes/S03E13_004"}}
{"id": "S03E13_005", "text": "[Scene: Central Perk, Chandler and Ross are there, Phoebe is entering with her date Robert.]\nPhoebe: Um, Chandler, Ross, this is Robert.\nChandler: Oh, hey.\nRobert: Hi.\nRoss: Hey.\nPhoebe: (to Robert) Youve have lipstick right here (points to her cheek). Thats okay, its mine, we just kissed.\nRoss: Oh.\nChandler: (to Robert) So ah, isnt a bit cold out for shorts?\nRobert: Well, Im from California.\nChandler: Right, right. Sometimes you guys just burst into flames.\n(Robert leans back on the arm of the chair and allows Chandler to see up his shorts and sees little Robert. Chandler is horrified by this view.)\nChandler: (standing up) Im up! Im up, Ive gotten up now! Anybody ah, want anything?\nPhoebe: Ill have coffee.\nRobert: Yeah, me too.\nRoss: Yeah, make that three.\nChandler: Okay Ross, why dont you come with me?\nRoss: Okay. (goes over to the counter) (to Chandler) What ah, what is the matter with you? Whats going on?\nChandler: Roberts coming out.\nRoss: What, what do you mean, what? Is he gay?\nChandler: No. He.....hes coming out of his shorts.\nRoss: What?!\nChandler: The man is showing brain.\nRoss: Are you sure? (Chandler nods: Yes!) Hold on. (walks over behind the couch) Im sorry you guys, that was a coffee and a....\nRobert: Coffee.\nRoss: Okay.\nRobert: We could write it down for you?\nRoss: No, no, that wont be ah, that wont be necessary (leans down and looks up Roberts shorts, seeing Roberts package.) \nChandler: (to Ross) Wellll?\nRoss: Yeah, yeah, yeah!\nChandler: What do we do? What do we do?\nRoss: Well, I suppose we just try to not look directly at it.\nChandler: Like an eclipse.\n(Ross nods his head.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 5, "scene_id": "S03E13_005", "location": "Central Perk", "scene_description": "Chandler and Ross are there, Phoebe is entering with her date Robert.", "characters": ["Chandler", "Phoebe", "Robert", "Ross"], "firestore_path": "/episodes/S03E13/scenes/S03E13_005"}}
{"id": "S03E13_006", "text": "[Scene: Monica and Rachel's, Monica is teaching Richard how to make lasagne.]\nRichard: So when people complement me on my cooking should I, what do I say?\nMonica: You say Thank you very much, and then you buy me something pretty. Come on, were gonna put are hands in this bowl, and were gonna start squishing the tomatoes.\n(They both start squishing the tomatoes.)\nRichard: Ew, this feels very weird.\nMonica: You touch peoples eyeballs every day and this feels weird.\nRichard: Yeah, well, sure I touch them, but I spent years learning not to squish them. (Monica grabs his hand in the tomatoes.) Thats my hand.\nMonica: Oops.\nRichard: Okay.\nMonica: Gotta keep squishing.\nRichard: Tomatoes are squishing.\nMonica: Okay.\n(Richard squishes a little too hard and some lands on his shirt.)\nRichard: Op.\nMonica: Oh, gosh, you got some on your shirt. \nRichard: Yeah.\nMonica: Hold on a second, just put a little club soda on it (does so) and it should umm, be..... \n(She is rubbing his chest and her voice trails off into silence, a long pause follows.)\nRichard: What?\nMonica: Umm, youve got some on your pants.\nRichard: Ill just throw them out.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 6, "scene_id": "S03E13_006", "location": "Monica and Rachel's", "scene_description": "Monica is teaching Richard how to make lasagne.", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S03E13/scenes/S03E13_006"}}
{"id": "S03E13_007", "text": "[Scene: Central Perk, Chandler is watching Joey read Little Women, Ross is also there.]\nJoey: These little women. Wow!\nChandler: Your liking it, huh?\nJoey: Oh yeah! Amy just burned Jos manuscript. I dont see how he could ever forgive her.\nRoss: Umm, Jos a girl, its short for Josephine.\nJoey: But Jos got a crush on Laurie. (Ross nods his head) Oh. You mean its like a girl-girl thing? Cause that is the one thing missing from The Shining.\nChandler: No, actually Lauries a boy.\nJoey: No wonder Rachel had to read this so many times.\n(Enter Phoebe and Robert)\nPhoebe: Hey!\nChandler: Hey.\nRoss: Hey! Howd the ah, basketball go?\nPhoebe: Oh, okay, I learned how to shoot a lay-up, a foul shot, and a twenty-three pointer.\nChandler: You mean a three pointer?\nPhoebe: Oh, I get more because Im dainty.\nRobert: So um, is there a phone here, I can check my messages?\nPhoebe: Yeah, in the back. You want a quarter?\nRobert: Oh, no thanks. I always carry one in my sock. \n(He puts his leg up on the couch to get the quarter, once again exposing himself to Chandler and Ross. In horror, Chandler, slides over and leans against Joey on the couch.)\nJoey: (noticing Chandler) What are you doing? (he pushes Chandler back to his side of the couch) Get back over on your side of the... (sees Robert in all his glory) Hello!! (to Robert) Hi, Im Joey, we havent met.\nRobert: Ah, good to meet you. Robert.\n(Robert walks away and the guys all start laughing in front of Phoebe.)\nPhoebe: What? (the guys keep laughing.) What? You guys, what is going on? You not like Robert? (the guys keep laughing.) Why are you laughing?!\nRoss: Calm down. Theres no reason to get testy.\n(The guys start laughing harder.)\nPhoebe: You guys!! Come on!\nChandler: Im sorry, Im sorry, it just seems that Robert isnt as concealed in the shorts area, as ah, one may have hoped.\nPhoebe: What do you mean?\nRobert: Hey. (sits down)\nPhoebe: Hey.\nJoey: Hey Robert, could you ah, ha, pass me those cookies?\nRobert: Sure.\n(He puts his leg up on the table to pass Joey the cookies, and Phoebe sees what the guys are laughing at, and gasps.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 7, "scene_id": "S03E13_007", "location": "Central Perk", "scene_description": "Chandler is watching Joey read Little Women, Ross is also there.", "characters": ["Chandler", "Joey", "Phoebe", "Robert", "Ross"], "firestore_path": "/episodes/S03E13/scenes/S03E13_007"}}
{"id": "S03E13_008", "text": "[Scene: Monica and Rachel's, Monica is talking to Richard on the phone.]\nMonica: So, howd the lasagne go over? (listens) Really?! Good. So you owe me three pretty things. (listens) Yeah, Ive been thinking a lot about you too. (listens) I know. Its hard this whole platonic thing. (listens) Its a word!\n(Theres a knock on the door.)\nMonica: Yeah, I do think its better this way. (listens) Yeah, were being smart. (gets up to answer the door) (listens) Yes, Im sure.(she opens the door and its Richard)\nRichard: You really sure?\nMonica: Ill call you back. (starts kissing him)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 8, "scene_id": "S03E13_008", "location": "Monica and Rachel's", "scene_description": "Monica is talking to Richard on the phone.", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S03E13/scenes/S03E13_008"}}
{"id": "S03E13_009", "text": "[Scene: Monicas bedroom, shes in bed with Richard.]\nMonica: So we can be friends who sleep together.\nRichard: Absolutely, this will just be something we do, like racquetball.\nMonica: Sounds smart and healthy to me. So um, just out of curiosity, um, do you currently have any other racquetball buddies?\nRichard: Just your dad. (pause) Although thats actually racquetball. You know I-I do have a blind date with my sisters neighbour next Tuesday.\nMonica: Oh.\nRichard: You want me to cancel it?\nMonica: No! (pushes him) No! \nRichard: Okay.\nMonica: Cause if you do that means youd be cancelling it for me, and were just friends.\nRichard: Exactly. (pushes her back)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 9, "scene_id": "S03E13_009", "location": "Monicas bedroom", "scene_description": "shes in bed with Richard.", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S03E13/scenes/S03E13_009"}}
{"id": "S03E13_010", "text": "[Scene: Central Perk, Robert is picking up Phoebe for a date.]\nRobert: Hey.\nPhoebe: Hey. Ooh! Dont sit down! \nRobert: You ready to go to the batting cage?\nPhoebe: Yeah. And, first heres a gift.\nRobert: Oh! Wow! Hey!\nChandler: Stretchy pants! Why, those are the greatest things in the world! If I were you I would wear them every day, every day!\nRobert: Jeez, thank you really that is so nice. But um, to be honest, I dont think I can wear these, theyre so tight, I feel like Im on display. Im sorry.\nPhoebe: Thats all right, thats well, I figured.... (they start to leave as Joey enters.)\nRobert: (to Joey) Hey!\nJoey: Hey! (starts to laugh.) Hows it going?\nRoss: Good.\nJoey: Hey, Rach, how you doing with The Shining?\nRachel: Oh, Danny just went into room 217.\nJoey: Oooh, the next parts the best, when that dead lady in the bathtub...\nRachel: Oh, no, meh-nah-nah-nah, come on youre gonna ruin it!\nJoey: All right Ill talk in code. (to Ross and Chandler) Remember when the kid sees those two blanks in the hallway?\nChandler: Hmmm, thats very cool.\nJoey: Oh, all blank, and no blank, makes blank a blank blank. Oh no-no-no, no, the end when Jack almost kills them all with that blank, but then at last second they get away. Aww!\nRachel: Joey! I cant believe you just did that!\nChandler: I cant believe she cracked your code!\nRachel: All right, okay, Laurie proposes to Jo, and she says no, even though shes still in love with him, and then he ends up marring Amy.\nJoey: Hey! Mine was by accident! All right, the boiler explodes and destroys the hotel, and kills the dad.\nRachel: Eh. Beth dies.\n(Joey recoils and gasps in horror.)\nJoey: Beth, Beth dies?\nRachel: Um-hmm.\nJoey: Is that true? If I keep reading is Beth gonna die?\nChandler: No, Beth doesnt die, she doesnt die. Does she Rachel?\nRachel: What?!\nRoss: Joeys asking if youve just ruined the first book hes ever loved that didnt star Jack Nicholson?\nRachel: No. She doesnt die.\nJoey: Then why would you say that?!\nRachel: Because, I wanted to hurt you.\nRobert: (running in) Oh, there they are! I-I dropped my keys.\n(He bends over to pick them up, right in front of Rachel, who then gets a free peep show.)\nRachel: (gasps) Oh my....\nRobert: Got em.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 10, "scene_id": "S03E13_010", "location": "Central Perk", "scene_description": "Robert is picking up Phoebe for a date.", "characters": ["Chandler", "Joey", "Phoebe", "Rachel", "Robert", "Ross"], "firestore_path": "/episodes/S03E13/scenes/S03E13_010"}}
{"id": "S03E13_011", "text": "[Scene: Monica and Rachel's, Rachel is reading The Shining, as Monica enters.]\nMonica: Hi.\nRachel: (screams and grabs a potato masher to defend herself) Sorry. Im sorry.\nMonica: You would not believe my day! I had to work two shifts, and then to top it off, I lost one of my fake boobs, (opens her coat revealing a large burn mark over her left breast.) in a grill fire.\n(Rachel starts laughing.)\nMonica: What are you smiling at?\nRachel: Im sorry, I was just thinking youre day could still pick up.\nMonica: Yeah, right.\n(She goes into her bedroom, and sees Richard who has covered the room in roses and has two glasses of wine and a rose between his lips.)\nRichard: Hello.\nMonica: I love this friend thing!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 11, "scene_id": "S03E13_011", "location": "Monica and Rachel's", "scene_description": "Rachel is reading The Shining, as Monica enters.", "characters": ["Monica", "Rachel", "Richard"], "firestore_path": "/episodes/S03E13/scenes/S03E13_011"}}
{"id": "S03E13_012", "text": "[Scene: Central Perk, Phoebe, Chandler, and Ross are there.]\nPhoebe: Listen, Roberts gonna be here any second so, will one of you just tell him?\nRoss: Oh.\nPhoebe: Please, right now, no, every time I see him its like Is it on the lose? Is it watching me?\nChandler: We cant tell him, you cant go up to a guy you barely know and talk about his.... stuff.\nRoss: Hes right, even if its to say something complementary. (He stops and thinks about what he just said.)\nRobert: (entering) Hey! \nPhoebe: Hey.\nRobert: (to Phoebe) So are ready for the gym? Theyve got this new rock climbing wall, we can spot each other.\nPhoebe: No, I can spot you from here.\nRobert: What?\nPhoebe: Okay, listen Robert...\nRoss: (to Chandler) Hey, dont we have to...\nChandler: Yeah, we got, um-hmm.\nPhoebe: Umm, I think youre really, really great...\nRobert: Oh God! Here we go again. Why does this keep happening to me? (spreads his legs) Is it something Im putting out there? Is this my fault? Or am I just nuts?\nPhoebe: I-I-I-I-I dont know, I dont know what to say.\nGunther: (cleaning up the table) (to Robert) Hey buddy, this is a family place, put the mouse back in the house.\n(Robert looks down and realises the problem.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 12, "scene_id": "S03E13_012", "location": "Central Perk", "scene_description": "Phoebe, Chandler, and Ross are there.", "characters": ["Chandler", "Gunther", "Phoebe", "Robert", "Ross"], "firestore_path": "/episodes/S03E13/scenes/S03E13_012"}}
{"id": "S03E13_013", "text": "[Scene: Richards bedroom, Monica has covered it in rose pedals and candles. We hear Richard come in to the apartment, and Monica frantically throws the rest of the pedals on the bed, and jumps onto the bed and puts a rose in her mouth, and bites a thorn.]\nMonica: Ow!\nRichard: (outside the bedroom) Really?! Well, its just like everyone elses apartment. Its got rooms, walls, and ceilings.\nRichards Date: Well, I just wanted to see where you lived. Now, give me the tour.\nMonica: Oh my God! Oh my God! (She frantically tries to clean up the bedroom as Richard starts the tour.)\nRichard: Ah well, this is the living room.\nRichards Date: Impressive.\nRichard: All right. This is the kitchen.\nRichards Date: Oh, thats real pretty. Wait a minute, dont I get to see the bedroom?\nRichard: The bedroom. Well its pretty much your typical... (opens the door as Monica hides under the covers, and quickly closes the door before his date can see the room.) bedroom.\nRichards Date: Were still on this side of the door.\nRichard: Um-hmm.\nRichards Date: Yeah, but I didnt get to see it.\nRichard: Oh shoot! Maybe next time. (yawns) Thanks for a lovely evening. (shows her out)\n[Cut to into the bedroom, with Monica still hiding under the covers. Richard enters and sits down next to her.]\nMonica: (still hiding under the blankets) So um, who was she?\nRichard: Oh, (laughs) that was the blind date that I told you about, she called and switched it to today.\nMonica: (still hiding under the blankets) Did you like her? And Im just asking as a friend, because I am totally fine with this.\nRichard: Well, you seem fine.\nMonica: (gets up) Okay, y'know what, Im not fine, Im not. I mean how can I be fine, hearing you come in with her, she wants to see your bedroom.... (pause) Y'know what, what if were friends who dont see other people?\nRichard: You mean like exclusive friends?\nMonica: Why not?! I mean this has been the most amazing week. Would it be so terrible? Even if we were friends who lived together. Or, maybe someday friends who stood up in front of their other friends, and vowed to be friends forever.\nRichard: Wow. Y'know were back where we were. Honey, I would love to do all that, but nothings changed.\nMonica: Thats not true, you dont have a moustache.\nRichard: Okay, okay, one things changed. But we still want different things and we know how this is gonna end.\nMonica: Y'know what, Ive got to walk out of here right now, cause getting over you is the hardest thing that I have ever had to do. I dont think I could do it again.\nRichard: I know I couldnt. So....\n(Monica kisses him.)\nMonica: How bout one last game of racquetball?\n(They both kiss, and Richard picks her up and goes over to the bed and starts to lie down.)\nMonica: Watch the thorns!\nRichard: (lying down) Ow!!\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 13, "scene_id": "S03E13_013", "location": "Richards bedroom", "scene_description": "Monica has covered it in rose pedals and candles. We hear Richard come in to the apartment, and Monica frantically throws the rest of the pedals on the bed, and jumps onto the bed and puts a rose in her mouth, and bites a thorn.", "characters": ["Monica", "Richard", "Richards Date"], "firestore_path": "/episodes/S03E13/scenes/S03E13_013"}}
{"id": "S03E13_014", "text": "[Scene: Monica and Rachel's, Joey is entering, and hes very dejected.]\nRachel: What?\nJoey: Beth is really, really sick.\nRachel: Awwww.\nJoey: Jos there, but I dont think theres anything she could do.\n(Rachel hugs him)\nRachel: Joey?\nJoey: Yeah.\nRachel: Do you want to put the book in the freezer?\nJoey: (nodding his head) Okay.\nRachel: Okay.\n(Joey hands her the book and she puts it in the freezer.)\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 13, "episode_id": "S03E13", "episode_title": "THE ONE WHERE MONICA AND RICHARD ARE FRIENDS", "scene_number": 14, "scene_id": "S03E13_014", "location": "Monica and Rachel's", "scene_description": "Joey is entering, and hes very dejected.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S03E13/scenes/S03E13_014"}}
