{"id": "S03E15_001", "text": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK\nWritten by: Michael Borkow Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 1, "scene_id": "S03E15_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E15/scenes/S03E15_001"}}
{"id": "S03E15_002", "text": "[Scene: Monica and Rachel's, Joey is taking a jar of olives out of the fridge.]\nJoey: (to Monica) Hey, how much will you give me to eat this whole jar of olives?\nMonica: I wont give you anything, but youll owe me 2.95.\nJoey: Done.\nPhoebe: (entering) Hey. I need an atlas! I need an atlas!\nMonica: Why? (in a motherlike tone) Do you have a report due?\nPhoebe: I have a date with this diplomat I met while I was giving free massages outside the UN and, I dont know where his country is.\nMonica: Okay, lets start with the free messages outside the UN.\nPhoebe: Oh!! Thats my new thing. I figure bodies at peace, make peace.\nMonica: Wow! You might just get the first Nobel prize in rubbing. So what country is this guy from?\nPhoebe: Ick-neck-tree-anis..... Theres a g in there.\nMonica: Wheres that?\nPhoebe: In your atlas!\nMonica: I dont have an atlas.\nPhoebe: Oh.\nMonica: Oh, but wait I do have a globe.\nPhoebe: Oh.\nMonica: Hold on.\nJoey: So Pheebs whats this guy like?\nPhoebe: Umm, well hes very dashing, y'know, and umm, very, very sophisticated, and he doesnt speak any English, but according to his translator, he totally gets me.\nMonica: Kay, here you go. (Hands her this tiny little globe.)\nPhoebe: What is this?\nMonica: Its a globe and, a pencil sharpener.\n(Phoebe puts the globe right up next to her eye to try and find the country.)\nChandler: (entering) Hey, does anybody need anything copied? Im going down to the Xerox place.\nMonica: Oh, no thanks.\nChandler: Okay listen, just give me anything I can make two of.\nMonica: Well, if you dont have anything to copy, why are you going down there?\nJoey: Yeah, are you just going down there to gawk at that hot girl with the belly button ring again?\nChandler: Yeah! You wanna come?\nJoey: Yeah!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 2, "scene_id": "S03E15_002", "location": "Monica and Rachel's", "scene_description": "Joey is taking a jar of olives out of the fridge.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E15/scenes/S03E15_002"}}
{"id": "S03E15_003", "text": "[Scene: The Xerox place, Chandler and Joey are waiting in line.]\nChandler: Come on Chloe! Finish up with your customer first. Come on Chloe! Come on Chloe!!\nIssac: (to Chandler and Joey) Can I help you?\nChandler: Uh-oh.\nJoey: Uh, y'know what, were having second thoughts about our copying needs. And well need a little more time to think about it.\nIssac: Chloe, switch with me, theres some guys here that got a crush on you.\nChandler: (to Joey) Okay, that hurt us.\nChloe: Hi guys. I havent seen you since this morning.\nChandler: Well ah, ........y'know.\nChloe: Hey, what are you guys doing tomorrow night?\nJoey: Both of us? (points to Chandler and himself)\nChloe: Maybe. Does that scare ya?\n(They both start laughing. They look at each other, stop and step apart a little bit.)\nChloe: Relax. Its just Issacs D.J.-ing at the Philly. You should come.\nJoey: Well be there.\nChloe: Great. Ill ah, see ya then.\nChandler: All right, rock on. (Does the Hang 10 sign, then hides his face in shame.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 3, "scene_id": "S03E15_003", "location": "The Xerox place", "scene_description": "Chandler and Joey are waiting in line.", "characters": ["Chandler", "Chloe", "Issac", "Joey"], "firestore_path": "/episodes/S03E15/scenes/S03E15_003"}}
{"id": "S03E15_004", "text": "[Scene: A Street, Phoebe is walking along with the diplomat (Sergei) and his translator (Mischa).]\nSergei: (something in Russian or Polish)\nMischa: Hes says, Walking with you makes this strange city, feel like home.\nPhoebe: Me too. Although this city is my home, so. So thats dumb what I said, dont tell him I said that. Umm, you make something up. (Mischa does so and Sergei kisses her hand.) Nice, (to Mischa) thank you. This is me. Here.\n(Sergei goes up to her at her door and says something.)\nMischa: (leaning in) Your eyes are very pretty.\nPhoebe: (to Mischa) Thank you, very much! Oh! (to Sergei) Thank you!\n(Sergei says something and leans in to kiss her, but just as hes about to....)\nMischa: (leaning in) He would like to kiss you.\nPhoebe: (to Mischa) Okay, y'know what, you dont have to do that now. (Mischa translates that to Sergei) No-no-no-no!! Not him, you dont! (Mischa tells Sergei he can proceed and steps away) Well the moments over.\n(Sergei says something and kisses her.)\nPhoebe: Oh.\nMischa: Oy!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 4, "scene_id": "S03E15_004", "location": "A Street", "scene_description": "Phoebe is walking along with the diplomat (Sergei) and his translator (Mischa).", "characters": ["Mischa", "Phoebe", "Sergei"], "firestore_path": "/episodes/S03E15/scenes/S03E15_004"}}
{"id": "S03E15_005", "text": "[Scene: Monica and Rachel's, Phoebe is showing Monica where Sergeis country is.]\nPhoebe: (pointing to the globe) See there it is right there.\nMonica: Wow! Its small.\nPhoebe: Yeah. But Sergei said it took the Germans six weeks to get all the way across it.\nMonica: So you had fun, huh?\nPhoebe: Yeah. Except for, y'know when youre on a date and youre getting along really great but the guys translator keeps getting in the way.\nMonica: No.\nRoss: (entering) Hey.\nPhoebe and Monica: Hey.\nRoss: What is ah, Rach in her room?\nMonica: Oh no, shes still at work, but she told me to tell you to call her.\nRoss: Oh what?! Is she gonna cancel on me again?! How can she do this? Doesnt she know its our anniversary?\nMonica: All right ah, Ross, this is the extent of my knowledge on the subject. (holds up a notepad) Call Rachel.\nRoss: Whats that on the bottom?\nMonica: Oh thats my doodle of a ladybug, with a top hat. (to Phoebe) Shes fancy.\n(Ross calls Rachel)\nRachel: (answering her phone at work) Hello.\nRoss: Hey, honey.\nRachel: Oh, hi.\nRoss: Hey, whats going on?\nRachel: Well, there was a disaster in shipping and Ive got to get this order in. Honey, Im so sorry, but it looks like Im gonna be here all night.\nRoss: What, do you, well umm, oh how about I come up there?\nRachel: No-no-no, no, honey please, Ive got, Ive just have so much to deal with.\n[Cut to kitchen.]\nPhoebe: (to Monica) Anyway, Im going out with Sergei again tonight, and um, could you come and be the translators date? So that when we, its time for our alone time, you two could split off. Y'know, hes really, hes kinda cute.\nMonica: Yeah, well kinda cute, like really kinda cute, or kinda cute like your friend Spackel Back Larry?\nPhoebe: Hey, dont call him that! His name is Spackel Back Harry!", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 5, "scene_id": "S03E15_005", "location": "Monica and Rachel's", "scene_description": "Phoebe is showing Monica where Sergeis country is.", "characters": ["Monica", "Phoebe", "Phoebe and Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_005"}}
{"id": "S03E15_006", "text": "[Scene: Central Perk, Chandler and Joey are sitting on the big couch.]\nChandler: Hey, y'know what, maybe we should get going. I mean what time did Chloe say we should be there?\nJoey: Uh, 10:30.\nChandler: What time is it now?\nJoey: 4:30.\nChandler: Yeah all right, so well hang out.\nJoey: Yeah. Hey, remember when she brought up that thing about the three of us?\nChandler: Yes. Vividly.\nJoey: She was kidding about that right?\nChandler: Yeah, I-I-I think so. (Pauses and thinks about it for a second) Yeah, I-I think so...\nJoey: God, that would be weird it that situation presented itself tonight, huh?\nChandler: Yeah. Yeah, I mean what, what would we do?\nJoey: Dude, I dont know.\nChandler: She was kidding.\nJoey: Yeah.\nChandler: She was.... But y'know what, just in case, maybe we should come up with a set of ground rules.\nJoey: Yeah, for sure. Okay. Probably want the first thing to be, never open your eyes. Y'know, because you dont want to be doing something and then look up and see something you dont want to be seeing.\nChandler: Yeah. Good call, nice one. Hold it!! Hold it! What if me eyes are closed, and, and my hand is out there.... (holds his arm out and pretends to grab something with his hand.)\nJoey: Ah!! Okay! Eyes open at all times! Oh, hey, how do we decide where we... (clears throat) y'know each would, (clears throat again) y'know (pause) be?\nChandler: Right. Right. Well ah, y'know we could flip for it.\nJoey: Yeah, I guess, but whats like heads and whats tails?\nChandler: Well it you dont know that, then I dont want to do this with you.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 6, "scene_id": "S03E15_006", "location": "Central Perk", "scene_description": "Chandler and Joey are sitting on the big couch.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E15/scenes/S03E15_006"}}
{"id": "S03E15_007", "text": "[Scene: Rachels office, Rachel and a co-worker (Sophie) are dealing with the crisis.]\nRachel: (on the phone) No, no, no, Im looking at a purchase order right here and it clearly states that we ordered the Rivera bikini in a variety of sizes and colours. And.... (listens) What does it matter, what Im wearing?! Can I please speak to your supervisor? (listens) Thank you. (to Sophie) Were holding.\nRoss: (entering, carrying a basket) Hi!\nRachel: (startled) Oh!! My God, what are you doing here?\nRoss: Well you said you couldnt go out so.... (pulls the cover off of the basket)\nSophie: You brought a picnic, oh, what a boyfriend. Thats it, on Monday I start wearing make-up.\nRachel: Ross honey, this is very nice, but, but I-I got a crisis.\nRoss: Yeah, but I got cous-cous!\nRachel: Honey, honey, Im sorry, I know its our anniversary but I told you on the phone I dont have time to stop.\nRoss: Okay, you dont have to stop, Im invisible, Im not here. (lights a candle)\nRachel: But I dont, hmm... (on phone) Oh, who approved that order?! (listens) Well there is no Mark Robbinson in this office. (to Sophie) Get me Mark on the phone!\nSophie: I love Mark. (to Ross) Do you know Mark?\nRoss: Yeah!!\nRachel: Well, let me just check that with what I got here, all right see 038 is not the number for (Ross starts making a lot of noise with a handheld pepper grinder) this store, 038 is Atlanta. And I...(stops and looks at Ross)\nRoss: (stopping grinding) Pepper?\nRachel: (angrily) None for me.\nRoss: Okay sorry, whew.\nRachel: Im sorry, as I was saying the store number is wrong, and Im sorry but thats... (notices a fire that Rosss candle has started) Oh my God!! \nRoss: (putting out the fire with a squeeze bottle of water) Okay, thats a fire. Oh yeah. Oh yeah.\nRachel: (on phone) Excuse me, Im sorry, Im gonna have to call you back, Ive got a Schemp in my office. (hangs up) (to Ross) What are you doing?\nRoss: Im sorry. But ah, hey, oh, somebodys off the phone, how bout a glass of wine by the fire, I could get it going again.\nRachel: Ross youre not listening to me, I dont have time to stop.\nRoss: Come on Rach, you dont have what, ten minutes?\nRachel: I dont have ten minutes!!\nRoss: What? (to Sophie) Sophie, does she have ten minutes?\nRachel: Hey, Ross!!! I told you I dont!\nRoss: Dont yell at me okay, this is the most Ive seen you all week.\nRachel: Look, I cannot do this right now, okay, Ive got a deadline, would you just go home, Ill talk to you later. (storms out) \nRoss: Yeah, but wait...\nRachel: Good bye!\n(Ross starts to pack up the picnic in anger, and throws a three hole punch in the basket.)\nSophie: Actually, thats our three hole punch.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 7, "scene_id": "S03E15_007", "location": "Rachels office", "scene_description": "Rachel and a co-worker (Sophie) are dealing with the crisis.", "characters": ["Rachel", "Ross", "Sophie"], "firestore_path": "/episodes/S03E15/scenes/S03E15_007"}}
{"id": "S03E15_008", "text": "[Scene: Monica and Rachel's, Ross is eating the picnic as Rachel comes home from work.]\nRoss: Hey.\nRachel: Hi. Look um, about what happened earlier...\nRoss: No, hey, well, I-I completely understand. You were, you were stressed.\nRachel: (throws her stuff down) I was gonna give you a chance to apologise to me.\nRoss: For what? For letting you throw me out of your office?\nRachel: You had no right coming down to my office Ross. You do not bring a picnic basket to somebodys work! Unless maybe they were a park ranger!\nRoss: Yeah, well excuse me for wanting to be with my girlfriend on our anniversary, boy what an ass am I. \nRachel: But I told you, I didnt have the time!\nRoss: Yeah, well you never have the time. I mean, I dont feel like I even have a girlfriend anymore, Rachel.\nRachel: Wh, Ross what do you want from me? You want me, you want me to quit my job so you can feel like you have a girlfriend?\nRoss: No, but itd be nice if you realised, its just a job!\nRachel: Just a job!\nRoss: Yes.\nRachel: Ross do you realise this is the first time in my life Im doing something I actually care about. This is the first time in my life Im doing something that Im actually good at. I mean. if you dont get that...\nRoss: No, hey, I get that, okay, I get that big time. And Im happy for ya, but Im tired of having a relationship with your answering machine! Okay, I dont know what to do anymore.\nRachel: Well neither do I!\nRoss: Is this about Mark?\nRachel: (shocked) Oh my God.\nRoss: Okay, its not, its not.\nRachel: Oh my God. I cannot keep having this same fight over and over again, Ross, no, youre, youre, youre making this too hard.\nRoss: Oh Im, Im making this too hard. Okay, what do you want me to do.\nRachel: I dont know, I dont know. Urrrgh! Look, maybe we should take a break.\nRoss: Okay, okay, fine, youre right. Lets ah, lets take a break, (goes to the door) lets cool off, okay, lets get some frozen yogart, or something.. (opens the door)\nRachel: No. (Ross is standing in the doorway.) A break from us.\n(Ross looks at her, then leaves slamming the door behind him.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 8, "scene_id": "S03E15_008", "location": "Monica and Rachel's", "scene_description": "Ross is eating the picnic as Rachel comes home from work.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_008"}}
{"id": "S03E15_009", "text": "[Scene: The Philly, Chandler and Joey are talking to Chloe.]\nChloe: And the advances in collating in the past five years, I mean we just got in an X-5000, y'know. The X-5000 makes the X-50 look like a T-71. \n(Chandler agrees in an absolutely bored way.) \nChloe: (seeing Ross enter) Hey, its the dinosaur guy. (runs over to Ross) Hi, Ross.\nRoss: Oh, hi Chloe.\nChloe: I want you to met some friends of mine. (Introduces him to Chandler and Joey) This guy is my hero, he comes in with some stuff he wants it blown up 400%, we said we dont do that, and he says you gotta. And y'know what, we did it. And now anytime anybody wants 400, we just say lets Ross it!\nChandler: And thats the only colour that comes in.\nIssac: Yo, Chloe, do you have a quarter for the condom machine?\nChloe: Oh! (storms off)\nChandler: So, what are you doing here? I thought tonight was your big anniversary dinner.\nRoss: Yeah, little change in plans. Ahh, were gonna break-up instead.\n(Chandler and Joey stare at each other in shock.)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 9, "scene_id": "S03E15_009", "location": "The Philly", "scene_description": "Chandler and Joey are talking to Chloe.", "characters": ["Chandler", "Chloe", "Issac", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_009"}}
{"id": "S03E15_010", "text": "[Scene: A Restaurant, Monica and Phoebe are on their dates with Sergei and Mischa.]\nMonica: Oh, and I can also speak a little French. Voulez-vous coucher avec moi ce soir? (Mischa laughs) Why? What did I say?\nMischa: Well, you just asked if I wanted to go to bed with you tonight.\nMonica: Oh my God! No wonder I get such great service at Cafe Maurice.\nPhoebe: (laughing and banging her spoon on the table) Knock, knock, knock, knock, hi. Um, could you please tell Sergei that um, I was fascinated by what Boutros Boutros Gali said in the New York Times.\n(Mischa does so.)\nPhoebe: You didnt say Boutros Boutros Gali.\nMischa: (to Sergei) Boutros Boutros Gali.\n(Sergei responds.)\nMischa: He says he was too.\nPhoebe: Interesting.\nMischa: (to Monica) So I was wondering....\nPhoebe: Okay, ah, before you get all talky again, umm, could you also please tell Sergei that I really like his suit.\n(Mischa does so, and Sergei complements Phoebe, and says it slowly)\nMischa: (to Phoebe, very quickly) Eh, he said, thank you very much, he thinks you look very pretty tonight, your hair, golden like the sun. (to Monica) So you're a chef?\nMonica: Im also thinking about opening up my own restaurant.\nMischa: Oh, really.\nPhoebe: Monica, can I talk to you behind my menu, please. (Behind the menu) What are you doing?\nMonica: Well, I was having a conversation.\nPhoebe: Yeah but, Mischa is so interested in you, that Sergei and I havent been able to say two words to each other.\nMonica: What do you want me to do? Just sit here silently while you three have a conversation?\nPhoebe: That would be great. Thank you.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 10, "scene_id": "S03E15_010", "location": "A Restaurant", "scene_description": "Monica and Phoebe are on their dates with Sergei and Mischa.", "characters": ["Mischa", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E15/scenes/S03E15_010"}}
{"id": "S03E15_011", "text": "[Scene: Monica and Rachel's, Rachel is lying in front of the bay window, and the phone rings.]\nRachel: (jumping up to answer the phone) Hello!\nMark: Oh, hi. Its Mark.\nRachel: (disappointed) Oh.\nMark: What? Is it my breath?\nRachel: No! Sorry, I just thought you were somebody else. Hi!\nMark: Hi. Well, look, I was just gonna leave a message, isnt tonight your, your big anniversary dinner?\nRachel: Yeah. Well, umm.....\nMark: Rach, are you okay?\nRachel: (on the verge of tears) Yeah, Im fine.\nMark: You wanna talk, I mean I can come over?\nRachel: No! Really, no, please, please, thats, thats okay.\nMark: All right, all right, Im coming over, and Im bringing Chinese food.\nRachel: Oh, yeah, Im not, Im not hungry.\nMark: Its for me.\nRachel: Oh. Okay, bye.\n[Scene: The Philly.]\nJoey: So what are you gonna do?\nRoss: What can I do? One person wants to break-up, you break-up.\nChandler: Hey, no way! Come on, this is you guys, call her and work it out.\nRoss: Oh come on, we just had this huge fight, all right, dont I have to wait a while?\nChandler: Hey, this isnt like swimming after you eat, pick up the phone!!\n(Ross goes to call her.)\nChandler: Y'know that whole swimming thing is a myth.\nJoey: Yeah, tell that to my Uncle Lenny.\nChandler: Why? What happened to him?\nJoey: Nothing, hes just really believes in that.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 11, "scene_id": "S03E15_011", "location": "Monica and Rachel's", "scene_description": "Rachel is lying in front of the bay window, and the phone rings.", "characters": ["Chandler", "Joey", "Mark", "Rachel", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_011"}}
{"id": "S03E15_012", "text": "[Scene: Monica and Rachel's, Mark is there, opening Chinese food boxes.]\nRachel: Oh, and then, we got into this big, stupid fight. I just, it was awful. I told him he treats me like a park ranger, or something, oh and then I told him I wanted to take a break, I dont want to take a break.\nMark: Wow. Im sorry. Eggroll?\nRachel: No. (grabs an eggroll) And then I called him, and he wasnt there.\nMark: Well, then hes, hes probably just, out.\nRachel: Oh, thank you thats very helpful, Im glad you came over.\n(The phone rings and Rachel answers it.)\nRachel: Hello.\nRoss: Hi! Its me.\nRachel: Hi! Oh, Im so glad you called.\nRoss: Really? Ive been thinking, this is crazy, I mean dont, dont you think we can work on this? \nMark: Hey, what do you want to drink?\nRoss: Whos that?\nRachel: Nobody.\nMark: Is it okay if I finish the apple juice?\n(Rachel mouths Shoot! or something similar.)\nRoss: Is that Mark?\nRachel: Umm, honey, look he just came over to....\n[Cut to The Philly.]\nRoss: Yeah! Got it! (slams the phone down, and walks back to the bar.)\nChloe: Hey, dinosaur guy, look at you, so sad. Come dance.\nRoss: Ah, thats okay, thanks.\nChloe: Hey, you dont have to smile. You just have to dance.\nRoss: Look, I dont feel like dancing, I feel like having a drink. Okay?\nChloe: Oh, okay. (to the bartender) Hey, two beers. (sits down next to him)", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 12, "scene_id": "S03E15_012", "location": "Monica and Rachel's", "scene_description": "Mark is there, opening Chinese food boxes.", "characters": ["Chloe", "Mark", "Rachel", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_012"}}
{"id": "S03E15_013", "text": "[Scene: The Restaurant, after dinner.]\nMischa: (to Monica) And the vet said it was time. And so from half a world away, while my Mother held the phone to his ear, I said good bye to my dog,. In seven languages.\nMonica: Oh. (to Phoebe) Can I have a tissue?\nPhoebe: Oh, yeah, sure. I just hope you, hope you dont accidentally suck it up through your nose and choke on it.\n(Sergei says something to Mischa.)\nMischa: (to Phoebe) Sergei, would like to apologise for my behaviour tonight.\nPhoebe: Well, tell him, apology accepted.\n(Mischa does so.)\nMischa: (to Monica) Oh, hes unbelievable. I mean for the first time in three years somebody wants to actually want to talk to me, but do you think he would let me enjoy that, no!! (to Sergei) You silly diplomat, why dont you learn some English, Sergei?\nPhoebe: Excuse me, but umm, isnt he paying for your dinner?\nMonica: Hey, the mans dog just died.\n(Sergei insults Mischa, and they get into a huge fight, in Russian.)\nMischa: (to Monica) I have just resigned my post. Would you care to accompany me to the Rainbow Room? I have diplomatic coupons.\nMonica: It will be my pleasure. (to Phoebe) My guy has diplomatic coupons. Your guy cant even say coupons. (they leave)\nSergei: Uh, (picks up a plate) plate?\nPhoebe: Plate! Yes, plate.\nSergei: Plate. Plate. Plate.\nPhoebe: See, we dont need them.\nSergei: (picking up a cup) Plate?\nPhoebe: Yeah.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 13, "scene_id": "S03E15_013", "location": "The Restaurant", "scene_description": "after dinner.", "characters": ["Mischa", "Monica", "Phoebe", "Sergei"], "firestore_path": "/episodes/S03E15/scenes/S03E15_013"}}
{"id": "S03E15_014", "text": "[Scene: The Philly, With or Without You is playing. (Which is the same song Ross played for Rachel in TOW the List.)]\nRoss: (to Chloe) I like this song.\nChloe: Well, youre practically dancing already. Why dont you just do it over here?\nRoss: Oh, no, no.\nChloe: What? Are you married? Cause thats okay.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 14, "scene_id": "S03E15_014", "location": "The Philly", "scene_description": "With or Without You is playing. (Which is the same song Ross played for Rachel in TOW the List.)", "characters": ["Chloe", "Ross"], "firestore_path": "/episodes/S03E15/scenes/S03E15_014"}}
{"id": "S03E15_015", "text": "[Scene: Monica and Rachel's, Rachel is next to the bay window again, Mark has left.]\nRachel: (picks up the phone and calls Ross) Oh, be home, be home, be home, be home, be home, be home. Be home. Be home, be home, be home. Oh, youre not home.", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 15, "scene_id": "S03E15_015", "location": "Monica and Rachel's", "scene_description": "Rachel is next to the bay window again, Mark has left.", "characters": ["Rachel"], "firestore_path": "/episodes/S03E15/scenes/S03E15_015"}}
{"id": "S03E15_016", "text": "[Scene: The Philly, Ross is dancing with Chloe.]\nChloe: Still no smile?\n(She kisses him. Ross leans back for a second, and then they both kiss, more passionately this time as U2's With or Without You plays in the background.)\nTo Be Continued......\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 16, "scene_id": "S03E15_016", "location": "The Philly", "scene_description": "Ross is dancing with Chloe.", "characters": ["Chloe"], "firestore_path": "/episodes/S03E15/scenes/S03E15_016"}}
{"id": "S03E15_017", "text": "[Scene: Central Perk, Sergei is teaching Phoebe how to sing American Pie, by Don Maclean.]\n(Both Phoebe and him are singing along and they get to the chorus.)\nSergei: (singing) Touchet, touchet, Miss Americccan pie. (stops to correct Phoebe) Ameri-ccan.\nPhoebe: Ameri-can.\nSergei: Ameri-ccan.\nPhoebe: Ameri-can. Y'know its a very hard language. Lets do it again.\n(They start singing, and Phoebe covers her mouth at the American part.)\nSergei: (to the rest of Central Perk) Everybody!! (In his language, and continues.)\nEnd", "metadata": {"chunk_type": "scene", "season": 3, "episode_number": 15, "episode_id": "S03E15", "episode_title": "THE ONE WHERE ROSS AND RACHEL TAKE A BREAK", "scene_number": 17, "scene_id": "S03E15_017", "location": "Central Perk", "scene_description": "Sergei is teaching Phoebe how to sing American Pie, by Don Maclean.", "characters": ["Phoebe", "Sergei"], "firestore_path": "/episodes/S03E15/scenes/S03E15_017"}}
