{"id": "S04E02_001", "text": "THE ONE WITH THE CAT\nWritten by: Jill Condon & Any Toomin Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 1, "scene_id": "S04E02_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E02/scenes/S04E02_001"}}
{"id": "S04E02_002", "text": "[Scene: Chandler and Joey's, Joey is eating breakfast as Chandler comes out of his bedroom, ripping his coat in the process.]\nChandler: Wow! That ripped! That ripped real nice!\nJoey: How many times do I have to tell you! Ya, turn and sliiiide! Y'know, turn and slide.\nChandler: You dont turn and slide, you throw it out! Im tired of having to get a tetanus shot every time I get dressed!\nJoey: Look, were not throwing it out! I built this thing with my own hands!\nChandler: All right, how about we, how bout we sell it.\nJoey: All right. But, youre gonna have to tell them. (He opens the cabinet to reveal the chick and the duck living inside with Christmas lights and a disco ball as decorations.)\nChandler: (nods his head) Do you mind if we stick you in another cabinet? (to Joey) They seem all right with it!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 2, "scene_id": "S04E02_002", "location": "Chandler and Joey's", "scene_description": "Joey is eating breakfast as Chandler comes out of his bedroom, ripping his coat in the process.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E02/scenes/S04E02_002"}}
{"id": "S04E02_003", "text": "[Scene: Monica and Rachel's, Monica and Ross are there. Monica is checking the messages.]\nChip: (on machine) Hey Monica, its Chip.\nMonica: Yesss!!\nRoss: Whos Chip?\nMonica: Shhh!\nChip: (on machine) Good runnin into you at the bank today, so ah, heres my number, 555-9323. Give me a call. Later.\nMonica: Chip, is Chip Matthews.\nRoss: The guy who took Rachel to the prom? Why is he calling you?\nMonica: Cause I ran into him at the bank, he is still soo cute.\nRoss: Monica, youre so lucky! Hes like the most popular guy in school!!\nMonica: I know!! (calls him) (on phone) Chip? Hi! Its Monica. (listens) Kay. (listens) Kay. (listens) Okay. (listens) Okay, good-bye. (hangs up) Oh my God, we just had the best conversation!! (goes into her room as Rachel enters)\nRoss: (to Rachel) I was just leaving.\nRachel: Good! Cause Ive got a product report to read, its like eight pages, I hope I dont fall asleep.\nRoss: Why? Did you write it?\nRachel: (sees Chips phone number) Wow! Look at that, Chip Matthews called. I wonder what he wants?\nRoss: Well ah, actually...\nRachel: (interrupting) I bet he sensed that I was ready to have sex with another guy.\nRoss: Well, umm, why dont you give him a call?\nRachel: Okay. (picks up phone) Are you sure you wanna hear this?\nRoss: Oh, Im sure.\nRachel: (on phone) Chip! Hi, its Rachel. (listens) Rachel Green. Yeah, umm, you left me a message. (listens) Yes you did, my roommate wrote it down. (listens) Monica Geller. (listens) Ohh.\nRoss: (whispering in her ear) Oh, thats right! He called to ask out Monica! That-thats gotta be embarrassing!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 3, "scene_id": "S04E02_003", "location": "Monica and Rachel's", "scene_description": "Monica and Ross are there. Monica is checking the messages.", "characters": ["Chip", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S04E02/scenes/S04E02_003"}}
{"id": "S04E02_004", "text": "[Scene: Central Perk, Phoebe is finishing up a song.]\nPhoebe: (screaming, angrily) ...DUMB, DRUNKEN, BITCH!!! (applause) (happily) Thank you, thanks.\nRoss: (reading the newspaper) Hey, heres a question; where did you guys get the finest oak East of the Mississippi?\nChandler: Uh-huh, first you tell us where you got the prettiest lace in all the land.\nRoss: Im reading your ad.\nJoey: Looks good, uh?\nRoss: Yeah.\nChandler: (reading the ad) Stunning entertainment center. Fine, (pause) fine Italian craftsmanship. (Joey is very proud of himself)\nPhoebe: Oh my God, you guys are selling the entertainment center?\nRachel: Why? I love that thing.\nChandler: You want it?\nPhoebe and Rachel: Oh no.\nChandler: Ahh, Gepeto, $5,000 dollars? Are you insane?\nJoey: Hey, the ad alone cost 300 bucks!\nChandler: All right look, Im changing it to 50 bucks, or your best offer.\nJoey: What kind of profit is that?! And you call yourself an accountant.\nChandler: (looks at him) Nooo.\nJoey: Oh. What do you do?\nChandler: I cant believe you dont know what I do for a living!\nPhoebe: Yeah, I actually dont know...\nRoss: Good, so do I\nRachel: Something to do with numbers?\n[Cut to someone entering Central Perk which lets a cat in. The cat then runs over to Phoebes guitar case and starts sniffing around.]\nPhoebe: Oh my God! No! Shoo! Kitty! No! No-no-no! Shoo! Come on, you! (goes over and picks up the cat) Come on. Crazy. (looks into the cats eyes) Oh my God.\nRachel: What?\nPhoebe: Nothing. Nothing.\nJoey: What? Whats wrong?\nPhoebe: I just, I just have this really strong feeling that this cat is my Mother.\nRachel: You mean the mom you met in Montauk. She was a cat?!\nPhoebe: No, no-no, she was a human lady. This is the spirit of my Mom Lily, the one who killed herself.\nRoss: Are you sure shes in the cat, or have you been taking your grandmas glycoma medicine again?\nPhoebe: No Dr. Skeptismo! Im sure. First of all, okay, theres the feeling. (Chandler shrugs) Okay, and for another, how about the fact that she went into my guitar case which is lined with orange felt. (Rachel nods her head in unsure agreement) My Mothers favourite fish is Orange Roughy... (Joey thinks he understands, but then nods that he has no clue.) Cats....like....fish! (Ross and Rachel are totally lost) (to the cat) Hi, Mommy. (Rachel covers her mouth, in an Oh my God. gesture) Oh, I havent seen this smile in 17 years!\nJoey: (to Chandler) Dude, Phoebes mom has got a huge peni...\nChandler: (interrupting) Let it go!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 4, "scene_id": "S04E02_004", "location": "Central Perk", "scene_description": "Phoebe is finishing up a song.", "characters": ["Chandler", "Joey", "Phoebe", "Phoebe and Rachel", "Rachel", "Ross"], "firestore_path": "/episodes/S04E02/scenes/S04E02_004"}}
{"id": "S04E02_005", "text": "[Scene: Monica and Rachel's, Rachel is working as Monica enters.]\nMonica: Hey!\nRachel: Umm, when were you gonna tell me that youre going out with Chip Matthews?\nMonica: Now? Is it okay if I go out with Chip Matthews?\nRachel: Nooo! Its not okay! I cant believe you would want to after what he did to me!\nMonica: What, that little thing at the prom?\nRachel: Monica! I couldnt find him for two hours! He was having sex with Amy Welch!\nMonica: Come on, that was back in high school! How could that still bother you?\nRachel: I mean why, of all people would you want to go out with Chip?!\nMonica: Look, you and I went to different high schools...\nRachel: Okay, that doesnt help me, because we went to the same high school.\nMonica: You went to one where you were popular, and you got to ride off Chips motorcycle, and wear his letterman jacket. I went to one where I wore a band uniform they had to have specially made.\nRachel: (shocked) They had to have that specially made?!\nMonica: It was a project for one of the Home Ec classes.\nRachel: (stunned) Oh my God, they told us that was for the mascot!\nMonica: Back then, I thought that I would never, ever get the chance to go out with a Chip Matthews, and now hes-hes called me up and asked me out. And the fat girl inside of me really wants to go. I-I owe her this. I never let her eat.\nRachel: Oh, you go out with him. (goes over and hugs her) \nMonica: Oh, really?!\nRachel: Yeah. Just, if its possible, could you leave him somewhere and go have sex with another guy?\nMonica: Ill try.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 5, "scene_id": "S04E02_005", "location": "Monica and Rachel's", "scene_description": "Rachel is working as Monica enters.", "characters": ["Monica", "Rachel"], "firestore_path": "/episodes/S04E02/scenes/S04E02_005"}}
{"id": "S04E02_006", "text": "[Scene: Monica and Rachel's, the next morning, they are all there eating breakfast.]\nRoss: So you guys having any luck getting rid of the entertainment center?\nJoey: Well, there were a couple of calls last night, but ah, I dont think any of them are gonna work out.\nChandler: Yes, Joey has a very careful screening process. Apparently, not everyone is qualified to own wood and nails.\nPhoebe: (is struggling with the cat) Stop it! Stop it! She keeps squirming, trying to get away! Just like when she was alive.\nRoss: So Pheebs, how long is your mom gonna be with us?\nPhoebe: Well, Im not sure. I mean, I guess until she y'know, gets used to the fact that theres y'know, a new mom. Y'know, I think shes worried that y'know, shes gonna, shes gonna be replaced. (to the cat, in a funny voice) Well, thats not gonna happen is it? Noo. (gets up) Okay, I have to return a call in the other room.\nMonica: Why cant you use the phone in here?\nPhoebe: Well, Im returning a call from a certain mom at the B-E-A-C-H. I just spelled the wrong word. (goes into Monicas room)\nRoss: So, guys, am I crazy, or does Phoebes mom remind anyone of a cat?\nMonica: Ross, dont start.\nRoss: Come on, you-you cant tell me you actually believe that-that theres a woman inside that cat!\nRachel: I believe it.\nRoss: No you dont. \nRachel: Yes, I do.\nRoss: No you doy'know what, youre not gonna suck me into this.\nRachel: Oh sure I am, because you always have to be right.\nRoss: I do not always have to beokay, okay. (starts to leave)\nRachel: Jurassic Park could happen.\n(Ross wants to say something, but just smiles and leaves.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 6, "scene_id": "S04E02_006", "location": "Monica and Rachel's", "scene_description": "the next morning, they are all there eating breakfast.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E02/scenes/S04E02_006"}}
{"id": "S04E02_007", "text": "[Scene: Chandler and Joey's, Joey and Chandler are showing a couple of guys (Tony and Peter) the entertainment center.]\nTony: Wow! Thats ah, thats pretty nice!\nJoey: Pretty nice?\nChandler: Youll have to pardon my roommate, he wanted to marry this.\nTony: We dont have 50 bucks, but would you be willing to trade for it? Weve got a canoe.\n(Joey jumps up in excitement and without turning around Chandler holds out his hand stopping him, and ushering him back into his seat. Joey sits down, dejected.)\nChandler: Y'know, I, I really dont think we need a canoe.\nTony: You gotta take the canoe!\nChandler: All right, just, just take the entertainment center, and then when you get home, throw the canoe away!\nPeter: Were not throwing it away! I built that canoe! (starts to leave as Tony chases after him)\nJoey: (to Peter) Good for you!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 7, "scene_id": "S04E02_007", "location": "Chandler and Joey's", "scene_description": "Joey and Chandler are showing a couple of guys (Tony and Peter) the entertainment center.", "characters": ["Chandler", "Joey", "Peter", "Tony"], "firestore_path": "/episodes/S04E02/scenes/S04E02_007"}}
{"id": "S04E02_008", "text": "[Scene: Central Perk, Chandler, Joey, Monica, and Ross are there.]\nRachel: (entering) You guys, youre never gonna believe what I just found tacked up on a telephone pole! (Shes holding a flyer.) Look kinda familiar?\nRoss: (taking the flyer) Apparently Phoebes mother also goes by the name Julio.\nRachel: You guys, theres a little girl in Soho looking for this cat. I mean, you know what that means?!\nJoey: (looking at the flyer) Yeah-eah! 200 dollar reward, split five ways!!\nRachel: Do we have to tell her?\nRoss: Yes, we have to tell her!\nMonica: Oh, but its made her so happy.\nRoss: (holds up a hand) Little girl misses her cat. (hold up the other hand) Crazy lady thinks her mother is in a cat. (gets up) Okay, y'know what, I have to go have dinner with my son, can I trust that when you see Phoebe, you will tell her.\nAll: (disappointed) Yeah.\nRoss: Thank you.\nRachel: I hate when Ross is right!\nMonica: He is right, isnt he?\nChandler: Y'know what, I think this might be one of the times hes wrong.\nAll: You think?\nChandler: Oh-no, hes right.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 8, "scene_id": "S04E02_008", "location": "Central Perk", "scene_description": "Chandler, Joey, Monica, and Ross are there.", "characters": ["All", "Chandler", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S04E02/scenes/S04E02_008"}}
{"id": "S04E02_009", "text": "[Scene: Central Perk, the same scene is continued from before the break. With Joey, Monica, Rachel, and Chandler sitting on the couch.]\nPhoebe: (entering, with Julio) Hi. (sits down in the chair)\nMonica: Hi!\nAll: Hey!\nJoey: Uh, Pheebs, about your mom...\nPhoebe: Yeah?\nJoey: (pause) Hows that going?\nPhoebe: So great. Oh, we took a nap today and my Mom fell asleep on my tummy and purred.\nJoey: Thats so sweet. (pause) Im gonna get some coffee. (gets up and leaves)\nMonica: (sliding into Joeys place on the couch to try and talk to Phoebe) Huh? Whatd ya say Joe? Ill be right there. (gets up and joins Joey)\n(Rachel and Chandler slide into position.)\nRachel: Pheebs...\nPhoebe: I just feel so, uhh.....\nRachel: All right!!\nChandler: Im coming already!!\nRachel: Jeez!\n(They both get up and leave Phoebe alone.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 9, "scene_id": "S04E02_009", "location": "Central Perk", "scene_description": "the same scene is continued from before the break. With Joey, Monica, Rachel, and Chandler sitting on the couch.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E02/scenes/S04E02_009"}}
{"id": "S04E02_010", "text": "[Scene: Monica and Rachel's, Rachel is reading at the kitchen table as there is a knock on the door.]\nMonica: (running from the bathroom to her room, wearing only a towel) Not yet! Not yet! Not yet! Not yet! Not yet! Not yet! Not yet! Not yet! (gets to her room and closes the door, as Rachel gets up to answer the door.)\nRachel: Hello, Chip.\nChip: Hey, Rach! How ya doin?\nRachel: Im great! Im great. Ive got a great job at Bloomingdales, have wonderful friends, and eventhough Im not seeing anyone right now, Ive never felt better about myself.\nChip: So ah, Monica ready yet?\nRachel: Shell be out in a second. So, Chip, hows umm, Amy Welch?\nChip: Amy Welch? Wow! I havent seen her since... So, Monica about ready?", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 10, "scene_id": "S04E02_010", "location": "Monica and Rachel's", "scene_description": "Rachel is reading at the kitchen table as there is a knock on the door.", "characters": ["Chip", "Monica", "Rachel"], "firestore_path": "/episodes/S04E02/scenes/S04E02_010"}}
{"id": "S04E02_011", "text": "[Scene: Chandler and Joey's, Joey is showing off the entertainment center.]\nJoey: This is the unit for you my friend. Sturdy construction, tons of storage compartments, some big enough to fit a grown man.\nGuy: What?!\nJoey: Oh yeah! I got in there myself once. My roommate bet me five bucks that I couldnt, and then he stuck a board through the handles that locked me in. Yeah. It was funny til I started feeling like I was in a coffin.\nGuy: No, you, you cant fit in that thing. Thats not deep enough.\nJoey: Oh yeah? (opens up the center and takes out the stereo) If I cant, Ill knock five bucks off the price off the unit.\nGuy: All right, you have yourself a deal. (shakes his hand)\nJoey: Okay. (he gets in the unit and closes the door) See?! I told ya! \n(The guys takes a hockey stick and slips it through the handles then proceeds to take the stereo and Chandlers computer and walk out.)\nJoey: Sometimes I get in here just to get away from it! Hey, a nickel!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 11, "scene_id": "S04E02_011", "location": "Chandler and Joey's", "scene_description": "Joey is showing off the entertainment center.", "characters": ["Guy", "Joey"], "firestore_path": "/episodes/S04E02/scenes/S04E02_011"}}
{"id": "S04E02_012", "text": "[Scene: A street, Chip is walking Monica to his motorcycle.]\nChip: Here, we are.\nMonica: Oh my God! You still have the Chipper!\nChip: The what?\nMonica: Thats what we used to call your ah, your motorcycle in high school. Y'know how a motorcycle is a Chopper, and youre Chip. Nevermind.\nChip: No, I think its cute. (kisses her)\nMonica: Wow! A lipper from Chipper.\nChip: So you still in touch with anyone from high school?\nMonica: Umm. Well, theres Rachel, and umm, I think thats it. How bout you?\nChip: Oh yeah, I still hang with Simmons and Zana, y'know. I see Spindler a lot. Devane, Kelly, and I run into Goldie from time to time. Steve Brown, Zuchoff, McGwire, J.T., Breadsly.\nMonica: Is that all?\nChip: Ehh, y'know after high school, you just kinda lose touch. Oh yeah! I ran into Richard Dorfman.\nMonica: Ohh, how is he?\nChip: Not so good, Simmons and I gave him a wedgie.\nMonica: Isnt he an architect now?\nChip: Yeah, they still wear underwear.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 12, "scene_id": "S04E02_012", "location": "A street", "scene_description": "Chip is walking Monica to his motorcycle.", "characters": ["Chip", "Monica"], "firestore_path": "/episodes/S04E02/scenes/S04E02_012"}}
{"id": "S04E02_013", "text": "[Scene: Chandler and Joey's, Chandler is coming home. As we walks through the door, and without looking up, he goes to throw his keys on the foosball table, only, its gone and the keys it the floor. He then looks up at an empty apartment; everything is gone except for the entertainment center and that ceramic dog. Even the food in the fridge!]\nChandler: OH MY GOD!!!\nJoey: (still trapped in the entertainment center) WHAT?!! \nChandler: Are you all right?!\nJoey: Yeah...\nChandler: (lets him out) What happened?!!\nJoey: (getting out) Awww, man! He promised he wouldnt take the chairs!!\nChandler: What the hell happened?!! How were you locked in?!! And where the hell is all of our stuff?!!\nJoey: Well, this guy came by to look at the unit and-and he said he didnt think big enough to fit a grown man!\nChandler: SoYou got in voluntarily?!\nJoey: I was tryin to make a sale!! Oh, man, if I ever run into that guy again, do you know what Im gonna do?\nChandler: BEND OVER?!!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 13, "scene_id": "S04E02_013", "location": "Chandler and Joey's", "scene_description": "Chandler is coming home. As we walks through the door, and without looking up, he goes to throw his keys on the foosball table, only, its gone and the keys it the floor. He then looks up at an empty apartment; everything is gone except for the entertainment center and that ceramic dog. Even the food in the fridge!", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E02/scenes/S04E02_013"}}
{"id": "S04E02_014", "text": "[Scene: Dots Spot, Chip and Monica are on there date, eating dinner. Chip is telling a story.]\nChip: ...and then Zana, just let one rip!! (laughs histerically)\nMonica: Look, not that I enjoy talking about people who I went to high school with, cause I do, but umm, maybe we could talk about something else? Like you, I dont even know where you work?\nChip: You know where I work!\nMonica: I do?\nChip: The movie theatre, you used to come in all the time.\nMonica: You still work at the multiplex?\nChip: Oh, like Id give up that job! Free popcorn and candy, anytime I want. I can get you free posters for your room.\nMonica: Thanks, Im set. Do you still live with your parents?\nChip: Oh yeah, but I can stay out as late as I want.\n(Monica takes a big swig of her martini.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 14, "scene_id": "S04E02_014", "location": "Dots Spot", "scene_description": "Chip and Monica are on there date, eating dinner. Chip is telling a story.", "characters": ["Chip", "Monica"], "firestore_path": "/episodes/S04E02/scenes/S04E02_014"}}
{"id": "S04E02_015", "text": "[Scene: Chandler and Joey's, Rachel, Phoebe, and Julio are consoling Joey and Chandler.]\nRachel: Wow! They really got you guys. Your T.V. The chairs.\nPhoebe: Oh yeah, your microwave. The stereo.\nJoey: (looking through a deck of cards) Aww, man, he took the five of spades!! Oh, no-no-no, here it is!\nMonica: (entering) Oh my God! What happened?\nChandler: Oh, umm, Joey was born, and then 28 years later, I was robbed!!\nRachel: (to Monica) So, how was your date?\nMonica: Well, y'know how I always wanted to go out with Chip Matthews in high school?\nRachel: Um-hmm.\nMonica: Well, tonight, I actually went out with Chip Matthews in high school.\nRachel: Oh honey, Im sorry.\nMonica: No, its okay, not only did I get to go out with Chip Matthews, I got to dump Chip Matthews.\nRachel: Ohh! Thats so great!\nMonica: I know!\nRoss: (entering) Hey! So ah, what did the insurance company say?\nChandler: Oh, they said uh, You dont have insurance here, so stop calling us.\nRoss: (seeing Phoebe still with cat) You didnt tell her?! (They all kinda shy away.) Okay, fine! Pheebs?\nPhoebe: Yeah? (sees Ross) Hi!\nRoss: Hi! Listen uhh, this cat belongs to a little girl. There are flyers all over the place.\nRachel: Im sorry, sweetie. (shows her the flyer)\nMonica: Hey, we can take her back with you if you want.\nPhoebe: Ohh. Um-hmm. But y'know, she choose to find me. I mean, I have to respect her decision. Right?\nChandler, Monica, Joey, and Rachel: Thats a good call. Right.\nRoss: No! No! LookHey, enough is enough! Look, I am sorry that you feel guilty or whatever about spending time with your new mom, but this is not your old mom. This is a cat! Okay, Julio the cat! Not mom! Cat!\nPhoebe: (she turns around and puts the cat on the entertainment center) Ross, how many parents have you lost?\nRoss: None.\nPhoebe: Okay, then you dont know what it feels like when one of them comes back. Do you? I believe this is my Mother. Even if Im wrong, who cares? Just be a friend. Okay? Be supportive.\nRoss: Im sorry.\nPhoebe: Okay.\nRoss: I dont know what to say.\nRachel: You could.... say youre sorry to her mom.\nPhoebe: I think she would like that.\nRoss: (goes over to Julio) Come here, here, come here, come here, (pause) Mrs. Buffay. Sorry, about what I said, umm, it was, it was insensitive of me to say that you were just a cat. When clearly you are also the reincarnated spirit, of my friends mother.\nPhoebe: Thank you. We both forgive you.\nRachel: So honey, what are you gonna do about the little girl?\nPhoebe: Yeah, okay, listen, umm, Mom, I hope you know you still mean a lot to me. And youre welcome to come back anytime.\nChandler: Pheebs, if she could come back as a couch, wed really appreciate it. (Joey nods in agreement)\nPhoebe: Come on, Mom, Ill take you home.\nRachel: Ill go with you.\nMonica: Me too. (they all leave)\nRoss: Oh! Y'know, Ive got an extra futon.\nJoey: Dude, you dont have to brag! We got nothing here!!\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 15, "scene_id": "S04E02_015", "location": "Chandler and Joey's", "scene_description": "Rachel, Phoebe, and Julio are consoling Joey and Chandler.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E02/scenes/S04E02_015"}}
{"id": "S04E02_016", "text": "[Scene: Chandler and Joey's, Joey and Chandler have trading the entertainment center for the canoe. Joey is sitting in the bow, staring off into space as to envision his future full of possibilities. Chandler is sitting at the stern, staring into space and is looking at an uncertain future.]\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 2, "episode_id": "S04E02", "episode_title": "THE ONE WITH THE CAT", "scene_number": 16, "scene_id": "S04E02_016", "location": "Chandler and Joey's", "scene_description": "Joey and Chandler have trading the entertainment center for the canoe. Joey is sitting in the bow, staring off into space as to envision his future full of possibilities. Chandler is sitting at the stern, staring into space and is looking at an uncertain future.", "characters": [], "firestore_path": "/episodes/S04E02/scenes/S04E02_016"}}
