{"id": "S04E12_001", "text": "THE ONE WITH THE EMBRYOS\nWritten by: Jill Condon & Amy Toomin Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 1, "scene_id": "S04E12_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E12/scenes/S04E12_001"}}
{"id": "S04E12_002", "text": "[Scene: Monica and Rachel's, its 0-Dark:30, in other words its really, really early. Everyones asleep, and all through the apartments not a creature was stirring, not even a mouse. That is except for the chick, who turns out to be a rooster and is crowing in the sun. Needless to say, this awakens Monica and Rachel who rush into their living room, searching for the cause of the sound.]\nRachel: What the hell is that?!! (to Monica) What the hell is that? Is that you? (Monica nods her head no, and Rachel realizes what is making that sound.) Ohhhhhhh! (storms over to Chandler and Joeys with Monica in trail.) \nMonica: Boy, you are really not a morning person.\nRachel: (angrily) BACK OFF!!! (She starts banging on their door.) Get up! Get up! Get up! God damn it! Get up, get up, get up, get up, get up!!\n(Chandler opens the door, finally.)\nRachel: What is that noise?\nChandler: You!\nJoey: Its the chick! Shesgoing through some changes.\nMonica: What kind of changes?\nChandler: Well the vet seems to think thats shes becoming a rooster. (The rooster crows.) Were getting a second opinion.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 2, "scene_id": "S04E12_002", "location": "Monica and Rachel's", "scene_description": "its 0-Dark:30, in other words its really, really early. Everyones asleep, and all through the apartments not a creature was stirring, not even a mouse. That is except for the chick, who turns out to be a rooster and is crowing in the sun. Needless to say, this awakens Monica and Rachel who rush into their living room, searching for the cause of the sound.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S04E12/scenes/S04E12_002"}}
{"id": "S04E12_003", "text": "[Scene: Monica and Rachel's, its later that morning, everybody has gotten up and Ross and Phoebe has joined them for breakfast. Rachel is returning from shopping.]\nPhoebe: Hey!\nRoss: Hey, what are you doing shopping at eight in the morning?\nRachel: Well, Ive been up since six. Thanks to somebodys dumb-ass rooster.\nPhoebe: You guys you really should get rid of those animals. They shouldnt be living in an apartment.\nRachel: Yeah! Especially not with all of these knives and cookbooks around\nPhoebe: All right. Im gonna go to the fertility doctor and um, see if Im ready to have Frank and Alices embryo transferred into my uterus.\nRoss: Now, how will they know if youre ready?\nPhoebe: Oh, theyre just gonna umm, look to see if my endometria layer is thick.\nChandler: Oh, I can uh, check that for ya.\nPhoebe: Okay everyone, think thick.\nAll: Good-bye! Good luck! (She opens the door to reveal Monica and Joey.)\nPhoebe: Hi! Wish me luck!\nMonica: Oh, good luck.\nJoey: Good luck. (to Monica) And Im still right!\nMonica: That is sooo not true!\nRachel: What?\nJoey: Shes mad because I know todays her laundry day and that means shes wearing her old lady underpants.\nChandler: I can check that for ya.\nMonica: I justI cant believe that you think that you and Chandler know me and Rachel better than we know you.\nChandler: Well we-we do. You can only eat Tic Tacks in even numbers.\nJoey: Yeah, whats that about?\nChandler: (to Rachel) And you Ross, I believe, if you check Rachels bag you will find a half-eaten box of cookies in there.\nRoss: (He does so, and finds a half-eaten box of cookies.) Youre good. (Tries a cookie.) These are not.\nRachel: Im so not impressed. Everybody snacks when they shop.\nMonica: Yeah.\nJoey: Oh yeah? Ross, how many items left in that bag?\nRoss: Five.\nChandler: Okay, ten bucks says that we can name every item in that bag.\nRachel: How many guesses do you get?\nJoey: Six.\nRoss: Challenge extended.\nMonica: Deal!\nRoss: Challenge excepted.\nJoey: All right, well start withapples.\nRoss: Well be starting with apples.\nChandler: (to Ross) Stop that now!\n(Ross reveals a bag of apples.)\nChandler: Yes!\nJoey: Okay. Uhh, tortilla chips, yogurt.\nChandler: Diet soda.\nRoss: Yes. Yes. Yes. (Theyre perfect so far.)\nChandler: Orange juice.\nRachel: No! Theres no orange juice in there! We win!! \nMonica: Ha-ha!\nRoss: They have another guess.\nRachel: Okay, well, we won that one.\nJoey: Okay, the last thing\nChandler: Oh-oh, oh, oh-oh! (Whispers something in Joeys ear.)\nJoey: No-no, not for like another two weeks.\nChandler: I got it! Scotch tape. (Theyre right.)\nRoss: How did you know she would buy scotch tape?\nChandler: Well, we used theres up last night making scary faces.\nMonica: Aww, man!\nChandler: All right! Ten buck! Fork it over! Cough it up! Pay the piper! Gimme it.\nMonica: That does not mean you know us better, I-I want a rematch.\nRachel: Yeah, and none of these stupid grocery questions, real personal questions.\nMonica: Yeah! And the winner gets a hundred bucks.\nJoey: Serious?\nMonica: Are you scared?\nJoey: No! All right, who-who makes up the questions?\nMonica: Ross will do it.\nRoss: Oh sure, \"Ross will do it!\" Its not like he has a job, or a child, or a life of his own.\nRachel: Fine! Well ask Phoebe.\nRoss: No-no-no, I-I wanna play.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 3, "scene_id": "S04E12_003", "location": "Monica and Rachel's", "scene_description": "its later that morning, everybody has gotten up and Ross and Phoebe has joined them for breakfast. Rachel is returning from shopping.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E12/scenes/S04E12_003"}}
{"id": "S04E12_004", "text": "[Scene: The Doctors office, Dr. Zane is examining Phoebe as Frank and Alice watch.]\nDr. Zane: It looks like your uterus is ready for implantation.\nPhoebe: Oh! I knew it! I knew it! I felt really thick this morning.\nFrank: Well, okay, so whats nowgo get, go get the eggs, put em in there.\nDr. Zane: Okay, itll take just a little while to prepare the embryos.\nPhoebe: Embryossss? As in, \"More than one?\"\nDr. Zane: Um-hmm, five actually.\nPhoebe: Five? Okay, where am I giving birth, a hospital or a big box under the stairs?\nDr. Zane: We do five because that gives you a 25% chance that at least one will attach.\nPhoebe: Thats it! 25 percent? That means thats its like 75 percent chance of no baby at all!\nFrank: Hey, yknow I was thinking, what are the odds like if-if, if you stuff like 200 of them in there?\nAlice: Sweety, now, shes a woman, not a gumball machine.\nPhoebe: Okay, well yknow what, dont worry you guys, cause Im-Im gonna do this as many times as it takes to get it right.\nFrank: Well, you see, the-the thing is, we-we only got, we kinda have one shot to make it right.\nAlice: Umm, it costs $16,000 each time you do this. So, umm, were kinda using all the money we have to do it just this one time.\nPhoebe: Whoa!! Thatokay, thats a lot of pressure on me and my uterus. (to Dr. Zane) So, well okay, so is thereis maybe is there something that I can do yknow just to like help make sure I get pregnant?\nDr. Zane: No, Im sorry.\nPhoebe: Wow! You guys really dont know anything!\nFrank: I know! Why dont you get drunk! That worked for a lot of girls in my high school.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 4, "scene_id": "S04E12_004", "location": "The Doctors office", "scene_description": "Dr. Zane is examining Phoebe as Frank and Alice watch.", "characters": ["Alice", "Frank", "Phoebe"], "firestore_path": "/episodes/S04E12/scenes/S04E12_004"}}
{"id": "S04E12_005", "text": "[Scene: Monica and Rachel's, the game is about to begin.]\nMonica: You guys! Do you realize that any minute now, Phoebe can be pregnant?\nJoey: Huh.\nRachel: I know! I know, its such a huge, life-altering thing.\nJoey: I know.\n(They all pause and think about it.)\nRoss: The test is ready.\nAll: Yeah! Yes! (They all right into the living room, all excited.)\nRoss: Okay, each team will answer ten questions. The first team that answers the most questions wins. Okay, the categories are, Fears and Pet Peeves, Ancient History, Literature, and Its All Relative. Now, the coin toss to see who goes first. (He flips the coin and they all watch it hit the table and stop. Then they all look up at him, to see who goes first.) Okay, somebody call it this time.\nAll: Oh yeah!\n(Ross flips the coin again.)\nRachel: Tails!\nRoss: Its heads. (The guys celebrate.) Gentlemen, pick your category.\nChandler: Fears and Pet Peeves.\nRoss: What is Monicas biggest pet peeve?\nJoey: Animals dressed as humans.\nRoss: Thats correct. Ladies?\nMonica: Same category?\nRoss: According to Chandler, what phenomenon scares the bejeezus out of him?\nMonica: Michael Flatley, Lord of the Dance!\nRoss: That is correct.\nJoey: (to Chandler) The Irish gig guy?!\nChandler: His legs flail about as if independent of his body!\nRoss: Gentlemen, youre pick.\nJoey: Its All Relative.\nRoss: Monica and I have a grandmother who died, you both went to her funeral, name that grandmother!\nJoey: (to Chandler) Nana?\nChandler: She has a real name.\nJoey: (answering the question) Althea!\nChandler: Althea?! What are you doing?! \nJoey: I took a shot.\nChandler: You're shooting with Althea?!\nRoss: Althea is correct.\nChandler: Nice shooting!\n(Ross motions for the girls to pick.)\nRachel: Well take Literature!!\nRoss: Every week, the TV Guide comes to Chandler and Joeys apartment. What name appears on the address label?\nRachel: Chandler gets it! Its Chandler Bing!\nMonica: No!!\nRoss: Im afraid the TV Guide comes to Chinandolor Bong.\nMonica: I knew that! Rachel! Use youre head!\nChandler: Actually, its Miss Chinandolor Bong.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 5, "scene_id": "S04E12_005", "location": "Monica and Rachel's", "scene_description": "the game is about to begin.", "characters": ["All", "Chandler", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S04E12/scenes/S04E12_005"}}
{"id": "S04E12_006", "text": "[Scene: The Doctors office, Phoebe is giving a pep talk to the petrie dish containing the embryos.]\nPhoebe: Hello, tiny embryos. Well, Im-Im Phoebe Buffay, hi! Im-Im-Im hoping to be your uterus for the next nine months. You should know, that were doing this for Frank and Alice, who you know, youve been there! Umm, yknow they want you so much, so when you guys get in there, really grab on. Okay, and-and I promise that Ill keep you safe and warm until youre ready to have them take you home, so Oh! And also, umm next time you see me, Im screaming, dont worry, thats whats supposed to happen.\nDr. Zane: Ready?\nPhoebe: Uh-huh. (To the embryos) Good luck.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 6, "scene_id": "S04E12_006", "location": "The Doctors office", "scene_description": "Phoebe is giving a pep talk to the petrie dish containing the embryos.", "characters": ["Phoebe"], "firestore_path": "/episodes/S04E12/scenes/S04E12_006"}}
{"id": "S04E12_007", "text": "[Scene: Monica and Rachel's, the game is coming to a close.]\nRoss: All right, the score is nine to eight in favor of the guys. Ladies if you miss this the game is theirs, pick your category.\nRachel: (shouting) Its All Relative!!\nRoss: You dont have to shout everything.\nRachel: (shouting) Im sorry!\nRoss: Ooh. What is the name of Chandlers fathers Las Vegas all-male burlesque?\nMonica: Viva Las Gaygas!\nChandler: Unfortunately that is correct.\nThe Girls: Yes!!\nRoss: All right, we have a tie. Luckily, I have prepared for such an event. (He opens up an envelope and holds up some note cards.) The Lightning Round!\nAll: Ohhhh.\nRoss: Thirty seconds, all the questions you can answer.\nMonica: You guys are dead, I am so good at lighting rounds.\nChandler: I majored in lightning rounds. All right, were gonna destroy you.\nMonica: Huh, wanna bet?\nChandler: Well, Im so confused as to what weve been doing so far\nMonica: How about we play for more money, say 150?\nRoss: 150 dollars.\nChandler: Say 200?\nRoss: 200 dollars.\nMonica: Youre doing it again.\nRoss: Excuse me.\nRachel: Monica, I dont want to lose 200 dollars.\nMonica: We wont. (to Chandler) 300?\nRachel: Monica?!\nMonica: Im just trying to spice it up!\nRachel: Okay, so lets play for some pepper! Stop spending my money!\nMonica: I got it! How about, if we win, they have to get rid of the rooster?\nRachel: Oooohh thats interesting.\nJoey: Hey, no way, that roosters family!\nRachel: Throw in the duck too!\nJoey: What do you have against the duck?! He doesnt make any noise!\nRachel: Well, he gets the other one all riled up.\nJoey: Look, we are not gonna\nChandler: (interrupting) All right, hold on! If you win, we give up the birds.\nJoey: (shocked) Dah!! (Chandler motions for him to calm down.)\nChandler: But if we win, we get your apartment.\nJoey: Oooooh!\nMonica: Deal!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 7, "scene_id": "S04E12_007", "location": "Monica and Rachel's", "scene_description": "the game is coming to a close.", "characters": ["All", "Chandler", "Joey", "Monica", "Rachel", "Ross", "The Girls"], "firestore_path": "/episodes/S04E12/scenes/S04E12_007"}}
{"id": "S04E12_008", "text": "[Scene: Monica and Rachel's, continued from earlier, only slightly later.]\nRachel: Monica, betting the apartment, I dont know about this.\nMonica: Rachel, I have not missed one question the whole game. I own this game! Look at my hand. (Holds up her hand.)\nRachel: Why? Do you have the answers written on there?\nMonica: No! Steady as a rock! Now, are you with me.\nRachel: All right, lets do it.\nMonica: Come on!\nRachel: Okay. (They go into the living room.)\nRoss: All right, gentlemen, youre up first.\nJoey: Okay.\nChandler: Okay. (Starts jumping around.)\nRoss: You have 30 seconds. And the lightning round beginsstop it (Chandler stops jumping)now. What was Monicas nickname when she was a field hockey goalie?\nJoey: Big fat goalie.\nRoss: Correct. Rachel claims this is her favorite movie\nChandler: Dangerous Liaisons.\nRoss: Correct. Her actual favorite movie is...\nJoey: Weekend at Bernies.\nRoss: Correct. In what part of her body did Monica get a pencil stuck at age 14?\nChandler: Oh! (Whispers something in Joeys ear and then in Rosss ear.)\nRoss: Eww! No!! Her ear! All right, Monica categorizes her towels. How many categories are there?\n(They both confer.)\nJoey: Everyday use.\nChandler: Fancy.\nJoey: Guest.\nChandler: Fancy guest.\nRoss: Two seconds\nJoey: Uhh, 11!\nRoss: 11, unbelievable 11 is correct. (The guys celebrate.) All right, thats 4 for the guys. Ladies, youre up. \nRachel: All right!\nMonica: Come on!\n(As they change places, they give each other the now patented Ross maneuver. If you dont know what that means, click here to find out The One With Joey's New Girlfriend.)\nRoss: 30 seconds on the clock. 5 questions wins the game. The lightning round beginsnow! What is Joeys favorite food?\nMonica: Sandwiches! \nRoss: Correct. Chandler was how old when he first touched a girls breast?\nRachel: 14?\nRoss: No, 19.\nChandler: Thanks man.\nRoss: Joey, had an imaginary childhood friend. His name was?\nMonica: Maurice.\nRoss: Correct, his profession was?\nRachel: Space cowboy!\nRoss: Correct! What is Chandler Bings job?\n(The girls are stumped)\nRachel: Oh gosh, it has something to do with numbers.\nMonica: And processing.\nRachel: He carries a briefcase.\nRoss: 10 seconds, you need this or you lose the game.\nMonica: Its umm, it has something to do with transponding.\nRachel: Oh-oh-oh, hes a transponcetranspondster!\nMonica: Thats not even a word! I can get this! I can get this!\n(Ross stops the clock, signifying the end of the lightning round.)\nMonica: NOOOOOOOOO!!!!!\nRachel: Oh my God.\nChandler and Joey: YEAH!!! YES!!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 8, "scene_id": "S04E12_008", "location": "Monica and Rachel's", "scene_description": "continued from earlier, only slightly later.", "characters": ["Chandler", "Chandler and Joey", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S04E12/scenes/S04E12_008"}}
{"id": "S04E12_009", "text": "[Scene: Monica and Rachel's, erm, Chandler and Joey's, Chandler and Joey are carrying in the foosball table.]\nJoey: I call Monicas room!\nChandler: You cant just call Monicas room.\nJoey: Sure I can, standard shotgun rules, Im sight of the room and I called it.\n(Chandler grunts and turns around, sees that hes in sight of the room, and mouths damn!)\nMonica: Man, I feel like Im coming down with something.\nJoey: What?\nMonica: Yeah. (to Chandler) I bet you cant guess what color my tonsils are? Ill bet the apartment!\nChandler: Oh, I would never bet this apartment. Its too nice.\nPhoebe: (entering) Hey!\nChandler: Hey!\nJoey: Heyooh Pheebs, are they in there?\nPhoebe: Umm, yeah, uh-huh, theyre implanted.\nMonica: How do you feel?\nPhoebe: Well, freaked. Cause it turns out that the odds are really sucky. And! This is Frank and Alices like only shot. Like, they are literally putting all of their eggs in my basket.\nChandler: Yeah, but I bet it works.\nMonica: Really?! How much?!\nPhoebe: All right, Im gonna go take a pregnancy test, right now.\nJoey: Oh wow! You can tell this soon.\nPhoebe: Well the doctor says it takes a couple days, but my bodys always been a little faster than Western medicine. \nRachel: (entering from Chandlers bedroom, I guess, and sees the foosball table.) Oh my God! I cant believe you guys are actually think youre moving in here!\nChandler: Well believe it baby!\nRachel: Well I-I-Im not moving.\nJoey: What?!\nRachel: No, it was a stupid bet! We were just playing a game!\nJoey: You cant just ignore the bet! Its a bet! You bet and you bet and if you lose, you lose the bet!\nMonica: Look Rach, we have to move. I mean if they had lost, we wouldve made them get rid of the birds. Right?\nRachel: Noooo.\nMonica: All right, look, I hate this as much as you, but if it makes you feel better, its all your fault.\nRachel: What?!\nMonica: Chinadolor Bong, come on, we steal that TV Guide every week!\nChandler: I knew it!\nRachel: I dont care, Im not going anywhere.\nChandler: Cool, girl roommate.\n(Phoebe comes in from the bathroom as Rachel sits down in disgust.)\nMonica: Well?\nPhoebe: Nope, not knocked up yet.\nMonica: Its only been a couple of hours, so just give it some time.\nPhoebe: Yeah, all right. Meanwhile, Im gonna do whatever I can to help this so, Im just gonna yknow, lie it your chair, (She climbs into the chair and drapes her feet over the back of the chair.) Y'know? Yeah, good, Im let gravity yknow, do its jobs.\n[Cut too later, the moving process is progressing steadily. Monica is trying to lift a heavy box, as Rachel comes in from Chandlers bedroom.]\nMonica: Hey, Rach, can you give me a hand with this box?\nRachel: No! Put that box down! We are not going anywhere! This is my apartment and I like it! This is a girls apartment! That is a boys apartment, its dirty and it smells. This is pretty. Its-its so pretty! And look, and its-its purple! And Im telling you, you with the steady hand, I am not moving, and now I have got the steady hand. (She holds out her hand, which is shaking uncontrollably.) \nMonica: Ill take care of it.\nRachel: Thats right! You do what the hand says!\n[Cut to later, Phoebe is still in the chair and Rachel is laying down as Monica enters.]\nRachel: How did it go?\nMonica: I lost our mattresses.\n[Cut to still later, Rachel has now resigned herself to move and is now helping Monica. Phoebe is still on the chair.]\nPhoebe: (singing) \"Are you in there little fetus?   In nine will you come great us?   I will buy you some Adidas.\"\n(Theres a knock on the door and Monica answers it.)\nMonica: Hey!\nFrank and Alice: (entering) Hi!\nAlice: Hi, Phoebe! We were just at the drugstore and we got you a little present.\nPhoebe: Oh. Oh.\nFrank: Umm, its a lollipop and a uh, a home pregnancy test.\nMonica: Hey, dont mix those up, you could really ruin that lollipop.\nAlice: So umm, you feel like taking a test? Theres only one question.\nPhoebe: All right, I will. No, I will. But umm, yknow just remember that its still really early, okay so, if it says that Im not pregnant, that doesnt mean that Im not gonna get pregnant, okay and, and just please, just so I dont go completely nuts, just try not put all your hopes on this.\nAlice: Okay.\nFrank: Okay. (They both squeal in expectation.)\nPhoebe: Great. (Goes to take the test.)\n(The door opens and Joey and Chandler ride in on the big, fake dog in triumph)\nRachel: Yknow what, you are mean boys, who are just being mean!\nJoey: Hey, dont get mad at us! No one forced you to raise the stakes!\nRachel: That is not true. She did! She forced me!\nMonica: Hey, we would still be living here if hadnt gotten the question wrong!\nRachel: Well it stupid, unfair question!\nRoss: Dont blame the questions!\nChandler: Would you all stop yelling in our apartment! You are ruining moving day for us!\nRachel: Will you stop calling it your apartment!\nJoey: But it is our apartment!\nRachel: No its not!\n(They all decay into massive bickering as Phoebe returns from the bathroom.)\nPhoebe: You guys! You guys! Youre gonna have a baby! Theyre gonna have a baby!\nFrank: MY SISTERS GONNA HAVE MY BABY!!!!!!!\n(They all go over and hug Phoebe.)\nPhoebe: Okay, but this cant be good for the baby.\nAll: Oh! (They stop hugging her to let her out and resume the hug without her.)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 9, "scene_id": "S04E12_009", "location": "Monica and Rachel's", "scene_description": "erm, Chandler and Joey's, Chandler and Joey are carrying in the foosball table.", "characters": ["Alice", "All", "Chandler", "Frank", "Frank and Alice", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E12/scenes/S04E12_009"}}
{"id": "S04E12_010", "text": "[Scene: Chandler and Joey's, erm, Monica and Rachel's, Monica and Rachel are busy unpacking.]\nMonica: I cant find garbage bags!\nRachel: Oh, I think I saw some in here. \n(She opens a door and they both scream at horror at whats inside of it.)\nMonica: What is it?!\nRachel: I dont know! But maybe if we keep that drawer shut, itll die.\nMonica: I cant believe were living here!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 10, "scene_id": "S04E12_010", "location": "Chandler and Joey's", "scene_description": "erm, Monica and Rachel's, Monica and Rachel are busy unpacking.", "characters": ["Monica", "Rachel"], "firestore_path": "/episodes/S04E12/scenes/S04E12_010"}}
{"id": "S04E12_011", "text": "[Scene: Monica and Rachel's, erm, Chandler and Joey's, theyre both unpacked. The big ceramic dog has found a new home in front of the window. Joey screams and runs into the living room.]\nChandler: What?! What-what is it?!\nJoey: Did you see the size of the closets?!\nChandler: I cant believe we live here!\n(They both sit down on the chairs and put up the foot rest.)\nChandler and Joey: Awwwww!! (They lean back all the way.) Awwwwwww!!!\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 12, "episode_id": "S04E12", "episode_title": "THE ONE WITH THE EMBRYOS", "scene_number": 11, "scene_id": "S04E12_011", "location": "Monica and Rachel's", "scene_description": "erm, Chandler and Joey's, theyre both unpacked. The big ceramic dog has found a new home in front of the window. Joey screams and runs into the living room.", "characters": ["Chandler", "Chandler and Joey", "Joey"], "firestore_path": "/episodes/S04E12/scenes/S04E12_011"}}
