{"id": "S04E21_001", "text": "THE ONE WITH THE INVITATION\nWritten by: Seth Kirkland Transcribed by: Eric Aasen With Help from: Darcy Partridge Episodes Orginally Transcribed by: guineapig, Ruth Curran, Mindy Mattingly Phillips, Josh Hodge, Dan Silverstein, and Eric Aasen.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 1, "scene_id": "S04E21_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E21/scenes/S04E21_001"}}
{"id": "S04E21_002", "text": "[Scene: Central Perk, Joey and Chandler are sitting and talking.]\nChandler: Yknow what? It seems like all of the sudden; so much has happened.\nJoey: I know. Ross is getting married.\nChandler: Phoebe is, making people.\nJoey: Everybodys doing stuff!\nChandler: And we just sit here. I mean if I die the only way people would even know I was here, would be by the ass print on this chair! Look, we have to do something. Okay? Something huge!\nJoey: (snaps his fingers) We could climb Mt. Everest!\nChandler: No-no, not something stupid, something huge.\nJoey: No-no-no-no-no, I saw an ad for this video, people climb that thing everyday! We could totally do that!\nChandler: Why not?! I mean its just, its just climbing! Its just, its just steep!\nJoey: Yeah!\nChandler: Were going to Everest! Okay, it would be nice to leave an ass print on Everest!\nPhoebe: (entering) Hey!\nJoey: Hey!\nPhoebe: What-whats up?\nJoey: Were gonna climb Mt. Everest!\nChandler: Yeah baby!\nPhoebe: Really?! I looked into that. Yeah, but, I mean it costs like $60,000 and yknow you can die. And, you would die!\nChandler: (dejected) Yeah, well\nJoey: We could get that Everest video though.\nChandler: Yeah, we could do that without yknow risking our lives at all!\nJoey: And while were down at the video store, you know what else we could rent? Die Hard! (Chandlers excited.) Oh, yknow what? I just remembered, that Everest thing is only available through mail order.\nChandler: (dejected) Oh, well\nPhoebe: So you guysll stay here and hang out with me?\nChandler: Yeeeeahhhh.\nJoey: Yeah. Yeah.\nChandler: But Ill tell you something. One of these days were get off of our buts and rent Die Hard again!\nJoey: Yeah we are!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 2, "scene_id": "S04E21_002", "location": "Central Perk", "scene_description": "Joey and Chandler are sitting and talking.", "characters": ["Chandler", "Joey", "Phoebe"], "firestore_path": "/episodes/S04E21/scenes/S04E21_002"}}
{"id": "S04E21_003", "text": "[Scene: Rosss apartment, he and Emily are addressing their invitations.]\nEmily: So what did he decide? Does your Uncle Nathan get an invite or not?\nRoss: Ohh, God, nobody likes him, and hes so cheap, hed never fly to London in a million years. Yeah, invite him? Hey, did I do these neat enough? (Hands her some envelopes.)\nEmily: Yeah, theyre fine.\nRoss: Yeah?\nEmily: If anyone asks, well just say Ben addressed them. (Looking through the envelopes.) Oh! So you invited Rachel then?\nRoss: Sure. Why not?\nEmily: Really?\nRoss: Yeah?\nEmily: I dont think Id be comfortable with any of my old lovers there.\nRoss: Wait-wait-wait, do you, do you think, maybe we shouldnt invite her?\nEmily: Oh, no-no, yknow I absolutely adore Rachel its just that, well it might be a awkward for you. But its absolutely your decision. (Gets up.) More tea?\nRoss: Yeah sure.\nEmily: Earl Grey?\nRoss: Huh? Yeah, fine, invite whoever you want.\n[And with that we start off on a series of clips from the entire history of Ross and Rachel, from Rosss point of view. The first clip is from The Pilot.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 3, "scene_id": "S04E21_003", "location": "Rosss apartment", "scene_description": "he and Emily are addressing their invitations.", "characters": ["Emily", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_003"}}
{"id": "S04E21_004", "text": "[Scene: Central Perk, Ross is complaining about Carol.]\nRoss: I don't want to be single, okay? I just... I just- I just wanna be married again!\n(A woman enters wearing a wet wedding dress and frantically starts to look around.)\nChandler: And I just want a million dollars! (He extends his hand hopefully.)\nMonica: Rachel?!\nRachel: Oh God Monica hi! I just went to your building and you weren't there and then this guy with a big hammer said you might be here and you are, you are!\n[cut to later]\nMonica: Okay, everybody, this is Rachel, another Lincoln High survivor. (To Rachel) This is everybody, this is Chandler, and Phoebe, and Joey, and- you remember my brother Ross? \nRachel: Hi, sure!\nRoss: Hi. \n(They go to hug but Ross' umbrella opens. He sits, defeated again.)\n[cut to later]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 4, "scene_id": "S04E21_004", "location": "Central Perk", "scene_description": "Ross is complaining about Carol.", "characters": ["Chandler", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_004"}}
{"id": "S04E21_005", "text": "[Scene: Monica and Rachel's, Ross and Rachel are finishing up some cookies.]\nRoss: You know you probably didn't know this, but back in high school, I had a, um, major crush on you.\nRachel: I knew.\nRoss: You did! Oh.... I always figured you just thought I was Monica's geeky older brother.\nRachel: I did.\nRoss: Oh. Listen, do you think- and try not to let my intense vulnerability become any kind of a factor herebut do you think it would be okay if I asked you out? Sometime? Maybe?\nRachel: Yeah, maybe...\nRoss: Okay... okay, maybe I will...\n[The next clip is from The One With The Blackout.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 5, "scene_id": "S04E21_005", "location": "Monica and Rachel's", "scene_description": "Ross and Rachel are finishing up some cookies.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_005"}}
{"id": "S04E21_006", "text": "[Scene: Monica and Rachel's, Ross and Rachel are talking about passion.]\nRoss: See, I see.... big passion in your future.\nRachel: Really?\nRoss: I do.\nRachel: Oh Ross, you're so great. [she playfully rubs his head and gets up]\n[Ross gets up, pleased with himself and starts to walk past Joey.]\nJoey: It's never gonna happen.\n[cut to later]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 6, "scene_id": "S04E21_006", "location": "Monica and Rachel's", "scene_description": "Ross and Rachel are talking about passion.", "characters": ["Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_006"}}
{"id": "S04E21_007", "text": "[Scene: Monica and Rachel's balcony, Ross is about to be attacked by Paulo's cat.]\nRoss: Hey, I have a question. Well, actually, it's not so much a question as.. more of a general wondering... ment.\nRachel: Okay.\nRoss: Okay. Umm, for a while now, I've been wanting to, um....\nRachel: Ohhh!!!! [looking at something behind Ross]\nRoss: Yes, yes, that's right...\nRachel: Oh, look at the little cat! [a small kitten is on the roof behind Ross] Look at it!\nRoss: What? [the cat jumps on his shoulders] Ow!\n[Cut to inside, Monica, Joey and Phoebe are singing while outside, Ross and Rachel are trying to get the cat off of Ross' shoulder.]\nMonica, Joey, and Phoebe: [singing] I'm on top of the world, looking down on creation and the only explanation I can find...\n[The next clip is from The One With The East German Laundry Detergent.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 7, "scene_id": "S04E21_007", "location": "Monica and Rachel's balcony", "scene_description": "Ross is about to be attacked by Paulo's cat.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_007"}}
{"id": "S04E21_008", "text": "[Scene: The Laundromat, Rachel is fighting with that old, annoying woman for a cart.]\nRachel: All right, listen, missy. If you want this cart, you're gonna have to take me with it! \n(She thinks it over, and then walks away.)\nRachel: (to Ross) Yes! Did you see that?\nRoss: You were incredible! Brand new woman, ladies and gentlemen.\nRachel: I could not have done this without you.\n(Rachel stands up and kisses Ross. He is stunned. A moment of silence follows.)\nRoss: Ok, um, uh, more clothes in the dryer? (Ross turns and bangs his head on an open dryer door.) I'm fine, I'm fine.\n[The next clip is from The One Where Ross Finds Out]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 8, "scene_id": "S04E21_008", "location": "The Laundromat", "scene_description": "Rachel is fighting with that old, annoying woman for a cart.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_008"}}
{"id": "S04E21_009", "text": "[Scene: Central Perk, I'm sure you've guessed, it's the famous fight scene between Ross and Rachel.]\nRoss: You had no right to tell me you ever had feelings for me.\nRachel: (hurt) What?\nRoss: I was doing great with Julie before I found out about you.\nRachel: Hey, I was doin' great before I found out about you. You think it's easy for me to see you with Julie?\n[cut to later]\nRoss: The point is I... I don't need this right now, OK. It, it's too late, I'm with somebody else, I'm happy. This ship has sailed.\n[cut to later]\nRachel: Alright, fine, you go ahead and you do that, alright Ross.\nRoss: Fine.\nRachel: 'Cause I don't need your stupid ship.\nRoss: Good.\nRachel: Good. (Ross leaves)\n[cut to later]\n(Rachel slams the door and locks it. She sits down, visibly upset. She puts her head in her hands and begins to cry. Ross comes back and is standing outside the window. When Rachel regroups and gets back up to finish closing, she sees him.)\n[cut to later]\n(She opens the door and they kiss.)\n[The next clip is the second famous fight in The One Where Ross and Rachel Take A Break.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 9, "scene_id": "S04E21_009", "location": "Central Perk", "scene_description": "I'm sure you've guessed, it's the famous fight scene between Ross and Rachel.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_009"}}
{"id": "S04E21_010", "text": "[Scene: Monica and Rachel's, Ross and Rachel are arguing.]\nRachel: Ross do you realise this is the first time in my life Im doing something I actually care about. This is the first time in my life Im doing something that Im actually good at. I mean. if you dont get that...\nRoss: No, hey, I get that, okay, I get that big time. And Im happy for ya, but Im tired of having a relationship with your answering machine! Okay, I dont know what to do anymore.\nRachel: Well neither do I!\nRoss: Is this about Mark?\nRachel: (shocked) Oh my God.\nRoss: Okay, its not, its not.\nRachel: Oh my God. I cannot keep having this same fight over and over again, Ross, no, youre, youre, youre making this too hard.\nRoss: Oh Im, Im making this too hard. Okay, what do you want me to do.\nRachel: I dont know, I dont know. Urrrgh! Look, maybe we should take a break.\nRoss: Okay, okay, fine, youre right. Lets ah, lets take a break, (goes to the door) lets cool off, okay, lets get some frozen yogart, or something.. (opens the door)\nRachel: No. (Ross is standing in the doorway.) A break from us.\n(Ross looks at her, then leaves slamming the door behind him.)\n[The next clip is from The One The Morning After]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 10, "scene_id": "S04E21_010", "location": "Monica and Rachel's", "scene_description": "Ross and Rachel are arguing.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_010"}}
{"id": "S04E21_011", "text": "[Scene: Ross's apartment, Ross is hurrying Chloe out the door.]\nChloe: Do I know why were rushing?\nRoss: Yeah, y'know the ah, the girlfriend I told you about last night? (Hes frantically throwing the cushions off of the couch looking for her other shoe) Well it turns out she ah, she wants to get back together with me. Oh, I found it!! \nChloe: Thats so great for you guys!\nRoss: Yeah! \n[cut to later]\nChloe: Good luck, with your girlfriend. \nRoss: Oh, thank you. (She goes to kiss him, but he holds her coat up between their faces to stop her.) Hey, hey. (opens the door, sees Rachel, and hides Chloe behind the door) Rachel!!!!\nRachel: Hi. Ohhh, you got my message.\nRoss: Yeah, oh hey, you are right on time.\nRachel: So what do you say? Can I be your girlfriend again?\nRoss: Yes, you can, very much.\n(Chloe gives Ross the thumbs up while still standing behind the door.)\nRoss: (seeing the thumbs up) Ahhhh!! (Hugs Rachel tighter.)\n[cut to later]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 11, "scene_id": "S04E21_011", "location": "Ross's apartment", "scene_description": "Ross is hurrying Chloe out the door.", "characters": ["Chloe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_011"}}
{"id": "S04E21_012", "text": "[Scene: Monica and Rachel's, Rachel has just found out about Chloe and is screaming at Ross. The rest of the gang is trapped in Monica's bedroom.]\nRachel: (opening the door) Y'know what, I want you to leave! Get outta here! \nRoss: No!!\nRachel: Just get out! Now!!\nRoss: No!! No!! I wanna stay. I wanna talk about this.\nRachel: Okay! All right! How was she?\n[Cut to Monica's bedroom]\nChandler: Uh-oh.\n[Cut to Living Room]\nRoss: What?\nRachel: Was she good?\n[Cut to Monica's bedroom]\nJoey: Dont answer that.\n[Cut to Living Room]\nRachel: Come on Ross! You said you wanted to talk about it, lets talk about it!! How was she?\nRoss: She was...\n[Cut to Monica's bedroom]\nJoey: Awful! Horrible!\nChandler: She was not good. Not good.\nJoey: She was nothing compared to you.\n[Cut to Living Room]\nRoss: She, she was different.\n[Cut to Monica's bedroom]\nJoey: Ewwwww!\nChandler: Uh-oh.\n[Cut to Living Room]\nRachel: Good different?\nRoss: Nobody likes change.\n(Rachel picks up a newspaper and starts beating him with it.)\nRoss: What? Okay, okay, okay, okay.\n[The next clip is from The One With The Jellyfish.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 12, "scene_id": "S04E21_012", "location": "Monica and Rachel's", "scene_description": "Rachel has just found out about Chloe and is screaming at Ross. The rest of the gang is trapped in Monica's bedroom.", "characters": ["Chandler", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_012"}}
{"id": "S04E21_013", "text": "[Scene: Rachel's bedroom, Rachel, entering selfish mode, is thanking Ross for wrongly taking the entire blame of the breakup; as if she had absolutely nothing to do with it.]\nRachel: ...the way you owned up to everything, it just showed me how much youve grown. Y'know? I mean my Mom never thought this would work out. It was all, Once a cheater, always a cheater. Ooh, I just wish we hadnt lost those four months, but if time was what you needed just to gain a little perspective...\nRoss: WE WERE ON A BREAK!!!!!!!\n[Cut back to the present.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 13, "scene_id": "S04E21_013", "location": "Rachel's bedroom", "scene_description": "Rachel, entering selfish mode, is thanking Ross for wrongly taking the entire blame of the breakup; as if she had absolutely nothing to do with it.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_013"}}
{"id": "S04E21_014", "text": "[Scene: A mailbox, Ross is mailing the invitations. He throws a bunch into the mailbox, but pauses with Rachel's. And it starts another round of clips.]\n[The One With The Fake Party]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 14, "scene_id": "S04E21_014", "location": "A mailbox", "scene_description": "Ross is mailing the invitations. He throws a bunch into the mailbox, but pauses with Rachel's. And it starts another round of clips.", "characters": [], "firestore_path": "/episodes/S04E21/scenes/S04E21_014"}}
{"id": "S04E21_015", "text": "[Scene: The hallway, Rachel is convincing Ross that Emily is good for him.]\nRachel: You seem to really like her.\nRoss: Yeah, I really do. Yeah, but what am I gonna do, I mean we-we both agreed that it was gonna be a two-week thing, yknow no commitment.\nRachel: Ross, that girl just spent the entire evening talking to your friends, asking to hear stories about you, looking through Monicas photo albums, I mean you dont do that if youre just in it for two weeks.\nRoss: You think?\nRachel: Yeah, you got like 14 hours until she has to be at the airport, and youre sitting here in the hallway with a 28-year-old cheerleader with a fat lip.\nRoss: Hey, youre right.\nRachel: Yeah.\n[Cut back to the present, Ross is still looking at Rachel's invitation. Finally, he makes up his mind and mails it.]\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 15, "scene_id": "S04E21_015", "location": "The hallway", "scene_description": "Rachel is convincing Ross that Emily is good for him.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_015"}}
{"id": "S04E21_016", "text": "[Scene: Monica and Rachel's, Joey, Monica, and Phoebe are opening their invitations.]\nMonica: Ohh, this is soo amazing! I cant believe my brothers getting married! And in London! Its so romantic!\nJoey: (taking apart the invitation) Hey, pretty smart! Tissue paper! Youre at the wedding, you have to cry, \"Handkerchief?\" \"No-no, I got my invitation.\"\nPhoebe: Oooh look! Isnt this adorable, Ross let Ben address mine!\nChandler: (entering) Hello!\nJoey: Hey!\nMonica: Hey!\nPhoebe: Hey! Hey, did you get your invitation to Rosss wedding?\nChandler: (sarcastic) Noo.\nJoey: Dont worry man, I get to bring a guest. Well show him.\nPhoebe: Im so jealous youre all going! I cant believe I never knew that you cant fly in your third trimester!\nChandler: I didnt know that.\nMonica: I never knew that either.\nJoey: I knew that! (They all look at him) I sooo didnt know that, but you should see your faces.\nRachel: (entering) Hey guys! Whats up?\nJoey: Heyyy. (They all try and hide their invitations.)\nMonica: Were hanging out.\n(Rachel starts going through her mail, and come across her invitation.)\nRachel: Whats this? Is this Rosss wedding invitation?\nChandler: See, maybe thats the one we shouldve actually hidden.\nRachel: Oh, no! No you guys! Come on, you dont have to do that! Im happy for him! I am! I reallyIm-Im happIll work on it.\nMonica: Im sorry honey.\nRachel: Yeah.\nMonica: Rach, youre gonna come though arent you?\nRachel: Oh, honey, I dont know. I\nChandler: This isnt one of those uh, yknow \"If she doesnt come, we-we dont, we dont come?\" Right? Because I already bought my ticket\nMonica: You know what would be real weird? Is if you werent there. Just say youll think about it, okay?\nRachel: No, Ill think about it. Yeah.\n[And with that, we go into another set of clips, this time from Rachels point of view.]\n[The first clip is from The One Where Rachel Finds Out.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 16, "scene_id": "S04E21_016", "location": "Monica and Rachel's", "scene_description": "Joey, Monica, and Phoebe are opening their invitations.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E21/scenes/S04E21_016"}}
{"id": "S04E21_017", "text": "[Scene: Monica and Rachel's, it's Rachel birthday party and Chandler is about to spill the beans.]\nRachel: Who's this from?\nChandler: Oh, that's Ross's. \nRachel: Oh... (opens it and sees it is a pin) Oh my God. He remembered.\nPhoebe: Remembered what?\nRachel: It was like months ago. We were walking by this antique store, and I saw this pin in the window, and I told him that it was just like one my grandmother had when I was a little girl. Oh! I can't believe he remembered!\nPhoebe: Oh, it's so pretty. This must have cost him a fortune.\nMonica: I can't believe he did this.\nChandler: Come on, Ross? Remember back in college, when he fell in love with Carol and bought her that ridiculously expensive crystal duck?\n(Everyone looks at him. He realizes he just spilled the beans about Ross's crush on Rachel.)\nRachel: What did you just say?\nChandler: (stuttering incoherently) F-hah.... flennin....\nRachel: Oh.... my God.\n[The next clip is from The One With Ross's New Girlfriend.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 17, "scene_id": "S04E21_017", "location": "Monica and Rachel's", "scene_description": "it's Rachel birthday party and Chandler is about to spill the beans.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E21/scenes/S04E21_017"}}
{"id": "S04E21_018", "text": "[Scene: The airport, Ross is about to walk off of the plane with Julie.]\nRachel: (seeing Ross come off the plane with another woman.) Oh my God.\n[cut to later]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 18, "scene_id": "S04E21_018", "location": "The airport", "scene_description": "Ross is about to walk off of the plane with Julie.", "characters": ["Rachel"], "firestore_path": "/episodes/S04E21/scenes/S04E21_018"}}
{"id": "S04E21_019", "text": "[Scene: Monica and Rachel's, Ross is introducing Julie to the gang.]\nJulie: Well, Ross and I were in grad school together.\nRoss: But we haven't seen each other since then. Well I land in China, guess who's in charge of the dig. \nRachel: Julie! Julie, isn't that great? I mean, isn't that just kick- you-in-the-crotch, spit-on-your-neck fantastic?\n[cut to later]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 19, "scene_id": "S04E21_019", "location": "Monica and Rachel's", "scene_description": "Ross is introducing Julie to the gang.", "characters": ["Julie", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_019"}}
{"id": "S04E21_020", "text": "[Scene: Monica and Rachel's, Ross is trying to hang up on Julie.]\nRoss: Oh, that is so sweet.(listens) No, no, ok, you hang up. Ok, ok, one, two, three.(He doesn't hang up and motions for Rachel to be quiet.) Well you didn't hang up either. \nRachel: She didn't hang up either...\nRoss: Ok, no, no, you hang up. You, you, y(Rachel grabs the phone and hangs it up for him.)\n[The next clip is from The One Where Ross Finds Out.]\n[Scene, A Restaurant, Rachel is on her date, drunk, and is leaving that answering machine message.]\nRachel: (on phone) Ross, hi, it's Rachel. I'm just calling to say that um, everything's fine and I'm really happy for you and your cat...(cut)...I am over you. I am over you and that, my friend, is what they call closure. (She hangs up and tosses phone in the ice bucket.)\n[cut to later]\n[Scene, Monica and Rachel's, the next morning, Ross is checking his messages.]\nRoss: Rach, I got a message from you.\n(Rachel comes out of her room, suddenly she remembers leaving the message.)\nRachel: Oh my God. Oh my God Ross, no, hang up the phone, give me the phone Ross, give me the phone, give me the phone, give me the. . . (She jumps the couch and lands on Ross's back, finally getting the phone from him. Ross has a confused expression on his face.)\nRoss: You're over me?\nRachel: Ohhhhhhhh God. (climbs off his back)\nRoss: Wha... you're uh, you're, you're over me?\nRachel: Ohh, ohh.\nRoss: When, when were you... under me?\nRachel: Well, basically, lately, I've uh, I've uh, sort of had feelings for you.\n[cut to later in the same scene]\nRoss: OK, I need to lie down. \n[The next clip is from The One With The List.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 20, "scene_id": "S04E21_020", "location": "Monica and Rachel's", "scene_description": "Ross is trying to hang up on Julie.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_020"}}
{"id": "S04E21_021", "text": "[Scene: Chandler and Joey's, Ross has just broken up with Julie and is about to get with Rachel.]\nJoey: He broke up with Julie. Well, go hug her, for god's sakes.\nRachel: Really?\nRoss: Really. It's always been you, Rach.\nRachel: Oh, god.\n(Ross and Rachel hug.)\nChandler and Joey: Ohhh.\n[The next clip is from The One Where Ross and Rachel.... You Know.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 21, "scene_id": "S04E21_021", "location": "Chandler and Joey's", "scene_description": "Ross has just broken up with Julie and is about to get with Rachel.", "characters": ["Chandler and Joey", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_021"}}
{"id": "S04E21_022", "text": "[Scene: The Auditorium, Ross and Rachel are about to... you know.]\nRoss: I've no idea, could be. Listen, I'm sorry I had to work tonight.\nRachel: Oh it's OK. You were worth the wait, and I don't just mean tonight.\n(They kiss and start undressing. As Rachel tries to pull off Ross's tie she catches it in his mouth. Then they roll across the fur rug.)\nRachel: Ah, oh God. Oh, honey, oh that's OK.\nRoss: What. Oh no, you just rolled over the juice box.\n[The next clip is from The One The Morning After.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 22, "scene_id": "S04E21_022", "location": "The Auditorium", "scene_description": "Ross and Rachel are about to... you know.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_022"}}
{"id": "S04E21_023", "text": "[Scene: Central Perk, Ross is trying to prevent Gunther from spilling the beans.]\nRoss: Gunther! Gunther. Gunther, please tell me you didnt say anything to Rachel about me and the girl from the Xerox place.\nGunther: Im sorry. Was I not supposed to?\n(Ross turns around and sees Rachel sitting by the window. She is just glaring at him.)\n[The next clip is from The One At The Beach.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 23, "scene_id": "S04E21_023", "location": "Central Perk", "scene_description": "Ross is trying to prevent Gunther from spilling the beans.", "characters": ["Gunther", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_023"}}
{"id": "S04E21_024", "text": "[Scene: The beachhouse, Ross and Rachel are argueing about the breakup.]\nRoss: Y'know, hey! Youre the one who ended it, remember?\nRachel: Yeah, because I was mad at you, not because I stopped loving you!\nRoss: You still love me?\nRachel: Noo.\n[cut to later]\nRoss: What does this mean? What do you, I mean do you wanna, get back together?\nRachel: Noo! Maybe! I, I dont know. \nRoss: What?!\nRachel: I just, I feel, I-I just...\n(Ross leans in and kisses her. They both look at each other for a moment, and then embrace in a more passionate kiss.)\n[The next clip is from The One With The Jellyfish.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 24, "scene_id": "S04E21_024", "location": "The beachhouse", "scene_description": "Ross and Rachel are argueing about the breakup.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_024"}}
{"id": "S04E21_025", "text": "[Scene: Monica and Rachel's, Rachel and Ross are finally breaking up for good, or is it?]\nRachel: Y'know I cant believe I even thought about getting back together again! We are so over!!\nRoss: (starts to cry) FINE BY ME!! (he opens the door and traps Chandler behind it)\n[cut to later]\nRachel: And hey! Just so you know, its not that common! It doesnt happen to every guy! And it is a big deal!!\nChandler: I KNEW IT!!!!\n[cut back to the present.]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 25, "scene_id": "S04E21_025", "location": "Monica and Rachel's", "scene_description": "Rachel and Ross are finally breaking up for good, or is it?", "characters": ["Chandler", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_025"}}
{"id": "S04E21_026", "text": "[Scene: Central Perk, Rachel is deciding on whether or not to go to the wedding.]\n[cut to another clip, this one is from The One With The Prom Video]", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 26, "scene_id": "S04E21_026", "location": "Central Perk", "scene_description": "Rachel is deciding on whether or not to go to the wedding.", "characters": [], "firestore_path": "/episodes/S04E21/scenes/S04E21_026"}}
{"id": "S04E21_027", "text": "[Scene: Monica and Rachel's, the gang is watching the Prom Video and Rachel is about to make her entrance on the video. The italics are portions of the prom video.]\nMrs. Geller: Rachel's coming up the path. Doesn't she look pretty. Jack... (Rachel enters with a huge nose)\nRachel: Oh my God.\nMonica: You know what this is, this is us getting ready for the prom.\nRachel: Oh.\nRoss: You know what, you guys, we don't have to watch this.\nAll: Oh yeah we do. C'mon.\nMrs. Geller: Get a shot of Monica. Where's Monica.\nMr. Geller: Wait, how do you zoom out? (zooms out and we see an extremely overweight Monica eating a big sandwich) There she is.\nMonica: Shut up, the camera adds ten pounds.\nChandler: Ahh, so how many cameras are actually on you?\n[cut to later]\nMonica: Oh, dad, turn it off.\nMr. Geller: It is off. Right Ross? (pans over to see Ross with an afro and moustache)\nJoey: Lookin' good Mr. Cotter.\n[cut to later]\nRachel: I can't go to my own prom without a date, I can't, it's too late.\nMonica: If you're not going then I don't want to go either.\nMrs. Geller: (to Ross on the stairs) I have a wonderful idea. You should take Rachel to the prom.\n[cut to later]\nRoss: Y'know what? I think we've seen enough, let's turn it off.\nAll: No, no, no.\nRoss: OK, fine, well I'm not gonna watch, alright.\nMr. Geller: C'mon kid, let's go.\nMrs. Geller: Ahh, are you hadsome.\nMr. Geller: Let's show 'em.\nRoss: (walks down the stairs and grabs the flowers out of the vase on the endtable) Okay dad.\nMr. Geller: (going downstairs) Rachel, ready or not, here comes your knight in shiningOh no. (Chip has shown up and the four are leaving.)\nRachel, Monica, Roy, and Chip: Bye.\nMrs. Geller: Oh, dear. Jack, how do I turn this off?\nMonica: (to Ross) I can't believe you did that.\nRoss: Yeah, well.\n[Rachel, seeing what he did for her, gets up, walks across the room, and kisses Ross]\nPhoebe: See, he's her lobster.\n[Cut back to the present, Rachel has made her decision.]\nMonica: (seeing the decision) Nooooo. Youre really not going?\nRachel: Yeah. Its just gonna be too hard. Yknow? I mean, its Ross. How can I watch him get married? Yknow its just, its for the best, yknow it is, its Yknow, plus, somebodys got to stay here with Phoebe! Yknow shes gonna be pretty big by then, and she needs someone to help her tie her shoes; drive her to the hospital in case she goes into labour.\nMonica: You dont have a car. And your license expired. \nRachel: I know. (Starts to cry) Yeah, see, theres so much to do and I have so little time to do it in.\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 27, "scene_id": "S04E21_027", "location": "Monica and Rachel's", "scene_description": "the gang is watching the Prom Video and Rachel is about to make her entrance on the video. The italics are portions of the prom video.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E21/scenes/S04E21_027"}}
{"id": "S04E21_028", "text": "[Scene: Central Perk, Chandler, Joey, and Phoebe are reading a book about things to do whilst in London.]\nChandler: All right, check it out. Check this out. It says here that theres a place you can go to rent videos of all the museums! (Reading from the book.) \"Its almost as good as being there.\"\nJoey: Its better! You cant go to a museum in your underwear!\nChandler: Well, You could, but... probably just the one time.\nJoey: I bet we could get videos of all the sites, get a VCR in our hotel room... we'd never even have to go outside!\nChandler: If we do that, we gotta get Die Hard.\nJoey: Oh-ho! I bet the British version is gooooood!\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 21, "episode_id": "S04E21", "episode_title": "THE ONE WITH THE INVITATION", "scene_number": 28, "scene_id": "S04E21_028", "location": "Central Perk", "scene_description": "Chandler, Joey, and Phoebe are reading a book about things to do whilst in London.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E21/scenes/S04E21_028"}}
