{"id": "S04E14_001", "text": "THE ONE WITH JOEYS DIRTY DAY\nWritten by: Wil Calhoun Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 1, "scene_id": "S04E14_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E14/scenes/S04E14_001"}}
{"id": "S04E14_002", "text": "[Scene: Monica and Rachel's, erm, Chandler and Joey's, Joey is getting ready for a fishing trip and Phoebe is asking him about the fishing lures. Ross is playing with the rod, and Monica is pretty much just watching the on goings.]\nPhoebe: (holding a lure) So now, what is this now?\nJoey: Guggly worm.\nPhoebe: (laughs and picks up another lure) And this?\nJoey: Glow-pop giggly jammer.\nPhoebe: (laughs harder) You make it so funny.\nMonica: (not wanting to be left out, picks up something) Hey umm, whats this?\nJoey: (examining it) Ohh, a hunk of sandwich from last year. (Monica drops the sandwich)\nRoss: (pretend fishing in the living room) Ohh, Gellers got one hooked! Ohh! Looks like a big one! Yeah, ohh! Ohh! (Swinging the rod back and forth) Its the classic struggle between man and(swings the rod and knocks over a lamp.) Someone knocked over a lamp.\nJoey: (going over and picking up the rod) Thats all right. Hey you guys, you know whats going to be great about the fishing trip this year? When my dad gets me out in the middle of the lake and gives me that, \"Joey, what are you doing with your life?\" stuff. I can say, \"Well, Im doing a movie with Charlton Heston dad. What are you doing with your life?\"\nAll: Great!\n(Chandler enters from his bedroom, all depressed and wearing sweat pants, with the chick and duck in tow.)\nChandler: You dont have to stop having fun just because Im here. Kathy didnt cheat on all of you. (To Joey) Well, except you. (They hug and Chandler goes into the bathroom with the chick and duck following him.)\nMonica: Hey, Joey, I dont think that you should leave Chandler alone. I mean its only been two days since he broke up with Kathy. Maybe you can go fishing next week?\nJoey: Look, theres nothing I can do for him right now, hes still in his sweat pants, thats still Phase One. Y'know? Ill be back for Phase Two, I would never miss Phase Two.\nMonica: Whats Phase Two?\nJoey: Gettin drunk and going to a strip club. \nRachel: How does going to a strip club help him better?\nRoss: Because there are naked ladies there.\nJoey: Which helps him get to Phase Three, picturing yourself with other women.\nRoss: There are naked ladies there too.\nJoey: Yeah.\nChandler: (opening the bathroom door and kicking out the chick and duck) Would you give me one minute!! Please.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 2, "scene_id": "S04E14_002", "location": "Monica and Rachel's", "scene_description": "erm, Chandler and Joey's, Joey is getting ready for a fishing trip and Phoebe is asking him about the fishing lures. Ross is playing with the rod, and Monica is pretty much just watching the on goings.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E14/scenes/S04E14_002"}}
{"id": "S04E14_003", "text": "[Scene: Bloomingdales, Rachel is still dressing Joshua. He is trying on a pair of pants.]\nJoshua: So, these will match the jacket you picked out for me last week?\nRachel: Um-hmm. (Joshua turns to look in the mirror and leaves Rachel staring at his ass.) There we go. There it is.\nJoshua: (turning around) Oh! You know what I need? \nRachel: Yeah!\nJoshua: Gloves. Brown, leather dress gloves.\nRachel: Oh, okay. Uhh, well lets see. (Grabs his hand.) Youre aboutwell uh, this one is large. And this one(Grabs the other hand.)\nJoshua: Also large?\nRachel: Yeah! Okay, two larges coming right up!\nJoshua: Okay.\nMr. Waltham: (entering) Rachel! Could I have a moment?\nRachel: Yes.\nMr. Waltham: I-I was wondering, my niece you see is in from Londonwell Shropshire really but yknowwell shes about your age I say. Anyway I have tickets for the opera, Die Fledermaus, and I was wondering if youd like to keep her company this evening?\nRachel: Sure. You got it. Great! \nMr. Waltham: Oh, good.\nRachel: Me, Fledermaus, great. I really(motions to Joshua.)\nMr. Waltham: Ohh! Yes of course, thank you, thank you, thank you so very much.\nJoshua: So(Holds out his hands as to say, \"Where are my gloves?\")\nRachel: So? (She puts her hands in his, totally forgetting about the gloves, and hoping for something more intimate.)\nJoshua: Gloves?\nRachel: Ohh! Right! Right, sorry, Ill be right back!\nJoshua: Uhh, actually yknow what, I kindaI have to take off. \nRachel: Oh.\nJoshua: But, I was curious; do you have any plans for tonight?\nRachel: No! Nothing!\nJoshua: I invested in this night-club and its opening tonight, would you like to come?\nRachel: Yeah! That would be great!\nJoshua: Youre into hardcore S&M right?\nRachel: (shocked) Well, I-I guessI\nJoshua: Kidding! (Rachel is relived) Im gonna get there early, but Im going to put you on the V.I.P list, okay? Look for me.\nRachel: Yeah, great, you betcha!\nMr. Waltham: (entering) I almost forget the tickets, didnt I?\nRachel: What?\nMr. Waltham: For you and Emily, tonight, Die Fledermaus.\nRachel: Oh. Oh, right.\nMr. Waltham: I think youll like it, it has two out of the three tenors.\nRachel: Oh yay!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 3, "scene_id": "S04E14_003", "location": "Bloomingdales", "scene_description": "Rachel is still dressing Joshua. He is trying on a pair of pants.", "characters": ["Joshua", "Rachel"], "firestore_path": "/episodes/S04E14/scenes/S04E14_003"}}
{"id": "S04E14_004", "text": "[Scene: Monica and Rachel's, erm, Chandler and Joey's, Chandler is in his sweats flinging playing cards into a pot.]\nChandler: Yknow, I cant believe Kathy did this too me. I really, thought that she was the one. I tell you what, from now on Im never getting out of this chair, ever! Okay? From now on, this chair is the one! You wanna what else is the one? My sweat pants!\nRoss: Come on, man! Just-just take the sweats off. Okay? Just take em off and well have some fun.\nJoey: (entering) Hey-hey!\nRoss: Hi!\nPhoebe: Hey!\nRoss: Catch any big fish? (Phoebe, Ross, and Monica all go over to him.)\nJoey: Oh my God, you guys have no idea. \nAll: (they all recoil from the smell emanating from him) Oh! God! Wow!\nMonica: You stink!\nRoss: Are you kidding?!\nJoey: Yeah, three days on the lake without a shower. Plus! I fell in that big tub of worms at the bait stand! Hey, how-hows he doing?\nRoss: He hasnt gotten out of that chair in two days.\nJoey: (goes over to Chandler) Hey buddy! Hows it going?\n(Chandler imitates retching and gets out of the chair.)\nJoey: (To the rest of the gang) Hey, see that? He just needed his pal to come home. All right, uh, Ive got to go memorise my lines. (Starts to go his bedroom) Me and Charlton Heston bright and early tomorrow morning! Yeah-yeah!\nRachel: (entering) Hey!\nRoss: Hey!\nRachel: Hey, Monica!\nMonica: Uh-oh, whats the matter?\nRachel: Ohh, its Joshua invited me to this fancy club opening tonight. But, I already told Mr. Waltham that I would take his niece to this dumb old opera. So What are you gonna do?\nMonica: I dont know sweetie.\nRachel: No! Help me!\nMonica: I cant! I have to work!\nRachel: Phoebe?\nPhoebe: I would, but I get my morning sickness in the evening. \nRachel: Ugh!\nPhoebe: Unless! She wants to spend the night holding my hair back for me.\nRachel: Ohh, gosh. You guys, come on, this isI have to meet Joshua! This is my one chance for him to see the fun Rachel. Yknow the \"Wouldnt it be great if she was my wife\" Rachel. Ohh, all right! Are Joey and Chandler back?\nMonica: No, Chandlers still in Phase One, and Joeys that thing you smell.\nRachel: Ohh! (Realises that Ross is in the room.) Hi!\nRoss: Hi!\nRachel: So.\nRoss: No.\nRachel: Ohhhh, come on!!!\n(Theres a knock on the door.)\nMonica: I think shes here.\nRachel: No! Wait! Wait-wait! Ross, please!\nRoss: You want me to take some girl Ive never met to the opera so you can go to a club and flirt with some guy, hmm, that-that is a toughie.\nMonica: (looking out the peephole) Ohh, shes looking down the hall. Oh! She looked right at me! Oh wait, you cant see people through that little hole, can you? (Goes back to the door.) Hello!\nWoman: Hello! (Monica screams)\nRachel: Ill be right there! (to Ross) Okay, Ross, please come on! I thought we have moved on! I thought weve gotten to a place where we could be happy for each other! I mean was that just me?\nRoss: All right, Ill do it.\nRachel: Oh thank you! Thank you, thank you, thank you! (Monica opens the door.) Emily?\nEmily: Yes.\nRachel: Im Rachel Green.\nEmily: Thank goodness.\nRachel: Theres been a teeny-teeny change in plans. It turns out that Im not free tonight. So\nEmily: Really?! Well, thats just lovely, isnt it? I mustve missed your call, even though I didnt leave the flat all day. \nRachel: Oh well, no I\nEmily: Oh, no-no-no, thats not rude! Its perfectly in keeping with a trip that Ive already been run down by one of your wiener carts, and been strip-searched at John F. Kennedy Airport, apparently to you people, I look like someone whos got a balloon full of cocaine stuffed up their bum.\nMonica: I-I-I think you look great.\nEmily: Good night, it was very nice to meet you all. (Storms out.)\n(Pause)\nRachel: Ill get her.\nRoss: Please hurry.\nPhoebe: Dont you just love the way they talk?!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 4, "scene_id": "S04E14_004", "location": "Monica and Rachel's", "scene_description": "erm, Chandler and Joey's, Chandler is in his sweats flinging playing cards into a pot.", "characters": ["All", "Chandler", "Emily", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S04E14/scenes/S04E14_004"}}
{"id": "S04E14_005", "text": "[Scene: Monica and Rachel's, erm, Chandler and Joey's, the next morning, Monica and Phoebe are eating breakfast.]\nPhoebe: Ohh!\nMonica: What?\nPhoebe: It kicked! I think the baby kicked!\nMonica: Oh my God!\nPhoebe: Oh no wait, oh no, the elastic on my underwear busted.\nJoey: (running from his bedroom) Oh my God! I overslept! I was supposed to be on the set a half an hour ago! I gotta get out of here!\nMonica: Oh wait, Joey, you cant go like that! You stink!\nJoey: Look, I know I feel asleep before I could shower and now I dont have time! Theyre just ten blocks away, if I run, I can make it.\nMonica: Yeah. Run ten blocks, thatll help the smell.\n(He opens the door to reveal Rachel.)\nRachel: Heywhoa, slow down. (Gets a whiff of him) No, keep moving. (Joey runs off.) Wow!\nMonica: So? How did it go with Joshua last night?\nRachel: Well, I didnt see Joshua last night, but I did punch a girl in the face.\nMonica: What?\nPhoebe: Why?\nRachel: The whole night was horrible, it was pouring down rain, and when I got there, there was no Rachel Green on the list, but there was a Rachel Greep.\nPhoebe: Ohh! So, did you get to meet her?\nRachel: No, there is no Rachel Greep, but then this other girl overheard us and she was all, \"Im Rachel Greep! Im Rachel Greep!\" and he let her right in. \nMonica: So you hit her in the face?\nRachel: No, she was already in, but then this big bitch behind me tried to steal my umbrella, so I clocked her. Ohhh! I cant believe this, all I wanted was a few hours outside of work to see Joshua, so he can go ahead and start falling in love with me.\nPhoebe: (going over to comfort her) Aww, Pheebs.\nRachel: Honey, thats youre name.\nPhoebe: Thats short for Phoebe?! I thought that was just what we called each other!\n(Chandler enters from his bedroom.)\nMonica: Hey! Youre wearing pants!\nChandler: Thats right! Where are the guys? Im ready to get drunk and see some strippers.\nMonica: Its 9:30 in the morning!\nChandler: They got a breakfast buffet.\n(The phone rings and Monica answers it.)\nMonica: Hello. (Listens) Oh, hey Ross!\nChandler: Ooh, let me talk to him!\nMonica: Oh-oh, my God!\nChandler: Well, can I just\nMonica: (to Chandler) Shh!! (On phone) Wait, what?\nChandler: Shes shhing me! Its my phone and shes shhing me!\nPhoebe: Shhh!! Please! Whats he saying?\nMonica: Hes with Emily at a Bed and Breakfast in Vermont!\nPhoebe: What? Oh my God!\nRachel: What? Who the hell is Emily(realises) noooo!!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 5, "scene_id": "S04E14_005", "location": "Monica and Rachel's", "scene_description": "erm, Chandler and Joey's, the next morning, Monica and Phoebe are eating breakfast.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E14/scenes/S04E14_005"}}
{"id": "S04E14_006", "text": "[Scene: Chandler and Joey's, erm, Monica and Rachel's, scene continued from earlier.]\nRachel: Theyre in Vermont!! How could this happen?! (She waves her arms franticly and hits Chandler.)\nChandler: Ow!\nRachel: Howhow did end up in Vermont with that awful witch?! (She hits Chandler again.)\nChandler: Maybe, she doesnt hit him all the time. \n[cut to Ross in Vermont, talking on the phone.]\nRoss: When we first met her, she was soaking, her feet were wet! Who wouldnt be miserable? Im telling you when I got her into a dry pair of shoes, she was a totally different person.\nEmily: (rushing in) Ross! Come quickly! Theres a deer just outside eating fruit from the orchard!\nRoss: Ive gotta go, theres a deer just outside eating fruit from the orchard! (He hangs up and runs out.)\n[cut back to Chandler and Joeys.]\nMonica: He had to go, theres a deer just outside eating fruit from the orchard.\nRachel: I dont get this! She was horrible! (She hits Chandler, yet again.)\nChandler: Okay, Im going to go stand over there. (Points and moves into the living room.)\nMonica: Why do you care so much anyway?\nRachel: I dont care! All right, yknow what Im just upset that Im getting nowhere with Joshua thatyknow what still, you do not meet someone and go flitting off to Vermont!\nMonica: Well, when you first met Barry, you flitted off to Vail.\nRachel: Oh, yknow, would you just for once, not remember everylittlething!! (Storms out.)\nChandler: So yknow, uh, whens he getting back?\nMonica: A couple of days.\nChandler: Yknow, I knew something like this was going to happen. (He starts to take off his pants, revealing that he is still wearing his sweat pants.)\nMonica: What are you doing?! Chandler! You cant just go back a phase!\nChandler: Yes you can. Youre thinking about time, you cant go back in time.\nPhoebe: Well, look, why dont you just, why dont you do your Phase Two strip club thing with us.\nMonica: Yeah, come on, we can be guys!\nChandler: (laughs) No you cant.\nPhoebe: Come on! Let us be guys! Maybe we want to be guys!\nChandler: You dont want to be guys, youd be all hairy and wouldnt live as long. (Starts to go to his bedroom)\nPhoebe: Yknow you, you just stop being such a wuss and get those off and you come with us and watch naked girls dance around!!\nChandler: Okay. (Starts to cry)\nPhoebe: Im sorry. (Goes and hugs him)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 6, "scene_id": "S04E14_006", "location": "Chandler and Joey's", "scene_description": "erm, Monica and Rachel's, scene continued from earlier.", "characters": ["Chandler", "Emily", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E14/scenes/S04E14_006"}}
{"id": "S04E14_007", "text": "[Scene: Silvercup Studios, Joey is just arriving for his scene.]\nJoey: (rushing in) Hey! Joey Tribbiani! Im here! Im here! \nThe A.D: Calm down, we got time, were running a little late.\n(Just then, Charlton Heston walks out of his dressing room and starts eating a liquorice whip.)\nJoey: Look at that, Charlton Heston eating a liquorice whip!\nThe A.D: Yeah, we loves em. Ive never seen him with(He gets a whiff of Joey and starts smelling around.)\nJoey: (trying to act like hes not the one that stinks.) Whoa! Yeah, what the hell is that? What smells so bad?\nThe A.D: You.\nJoey: Yknow, I can see why you think that, but ah, actually, you know who I think it is?\nThe A.D: You?\nJoey: No-no, its uh, its Heston.\nThe A.D: What?\nJoey: Yeah, the man wreaks! Smells like he went on a three day fishing trip and then ate some liquorice. \nThe A.D: Theres no way he smells, hes the only one around here with a shower in his dressing room.\nJoey: Really, a shower huh? And uh, which-which room might that be?\nThe A.D: The one with \"Heston\" on it.\nJoey: Interesting.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 7, "scene_id": "S04E14_007", "location": "Silvercup Studios", "scene_description": "Joey is just arriving for his scene.", "characters": ["Joey"], "firestore_path": "/episodes/S04E14/scenes/S04E14_007"}}
{"id": "S04E14_008", "text": "[Scene: A strip club, the girls are there with Chandler, who isnt enjoying himself.]\nMonica: (coming back to the stage and sitting next to Chandler) Okay, Ive got some Ones, you wanna put them in her panties?\nChandler: No thanks, Mom!\n(A man sits down next to Phoebe and lights up a cigarette.)\nPhoebe: Oh, no umm, hi, that-that, you have to put that out, cause Im pregnant.\nThe Cigarette Smoking Guy: (No, not the Cigarette Smoking Man from The X-Files.) Well, maybe you and your baby should go to another strip club.\nPhoebe: Ha-ha, its not my baby, ha-ha-ha! (He leaves.)\n(The dancer finishes and everyone claps.)\nMonica: Very good, (getting up and sliding a One into the dancers hot pants) so good.\nPhoebe: (doing the same) I really, really enjoyed it. Very exotic.\nRachel: (joining them) Well, I just checked our messages and Joshua didnt call. I mean youd think hed be worried about me not showing up at his club. Ugh, you know what makes it so much worse, Ross is all happy in Vermont!\nPhoebe: Come on! Look where you are!!\nMonica: (to the waitress) When you get a sec, another round of daiquiris.\nPhoebe: Remember, a virgin for me please.\nMonica: Oh! And dont let me leave without getting the name of that carpet guy.\nChandler: Ahh, come on! Yknow whatyknow what, I think Im just gonna go home and call Kathy.\nPhoebe: Well, if you think it will help.\nChandler: No! That was a test! In a couple of hours Im gonna get really drunk and wanna call Kathy and you guys are gonna have to stop me! And then after that, Im gonna get so drunk, Im gonna wanna call Janice\nPhoebe: You should! How is she?\nChandler: Ohhh!!\nMonica: I think somebody needs another lap dance. (Motions for one.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 8, "scene_id": "S04E14_008", "location": "A strip club", "scene_description": "the girls are there with Chandler, who isnt enjoying himself.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "The Cigarette Smoking Guy"], "firestore_path": "/episodes/S04E14/scenes/S04E14_008"}}
{"id": "S04E14_009", "text": "[Scene: Silvercup studios, Joey is taking a shower in Charlton Hestons dressing room. Heston enters the room, Joey panics, and walks over to the shower and confronts Joey about the use of his shower.]\nCharlton Heston: Hello! Whos in there? (He opens to curtain to reveal a naked and wet Joey.)\nJoey: How ya doin?\nCharlton Heston: Who in the hell are you?\nJoey: I guess you wouldnt believe me if I said I was Kurt Douglas, huh?\nCharlton Heston: Put some pants on kid so I can kick your butt.\nJoey: No-no-no, no, no, wait. You see, Im an actor, Joey Tribbiani, Im doing a scene with you today, and well, I stink.\nCharlton Heston: (shocked) Youre in this picture?\nJoey: Yeah-yeah, Im one of the cops that wont work with you cause you a lose cannon. Anyway, look, Im really sorry, but I stink!\nCharlton Heston: Joey, right?\nJoey: Yeah.\nCharlton Heston: (tosses him a towel, motions for him to get out of the shower and sits down on the couch) Every actor at one time or anotheropp! (Joey tries to sit down next to him and Heston makes him sit somewhere else.) Every actor thinks he stinks, even Lawrence Oliver at sometimes thought he stank, Bob Redford wont even watch himself.\nJoey: Oh no-no-no, you dont understand\nCharlton Heston: Listen to me!\nJoey: Oh yeah, yeah.\nCharlton Heston: I dont know one actor worth his salt that didnt say at one time or another, \"God, I stink!\" Hell, I just did a scene out there, first take, I stunk the place up. But, the important thing you must remember, no matter how badly you think you might stink, you must never, ever bust into my dressing room and use my shower! Do you understand me?!\nJoey: Yes sir! Yes sir, Im-Im(he starts to leave)\nCharlton Heston: Wait a minute! Take your pants.\nJoey: Yeah. Oh, yeah.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 9, "scene_id": "S04E14_009", "location": "Silvercup studios", "scene_description": "Joey is taking a shower in Charlton Hestons dressing room. Heston enters the room, Joey panics, and walks over to the shower and confronts Joey about the use of his shower.", "characters": ["Charlton Heston", "Joey"], "firestore_path": "/episodes/S04E14/scenes/S04E14_009"}}
{"id": "S04E14_010", "text": "[Scene: Chandler and Joey's, erm, Monica and Rachel's, Chandler, Monica, and Phoebe are returning from the strip club.]\nMonica: So, we did okay at the strip club, right?\nChandler: Oh yeah, that was great. Thanks to you, the hottest cocktail waitress there is quitting to teach the third grade!\nRachel: (entering) I cant believe it! He still hasnt called.\nPhoebe: Who, Josh?\nRachel: Its Joshua.\nMonica: What, he doesnt like Josh?\nRachel: No, I dont.\nChandler: All right, well Im gonna put my sweats back on.\nPhoebe: Oh no! Wait! Wait! Okay, yknow what, you were right, you were right. We really werent great at being guys, but you know why? Because were girls.\nChandler: Yeah?\nPhoebe: And do you know what girls are really good at?\nChandler: Stripping!\nPhoebe: No, listening! Sit! Yknow, maybe it would just really, really help if you would just talk.\nRachel: Yeah, come on! Whats going in on in there? (Pats his chest.)\nMonica: Yeah. And yknow, if you wanna cry, thats okay too.\nChandler: Okay, look, Im gonna have to ask you all to leave.\nMonica: Come on! Chandler!\nChandler: Look, forget it. We tried, but Phase Three is a lost cause, Okay? Those strippers were insanely hot, and I couldnt picture myself with any of them. (Sits back in disgust.)\nMonica: They really were pretty, werent they? (Rachel and Phoebe both agree)\nPhoebe: Yeah, I really liked that fighter pilot one.\nMonica: Oh, Candy! She was so spunky! \nPhoebe: Yeah.\nMonica: Yknow, I think if I were going to be with a woman. (Chandler is intrigued.) Itd, itd be with someone like Michelle, she was so oh, she was so petite.\nRachel: See, I dont know, for me it would have to Chantal.\nMonica: Oh, Chantal!\nRachel: Oh my goodness, she had the smoothest skin! I mean when I stuck that dollar bill in her g-string and grazed her thigh\nChandler: (jumping up) Phase Three! I just achieved Phase Three!\nMonica: Really?!\nChandler: I am totally picturing you with all those women!\nMonica: Thats-thats not Phase Three.\nChandler: Well, Im there too!\nRachel: Well, are we all together? Like in a group?\nChandler: Stop it! Youre killing me! I think I just moved on to Phase Four!\nPhoebe: Oh! What is that? What is that?\nChandler: Where I dont want to have a relationship ever! I just want to have sex with strippers and my friends!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 10, "scene_id": "S04E14_010", "location": "Chandler and Joey's", "scene_description": "erm, Monica and Rachel's, Chandler, Monica, and Phoebe are returning from the strip club.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E14/scenes/S04E14_010"}}
{"id": "S04E14_011", "text": "[Scene: Central Perk, the gang is there, minus Ross. Chandler is trying to cheer Joey up about missing Phase Two.]\nChandler: Come on, let me see that smile.\nJoey: I dont wanna.\nChandler: Please?\nJoey: I wanted to go to the strip club!\nChandler: I know, I know, but youre gonna have plenty of chances. There are literally thousands of women out there just waiting to screw me over.\nJoey: Yeah, all right. (Ross enters.)\nMonica: Hey!\nRoss: Hey!\nPhoebe: Heyooh so, how was Vermont?\nRoss: Emily isincredible. I mean there-there are no words to describe it, I mean the whole weekend was like a dream. (Sees Rachel coming back from the bathroom.) Oh! And you! Rach!\nRachel: Oh, hey!\nRoss: Hey! You were so right!\nRachel: What?\nRoss: Uh, what you said, about us being in a place where we could finally be happy for each other. \nRachel: Oh, hmm.\nRoss: I mean, I, I-I admit I-I wasnt quite there. Yknow, I mean the thought of you and that-that Josh guy\nRachel: Joshua.\nRoss: Joshuaguy at that club, dancing and having a good time, the thought of it kindayknow.\nRachel: Yeah, I\nRoss: But now! Im there! Im totally there! Im-Im finally where you are!\nRachel: Oh, thank goodness!\nRoss: Yeah, and-and thank you for Emily.\nRachel: Oh, no problem. Im so glad I could help. Happy for you. (She playfully punches him.)\nRoss: Happy for you. (He punches her back.)\nRachel: No, happy for you! (Hits him harder.)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 11, "scene_id": "S04E14_011", "location": "Central Perk", "scene_description": "the gang is there, minus Ross. Chandler is trying to cheer Joey up about missing Phase Two.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E14/scenes/S04E14_011"}}
{"id": "S04E14_012", "text": "[Scene: Chandler and Joey's, erm, Monica and Rachel's, Chandler is there and is getting ready to direct a bunch of strippers, Monica, Rachel, and Phoebe on what to do in the upcoming orgy of lesbian lust. Yes, its a dream sequence, this isnt cable.]\nChandler: All right ladies, heres what were gonna do. (Points to a stripper.) You are gonna take off my clothes. (To another two strippers) You two, go get the oils. (To another stripper) And you just constantly scream at the top of your voice, \"Chandlers the king! Chandlers the king!\"\nPhoebe: I-I wanna be with her, (points to the stripper next to her) I like her.\nChandler: Oh, thats fine! Go with your instincts, go with your instincts.\nMonica: Wait, now, what am I doing again?\nChandler: Come on! Would you please pay attention, I could wake up at any moment!\nThe Cigarette Guy: Hi, Im Joshua, Im here to pick up Rachel.\nRachel: No-no-no, that not Joshua.\nChandler: What do you want from me, Ive never met the guy. So anyway, Rachel, Im sorry you cant stay, (Rachel is upset about leaving the orgy with the cigarette guy.) but the rest of us have a lot of work to do. (The cigarette guy starts rubbing Chandlers back.) What are you doing? (The guy just nods) All right, listen, Ive got to wake up!\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 14, "episode_id": "S04E14", "episode_title": "THE ONE WITH JOEYS DIRTY DAY", "scene_number": 12, "scene_id": "S04E14_012", "location": "Chandler and Joey's", "scene_description": "erm, Monica and Rachel's, Chandler is there and is getting ready to direct a bunch of strippers, Monica, Rachel, and Phoebe on what to do in the upcoming orgy of lesbian lust. Yes, its a dream sequence, this isnt cable.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "The Cigarette Guy"], "firestore_path": "/episodes/S04E14/scenes/S04E14_012"}}
