{"id": "S04E09_001", "text": "THE ONE WHERE THEY'RE GONNA PARTY!\nWritten by: Andrew Reich & Ted Cohen Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 1, "scene_id": "S04E09_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E09/scenes/S04E09_001"}}
{"id": "S04E09_002", "text": "[Scene: Outside Central Perk, Monica and Phoebe are showing everyone the van they bought for the catering business. Its an old Dodge van, that has a cartoon woman riding on a dragon painted on the side of it.]\nPhoebe: Okay!\nMonica: Come on, no peeking! (They are leading the gang out with there hands over their eyes.)\nChandler: Our eyes are closed and were about to cross the street. Very good.\nPhoebe: Okayyyyy, open up! \n(They open their eyes and are stunned at the van.)\nRoss: What did you want to show us? Because all I can see is this bitchin' van!\nPhoebe: Yeah, its for our catering business!\nJoey: I think I know that girl.\nMonica: All right, umm, were not gonna really keep it this way though.\nRachel: No?\nPhoebe: No, were gonna paint over the sword, and replace it with a baguette. \nRachel: Oh!\nPhoebe: And also, we dont know what to do with this. (She turns on a switch and the girls nipples light up.)\nJoey: Oh yeah, I definitely know her.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 2, "scene_id": "S04E09_002", "location": "Outside Central Perk", "scene_description": "Monica and Phoebe are showing everyone the van they bought for the catering business. Its an old Dodge van, that has a cartoon woman riding on a dragon painted on the side of it.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E09/scenes/S04E09_002"}}
{"id": "S04E09_003", "text": "[Scene: Monica and Rachel's, the gang is all there.]\nMonica: (to Phoebe) Remember that guy from cooking school I told you about that put cilantro with everything?\nPhoebe: Oh sure, Cilantro Larry.\nMonica: Well, Im gonna fill in for him as food critic for the Chelsea Reporter.\nMonica: Wow, Monica! What an amazing opportunity to influence dozens of people.\nPhoebe: How could you say yes, what about our catering business?\nMonica: Oh no-no-no, its only one night a week, and plus I get to take all of you out for a lot of free dinners.\nAll: Yay!!\nPhoebe: Oh, in that case(hops up and down in joy)Yay! (Monica looks confused) That was me hopping on board.\nMonica: Oh.\nChandler: (entering) Hey, you guys! Hey, Ross, quick question for ya. Are you ready to party?\nRoss: I dont know, I could maybe go out for a couple of beers, but theres this thing about bumblebees on The Discovery Channel that I was planning to watch.\nChandler: No-no, I dont think you heard me. Are you ready to party?!\nRoss: Nooo!! Gandolf?! Gandolf is coming to town?\nChandler: Kathys with her parents, I have nothing to do, so tomorrow we are partying with Gandolf dude!\nRoss: Dude, we are sooo gonna party!\nPhoebe: Wow! Okay, dude alert! And who is this guy?\nRoss: Mike \"Gandolf\" Ganderson, only like the funest guy in the world.\nChandler: Im gonna call and get off work tomorrow!\nRoss: Im gonna call after you!\nChandler: This is gonna be soo cool, dude, we never party anymore!\nChandler and Ross: Woooo!!!\nMonica: All right, were you guys smoking something in the back of our van?\nJoey: Really. And what do you mean you never have fun anymore? You have fun with me, remember that time we saw those strippers and you paid me 50 bucks to eat that book?\nRoss: Joey, you are gonna love this guy. Gandolf is like the party wizard!\nJoey: Well, why do you call him Gandolf?\nRoss: Gandolf the wizard. (Joey is still confused) Hello! Didnt you read Lord of the Rings in high school?\nJoey: No, I had sex in high school.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 3, "scene_id": "S04E09_003", "location": "Monica and Rachel's", "scene_description": "the gang is all there.", "characters": ["All", "Chandler", "Chandler and Ross", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S04E09/scenes/S04E09_003"}}
{"id": "S04E09_004", "text": "[Scene: Rachels office, Rachel and Sophie are sitting at their desks working as Joanna walks in.]\nRachel: Oh, uh, Joanna I was wondering if I could ask you something. Theres an opening for an assistant buyer in Junior Miss\nJoanna: (interrupting) Okay, but that would actually be a big step down for me.\nRachel: Well, actually, I meant for me. The hiring committee is meeting people all day and\nJoanna: Oh. Well, I wish I could say no, but you cant stay my assistant forever. Neither can you Sophie, but for different reasons.\nRachel: God, I am so glad you dont have a problem with this, because if you did, I wouldnt even consider applying.\nJoanna: Really? Well, in that case\nRachel: (interrupting) And thats Im so glad theres no problem.\nJoanna: Thats fine, actually Im on the hiring committee, so therell be at least one friendly face.\nRachel: Ohh! Thats great!\nJoanna: You know, Junior Miss is where I started. Oh, I had to sleep with the ugliest guy to get that job.\nRachel: Really?!\nJoanna: No-ho-ho! (pause) Yeah. (pause) I mean, no-no-no-no-no, dont you worry, Im sure with your qualifications you wont need to sleep with some guy to get that job. Although, I might need some convincing.\nRachel: Well, I, umm\nJoanna: Kidding! God, I feel wild today!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 4, "scene_id": "S04E09_004", "location": "Rachels office", "scene_description": "Rachel and Sophie are sitting at their desks working as Joanna walks in.", "characters": ["Joanna", "Rachel"], "firestore_path": "/episodes/S04E09/scenes/S04E09_004"}}
{"id": "S04E09_005", "text": "[Scene: Chandler and Joey's, Chandler is getting ready to party.]\nChandler: Oh man! I am so excitedI may vomit!\nJoey: Will you calm down, hes just a human guy.\nChandler: Look you dont understand, Gandolf is amazing. Yknow youre never know whats gonna end up happening, you go out for a couple of beers and end up on a fishing boat to Nova Scotia! \nJoey: Really?!\nChandler: Oh yeah, its beautiful country up there.\nRoss: (entering) Hey! Okay! I got my passport, fresh socks, and a snake bite kit!\nChandler: Its not gonna be exactly like last time.\nJoey: All right, Ill see you guys.\nChandler and Ross: Whoa-whoa-whoa!\nChandler: Whoa-wh-wh-whoa-whoa-whoa-whoa!\nJoey: I have an audition, but Ill definitely hook up with you later. Where are you gonna be around noon?\nRoss: Somewhere maybe along the equator?\nJoey: Okay. (leaves as the phone rings)\nChandler: (answering it) Hello. (listens) (to Ross) Its Gandolf!!! (on phone) So, are you in town? (listens) (disappointed) Oh, well, well maybe next time then. (Hangs up)\nRoss: What happened?\nChandler: Hes not gonna make it, hes stuck in Chicago.\nRoss: Ohh, man! Chicago, is sooo lucky!\nChandler: Stupid, useless Canadian money!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 5, "scene_id": "S04E09_005", "location": "Chandler and Joey's", "scene_description": "Chandler is getting ready to party.", "characters": ["Chandler", "Chandler and Ross", "Joey", "Ross"], "firestore_path": "/episodes/S04E09/scenes/S04E09_005"}}
{"id": "S04E09_006", "text": "[Scene: Bloomingdales, Rachel is meeting with Mr. Posner, Mrs. Lynch, and Joanna the hiring committee.]\nMr. Posner: You have a very impressive resume, Ms. Green. I especially like what I see here about implementing a new filing system.\nRachel: Thank you.\nJoanna: Filing system? Oh-oh! You mean those-those little colored labels you put on all the folders? (to the committee) It certainly did brighten up the inside of the filing cabinets. \nRachel: Well, they uh, they-they do more than that.\nMrs. Lynch: I notice that youve been trusted with a lot of rather important responsibilities.\nRachel: Yes, Joanna really has been an incredible mentor to me.\nJoanna: Oh. And Rachel has been really incredible in getting my morning bagel for me. Its amazing how she gets it right almost every time!\nRachel: I-I-I of course, I have more responsibilities than that.\nJoanna: Oh yes, well theres the coffee too. (to the committee) Rachel can carry two things at once!\nMr. Posner: Yes, thats very good. Now a uh, big part of this job is cultivating personal relationships, especially with designers.\nRachel: Yes, I realize that\nJoanna: (interrupting) And Rachel shouldnt have any problem with that. The only problem might be getting a little too friendly, if you know what I mean.\nRachel: I love working with designers!\nJoanna: With them, under them, whats the difference? Eh, Rach?", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 6, "scene_id": "S04E09_006", "location": "Bloomingdales", "scene_description": "Rachel is meeting with Mr. Posner, Mrs. Lynch, and Joanna the hiring committee.", "characters": ["Joanna", "Rachel"], "firestore_path": "/episodes/S04E09/scenes/S04E09_006"}}
{"id": "S04E09_007", "text": "[Scene: Monica and Rachel's, Phoebe is there as Monica enters carrying a huge stack of newspapers.]\nMonica: Hey! My first review is out!\nPhoebe: Ohh! Oh, the Chelsea Reporter, ohh, this used to keep me so warm.\nMonica: All right, look at my on the back page.\nPhoebe: Oh, okay! (reading) \"Would I go back to Allesandros? Sure, but Id have to order two meals, one for me and one for the guy pointing the gun to my head.\" (to Monica) Wow! You really laid into this place.\nMonica: Hey, they dont pay me a penny a word to make friends.\nPhoebe: Ooh, I gotta go. I found a guy that who could fix up the van for catering.\nMonica: Oh! Do you need me to go with you?\nPhoebe: No-no, its okay. But are we sure we dont want the waterbed?\nMonica: Havent we made this decision?\nPhoebe: Yeah, all right. (starts to leave)\nMonica: Bye!\nPhoebe: Bye!\n(The intercom buzzes.)\nMonica: (answering it) Who is it?\nAllesandro: Its Allesandro, from Allesandros.\nMonica: Oh my God.\nAllesandro: I want to talk to you about your review.\nMonica: Oh my God, oh my God. (on intercom) Call me on the phone!\nAllesandro: Why? So you could hang up on me?\nMonica: Look, I-Im never gonna let you up so you may as well just go away.\nAllesandro: Just give me a chance too\nPhoebe: (on intercom) Hey, do you need to get in? Here you go.\nMonica: No! Phoebe!\nPhoebe: Hey, Monica!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 7, "scene_id": "S04E09_007", "location": "Monica and Rachel's", "scene_description": "Phoebe is there as Monica enters carrying a huge stack of newspapers.", "characters": ["Allesandro", "Monica", "Phoebe"], "firestore_path": "/episodes/S04E09/scenes/S04E09_007"}}
{"id": "S04E09_008", "text": "[Scene: Monica and Rachel's, continued from earlier.]\nAllesandro: (entering) I want a retraction! Our food is not inedible swill!\nMonica: I couldnt eat it! I had five friends who couldnt eat it, and one of them eats books.\nAllesandro: Well our service is not grossly incompetent.\nMonica: The waiter carried the breadsticks in his pants!\nAllesandro: Well, you said that we except the Discover Card, which we do not!\nMonica: All right, that Ill retract. But I stand by my review, I know food and that wasnt it. Youre marinara sauce tasted like tomato juice! You should serve it with vodka and a piece of celery. \nAllesandro: Hey! Im proud of that sauce, its delicious.\nMonica: Oh my God! You own an Italian restaurant and you think that tastes good?! Where are you even from?\nAllesandro: (shyly) Lebanon.\nMonica: Hand me those tomatoes, Im gonna show you what it should taste like! Come on, hand me them.\nAllesandro: How long is this gonna take? Cause I got another critic to go yell at.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 8, "scene_id": "S04E09_008", "location": "Monica and Rachel's", "scene_description": "continued from earlier.", "characters": ["Allesandro", "Monica"], "firestore_path": "/episodes/S04E09/scenes/S04E09_008"}}
{"id": "S04E09_009", "text": "[Scene: Rachels office, Rachel is confronting Joanna about her interview.]\nRachel: (entering Joannas office) Umm, Joanna? I wanna talk about that interview.\nJoanna: I thought it went very well.\nRachel: No! It didnt! Thats what I want to talk to you about. (starts to break up) Now, just to brief you (starts to cry) I may cry, but they are not tears of sadness or of anger, but just of me having this discussion with you.\nJoanna: Rachel, please, dont make a scene.\nRachel: Theres nobody here!\nJoanna: Sophie, get in here! (Sophie enters) You see! Now youre making Sophie uncomfortable!\nSophie: Shes not making me uncomfortable.\nJoanna: Congratulations! You now just crossed the line into completely useless. Get out. (Sophie starts to cry and leaves)\nRachel: Do you want me to quit?\nJoanna: What?! What would make you think that?\nRachel: Well of those things that you said in the interview, I mean if you believe any of them, I must not be a very good assistant. Yknow what? I am just gonna pack up my desk, (She goes over to get all of her belongings from the desk, which amount to a muffin and a pen) and I will be gone by the end of the day! (Realizes she has nothing.) Well, I guess theres no use to me sticking around til the end of the day! (Starts to leave.)\nJoanna: Wait-wait-wait-wait! You can put your sad little muffin back in its drawer. If you must know the truth, I didnt want to lose a perfectly good assistant.\nRachel: What?\nJoanna: Thats why I said all those things about your flirting and your drinking\nRachel: My drinking? \nJoanna: Oh, I mustve said that after you left.\nRachel: Said what? Exactly.\nJoanna: That you enjoyed the occasional drinking binge.\nRachel: Oh my God!! Ohh, that is it! Im leaving! You are just a horrible person!\nJoanna: Wait-wait-wait-wait-wait-wait-wait-wait!! If youre gonna get all sensitive about it! I dont want to lose you. What if I, create a position for you? Ill make you an assistant buyer in this department.\nRachel: Say more things like that.\nJoanna: You can have your own office, and a raise! Effective tomorrow.\nRachel: Id need an expense account.\nJoanna: Done!\nRachel: And an assistant.\nJoanna: Sophie, get in here! (Sophie peeks in around the corner)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 9, "scene_id": "S04E09_009", "location": "Rachels office", "scene_description": "Rachel is confronting Joanna about her interview.", "characters": ["Joanna", "Rachel", "Sophie"], "firestore_path": "/episodes/S04E09/scenes/S04E09_009"}}
{"id": "S04E09_010", "text": "[Scene: Chandler and Joey's, Ross and Chandler are watching TV as Joey enters.]\nJoey: Hey! What are you guys doing here? I thought youd be out partying with Gandel-worf.\nRoss: Its Gandolf, and hes not coming.\nJoey: So youve been sittin around here all mornin?\nRoss: No! I balanced my checkbook. \nChandler: Yeah, and I-I gave first names to all of the foosball players.\nRoss: I cant believe he didnt come!\nJoey: So what if he didnt come! We can still go out and party ourselves!\nChandler: Oh-no, yknow with Gandolf wed be out all night!\nRoss: Yeah! Wed meet, wed meet total strangers, and hang out with them!\nJoey: Well, we could do that! \nRoss: Theres other stuff too.\nJoey: Well do it all, and better! Look, after tonight, Gandolf will want to party with us, dude! Come on!\nRoss: Yeah!\nJoey: Yeah!\nRoss: Yeah!!\nJoey: Yeah!! \nRoss: Its not like we dont know how to party!!\nJoey: Yeah! All right? Lets go!\nChandler: And may-maybe we could end up on a boat again?\nJoey and Ross: Yeah!!!\nChandler: All right!!\nRoss: (to Chandler) Hey-hey-hey, when uh, when were we on a boat?\nChandler: Remember that really cold morning, you woke up and those dogs were licking your face?\nRoss: Yeah.\nChandler: Well, those were seals, man.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 10, "scene_id": "S04E09_010", "location": "Chandler and Joey's", "scene_description": "Ross and Chandler are watching TV as Joey enters.", "characters": ["Chandler", "Joey", "Joey and Ross", "Ross"], "firestore_path": "/episodes/S04E09/scenes/S04E09_010"}}
{"id": "S04E09_011", "text": "[Scene: Monica and Rachel's, Rachel is entering, excited.]\nRachel: Hey Mon, little question for ya! How do you think this suit will look on an assistant buyer?\nMonica: Okay, the owner of Allesandros came over to yell at me, but instead I made him some sauce, and he offered me the job as head chef!!\nRachel: Oh my God!! You just ruined the thing I was practicing the whole way home, but Im soo happy!\nMonica: Can you believe it? I finally get to run my own kitchen!\nRachel: Ohh, youve waited soo long. \nPhoebe: (entering) Hey!\nRachel: Hey, Pheebs, quick question for ya.\nPhoebe: Yeah.\nRachel: How do you think this suit would look on an assistant buyer at Bloomingdales?\nPhoebe: I dont know, it would totally depend on her coloring and (realizes) You got the job!!\nRachel: Yes!!!\nMonica: You got the job?! Why didnt you tell me?\nRachel: Ohh, its gonna be so great! Im gonna get to help decide what we sell, Im gonna have an office with walls and everything. (turns to Monica) Im gonna have walls!\nPhoebe: Okay, is this the day of good news or what? I got us a job! The wedding reception.\nMonica: Ohh! Umm, Phoebe, I kinda need to talk to you about that. (Rachel excuses herself) Umm, well I-I-I think it might be time for me to take a step back from catering.\nPhoebe: But weve only had one job.\nMonica: I know, but now we have this second one and it just, it feels like its snowballing, yknow?\nPhoebe: Yeah! What are you saying?\nMonica: I got offered the head chef job at Allesandros.\nPhoebe: What?\nMonica: Its okay, cause y'know what? You dont really need me for the business.\nPhoebe: Youre the cook! With out you its just me driving up to peoples houses with empty trays and asking for money!\nMonica: All right. But umm, I-I-Ill pay you back all the money you invested, and you can keep the van.\nPhoebe: For what? I cant believe this! I gotta get out of here. (leaves) \nMonica: Phoebe, wait a minute! (runs after her, leaving Rachel alone)\nRachel: Im an assistant buyer!!", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 11, "scene_id": "S04E09_011", "location": "Monica and Rachel's", "scene_description": "Rachel is entering, excited.", "characters": ["Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S04E09/scenes/S04E09_011"}}
{"id": "S04E09_012", "text": "[Scene: Central Perk, Joey, Ross, and Chandler are making a pit stop on their party tour.]\nJoey: All right, so well get a little coffee, and get energized, and well head back out.\nChandler: Yeah, all right.\nRoss: Okay.\nJoey: So, were having fun, right?\nChandler and Ross: Yeah.\nJoey: We dont need that wizard guy. We hit a couple of clubs, talked to some strangers, and uh, after this, well head down to the docks and see about that boat thing.\nRoss: Im kinda beat.\nChandler: Actually, me too.\nJoey: Are you serious?!\nChandler and Ross: Yeah.\nJoey: Thank God! Im exhausted!\nGunther: So you guys want coffees?\nJoey: Yeah, but uh, I dont want to be up too late, so uh, Ill have a decaf. \nRoss: Yeah, me too.\nChandler: Actually, can I get some hot water with a little lemon? I think I strained my voice screaming in there. Does it have to be so loud?\nJoey: I cant hear a word youre saying, my ears are ringing so bad.\nRoss: Im just glad I brought that extra pair of socks, yknow? I used them as mittens, I didnt want to touch a thing in that last place.\n(pause)\nRoss: How sad are we?\nJoey: Yeah, I know.\nChandler: Yknow what? Were not sad, were not sad, were just not 21 anymore. Yknow? Im 29 years old, damnit! And I want to sit in a comfortable chair, and watch television and go to bed at a reasonable hour!\nJoey and Ross: Yeah!\nJoey: Yeah! And I like to hang out in a quiet place where I can talk to my friends.\nChandler and Ross: Yeah!\nRoss: And so what if I like to go home, throw on some Kenny G, and take a bath!\nJoey: Were 29, were not women.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 12, "scene_id": "S04E09_012", "location": "Central Perk", "scene_description": "Joey, Ross, and Chandler are making a pit stop on their party tour.", "characters": ["Chandler", "Chandler and Ross", "Gunther", "Joey", "Joey and Ross", "Ross"], "firestore_path": "/episodes/S04E09/scenes/S04E09_012"}}
{"id": "S04E09_013", "text": "[Scene: Central Perk, the next day, Phoebe is there.]\nMonica: (entering) Ohh, here you are. Yknow, Im-Im glad you decided to hear me out.\nPhoebe: Okay, Im hearing.\nMonica: Ive been doing a lot of thinking. A lot! And umm, well, I came up with a whole bunch of businesses you can do with your van. Okay umm, you could be flower delivery person.\nPhoebe: What?!\nMonica: Or! A bakery delivery person.\nPhoebe: I wa-I wa-I wa\nMonica: Pizza?!\nPhoebe: Monica! \nMonica: All right, Ive got a whole bunch of uh-uh, stuff in this area, but umm, Im getting the feeling that you dont want to deliver.\nPhoebe: No.\nMonica: Okay. Im guessing that if you dont want to deliver, you probably dont want to pick stuff up either.\nPhoebe: No.\nMonica: Yknow what, lets do the catering business.\nPhoebe: Really?! Are you sure?\nMonica: Yeah, y'know I-I made a commitment to you. Yknow what, itd be, itd be fun.\nPhoebe: Oh! It will be fun! Ohh! Yay! Oh! Okay, ooh, lets plan the wedding reception. (She grabs the notebook which Monica used for her ideas and starts flipping page after page after page after page after page to find a blank one.) Wow! You really wanted me to do something with this van. (pause) Yknow what, I want you to take the chef job.\nMonica: Really?!\nPhoebe: Yeah. Thats what you really want. Yeah, I dont want to be the reason youre unhappy, that would just make me unhappy, and I really dont want to be the reason Im unhappy.\nMonica: Thank you.\nPhoebe: Besides, it might be kinda fun to form the new A-Team.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 13, "scene_id": "S04E09_013", "location": "Central Perk", "scene_description": "the next day, Phoebe is there.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S04E09/scenes/S04E09_013"}}
{"id": "S04E09_014", "text": "[Scene: Rachels office, she is coming in for the day carrying a picture for her new office. Mrs. Lynch is coming out of Joannas office, carrying a box.]\nRachel: Oh, hi Mrs. Lynch! Is Joanna in already?\nMrs. Lynch: Oh my goodness! You havent heard!\nRachel: Heard what?\nMrs. Lynch: Joanna passed away last night.\nRachel: Oh my God! How?!\nMrs. Lynch: Well, she was leaving work and she was hit by a cab.\nRachel: Oh my God! Oh, I cannot believe it!\nMrs. Lynch: I know!\nRachel: Oh, God. Oh, God. (gets worried) Oh God.\nMrs. Lynch: I didnt realize that she was so close.\nRachel: Yes, so close. Mrs. Lynch, I know that this is an emotional and difficult time, for all of us. But by any chance did Joanna send any paperwork your way before it happened.\nMrs. Lynch: No. Nothing. Imagine, if she had just stepped off that curb a few seconds later.\nRachel: Yes-yes, just a few seconds and shed still be with usnothing about an assistant buyer?\nMrs. Lynch: (starting to cry) No, Im sorry. I have to go. (She leaves as Sophie arrives.)\nSophie: (happily) Good morning!\nRachel: Oh, Sophie, I guess you didnt hear about Joanna\nSophie: I sure did! (smiles)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 14, "scene_id": "S04E09_014", "location": "Rachels office", "scene_description": "she is coming in for the day carrying a picture for her new office. Mrs. Lynch is coming out of Joannas office, carrying a box.", "characters": ["Rachel", "Sophie"], "firestore_path": "/episodes/S04E09/scenes/S04E09_014"}}
{"id": "S04E09_015", "text": "[Scene: Monicas new kitchen, Allesandro is introducing her to her new employees.]\nAllesandro: Im so excited about having Monica come on board with us. Although I do feel bad about having fired chef Emillio, its like losing a member of the family. Of course, that literally is the case for several of you. Tony, Carlos, Marie, please, tell your father how much were gonna miss him. Now, I know that Monica has a lot of great ideas for this place, well, you all read the review. So without much further ado, I present to you our new head chef.\nMonica: Umm, I just wanna say, uh (reads from a 3 X 5 card) that with a pinch of exictement, a dash of hard work, a dollup of cooperation, we can have the recipe... (Looks up and sees eveyone glaring at her) Are you gonna kill me?\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 9, "episode_id": "S04E09", "episode_title": "THE ONE WHERE THEY'RE GONNA PARTY!", "scene_number": 15, "scene_id": "S04E09_015", "location": "Monicas new kitchen", "scene_description": "Allesandro is introducing her to her new employees.", "characters": ["Allesandro", "Monica"], "firestore_path": "/episodes/S04E09/scenes/S04E09_015"}}
