{"id": "S04E03_001", "text": "THE ONE WITH THE CUFFS\nWritten by: Seth Kirkland Transcribed by: Eric Aasen With Help from: Darcy Partridge", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 1, "scene_id": "S04E03_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E03/scenes/S04E03_001"}}
{"id": "S04E03_002", "text": "[Scene: Chandler and Joey's, Chandler is sitting in the canoe as Joey runs through the door carrying an outdoor patio table.]\nJoey: Hey!! We are so in luck! Treeger said that we could have all this cool stuff from the basement. Wait right there. (Goes back into the hall)\nChandler: Oh no-no-no, Im, Im paddling away!\nJoey: (Returning carrying a couple of rusted lawn chairs) Huh?!\nChandler: Wow! Really?! We get all this rusty crap for free?!\nJoey: Uh-huh. This and a bunch of bubble wrap. And, some of it is not even popped! \n(They both sit down at the table and the chick and the duck enter from Joeys bedroom.)\nChandler: Could we be more white trash?\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 2, "scene_id": "S04E03_002", "location": "Chandler and Joey's", "scene_description": "Chandler is sitting in the canoe as Joey runs through the door carrying an outdoor patio table.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E03/scenes/S04E03_002"}}
{"id": "S04E03_003", "text": "[Scene: Monica and Rachel's, Monica, Ross, Phoebe, and Rachel are eating breakfast.]\nMonica: (Entering from her bedroom) How desperate am I?\nRachel: Oh! Good thing Chandlers not here, he always wins at this game.\nMonica: I just told my Mom Id cater a party for her.\nPhoebe: How come?\nMonica: Because I need the money, and I thought that itd be a great way to get rid of that last little schmidgen of self-respect.\nRoss: Come on, I think this is a good thing. I dont think Mom wouldve hired you if she didnt think you were good at what you do.\nMonica: You dont have to stick up for her. She cant here you.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 3, "scene_id": "S04E03_003", "location": "Monica and Rachel's", "scene_description": "Monica, Ross, Phoebe, and Rachel are eating breakfast.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E03/scenes/S04E03_003"}}
{"id": "S04E03_004", "text": "[Scene: Chandler and Joey's, Joey is reading the paper and Chandler is getting ready for work.]\nRachel: (entering) Hey! Umm, do you guys have any juice?\nJoey: Just pickle.\nChandler: Hey uh, Rach, funny story. I ah, bumped into Joanna on the street yesterday.\nRachel: My boss, Joanna? Wow, that mustve been awkward.\nChandler: Well, no, actually she uh, asked me if I wanted to get a drink.\nRachel: (laughs) You ah, you didnt say Yes to that did you?\nChandler: (laughs) No. No!\nJoanna: (Coming out of the shower wearing nothing but a towel) Hello, Rachel. (She goes into Chandlers bedroom)\nChandler: Well, not at first.\nRachel: What is she doing here?\n(Joey makes a sound like a creaking bed.)\nRachel: I dont understand! Last time you went out with her you said she was a big, dull dud.\nChandler: Well, I think I judged her too quickly, and this time we were able to take the relationship to the next level.\n(Joey creaks louder)\nRachel: Well, last time I almost got fired. You must end it, you must end it now!\nChandler: Oh, come on! Its not like this is an everyday occurrence for me! I mean usually Im pretty much just in there by myself.\n(Joey makes a sound imitating one person making a bed creak and Chandler turns and glares at him.)\nRachel: Chandler!! (He turns around quickly) Promise me, you will end it.\nChandler: Okay, I promise, Ill end it.\nRachel: Thank you.\nChandler: I hope you know what Im giving up for ya, because shes not just the boss in your office, if you know what I mean.\nJoey: Yeah-eh-eah! (Rachel glares at him) Oh-oh, sorry, I-I knew what he meant.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 4, "scene_id": "S04E03_004", "location": "Chandler and Joey's", "scene_description": "Joey is reading the paper and Chandler is getting ready for work.", "characters": ["Chandler", "Joanna", "Joey", "Rachel"], "firestore_path": "/episodes/S04E03/scenes/S04E03_004"}}
{"id": "S04E03_005", "text": "[Scene: The Geller household kitchen, Monica and Phoebe are cooking for Mrs. Gellers party.]\nMrs. Geller: (entering) Hows the hired help?\nMonica: Doing great, the quiches are coming along.\nMrs. Geller: Whats this? Blue nail polish?\nMonica: Yeah, I thought it was cute.\nMrs. Geller: Ahh, thats what your Grandmothers hands looked like when we found her.\nMonica: Let me ask you a question.\nMrs. Geller: Hmm.\nMonica: Why did you hire me?\nMrs. Geller: Oh, well Richard raved about the food at his party, of course you were sleeping with him. Then I heard the food at that lesbian wedding was very nice, I assume you werent sleeping with anybody there. Though, at least that would be something. (Leaves)\nMonica: (to Phoebe) Oh my God! Did you hear that? She hired me because she thinks Im good.\nPhoebe: Okay, I didnt hear that.\nMonica: Oh yeah, she didnt hire me out of pity, it wasnt so she could pick on me in front of her friends, she actually thinks Im good.\nPhoebe: Wow! And hey, its cool if youre a lesbian! (Gives her a thumbs up)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 5, "scene_id": "S04E03_005", "location": "The Geller household kitchen", "scene_description": "Monica and Phoebe are cooking for Mrs. Gellers party.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S04E03/scenes/S04E03_005"}}
{"id": "S04E03_006", "text": "[Scene: Chandler and Joey's, Joey is scrapping gum off the table as there is a knock on the door. He goes over and opens it.]\nThe Salesman: (Entering before Joey can say anything) Good afternoon, are you the decision maker of the house?\nJoey: Uhhhh. (Hes not sure)\nThe Salesman: Do you ah, currently own a set of encyclopedias? \nJoey: No! No. But ah, try the classifieds, people sell everything in there.\nThe Salesman: Actually, Im not buying. Im selling. Let me ask you one question. Do your friends ever have a conversation and you just nod along even though youre not really sure what theyre talking about?\n(We go into a flashback sequence with Joey remembering some of those times.)\n[Cut to Monica and Rachels apartment, all are there.]\nRoss: Im telling you its totally unconstituional.\nMonica, Chandler, Phoebe, and Rachel: Oh yeah, I totally agree.\n(Joey just nods his head.)\n[Cut to Central Perk, the entire gang is there.]\nMonica: I think he deserves a Nobel Prize. (Joey starts to nod Yes.)\nAll: Nooo!! (Joey quickly stops nodding his head.)\n[Cut to Monica and Rachels, theyre all there playing cards.]\nChandler: it was like the Algonquin kids table. (They all laugh, but Joey only laughs not to be left out.)\n[Cut back to the present day.]\nThe Salesman: (Interrupting the flashback) Excuse me, Im sorry, you havent said anything for about two and a half minutes, are you at all interested?\nJoey: Yeah-well-yeah! Yeah-oh-yeah. Come on in.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 6, "scene_id": "S04E03_006", "location": "Chandler and Joey's", "scene_description": "Joey is scrapping gum off the table as there is a knock on the door. He goes over and opens it.", "characters": ["All", "Chandler", "Joey", "Monica", "Ross", "The Salesman"], "firestore_path": "/episodes/S04E03/scenes/S04E03_006"}}
{"id": "S04E03_007", "text": "[Scene: The Gellers Kitchen, Monica and Phoebe are still cooking.]\nPhoebe: Thats weird.\nMonica: What?\nPhoebe: Your nails.\nMonica: Oh, I know, I never wear fake ones. I just did it so my Mom wouldnt give me grief about me biting them.\nPhoebe: Oh, no, I meant that its weird that you only have nine now.\nMonica: (Looks at her nails) Oh my God. Wait a minute, I had them put (realises) Oh my God! Its in the quiche! Oh My God!\nPhoebe: Okay, dont panic. Im gonna go to the store, Im gonna get you another set of nails, no ones gonna know, and youre gonna look great. (She runs over to get her coat.) Oh! Oh, its cause theyre gonna eatthats the problem.\nMrs. Geller: (entering) (to Monica) Honey, dont bite your nails.\nMonica: Okay ah, please dont freak out. Umm, but ah, theres a blue fingernail in one of the quiche cups, and theres no way to know which one.\nPhoebe: And! Whoever finds it wins the prize!\nMrs. Geller: (laughs) Im not freaking out.\nMonica: Then why are you laughing?\nMrs. Geller: Its nothing, its just that now your Father owes me five dollars.\nMonica: What? You bet Id lose a nail?\nMrs. Geller: Oh no, dont be silly. I just bet Id need these. (Opens the freezer to reveal)\nMonica: Frozen lasagnas?\nMrs. Geller: Um-hmm.\nMonica: You bet that Id screw up?! So all that stuff about hiring me because I was good was\nMrs. Geller: No-no-no, that was all true. This was just in case you pulled a Monica.\nMonica: You promised Dr. Weinburg, youd never use that phrase.\nMrs. Geller: Oh honey, come on, have a sense of humour, youve never been able to laugh at yourself.\nMonica: (laughs) Thats right. My Mom doesnt have any faith in me! Oh, thats hilarious! Ha-ha-ha-ha-ha.\nPhoebe: I dont get it.\nMrs. Geller: No, I have faith\nMonica: (interrupting) No! You have lasagnas! (Storms out and an awkward silence follows.)\nOven: Ding!\nPhoebe: Op, the ruined quiches are ready.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 7, "scene_id": "S04E03_007", "location": "The Gellers Kitchen", "scene_description": "Monica and Phoebe are still cooking.", "characters": ["Monica", "Oven", "Phoebe"], "firestore_path": "/episodes/S04E03/scenes/S04E03_007"}}
{"id": "S04E03_008", "text": "[Scene: Joannas office, Joanna and Chandler are making out on her chair. Chandler isnt wearing any pants.]\nChandler: It just doesntfeel like were breaking up.\nJoanna: No, we are. Im sad.\nChandler: Okay.\n(They start kissing again, but are interrupted by the phone.\nJoanna: (answering the phone) Yes. (listens) Uh, cant you wait until tomorrow? (listens) All right. (hangs up) Unbelievable!!\nChandler: Thanks.\nJoanna: No, no, that was my boss. I have to go.\nChandler: Okay. (Starts to button up his shirt)\nJoanna: What are you doing?\nChandler: Im getting dressed.\nJoanna: Why?\nChandler: When I walk outside naked people throw garbage at me.\nJoanna: Wait. I wanna show you something.\nChandler: What is it?\nJoanna: Just a little gag gift somebody gave me. (Shes holding a pair of handcuffs) Put your hands together.\nChandler: Ah-ha, youre not the boss of me. (She kisses him) Yeah, you are! (She handcuffs him to the chair) Ooh, saucy.\nJoanna: (kisses him) Ill be back in ten minutes. (Starts to leave)\nChandler: You are, youre gonna leave me like this?\nJoanna: Knowing youre here, waiting for me I think its kinda exciting.\nChandler: Okay. But if you dont come back soon, (She leaves and closes the door) theres pretty much nothing I can do about it!\n[Cut to Joannas outer office, where Rachel and Sophie work. They are both coming back from lunch.]\nJoanna: (locking her door) Oh.\nSophie: Hi! I brought you back a macaroon!\nJoanna: Oh great! Ill keep it in my butt with your nose. (She grabs the cookie and walks out.)\nRachel: Thats weird, she locked the door.\nSophie: Yknow why? Shes got the Christmas bonus list in there. I saw her working on it this morning.\nRachel: Okay, swear you wont tell, but when Mark left he gave me a key to Joannas office. Do you wanna see the list?\nSophie: Yeah!\n(Rachel unlocks and opens the door to reveal a half-naked Chandler handcuffed to the chair. They both gasp and Chandler stares at them in shock and surprise.)\nChandler: Hi! (to Sophie) How are you?\n(Rachel and Sophie both back out and close the door without saying anything.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 8, "scene_id": "S04E03_008", "location": "Joannas office", "scene_description": "Joanna and Chandler are making out on her chair. Chandler isnt wearing any pants.", "characters": ["Chandler", "Joanna", "Rachel", "Sophie"], "firestore_path": "/episodes/S04E03/scenes/S04E03_008"}}
{"id": "S04E03_009", "text": "[Scene: Joannas office, Chandler, still handcuffed to the chair, is looking through the lingerie catalogue by turning the pages with his teeth. The phone rings and Chandler answers it with his nose.]\nChandler: Hello, Joanna(Realises he doesnt know her last name)s office.\nJoanna: (on speaker phone) Im really sorry but I may be a little while longer.\nChandler: How little?!\nJoanna: A couple of hours, I feel awful.\nChandler: Look, this isnt funny! You get back here right now!\nJoanna: I cant!!\nChandler: Why not?!\nJoanna: Im in my bosss car!\nChandler: What?!\nJoanna: Uh-oh, tunnel. (The phone gets cut off)\n(Chandler gets an idea)\n[Cut to Rachels office as her intercom buzzes.]\nRachel: (answering it) (angrily) What?!\nChandler: (in a serious, businesslike tone) Rachel, could I see you for a moment?\n(Rachel goes into talk to Chandler.)\nChandler: Okay, heres the situation. The keys to the cuffs are on the back of the door. Could you be a doll and grab them and scoot on over and unlock me? And on a totally different subject, that is a lovely pantsuit.\nRachel: You promised you would break up with her!\nChandler: I did break up with her! She just took it really, really well!\nRachel: And the fact that you were jeopardising my career never entered your mind?!\nChandler: It did enter my mind! But then something happened that made it, shoot right out.\nRachel: Y'know what Chandler, you got yourself into those cuffs, you get yourself out of them.\nChandler: No-no-no-no-no-no-no!! I cant get myself right out of them! You must have me confused with the Amazing Chandler!! Come on, you have to unlock me, she could be gone for hours, and Im cold, and (Stops and looks up the skirt on a statue behind Joannas desk.)\nRachel: Oh, Chandler!! All right, this is it! (Grabs the key) You never see Joanna again!\nChandler: Never!\nRachel: You never come into this office again!\nChandler: Fine!\nRachel: You give me back my Walkman!\nChandler: Inever borrowed your Walkman.\nRachel: Well, then I lost it. You buy me one!\nChandler: You got it! Here we go! Come on! This is great! (Rachel goes over and unlocks the handcuffs) Ahhh! (He starts rubbing his wrist)\nRachel: Does it hurt?\nChandler: No, I just always see guys doing this when they get handcuffs taken off them. (He runs over to where his pants are hanging) Hello sweet pants!\nRachel: Wait a minute! What are you gonna tell Joanna?\nChandler: About what?\nRachel: When she sees that youre gone, shes gonna know that I let you out, and that I was in here, and Im gonna get fired!\nChandler: Ill make something up! Im good at lying, I actually did borrow your Walkman!\nRachel: No, theres nothing to make up, shes gonna know that I have a key to her office, Ive got to get you locked up back the way you were! (She tries to drag him over to the chair, but Chandler stops her.)\nChandler: Oh-ho-ho, I dont think so!\n(He starts to put his pants on, but Rachel manages to drag him to the chair. When they get to the chair, Chandler drops his pants and knocks the chair away. Rachel then backs him up and locks him to the top drawer of a filing cabinet.)\nChandler: Well, this is much better.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 9, "scene_id": "S04E03_009", "location": "Joannas office", "scene_description": "Chandler, still handcuffed to the chair, is looking through the lingerie catalogue by turning the pages with his teeth. The phone rings and Chandler answers it with his nose.", "characters": ["Chandler", "Joanna", "Rachel"], "firestore_path": "/episodes/S04E03/scenes/S04E03_009"}}
{"id": "S04E03_010", "text": "[Scene: Chandler and Joey's, The salesman is trying to sell Joey the encyclopedias.]\nThe Salesman: So, heres somebody interesting, Joey. What do you know about Van Gogh?\nJoey: He cut off his ear.\nThe Salesman: And?\nJoey: Im out.\nThe Salesman: He painted that. (Points to one of his paintings in the book)\nJoey: Wow! Thats pretty nice. I thought he cut off his ear cause he sucked. What else you got in there?\nThe Salesman: Lets see, ahhh Where does the Pope live?\nJoey: In the woods. No wait-wait, thats the joke answer.\nThe Salesman: Actually its, Vatican City. Now ahh, what do you know about vulcanised rubber?\nJoey: Spocks birth control.\nThe Salesman: (laughs) You need these books.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 10, "scene_id": "S04E03_010", "location": "Chandler and Joey's", "scene_description": "The salesman is trying to sell Joey the encyclopedias.", "characters": ["Joey", "The Salesman"], "firestore_path": "/episodes/S04E03/scenes/S04E03_010"}}
{"id": "S04E03_011", "text": "[Scene: Monicas childhood bedroom (which has been turned into a gym), Monica is lying on the treadmill as Phoebe enters.]\nPhoebe: Hey!\nMonica: Hi.\nPhoebe: This used to be your room? (She nods Yes) Wow! You mustve been in really good shape as a kid.\nMonica: Ohh, Im such an idiot. I cant believe I actually thought she could change.\nPhoebe: Well, who cares what your Mom thinks? So you pulled a Monica.\nMonica: Oh good, Im glad thats catching on.\nPhoebe: No but, why does that have to be a bad thing. Just change what it means. Y'know? Go down there and prove your Mother wrong. Finish the job you were hired to do, and well call that pulling a Monica.\nMonica: What?\nPhoebe: Okay, umm, if a kid gets straight As, his parents would say, \"Yeah, he pulled a Monica.\" Y'know? Or a fireman saves a baby, and they go, \"Yeah I know, he pulled a Monica.\" Or someone hits a homerun and the announcer says, \"Yeah, that ones outta here.\" Though some things dont change.\nMonica: (getting up) All right, Ill go down there. But, Im not gonna serve the lasagna. Im gonna serve something I make.\n(She exits and Phoebe goes over and sits down at the machine that works your shoulders and tries to do one, which she does, easily.)\nPhoebe: Wow! My breasts are really strong. (She goes and joins Monica.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 11, "scene_id": "S04E03_011", "location": "Monicas childhood bedroom (which has been turned into a gym)", "scene_description": "Monica is lying on the treadmill as Phoebe enters.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S04E03/scenes/S04E03_011"}}
{"id": "S04E03_012", "text": "[Scene: Joannas office, Rachel and Chandler are having a little tug-of-war with his pants.]\nRachel: Chandler! Chandler, please, I have to get you locked up back the way you were, I am sooo gonna lose my job, shes very private about her office. Now I know why.\nChandler: Hey, look, youre in trouble either way! Okay? If she comes back and sees me locked to this instead of the chair, shes gonna know you were in here. So you might as well just let me go.\nRachel: What if I clean your bathroom for a month?\nChandler: It still wouldnt be clean. (Rachel makes an Eww, disgusting! face) All I want is my freedom.\nRachel: Foot rubs for a month!\nChandler: Freedom!\nRachel: Ill take all of your photos and put them into photo albums!\nChandler: Freedom! I want my freedom! Why wont you here me?! (Opens the door) Sophie, help me! Help me!! (Sophie stands up)\nRachel: Sophie sit!!\n(She closes the door and puts his tie into his mouth as a gag.)\nRachel: No! God, would you just calm down!\n(Chandler screams a little bit, then realises that he can spit out his gag. He does so with a Pouff!)\nChandler: Im gonna say this for the last time. Would you please just (He moves his arm which opens the drawer and hits in the back of the head, which proves his point.)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 12, "scene_id": "S04E03_012", "location": "Joannas office", "scene_description": "Rachel and Chandler are having a little tug-of-war with his pants.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S04E03/scenes/S04E03_012"}}
{"id": "S04E03_013", "text": "[Scene: Chandler and Joey's, Joey is now reading the V book, with the salesman watching.]\nJoey: Wow! Theres a lot I didnt know about vomit. (The duck comes to the door of the bathroom, quacking.) (To the duck) In a minute. (The duck goes back into the bathroom.)\nThe Salesman: So, what do you say, Joey? You get the whole set of encyclopedias for twelve hundred dollars, which works out to just 50 bucks a book!\nJoey: Twelve hundred dollars? You think I have $1200? Im home in the middle of the day, and I got patio furniture in my living room. I guess theres a few things you dont get from book learnin.\nThe Salesman: Well ah, what can you swing?\nJoey: How about zero down and zero a month for a long, long time?\nThe Salesman: You dont have, anything?\nJoey: You wanna see what I got? (He gets up to empty out his pockets) Okay? Ive got a baby Tootsie Roll, a movie stub, keys, a Kleenex, a rock, and an army man. Hey!\nThe Salesman: Okay, I-I get the picture. Uh, thanks, for your time. (Starts to leave)\nJoey: And a 50. (The salesman stops suddenly) Huh, these must be Chandlers pants.\nThe Salesman: For 50 bucks, you can get one book! What will it be? A? B? C?\nJoey: Oh, I-I think Im gonna stick with the V, I wanna see how this bad boy turns out.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 13, "scene_id": "S04E03_013", "location": "Chandler and Joey's", "scene_description": "Joey is now reading the V book, with the salesman watching.", "characters": ["Joey", "The Salesman"], "firestore_path": "/episodes/S04E03/scenes/S04E03_013"}}
{"id": "S04E03_014", "text": "[Scene: Joannas office, Rachel and Chandler are still negotiating.]\nRachel: I ah, will buy and wrap all of your Christmas gifts.\nChandler: No!\nRachel: I ah Oh! Ill squeeze you fresh orange juice every morning!\nChandler: With extra pulp?\nRachel: (happily) Yeah!!\nChandler: No!\nRachel: Doh!! (pause) Ive got it!\nChandler: You dont have it.\nRachel: I have so got it. Theres gonna be rumours about this, theres no way to stop it. Sophie knows, Monica and Phoebe know.\nChandler: How do Monica and Phoebe know?\nRachel: Oh, I called them. And when they ask me what I saw, I can be very generous (Holds her hands far apart) or very (In a high pitched voice) stingy.\nChandler: (intrigued) Go on.\nRachel: I can make you a legend. I can make you this generations Milton Berle.\nChandler: And Milton Berle has a\nRachel: Ohh, not compared to you. (Chandler nods in agreement)", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 14, "scene_id": "S04E03_014", "location": "Joannas office", "scene_description": "Rachel and Chandler are still negotiating.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S04E03/scenes/S04E03_014"}}
{"id": "S04E03_015", "text": "[Scene: The Gellers kitchen, Phoebe is bringing in some dirty dishes.]\nMonica: Well?\nPhoebe: Theyre not even touching the lasagna!\nMonica: Really?!\nPhoebe: Oh, they love your casserole.\nMonica: Yes!!\nPhoebe: Its hard to believe that just a little while ago this was nothing but ingredients.\nMrs. Geller: (entering) Well, everyone seems to be enjoying your dish.\nMonica: And you?\nMrs. Geller: I thought it was quite tasty.\nMonica: So if everyone liked it, and you liked it, that would make this a success. Which would make you\nMrs. Geller: (interrupting) A bitch?\nMonica: Well, I was going for wrong, but we can use your word.\nMrs. Geller: Yes, well I was wrong, and I have to say you really impressed me today.\nMonica: Wow!\nPhoebe: Umm, you might even say that she pulled a Monica. (They both look at her) (to Monica) She doesnt know we switched it. (Monica nods her head No.)\nMrs. Geller: And the next time you cater for me, there will be nothing but ice in the freezer. (She starts to bite her nails)\nMonica: That really means a lot. Oh, and Mom, dont bite your nails.", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 15, "scene_id": "S04E03_015", "location": "The Gellers kitchen", "scene_description": "Phoebe is bringing in some dirty dishes.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S04E03/scenes/S04E03_015"}}
{"id": "S04E03_016", "text": "[Scene: Central Perk, all except Chandler, are there.]\nChandler: (hello) Hello.\nJoey, Rachel, and Ross: Hey!\nMonica: (in a sexy voice) Hello, Chandler. (Phoebe has a huge smile on her face.)\nChandler: (to Rachel) I love you. (Kisses her on the forehead)\nJoey: Wh-whats going on?\nPhoebe: Oh. \n(She motions for them to come closer, they lean in and she whispers what Rachel told her. The guys both lean back laughing.]\nJoey: No he doesnt!\nChandler: (checks his watch) Two hours, that lasted!\nRachel: So did you break up with Joanna?\nChandler: I think so.\nJoey: Well, its good thing you got out when you did, before she blew up like that Vesuvius.\nRoss: The volcano?\nJoey: Yeah. And speaking of volcanoes, man are they a violent igneous rock formation.\nRachel: What?!\nJoey: Oh yeah, lava spewing, hot ash, of course some are dormant.\nMonica: Why are you talking about volcanoes all of the sudden?\nJoey: Well, we can talk about something else. What do you want to talk about? Vivisection? The Vasdeferens? The Vietnam War?\nMonica: Oh! Did anybody see that-that documentary on the Korean War? (Joey is pissed)\nAll: Oh, yeah. Yeah.\nPhoebe: Oh God, Korea is such a beautiful country.\nRoss: With such a sad history.\nChandler: Could there be more Kims?\n(They all laugh and Joey joins them, not to be left out. When the laughing dies down, he has a depressed look on his face.)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 16, "scene_id": "S04E03_016", "location": "Central Perk", "scene_description": "all except Chandler, are there.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E03/scenes/S04E03_016"}}
{"id": "S04E03_017", "text": "[Scene: Rachels office, Rachel is coming in for the day.]\nJoanna: (from her office) Whos out there?\nRachel: Its me! Good morning!\nJoanna: Rachel, could you come in here for a moment, please?\nRachel: Yeah, sure. Umm, they didnt have poppy seed bagels, so I (Enters Joannas office and sees her handcuffed to her chair wearing nothing but a slip) Oh my word!\nJoanna: I seem to have had a slight office mishap. Could you please get the key off the back of the door for me.\nRachel: Oh, yeah! Yeah!\n(She goes back and forth, not sure what to do first, put the bagel down or grab the key. She finally puts the bagel down and grabs the key and goes over to unlock Joanna.)\nJoanna: You tell your friend Chandler that were definately broken up this time.\nRachel: Okay.\nEnd", "metadata": {"chunk_type": "scene", "season": 4, "episode_number": 3, "episode_id": "S04E03", "episode_title": "THE ONE WITH THE CUFFS", "scene_number": 17, "scene_id": "S04E03_017", "location": "Rachels office", "scene_description": "Rachel is coming in for the day.", "characters": ["Joanna", "Rachel"], "firestore_path": "/episodes/S04E03/scenes/S04E03_017"}}
