{"id": "S05E23_001", "text": "THE ONE IN VEGAS: Part 1\nPart I Written by: Andrew Reich & Ted Cohen Part II Written by: Greg Malins & Scott Silveri Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 1, "scene_id": "S05E23_001", "location": "", "scene_description": "", "characters": ["Part I Written by", "THE ONE IN VEGAS"], "firestore_path": "/episodes/S05E23/scenes/S05E23_001"}}
{"id": "S05E23_002", "text": "[Scene: Monica and Rachel's, Rachel is sitting in the living room and Phoebe is standing in the kitchen as the phone rings.]\nRachel: Pheebs? Could you get that? Please?\nPhoebe: Why? Just 'cause you're too lazy to get up off your touchie? \nRachel: No! No! It's just that all the people in the entire world that I want to talk to are right here.\nPhoebe: (smiles) Okay! (Goes to answer the phone.)\nRachel: (under her breath) Sucker!\nPhoebe: (answering the phone) Hello? (Listens) Hey Joey!\n[Cut to Las Vegas, Joey is on the phone and wearing his gladiator costume.]\nJoey: Hey Pheebs! Listen, uh can you do me a favor? I forgot the pin number to my ATM card can, can you get it for me?\nPhoebe: Sure! Where is it?\nJoey: Uh, I scratched it on the ATM machine down on the corner.\nPhoebe: Ohh! So you're 5639?!\nJoey: That's it! Thanks Pheebs!\n[Cut to Monica and Rachel's]\nChandler: (entering) Hey!\nPhoebe: (to Joey) Ooh, do you want to talk to Chandler?\nChandler: (To Phoebe) Is that Joey?! (She nods yes) Let me talk to him!\n[Cut to Joey]\nJoey: No! (She nods no to Chandler) Because he didn't believe in my movie! Which is a big mistake because it is real! Real!\nA Casino Boss: Hey! Tribbiani! Get back to work! Break time's over!\n[Cut to Phoebe]\nPhoebe: Who was that?\nJoey: Uhh, my stunt double. Yeah, and y'know, he's getting a little too familiar for my tastes.\nChandler: (To Phoebe) Y'know what? I have been trying to apologize to him all week! If he's not gonna let me do it on the phone, I'm gonna go down there and do it in person.\n[Cut to Joey]\nJoey: Uhh Pheebs, I heard that. Can you put him on?\n[Cut to Phoebe]\nPhoebe: Yeah! (She hands the phone to Chandler.)\nChandler: (To Joey) Hey!\n[Cut to Joey]\nJoey: Don't come out here!\n[Cut to Chandler]\nChandler: No-no-no-no, I've supported you one hundred percent and I want to prove that to you in person!\n[Cut to Joey]\nJoey: I got that! I forgive ya! Don't come out here!\n[Cut to Chandler]\nChandler: Forgive me? You haven't been taking my calls in a week!\n[Cut to Joey]\nJoey: Well, I'm totally over it Chandler. Friends forever! Don't come out here!\nA Tourist: (To Joey) Would you mind doing a picture with us?\n[Cut to Chandler]\nChandler: Uh, what was that?\n[Cut to Joey]\nJoey: Uh, Entertainment Tonight. [Cut to Chandler] Yeah, okay so, good talking to ya and don't come out here. All right. (Hangs up the phone and poses for that picture.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 2, "scene_id": "S05E23_002", "location": "Monica and Rachel's", "scene_description": "Rachel is sitting in the living room and Phoebe is standing in the kitchen as the phone rings.", "characters": ["A Casino Boss", "A Tourist", "Chandler", "Joey", "Phoebe", "Rachel"], "firestore_path": "/episodes/S05E23/scenes/S05E23_002"}}
{"id": "S05E23_003", "text": "[Scene: Monica and Rachel's, Phoebe is entering.]\nPhoebe: Monica! I'm sorry I'm late! (Starts looking around for her) Monica? (Goes into Monica's bedroom.)\nMonica: (entering) Phoebe? (Phoebe comes back into the living room) Oh, Phoebe, I'm so sorry. Have you been here long?\nPhoebe: (saddened) It's okay. What the hell took you so long?\nMonica: Okay, you can not tell Chandler. Okay? That I ran into Richard.\nPhoebe: Which Richard?\nMonica: The Richard.\nPhoebe: Richard Simmons?! Oh my God!\nMonica: Noo! My ex-boyfriend Richard! Y'know the tall guy, moustache? \nPhoebe: Oh! Okay, that actually makes more sense. So how was it?\nMonica: It was, it was really nice. We started talking and I-I ended up having lunch with him.\nPhoebe: That is so weird! I had a dream that you'd have lunch with Richard.\nMonica: Really?\nPhoebe: But again, Simmons. Go on.\nMonica: The strange part was, he was really nice, umm and he looks great, but I didn't feel anything at all!\nPhoebe: Ooh! So now why can't we tell Chandler?\nMonica: Because it would totally freak him out and tomorrow's our anniversary. I just don't want anything to spoil that.\nPhoebe: Oh, I can't believe you guys lasted a whole year!\nMonica: I know.\nPhoebe: Wow! I owe Rachel 20 bucks!\nMonica: What?\nPhoebe: On a totally different bet.\nChandler: (entering) Hey!\nMonica: It's almost our anniversary!\nChandler: I know. Can you believe it? One year ago today I was just your annoying friend Chandler.\nPhoebe: Awww! Now you're just my annoying friend Chandler.\nChandler: Huh.\nMonica: I got you a present!\nChandler: Oh, but it's not 'til tomorrow!\nMonica: I know, but you have to open it today! (Hands it too him.)\nChandler: Okay.\n(He starts taking his time opening it. Finally Monica snaps.)\nMonica: (grabbing the gift from him and opening it) Okay! There you go! It's two tickets to Vegas!\nChandler: Wow!\nMonica: For this weekend! Oh gosh, it would be perfect, we get to see Joey plus we get to start our anniversary celebration on the plane. We can call it out plane-aversary.\nChandler: Do we have to?\nMonica: No.\nChandler: Okay this is great, but Joey said he didn't want any of us out there.\nMonica: Oh, he just doesn't want us to go through any trouble. Think of how excited he'll be when we go out and surprise him! Plus we get to have our own, ani-Vegas-ary! A-Nevadaversary!\nChandler: Yeah, I think we should see other people.\nMonica: But we can go, right?\nChandler: Yes.\nMonica: Okay!\nChandler: It's a great idea. (They kiss)\nPhoebe: Okay, I'm gonna go too!\nChandler: Y'know Pheebs, it's kinda our (His and Monica's) anniversary.\nPhoebe: Oh please, you are not gonna ditch again like you did with London.\nMonica: Ditch you? Phoebe, you were pregnant with the triplets!\nPhoebe: Uh-huh, great story! I'm going!\nRachel: (entering with Ross) Hi!\nPhoebe: Hey!\nRoss: Hey!\nPhoebe: Hey, you guys, listen, this weekend we're all gonna go to Las Vegas to surprise Joey! Including me!! You wanna go?!\nRachel: Well, I guess I could take a couple days off work.\nPhoebe: Of course you can take a couple days off work because this trip includes me!\nRachel: Oh no, wait a minute, wait, I've got a presentation tomorrow. I can't miss that.\nRoss: Oh, but I've got tickets to the Van Gogh exhibit! I've been waiting like a year for this.\nChandler: (coughing) Art lover!\nRoss: What'd you say?\nChandler: I said art lover.\nRoss: Is that supposed to be an insult?\nChandler: I don't know, I'm very tired. \nRoss: So Rach, maybe you and I could fly out together Saturday.\nRachel: That sounds great.\nRoss: Yeah? All right I'll call the airlines. (Picks up the phone and does so)\nRachel: Okay. Yeah, that would be nice actually, to have the apartment to myself for a night.\nPhoebe: Oh yeah, so you can walk around naked.\nRachel: No! So I can be by myself. Y'know? Have a little alone time.\nPhoebe: Naked alone time.\nRachel: No! Phoebe just because I'm alone doesnt mean I wanna walk around naked. I mean, you live alone, you don't walk around naked.\nPhoebe: Uh-huh! Why do you think it takes me so long to answer the door?", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 3, "scene_id": "S05E23_003", "location": "Monica and Rachel's", "scene_description": "Phoebe is entering.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E23/scenes/S05E23_003"}}
{"id": "S05E23_004", "text": "[Scene: An airplane cabin, Phoebe has the aisle seat, Chandler the window, and Monica's stuck in that horrible middle seat.]\nPhoebe: So, so far is this trip to Vegas better or worse than the trip to London?\nChandler: So it's pretty much the same Pheebs.\nPhoebe: Okay, what about after I give you these candies? (Hands them each one from her purse.)\nChandler: Yeah, I guess it's a little better now.\nPhoebe: Ah-ha! Okay, (takes out a notepad) Las Vegas 1, London 0! I'll be right back. (Gets up and heads aft.)\nChandler: (To Monica) Happy plane-aversary.\nMonica: Aww! I love you!\nChandler: Can I give you a present now?\nMonica: Okay!\nChandler: Okay! (He grabs his carryon and starts rummaging through it.) Oh man! Dont tell me I did this!\nMonica: I love the \"I forgot the present\" fake out!\nChandler: How do you feel about the, \"I really did forgot the present, please forgive me\" not fake out?\nMonica: Oh that's okay. Dont worry about it, you can give it to me when we get back.\nChandler: Ohh that's the worse thing that can happen on an anniversary ever!\nPhoebe: (sitting down) Oh good! All right, so you decided to tell him about the Richard thing.\nChandler: What-what Richard thing?\nPhoebe: Oh no. [The patented version.]\nChandler: What Richard thing?\nPhoebe: (To Monica under her breath) Simmons! Go with Simmons!\nMonica: Okay, I umm, I ran into Richard yesterday and he asked me if I wanted to go for a bite and I did. The only reason I didn't tell you is because I knew you'd get mad and I didn't want to spoil our anniversary.\nChandler: (talking out of the side of his mouth) I'm not mad.\nMonica: Really?!\nChandler: Oh yeah! Yeah, so you-you bumped into Richard! You grabbed a bite! It's no big deal. (He still ain't happy.)\nMonica: Great!\n(Pause.)\nPhoebe: Okay, London 1", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 4, "scene_id": "S05E23_004", "location": "An airplane cabin", "scene_description": "Phoebe has the aisle seat, Chandler the window, and Monica's stuck in that horrible middle seat.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S05E23/scenes/S05E23_004"}}
{"id": "S05E23_005", "text": "[Scene: Monica and Rachel's, Rachel is coming out of the bathroom after a shower wearing only her bath robe, walks into the kitchen, and opens the fridge. As she bends over to grab a bottle of wine, her robe falls open (Damn this network primetime programming, we didn't see anything!) and she quickly closes it again. But then realizes she didn't have to do that. So she closes the fridge and stands next to the table, thinks about it for a little while and]\nRachel: (takes off her robe) Oh! Look what happened! {Don't get your hopes up guys, we only get to see her from the back or from the neck up. Its times like these I wish that the networks would broadcast some nudity other than Denis Franz's butt.} (In her head.) Huh, check me out! I'm in my kitchennaked! I'm picking up an orange. (Does so) I'm naked! (Goes into the living room) Lighting the candles, naked, and carefully. (She backs anything that might have a point like a candle on her body away.)\n[Cut to Ross's apartment, he's sitting by his window looking at an art book. As he's turning the page, he glances up and notices something.]\nRoss: (in his head) Oh my God! That's Rachel naked! I can't look at that! I am looking at this. (Looks back at his book.) Okay, vivid colors, expressive brush strokesUnless she wants me to be looking at that. She knows I'm home. She knows I can see her. What kind of game is she playing? I think maybe someone's lonely tonight. Oh-ho, Dr. Geller! Stop it! You're being silly! Or, am I?\n[Cut back to Monica and Rachel's apartment, Rachel is singing along with a song and dancing while facing the big picture window. Y'know, I think I'd pay real good money to be on the other side of that window!]\nRachel: (singing) Love to love ya baby! Ow! Love to love ya baby! Ow! (There's a knock on the door, she turns off the music, puts on her robe, and goes to answer the door.) Love to love ya, baby! (There's another knock.) Darnit! (Looks through the peephole and turns on the lights.) Ugh. (She opens the door to Ross who's leaning against the door jam.) \nRoss: Hey.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 5, "scene_id": "S05E23_005", "location": "Monica and Rachel's", "scene_description": "Rachel is coming out of the bathroom after a shower wearing only her bath robe, walks into the kitchen, and opens the fridge. As she bends over to grab a bottle of wine, her robe falls open (Damn this network primetime programming, we didn't see anything!) and she quickly closes it again. But then realizes she didn't have to do that. So she closes the fridge and stands next to the table, thinks about it for a little while and", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S05E23/scenes/S05E23_005"}}
{"id": "S05E23_006", "text": "[Scene: Monica and Rachel's, the scene is continued from where we left off before the break.]\nRoss: May I come in?\nRachel: Uh, yeah, if you want too.\nRoss: Do you want me too?\nRachel: Yeah, sure?\nRoss: So do I. (Slowly walks in.) Okay Rach, before anything happens (He takes off his coat) I just want to lay down a couple of ground rules. (Turns back to face her.) This is just about tonight. I don't to go through with this if it's going to raise the question of \"Us.\" (Rachel's confused) Okay? I just want this to be (Kicks off his left shoe) about what it is! (Kicks off the other one.)\nRachel: And um, what-what is that Ross?\nRoss: The physical act of love. (Hisses at her.)\nRachel: (laughs) What?! Are you crazy?\nRoss: Oh so-so you weren't trying to entice me just now with your-your nakedness?\nRachel: (gasps) Oh God, you saw me?! Oh!\nRoss: You weren't trying to entice me with your nakedness.\nRachel: Noo!! No! You thought, you actually thought I wanted to have sex with you?!\nRoss: No! No! (Grabs his coat) No! (Grabs a shoe.) No-no-no-no. (Grabs the other one and heads for the door.)\nRachel: Ohh wow! Im sorry, but Ross you kicked off your shoes!\nRoss: Can we, can we just forget this ever happened?\nRachel: Yes of course, absolutely! You're right. I'm sorry.\nRoss: Thank you.\nRachel: Yes.\nRoss: All right I guess I'm, gonna go pack. (Starts to leave)\nRachel: Okay. Oh wait! One more thing umm, do-do we still need to uh settle the question of \"us?\"\n(Ross storms off embarrassed.)", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 6, "scene_id": "S05E23_006", "location": "Monica and Rachel's", "scene_description": "the scene is continued from where we left off before the break.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S05E23/scenes/S05E23_006"}}
{"id": "S05E23_007", "text": "[Scene: Las Vegas, we have the typical glamour shots of Vegas, the Strip, slot machines, a couple other gaming tables all set to the tune of you guessed it, Money. Anyhoo, we finally get through that and watch Chandler, Monica, and Phoebe enter Caesar's Palace carrying their luggage.]\nPhoebe: Hey you guys wait! Guys! (Catches up to them.) This place is so much better than London! Okay? This lady dressed like Cleopatra gave me a coupon, 99 cent steak and lobster dinner. Huh!\nMonica: Phoebe, you don't eat animals. \nPhoebe: For 99 cents, I'd eat you. (Sees the casino) Okay, I can totally settle down here. It's got everything I could ever want, including Joey! Look! (Points to Joey in his gladiator suit posing for a picture with two old ladies.) Oh! Look! Hi!\nChandler: Oh my God.\nPhoebe: Hey! Joey! (They all head over to him, he spots them coming and panics.) Hey! Hey!! Wow! (She hugs him.)\nJoey: Hi!\nChandler: Love your condoms my man.\nJoey: What-what are you guys doing here? I thought I told you not to come.\nPhoebe: Why are you dressed as a gladiator?\nJoey: Uhh, because I'm shooting a scene right now. Yeah, I uh, I play a gladiator. Uh, y'know what? Hold-hold on a second. (To no one in particular) Can we cut? Yeah, my-my friends are here, I'm gonna take a little break.\nMonica: Who are you talking too?\nJoey: They uh director. Uhh, her. (Points to an old woman standing behind him. Who glares at him and walks off.) All right, all right, it's not a gladiator movie. I work here.\nChandler: Why?! What happened?!\nJoey: Well, the movie got shutdown because they ran out of money, so I'm working here 'til it starts up again, if it ever does.\nMonica: I'm so sorry.\nJoey: Look, I'm sorry I didn't tell ya. (To Chandler) I'm sorry man.\nChandler: No-no, that's okay, apparently there's a new policy where we don't have to share everything with everybody.\nMonica: I knew you were not okay with that.\nPhoebe: So you're a gladiator! Wow!\nJoey: Yeah, what-what's going on?\nPhoebe: Monica had lunch with Richard.\nJoey: Dawson?! \nPhoebe: Noo! But that would've been so cool!\nChandler: No! Her boyfriend Richard!\nMonica: It meant nothing! Okay? After all this time, how can you not trust me?\nChandler: When you go lunching with hunky moustache men and don't tell me about it!\nMonica: You're right. I'm sorry. I should've told you.\nChandler: Thanks. (They hug.)\nJoey: Aww, there we go.\nPhoebe: I love Vegas!\nMonica: I promise you, next time I will absolutely tell you.\nChandler: (pushing her away from another hug) Next time?\nJoey: Ooh, so close.\nChandler: There's not gonna be a next time! You can not ever see him again!\nMonica: I can not see him? I mean, you can't tell me what to do!\nChandler: That's so funny, because I think I just did!\nMonica: Oh y'know what? If you're gonna be acting like this all night, I really, I don't even want to be around you.\nChandler: Fine with me!\nMonica: Fine! Happy Anniversary!\nJoey: Whoa! Whoa! Guys! Please! Come on! Come on! This is obviously just a big misunderstanding.\nMonica: No it is not!\nChandler: What are you talking\nJoey: Hey-hey don't look at me! I just work here! (Walks away.)", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 7, "scene_id": "S05E23_007", "location": "Las Vegas", "scene_description": "we have the typical glamour shots of Vegas, the Strip, slot machines, a couple other gaming tables all set to the tune of you guessed it, Money. Anyhoo, we finally get through that and watch Chandler, Monica, and Phoebe enter Caesar's Palace carrying their luggage.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S05E23/scenes/S05E23_007"}}
{"id": "S05E23_008", "text": "[Scene: An aircraft cabin, Ross and Rachel are on their way to Vegas.]\nRachel: (taking off her sweater) Okay umm, Ross? I'm-I'm really warm, so I'm going to be taking off my sweater. Now, I'm just letting you know that this is not an invitation to the physical act of love.\nRoss: (sarcastic) Yep! That's hilarious!\nRachel: I'm sorry. I'm done. I'm done.\nRoss: Y'know, last night was embarrassing for you too.\nRachel: No, not really. I mean you've seen me naked hundreds of times.\nRoss: Uh-huh. But it was a first for the rest of my building.\nRachel: Okay. All right, that's true! But y'know I just don't embarrass that easily.\nRoss: What?! You totally get embarrassed!\nRachel: No, I don't! Ross, I think I'm just a more secure person than you are.\nRoss: Is that so?\nRachel: Yeah.\n(Pause.)\nRoss: (loudly so that everyone can hear) Hey lady! I don't care how much you want it! Okay?! I am not gonna to have sex with you in the bathroom! (Rachel sinks lower on her chair trying to hide.)", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 8, "scene_id": "S05E23_008", "location": "An aircraft cabin", "scene_description": "Ross and Rachel are on their way to Vegas.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S05E23/scenes/S05E23_008"}}
{"id": "S05E23_009", "text": "[Scene: Chandler's hotel room, he's sitting there with Joey who's talking about his helmet and running his hand through that feathery thing at the top.]\nJoey: Hey, y'know in Roman times this was more than just a hat.\nChandler: Really?\nJoey: Yeah, sure! Sure! They would uh, they would scrub the floors with it! They would use it to get the mud off their shoe. And sometimes underneath the horse would get dirty so they would stick it right\nChandler: (interrupting in the nick of time) Joey, I uh! I can't believe this is how I'm spending my anniversary.\nJoey: All right well, I'll take you someplace nice then. Look! A guy tipped me a hundred bucks today.\nChandler: Whoa!\nJoey: Yeah-yeah, he was playing blackjack for like an hour and he won $5,000. Can you believe that? $5,000!\nChandler: Y'know, if I won $5,000 I'd join a gym, y'know build up my upper body and hit Richard from behind with a stick! (Mimics it.)\nJoey: Wait a minute! Why don't I do what that guy did? I'll take this $100 and turn it into $5,000! And then I'll turn that into enough money to get my movie going again!\nChandler: Good luck! \nJoey: Chandler! I don't need luck. I have thought this through!\nChandler: I see.\n(Joey exits as Chandler shakes his head.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 9, "scene_id": "S05E23_009", "location": "Chandler's hotel room", "scene_description": "he's sitting there with Joey who's talking about his helmet and running his hand through that feathery thing at the top.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S05E23/scenes/S05E23_009"}}
{"id": "S05E23_010", "text": "[Scene: The casino bar, Phoebe and Monica are sitting at the bar, while Wayne Newton's signature song Danke Schoen is playing in the background.]\nMonica: (to the bartender) Thank you.\nPhoebe: Thanks.\nMonica: I can't believe this! This is like the worst night ever!\nPhoebe: Y'know Monica you had a minor setback in your relationship with Chandler. Big deal! It's only Chandler. (Monica turns and stares at her.) I am so sorry.\nMonica: This is crazy! I mean, it's such a stupid argument. I don't even wanna see Richard again.\nPhoebe: So go fix it! Go find Chandler! He's probably up in your room! Tell him that you're sorry and that you love him.\nMonica: Y'know what? You're right Phoebe. You're right. Thank you! (Gets up to find Chandler.)\nPhoebe: Sure! (When Monica gets close to the door.) (Yelling) Yeah! Las Vegas, number one!\n[Cut to the casino, Monica is walking through it past the craps table when she notices a chip on the floor. She picks it up and heads to the table.]\nMonica: Anybody lose this? (Holds up the chip and the woman next to her shakes her head no.)\nThe Croupier: Comin' out. Place your bet. (Monica does so.) Dice are out. (The woman next to Monica rolls the dice.) Double or nothin'! Pay the front line! (Monica won and doubled the chip.)\nMonica: Hmm.", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 23, "episode_id": "S05E23", "episode_title": "THE ONE IN VEGAS: Part 1", "scene_number": 10, "scene_id": "S05E23_010", "location": "The casino bar", "scene_description": "Phoebe and Monica are sitting at the bar, while Wayne Newton's signature song Danke Schoen is playing in the background.", "characters": ["Monica", "Phoebe", "The Croupier"], "firestore_path": "/episodes/S05E23/scenes/S05E23_010"}}
