{"id": "S05E01_001", "text": "THE ONE AFTER ROSS SAYS RACHEL\nWritten by: Seth Kurland Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 1, "scene_id": "S05E01_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S05E01/scenes/S05E01_001"}}
{"id": "S05E01_002", "text": "[Scene: Rosss Wedding, continued from last season, the Minister is about to marry Ross and Emily.]\nMinister: Friends. Family. We are gathered to celebrate here today the joyous union of Ross and Emily. (Time lapse) Now Ross, repeat after me. I Ross...\nRoss: I Ross...\nMinister: Take thee, Emily...\nRoss: Take thee, Rachel...(All his friends have looks of shock on their faces. He realizes what he said. Quickly he says.) Emily. (A slight chuckle.) Emily.\nMinister: (Looking and feeling awkward. he looks towards Emily.) Uhh...Shall I go on?\nRachel: (To the woman sitting in front of her) He-he said Rachel, right? Do you think I should go up there?\nEmily: Yes, yes, do go on.\nMinister: I think wed better start again. Ross, repeat after me. I, Ross\nRoss: I, Ross\nMinister: Take thee, EM-I-LY\nRoss: Take thee, (Glares at the Minister) Emily. (Chuckles) Like thered be anybody else. (Emily is glaring at him.)\nMinister: As my lawfully wedded wife, in sickness and in health, till death parts us.\nRoss: As my lawfully wedded wife, in sickness and in health, until death parts us. Really, I do. Emily. (Points at her.)\nMinister: May I have the rings? (He is given the rings) Emily, place this ring on Rosss finger as a symbol of your bond everlasting. (She jams the ring onto his finger) Ross, place this ring in Emilys hand as a symbol of the love that encircles you forever.\nRoss: Happy too.\nMinister: Ross and Emily have made their declarations and it gives me great pleasure to declare them husband and wife.\nRoss: Yay!\nMinister: You may kiss the bride.\n(He goes to kiss her, but she isnt very receptive of the kiss. She keeps avoiding him, until Ross finally gets to kiss her on her cheek.)\nMrs. Geller: (To Mr. Geller) This is worse than when he married the lesbian.\n(The band starts to play, and the recessional starts. Ross tries to take Emilys hand, but she snatches it away from him.)\nEmily: Just keep smiling.\nRoss: Okay.\nJoey: Well, that went well. Yeah.\nChandler: It couldve been worse, he couldve shot her.\n(Ross and Emily make it to the lobby.)\nRoss: (laughs) That uh, that was pretty funny. Wasnt it?\n(Emily gives him a forearm shot across the stomach.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 2, "scene_id": "S05E01_002", "location": "Rosss Wedding", "scene_description": "continued from last season, the Minister is about to marry Ross and Emily.", "characters": ["Chandler", "Emily", "Joey", "Minister", "Rachel", "Ross"], "firestore_path": "/episodes/S05E01/scenes/S05E01_002"}}
{"id": "S05E01_003", "text": "[Scene: The Wedding reception, Ross and Emily are in the bathroom and Emily is yelling at him. Rachel, Chandler, Joey, and Monica are standing outside the doorway.]\nEmily: (Yelling from inside the bathroom) Youve spoiled everything! Its like a nightmare! My friends and family are out there! How can I face them?! How can you do this to me?!\nJoey: (To the gang) Hey, no matter what happens with Ross and Emily, we still get cake right?\nRoss: (exiting the bathroom) That-that-thats all right, no honey, you take your time sweetie. Ill be right out here. (She slams the door in his face, to the gang) Shes just fixing her makeup.\nEmily: I hate you!!\nRoss: And, I love you!! (He walks into the living room)\nMr. Geller: Boy, bad time to say the wrong name, huh Ross?\nRoss: Thats true, thanks dad. (To All) People should be dancing! Huh? Hey, this is a party! Come on! Joey, dance!! (He starts to dance but stops when no one else joins him.)\n(Mrs. Walthams phone rings and she answers it.)\nMrs. Waltham: Yes, Waltham interiors.\nPhoebe: (On the phone, in New York) Uh, hello, this is Ross Gellers personal physician, Dr. Philange.\nMrs. Waltham: Who?\nPhoebe: Yeah, Ive discovered that Ross forgot to take his brain medicine, uh, now without it, uh, in the brain of Ross, uh womens names are interchangeable, through-through no fault of his own.\nMrs. Waltham: Oh my God, Phoebe.\nPhoebe: No, not Phoebe, Dr. Philange. Oh no! You have it too!\n(Mrs. Waltham hangs up on her.)\nPhoebe: Hello?\n(Cut to Chandler and Monica at the buffet table.)\nChandler: Hey.\nMonica: Hey.\nChandler: Oh wow, I hope you dont take this the wrong way but, I know we had plans to meet up tonight and, ugh, Im just kinda worried about what it might do to our friendship.\nMonica: I know. How could we have let this happen?\nChandler: Seven times!\nMonica: Ugh! Well, yknow, we were away\nChandler: In a foreign, romantic country\nMonica: I blame London.\nChandler: Bad London! (Takes a spoon and smacks the turkey.)\nMonica: So look umm, while were st-still in London, I mean, we can keep doing it right?\nChandler: Well, I dont see that we have a choice. But, when were back home, we dont do it.\nMonica: Only here.\nChandler: Yknow, I saw a wine cellar downstairs\nMonica: Ill meet you there in two minutes.\nChandler: Okay! \n(He throws down his plate and runs to the wine cellar, Monica is about to follow him but is intercepted by Rachel.)\nRachel: Mon, honey, I gotta ask you something.\nMonica: (impatiently) Now?\nRachel: Ross said my name up there, I mean, come on, I just cant pretend that didnt happen can I?\nMonica: Oh, I-I dont know.\nRachel: Monica, what should I do?\nMonica: Just uh, do the right thing. (Uses some breath spray)\nRachel: What?\nMonica: Toe the line. Thread the needle. Think outside the box! (Tries to leave, but is stopped by Rachel.)\nRachel: Whoa, wait, listen, I think Im just gonna talk to Ross about what he think it meant.\nMonica: Wait. Rachel, no, hes married. Married! If you dont realize that, I cant help you.\nRachel: Okay, youre right. Youre right. You cant help me.\n(Cut to Mr. and Mrs. Geller.)\nMrs. Geller: Jack, is it all our fault? Were we bad parents?\nMr. Waltham: (walking by) Yes.\nMr. Geller: Oh yeah, well who serves steak when theres no place to sit, I mean how are you supposed to eat this?\nJoey: Hey, whats up? (He has solved the problem of eating the steak, hes eating it with his hands.)\n(Cut to Monica and Chandler, Monica is running up to him.)\nMonica: Where were you? We were supposed to meet in the wine cellar?\nChandler: Forget it, thats off.\nMonica: Why?!\nMr. Waltham: (drunkenly) The next tour of the wine cellar will plan in two in-in minutes\n(Joey walks up to them.)\nMonica: Joey, what are you doing? You promised Phoebe you wouldnt eat meat until she has the babies!\nJoey: Well, I figured were in another country, so it doesnt count.\nMonica: Thats true.\nChandler: The mans got a point.\n(Cut to Rachel and Ross.)\nRachel: Oh, hi!\nRoss: Hi!\nRachel: Hi. Sorry, things arent working out so well.\nRoss: Oh no! It could be better, but its gonna be okay, right?\nRachel: Oh yeah! Of course, I mean, shes gonna get over this, yknow? I mean, so you said my name! Yknow you just said it cause you saw me there, if youd have seen a circus freak, you wouldve said, \"I take thee circus freak.\" Yknow, it didnt mean anything, its just a mistake. It didnt mean anything. Right?\nRoss: No! No! Of course it didnt mean anything! I mean, uh well, I can understand why Emily would think it meant something, yknow, because-because it was you\nRachel: Right\nRoss: But it absolutely didnt. (Yelling towards the bathroom) It didnt!! It didnt!!\nJoey: (approaching) Ross, hey, the bands ready outside for your first dance with Emily, so\nRoss: (sarcastic) Oh! Oh-oh, the bands ready! Well, I-I-we gotta do what the band saysI dont care about the stupid band!!\nJoey: You spit on me man! (Wipes his face.)\nRoss: Look, Im sorry.\nJoey: Emily is kinda taking a long time, huh?\nRachel: (laughs) Yknow when I locked myself in the bathroom at my wedding, it was because I was trying to pop the window out of the frame.\nRoss: Oh, right!\nRachel: Get the hell out of there, yknow?\n(They all start laughing, and quickly stop when they realize what she just said and run over to the bathroom.)\nRoss: (Bangs on the bathroom door) Emily? Emily? Im coming in. (He opens the door to reveal that the window is gone, along with Emily.)\nRachel: Well, look at that, same thing.", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 3, "scene_id": "S05E01_003", "location": "The Wedding reception", "scene_description": "Ross and Emily are in the bathroom and Emily is yelling at him. Rachel, Chandler, Joey, and Monica are standing outside the doorway.", "characters": ["Chandler", "Emily", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E01/scenes/S05E01_003"}}
{"id": "S05E01_004", "text": "[Scene: London Marriott, Monica and Chandler are walking to her room.]\nChandler: Listen, in the middle of everything if I scream the word, \"Yippee!\" just ignore me.\n(She laughs and opens the door to reveal Rachel sitting on the bed.)\nMonica: Oh my God, Rachel! Hi!\nChandler: Oh, hello Rachel.\nRachel: Ross said my name. Okay? My name. Ross said my name up there that obviously means that he still loves me! (They both just stare at her.) Okay, dont believe me, I know Im rightdo you guys want to go downstairs and get a drink?\nChandler: Yes, we do. But, we have to change first.\nMonica: Yes, I want to change. And why-why dont you go down and get us a table?\nChandler: Yeah, well be down in like five minutes.\nMonica: (elbows him) Fifteen minutes.\nRachel: Okay.\n(The phone rings and Rachel answers it.)\nRachel: Hello? Oh, Pheebs! (To them) Its Phoebe!\nChandler: Oh, yay\nMonica: Great\nRachel: Hi!\nPhoebe: Hi, so what happened?\nRachel: Well, Ross said my name.\nPhoebe: Yeah, I know, but I dont think that means anything.\nRachel: Okay, Pheebs, yknow what, lets look at this objectively all right? Ninth grade, right? The obsession starts. All right? The summer after ninth grade he sees me in a two-piece for the first time, his obsession begins to grow. So then\nChandler: (To Monica) Hey, listen, why dont we go change in my room?\nMonica: But my clothes areohh! (They both leave.)\n(Cut to Chandlers room, he opens the door slowly to see if Joey is there and after seeing that he isnt, ushers Monica into the room, closes the door, and the security bar.)\nChandler: Wow, you look\nMonica: No time for that!\n(They both start to frantically rip each others clothes off, but are interrupted when Joey tries to open the door.)\nJoey: Hey, dude, let me in. I got a girl out here!\nChandler: Well, Ive got a girl in here.\nJoey: No you dont, I just saw you go in there with Monica!\nChandler: Well, were-were hanging out in here!\nJoey: Look, which one of us is gonna be having sex in there, me or you?\nChandler: Well, I suppose Id have to say you!! But, what if were watching a movie in here?\nMonica: Which we are, and-and we already paid for it. Its My Giant!\nJoey: My Giant? I love that movie!", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 4, "scene_id": "S05E01_004", "location": "London Marriott", "scene_description": "Monica and Chandler are walking to her room.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S05E01/scenes/S05E01_004"}}
{"id": "S05E01_005", "text": "[Scene: Ross and Emilys room, Chandler and Monica are still looking for a place to do the deed.]\nMonica: You really think this is okay?\nChandler: Well, Ross and Emily arent gonna use it.\nMonica: Oh, its so beautiful. Ohh! Yknow, I-I dont know if I feel right about this.\nChandler: Oh Mon-Mon-Mon-Mon-look, this is the honeymoon suite. The room expects sex. The room would be disappointed if it didnt get sex. All of the other honeymoon suites would think it was a loser.\nMonica: Okay!\nChandler: Okay!\n(They both run to rip the covers off the bed, but are interrupted by Ross.)\nRoss: (entering) Emily?!\nChandler: Nope, not under here!\nMonica: You didnt find her?\nRoss: No, Ive looked everywhere!\nChandler: Well, you couldnt have looked everywhere or else you wouldve found her!\nMonica: Yeah, I think you should keep looking!\nChandler: Yeah, for about 30 minutes.\nMonica: Or 45.\nChandler: Wow, in 45 minutes you can find her twice. (Monica smiles at that.)\nRoss: No! For all I know, shes trying to find me but couldnt because I kept moving around. No, from now on, Im staying in one place. (He sits down on the bed.) Right here.\nMonica: Well, its getting late.\nChandler: Yeah, were gonna go.\nRoss: Actually, do you guys mind staying here for a while?\nMonica: Ugh, yknow, umm we gotta get up early and catch that plane for New York.\nChandler: Yeah, its a very large plane.\nRoss: (disappointed) Thats cool.\nChandler: But, well stay here with you.\nRoss: Thanks guys! (They both sit down on either side of him.) I really appreciate this, yknow, but you dont have to rub my butt.\n(Chandler slowly takes his hand away.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 5, "scene_id": "S05E01_005", "location": "Ross and Emilys room", "scene_description": "Chandler and Monica are still looking for a place to do the deed.", "characters": ["Chandler", "Monica", "Ross"], "firestore_path": "/episodes/S05E01/scenes/S05E01_005"}}
{"id": "S05E01_006", "text": "[Scene: Ross and Emilys room, the next morning. Ross is now asleep and has his head in Monicas lap and his feet on Chandlers lap. Monica and Chandler are both still awake and depressed.]\nChandler: We have to leave for New York in an hour.\nMonica: I know, Ive been looking at those doors, they look pretty sound proof, dont you think?\nChandler: We cant do that thats insane. I mean A he could wake up and B yknow, lets go for it.\n(They both try to slowly extricate themselves from Ross, but theres a knock on the door that awakens him.)\nRoss: Em-Emily? (Looking around for her.) Em-Emily? (He runs to the door.) Emily! (He opens the door to reveal the Walthams standing outside.)\nMr. Waltham: No.\nMrs. Waltham: You can forget about Emily, shes not with us.\nMr. Waltham: Weve come for her things.\nRoss: Wait, well wh-wh-wh-where is she?\nMr. Waltham: Shes in hiding. Shes utterly humiliated. She doesnt want to see you ever again.\nMrs. Waltham: Were very sad that it didnt work out between you and Emily, monkey. But, I think youre absolutely delicious.\nMr. Waltham: Excuse me, Im standing right here!\nMrs. Waltham: Oh yes, there you are.\nRachel: (entering, carrying an armful of those little soaps.) Hey-hey, you guys oh hurry up, get some, theres a whole cart outside (Sees the Walthams and stops.)\nMr. Waltham: Goodbye Geller.\nRoss: Now, hold on! Hold on! (Stops him) Look, look, your daughter and I are supposed to leave tonight for our honeymoon, now-now you-you tell her that Im gonna be at that airport and I hope that shell be there too! Oh yeah, I said Rachels name, but it didnt mean anything, Okay? Shes-shes just a friend and thats all! (Rachel sits down, depressed.) Thats all! Now just tell Emily that I love her and that I cant imagine spending my life with anyone else. Please, promise me that youll tell her that.\nMr. Waltham: All right, Ill tell her. (To his wife) Come on bugger face!\nMrs. Waltham: (As she walks pass Ross, she pats his but.) Call me.\nMr. Waltham: You spend half your life in the bathroom, why dont you ever go out the bloody window!", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 6, "scene_id": "S05E01_006", "location": "Ross and Emilys room", "scene_description": "the next morning. Ross is now asleep and has his head in Monicas lap and his feet on Chandlers lap. Monica and Chandler are both still awake and depressed.", "characters": ["Chandler", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S05E01/scenes/S05E01_006"}}
{"id": "S05E01_007", "text": "[Scene: A 747 somewhere over the North Atlantic, Monica and Chandler are sitting in first class, depressed.]\nMonica: Yknow, maybe its best that we never got to do it again.\nChandler: Yeah, it kinda makes that-that one night special. (Realizes something) Yknow, technically we still are over international waters.\nMonica: Im gonna go to the bathroom, maybe Ill see you there in a bit?\nChandler: Kay!\n(Monica gets up and heads for the bathroom, Chandler turns to watch her go and is startled to see Joey sitting in Monicas seat.)\nJoey: Can I ask you something?\nChandler: Uhh, no.\nJoey: Felicity and I, were watching My Giant, and I was thinking, \"Im never gonna be as good an actor as that giant.\" Do you think Im just wasting my life with this acting thing?\nChandler: No.\nJoey: I mean, the giant is like five years younger than me, yknow, you think Ill ever get there?\nChandler: Yes.\nJoey: Thanks man. \nChandler: Okay man. (Chandler starts to get up.)\nJoey: But what about how much taller he is than me?\n(Time lapse, Chandler is finishing his third little bottle of booze.)\nJoey: I mean, theres no way I can make myself taller now, yknow? And who knows what science will come up with in the future, but Chandler, what if I die an unsuccessful, regular sized man?\n(Monica returns.)\nJoey: Hey, Monica, wow youve been in the bathroom for like a half-hour.\nMonica: I know!\nJoey: Had the beef-tips, huh?", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 7, "scene_id": "S05E01_007", "location": "A 747 somewhere over the North Atlantic", "scene_description": "Monica and Chandler are sitting in first class, depressed.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S05E01/scenes/S05E01_007"}}
{"id": "S05E01_008", "text": "[Scene: Monica and Rachel's, Phoebe is eating cereal from a bowl she has balanced on her stomach as Joey, Chandler, and Monica return.]\nPhoebe: Hey!\nChandler: Hey!\nJoey: Hi!\n(They all hug.)\nPhoebe: (To Joey) You ate meat! (Joey is shocked) (To Chandler and Monica) You had sex! (Theyre shocked.)\nChandler: No we didnt!\nPhoebe: I know you didnt, I was talking about Monica.\nMonica: Phoebe, I did not have sex.\nPhoebe: This pregnancy is throwing me all off.\nJoey: All right, Im gonna go say hi the chick and the duck.\nPhoebe: Oh, me too!\nJoey: Why would you need to say hi to them, youve been feeding them for four days?\nPhoebe: Oh right, maybe Ill just go home. \n(She grabs her bag and leaves, Joey moves a little quicker to his apartment, leaving Monica and Chandler alone.)\nMonica: Well, we certainly are alone.\nChandler: Yes! Good thing we have that, Not in New York rule.\nMonica: Right. Umm, listen since were-we-re on that subject, umm, I just wanted to tell you that uh, well, I-I was going through a really hard time in London, what with my brother getting married and that guy thinking I was Rosss mother\nChandler: Right.\nMonica: Well, an-anyway, I justthat night meant a lot to me, I guess Im just trying to say thanks.\nChandler: Oh. Yknow, that night meant a lot to me too, and it wasnt because I was in a bad place or anything, it just meant a lot to me cause, youre really hot! Is that okay?\nMonica: (laughs) Thats okay.\nChandler: And Im cute too.\nMonica: And youre cute too.\nChandler: Thank you! (They hug.) All right, I gotta go unpack.\nMonica: Okay.\nChandler: Bye. \n(After he closes the door, Monica starts to follow him, but thinks better of it and stops.)\nChandler: (entering) Im still on London time, does that count?\nMonica: That counts!\nChandler: Oh, good! (They start kissing.)", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 8, "scene_id": "S05E01_008", "location": "Monica and Rachel's", "scene_description": "Phoebe is eating cereal from a bowl she has balanced on her stomach as Joey, Chandler, and Monica return.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S05E01/scenes/S05E01_008"}}
{"id": "S05E01_009", "text": "[Scene: An airport in London, Ross is waiting for Emily to show up to go on their honeymoon and sees Rachel walking past.]\nRoss: Rach! Rach!\nRachel: (she stops and turns) Hi!\nRoss: Hi! What are you, what are you doing here?\nRachel: Well, I-I-Ive been on Standby for a flight home for hours. \nRoss: Oh.\nRachel: Ohh, so no sign of Emily huh?\nRoss: Not yet.\nRachel: So umm, what time are you supposed to leave?\nGate Agent: (On the P.A.) This is the last call for Flight 1066 to Athens. The last call.\nRoss: Pretty soon I guess.\nRachel: Yeah. Im sorry.\nRoss: I just, I dont understand, I mean, how-how can she do this? Yknow, what, am I, am I like a complete idiot for thinking that shed actually show up?\nRachel: No, youre not an idiot, Ross. Youre a guy very much in love.\nRoss: Same difference.\nGate Agent: (On the P.A.) All ticketed passengers for Flight 1066 to Athens should now be on board.\nRoss: I get it! Well, thats that.\nRachel: No, you know what, I think you should go.\nRoss: What?\nRachel: Yeah, I do. I think you should go, by yourself, get some distance, clear your head, I think itd be really good.\nRoss: Oh, I dont, I dont, I dont know\nRachel: Oh, come on Ross! I think it would be really good for you!\nRoss: I could, yeah, I can do that.\nRachel: Yeah.\nRoss: I cant, I cant even believe her! No, yknow what, I am, I am gonna go!\nRachel: Good!\nRoss: I know, why not?\nRachel: Right!\nRoss: Right?\nRachel: Right!\nRoss: Yknowthanks! (They hug)\nRachel: Okay, Ill see you back at home, if I ever get a flight out of here.\nRoss: Yeah, wellnah.\nRachel: What? Wait, what?\nRoss: Why dont you come, I mean, I-I have two tickets, why not?\nRachel: Well-well, I dont know Rossreally?\nRoss: Yeah, yeah, itll be great! You can, you can lay on the beach and I can cry over my failed marriage. See-see how I make jokes?\nRachel: Uh-huh.\nRoss: No really, I mean, I mean, God, I could use a friend.\nRachel: Oh wow, uh okay, uh maybe. Umm, yes, I can do that!\nRoss: Okay!\nRachel: Okay!\nRoss: Cool!\nRachel: All right!\nRoss: Come on! (They go to the jetway, Ross hands the tickets to the gate agent.) Here. \nRachel: Oh, okay, were going. Yeah.\nRoss: Ah! Ah! I forgot my jacket!\nRachel: Oh, wait-wait-wait\nRoss: You tell them to wait!\nRachel: Okay. Wait! Wait!\n(Ross retrieves his jacket and sees that not only has Emily arrived, but she as seen Rachel take her place on the plane.)\nRoss: Emily.\n(She stares at him and Ross realizes what shes thinking.)\nRoss: Oh no-no-no! Oh-no! (Emily starts to run out and Ross chases her.) No! No! Emily!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 9, "scene_id": "S05E01_009", "location": "An airport in London", "scene_description": "Ross is waiting for Emily to show up to go on their honeymoon and sees Rachel walking past.", "characters": ["Gate Agent", "Rachel", "Ross"], "firestore_path": "/episodes/S05E01/scenes/S05E01_009"}}
{"id": "S05E01_010", "text": "[Scene: Flight 1066 to Athens, Rachel is ordering a drink for Ross and herself.]\nRachel: Ahh, yes, I will have a glass of the Merlot and uh, (points to Rosss seat.) he will have a white wine spritzer. Woo! (Looks out the window.) Hey, look at that, the airports moving. (Realizes that thats not how it works.) Hey, are we moving?! Are we moving? Why are we moving? Hey, time-out, umm, yeah, does the captain know that were moving? (Sits back in defeat.) Oh my God. Oh, my gosh.\nEnd", "metadata": {"chunk_type": "scene", "season": 5, "episode_number": 1, "episode_id": "S05E01", "episode_title": "THE ONE AFTER ROSS SAYS RACHEL", "scene_number": 10, "scene_id": "S05E01_010", "location": "Flight 1066 to Athens", "scene_description": "Rachel is ordering a drink for Ross and herself.", "characters": ["Rachel"], "firestore_path": "/episodes/S05E01/scenes/S05E01_010"}}
