{"id": "S06E21_001", "text": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD\nTeleplay by: Scott Siveri Story by: David J. Lagana Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 1, "scene_id": "S06E21_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S06E21/scenes/S06E21_001"}}
{"id": "S06E21_002", "text": "[Scene: Central Perk, Phoebe, Rachel, Chandler, and Monica are there. Rachel is reading everyones horoscope.]\nRachel: Okay, Chandler!\nChandler: Okay.\nRachel: And your horoscope says, \"On the fifth a special someone is going to give you a gift.\"\nChandler: (To Monica) Oh, well thank you in advance. (Kisses her.)\nRachel: Op, but the twelfth brings a lovers spat.\nMonica: (To Chandler) You are going to make a joke about my special present! Why would you do that?!\nRachel: Oh, wait and on the nineteenth a secret crush announces itself.\n(Phoebe winks and licks her lips while eyeing Chandler.)\nJoey: (entering) Hey guys!\nChandler: Hey!!\nRachel: (ecstatic) Oh my God! Its Joey Tribbiani of Mac and C.H.E.E.S.E.!!!!!!!\n(Everyone claps and cheers, Joey mimics looking about with a gun.)\nChandler: Oh thats right. Its your first day! So are you psyched to fight fake crime with your robot sidekick?\nJoey: Am I psyched? The lead in my own TV series? Ive dreamed about this for years! Why have I not been preparing?!\nPhoebe: No! Joey, youre going to be great!\nJoey: But I got to act with a robot Pheebs, and-and I dont know anything about technology! I cant even use Chandlers computer except to find porn! And-and thats only cause its right there when you turn it on!\nMonica: I think our lovers spat will start a little early this month.\nPhoebe: (in a sexy voice to Chandler) Ill be waiting.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 2, "scene_id": "S06E21_002", "location": "Central Perk", "scene_description": "Phoebe, Rachel, Chandler, and Monica are there. Rachel is reading everyones horoscope.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S06E21/scenes/S06E21_002"}}
{"id": "S06E21_003", "text": "[Scene: Central Perk, time lapse. Phoebe is now looking at the covers of two different books.]\nChandler: Are you judging them by their covers? Because youre really not supposed to do that.\nPhoebe: No, Im just deciding which one to useIm gonna start writing another book!\nRachel: Be-because the last one was such a big seller?\nPhoebe: Well, if you must know I have written 14 books. And as I am the only one who has read them, I can tell you that they all have been very well received. \nRoss: (entering) Hey!\nChandler: Hey!\nRachel: Hey!\nRoss: What are you guys doing later?\nPhoebe: Oh, Rachel and I have appointments to get our hair cut.\nRachel: (To Phoebe) We do?\nPhoebe: I want to see what he wants first.\nRachel: Okay.\nRoss: (continuing) I just found out that Elizabeths dad wants to meet me.\nChandler: Wait a minute, hold the phone! Youre not Elizabeths dad?!\nRoss: Come on guys, I-I really want this guy to like me. It-it would really help me out if you guys were here to make me look good.\nAll: Of course well help! Yeah! Well be here!\nRoss: Thanks!\nMonica: We know how tough those parent/teacher conferences can be.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 3, "scene_id": "S06E21_003", "location": "Central Perk", "scene_description": "time lapse. Phoebe is now looking at the covers of two different books.", "characters": ["All", "Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_003"}}
{"id": "S06E21_004", "text": "[Scene: Pier 59 Studios, its the set of Mac and C.H.E.E.S.E. The producer is showing Joey around the set.]\nThe Producer: (walking into Macs office) So uh, heres your office set!\nJoey: Wow! Huh? (Picks up the phone) Mac Macaveli, Private Investigator!\nThe Producer: (checking his watch) Lets get you into wardrobe for a fitting.\nJoey: Okay. Hey uh, when do I get to meet the robot?\nThe Producer: Im sorry, why dont we do that right now? Hes right here. (Points to a guy.)\nJoey: Okay.\nThe Producer: Joey Tribbiani, this is\nJoey: Oh wow! Hes so lifelike! (Starts touching the guys cheeks) Unbelievable! (He starts tugging on the guys ears.\nThe Producer: This is Wayne, the man who created and operates C.H.E.E.S.E.\nJoey: (slaps Wayne on his cheek) How do you do there, Wayne? (Backs away.)\nThe Producer: Ill let you two guys get acquainted, huh? (Walks away.)\nJoey: Okay. Sorry about that(Mimics that cheek thing he just did.) Uh, so wheres C.H.E.E.S.E.?\nWayne: C.H.E.E.S.E. is right here. (He puts on his headset, picks up the controller, and wheels C.H.E.E.S.E. in. C.H.E.E.S.E. is just a plain old robot on tracks; he kinda looks like No. 5 in the movie Short Circuit.)\nC.H.E.E.S.E.: (Wayne with a computerized voice) Nice to meet you Mac!\nJoey: (laughs) This is like the temporary robot, right?\nWayne: No. Why?\nJoey: Well, I-I just, I just it was going to be like a really cool robot, yknow? Like the terminator or uh, when I first saw you.\nWayne: I spent two years developing this machine, its absolutely state of the art.\nJoey: Im sorry, it justI dont know it doesnt really look like it can do anything.\nWayne: It can do this. (He moves C.H.E.E.S.E.s arm close to Joeys special area and he jumps back.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 4, "scene_id": "S06E21_004", "location": "Pier 59 Studios", "scene_description": "its the set of Mac and C.H.E.E.S.E. The producer is showing Joey around the set.", "characters": ["Joey", "The Producer", "Wayne"], "firestore_path": "/episodes/S06E21/scenes/S06E21_004"}}
{"id": "S06E21_005", "text": "[Scene: Central Perk, Ross is at the counter drinking coffee as Elizabeth enters with her dad, Paul. Elizabeth goes to kiss Ross, but he just kisses her on the forehead. By the way Paul is played by Bruce Willis. Yes, that Bruce Willis from Moonlighting, Die Hard, and Armageddon.]\nElizabeth: This is my father, Paul Stevens. Dad, this is Ross Geller.\nRoss: It-its great to meet you Paul.\nPaul: I usually prefer Elizabeths boyfriends to address me as Mr. Stevens.\nRoss: Of course, of course, Mr. Stevens.\nPaul: So Ross, what your problem?\nRoss: Eh-whExcuse me?\nPaul: Why cant you get a girlfriend your own age?\nRoss: Thats funny. Umm. (Pause, then serious) Its not funny.\nPaul: I dont like you going out with my daughter Ross.\nRoss: Okay. I can, I can see that. Umm, but I think if you give me umm, one chance I can, I can change your mind.\nPaul: Okay.\nRoss: What?\nPaul: Okay. Ill give you one chance to change my mind. (Ross laughs in relief) You got one minute. (Ross suddenly gets worried.)\nElizabeth: Daddy!\nPaul: Fine! Two minutes. Go.\nRoss: This isyou(Ross starts laughing.)\nPaul: (laughs then checking his watch) 1 minute 50 seconds.\nRoss: Okay, umm I want you to know that I have never done anything like this before. I mean, I mean Ive been in um, relationships in general, uh but I have never done it with a studentI mean I notnot it! I mean, I mean I dontWe havent done it. Uh, I mean, I mean, weve-weve-weve done stuff. (Paul is not amused.) Okay, okay, a joke, a jokelighten the mood. Umm, two guys go into a bar. One of them is Irish.\nPaul: Im Irish.\nRoss: And the Irish guy wins the joke!\n(Monica, Chandler, and Phoebe enter.)\nMonica: Ross!!\nChandler: Ross!\nMonica: How crazy that wed run into you!\nRoss: Oh God, thank you! (Runs and gives all of them a group hug.) Umm, uh, Mr. Stevens Id like you to meet my friends uh, this is Phoebe, Monica, and Chandler.\nPhoebe: Youre Elizabeths father, huh? I can see now where she gets her rugged handsomeness.\nMonica: (obviously attracted to him) Is-is-is there a-a Mrs. Stevens?\nChandler: Theres a Mr. Bing!\nPaul: No, unfortunately Lizzies mom passed away shortly after she was born. I raised her by myself.\nPhoebe and Monica: (sympathetic) Ohh!\nPaul: I get that a lot.\nRoss: Okay umm, why dont we all take a seat, yknow? And uh, and Ill get us all some uh some coffees(He goes to pull out Elizabeths chair, but Paul steps in)Yeah, why dont you. (Paul pulls out her chair) Uh and you guys can talk about whatever, whatever you want. Yknow? Whatever pops into your head. (He turns his back to Paul and Elizabeth and points to himself for Chandler, Monica, and Phoebe. Then he goes to order the coffee.)\nMonica: Yknow, it is so strange seeing Ross here this time of day, cause usually hes got the childrens hospital.\nPhoebe: Yeah. Not looking for dates. (Monica turns in horror.)\nElizabeth: So uh, Monica is Rosss sister.\nMonica: And hes a great brother!\nPaul: I had a sister.\nMonica: Ohh!\nPaul: She passed away.\nMonica and Phoebe: (sympathetic) Ohh!\nPaul: Oh, you dont have to do that every time.\nChandler: But uh Ross, Ross is a great guy! I was roommates with him in college. Uh, funny story (He starts laughing then notices that Paul isnt happy.) Youre roommate in college died didnt he?\nPaul: A part of him did yes.\nRoss: (returning with the coffee) Okay here we are Paul, Elizabeth. (He sets down their cups.) So I hope you guys were finding something to talk about.\nChandler: Yes, we were just\n(Rachel runs in.)\nRachel: Hi, Im sorry Im late but I am ready, ready to talk you up! When does Lizs father get here?\nPaul: Im already here.\nRachel: Oh! Ross is sooo great!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 5, "scene_id": "S06E21_005", "location": "Central Perk", "scene_description": "Ross is at the counter drinking coffee as Elizabeth enters with her dad, Paul. Elizabeth goes to kiss Ross, but he just kisses her on the forehead. By the way Paul is played by Bruce Willis. Yes, that Bruce Willis from Moonlighting, Die Hard, and Armageddon.", "characters": ["Chandler", "Elizabeth", "Monica", "Monica and Phoebe", "Paul", "Phoebe", "Phoebe and Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_005"}}
{"id": "S06E21_006", "text": "[Scene: Monica, Chandler, and Phoebe's, Phoebe is working on her book at the kitchen table, Monica is on the couch, and Chandler is entering from the bathroom carrying a package of toilet paper.]\nChandler: Hey honey, you got the kind with the little girl, you said we were gonna to get the kind with the baby.\nMonica: No, you said the baby creeps you out.\nChandler: No, the little girl creeps me out.\nMonica: You said the baby.\nChandler: Why would the baby creep me out?\nMonica: Why would the little girl creep you out?\nPhoebe: (writing frantically) You guys, Im sorry, could you please talk a little slower? \nChandler: This is going in your book?\nPhoebe: Yeah, its about relationships. Yknow? The traps, the pitfalls, what not to do, keep going. This stuff is great!\nMonica: What?! Excuse me!\nPhoebe: And how none of it matters when the people really love each other. (Chandler and Monica kiss.) And how people will believe anything you tell them as long as its a compliment.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 6, "scene_id": "S06E21_006", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Phoebe is working on her book at the kitchen table, Monica is on the couch, and Chandler is entering from the bathroom carrying a package of toilet paper.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S06E21/scenes/S06E21_006"}}
{"id": "S06E21_007", "text": "[Scene: Central Perk, Rachel is there alone as Paul enters.]\nRachel: (seeing him) Oh hi!\nPaul: Hi! Hi. (Hes looking around.) I think I left my keys here somewhere.\nRachel: Oh! Well lets look for them. (Finds some under one of the couch cushions. It has a pink, fuzzy ball on the key chain.) Oh-oh-hey! Are these them?\nPaul: No.\nRachel: All right! (Throws them back under the cushion.)\nPaul: Oh, here they are right here. (Picks them up from underneath the corner of the couch.)\nRachel: Oh good.\nPaul: Thanks for your help. (Starts to leave.)\nRachel: (chasing after him) Oh, wait! Sorry, Mr. Paul? Mr. Paul?\nPaul: Just call me Paul.\nRachel: Paul. Umm, I just wanted you to know that Ross really is a great guy.\nPaul: Well maybe you can date him then that would save me the trouble of killing him. (Rachel laughs then starts looking at him.) Are you okay?\nRachel: You just dont look old enough to have a twenty-year-old daughter.\nPaul: Well, we were very young when we had her.\nRachel: Oh. We?\nPaul: Well yeah, it usually, it takes two people to (He taps his index fingers together.)\nRachel: Oh no! Yes! Of course, I know that! I justI meant yknow are you still a We or are you just You?\nPaul: Im just me, my wife died shortly after Lizzie was born.\nRachel: (sympathetic) Ohh. So you raised her all on your own?\nPaul: Yes I did.\nRachel: Ohh. (She touches his arm for support and likes what she feels) Ooh!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 7, "scene_id": "S06E21_007", "location": "Central Perk", "scene_description": "Rachel is there alone as Paul enters.", "characters": ["Paul", "Rachel"], "firestore_path": "/episodes/S06E21/scenes/S06E21_007"}}
{"id": "S06E21_008", "text": "[Scene: Monica, Chandler, and Phoebe's, Phoebe is still writing in her book, Chandler and Monica are in the kitchen as Joey enters.]\nJoey: Hey!\nChandler: Hey!\nPhoebe: Hey!\nMonica: How was your first day?\nJoey: Pretty great! Except I did get a little attitude from the robot.\nChandler: Damn those robots, theyre supposed to be our faithful servants!\nJoey: Anyway, it wasnt the robot, it was the guy who controls him. Yeah, he doesnt like me. He had C.H.E.E.S.E. knock over the sandwich right when I was reaching for one! Ohh!\nPhoebe: Well, why dont you just get him fired?\nJoey: I may have to, I hate to do it, but Im the star! Yknow? Theres a limit to how many sandwiches I can eat off the floor. (His cell phone rings) Excuse me. (Answers it, on phone) Joey Tribbiani. \nEstelle: (on the other end) Joe! Im glad I found ya, I got an audition for ya!\nJoey: Wow!\nEstelle: The thing is its kinda on the Q.T. The actor who has the part doesnt know he might be fired. Its the lead in a series, Mac and C.H.E.E.S.E.\nJoey: Im the lead in Mac and C.H.E.E.S.E.!!\nEstelle: Uh-oh!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 8, "scene_id": "S06E21_008", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Phoebe is still writing in her book, Chandler and Monica are in the kitchen as Joey enters.", "characters": ["Chandler", "Estelle", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S06E21/scenes/S06E21_008"}}
{"id": "S06E21_009", "text": "[Scene: Joey and Rachel's, Ross is entering looking for Joey, but instead he finds Paul and Rachel making out on the couch.]\nRoss: Joey?!\nPaul: Hi Ross.\nRachel: I was just getting him to like you.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 9, "scene_id": "S06E21_009", "location": "Joey and Rachel's", "scene_description": "Ross is entering looking for Joey, but instead he finds Paul and Rachel making out on the couch.", "characters": ["Paul", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_009"}}
{"id": "S06E21_010", "text": "[Scene: Joey and Rachel's, scene is continued from earlier.]\nRoss: Joey?! Joey!! (He runs into his bedroom.)\nRachel: Ross, Joey is not here.\nRoss: Okay, Ill just wait for him in here!\nRachel: Ross, its okay. You can come out.\nPaul: Yeah Ross its okay, its me, Mr. Stevens.\nRoss: (coming out of the bedroom) Oh! Oh my God! I didnt even see you!\nPaul: Sure you did! You came in, you got all awkward, and you ran into the bedroom. You were shouting, \"Joey! Joey!\" Bye Rach. (Kisses her.)\nRachel: Bye!\nPaul: Ill call you later. Bye Ross. (Leaves)\nRoss: What-what-what thehow da-how did-what the-how did-what?!\nRachel: Well, yknow he lost his keys so he was looking for them\nRoss: (incredulous) In your mouth?!\nRachel: No! Downstairs! And we got to talking yknow, for like two hours, and I really liked him so I invited him up here for a cup of coffee.\nRoss: You were at the coffeehouse!\nRachel: Ross, whats the big deal? So I kissed the guy!\nRoss: He is my girlfriends father, okay? Its-its, its weird!\nRachel: WhYou dated my sister!\nRoss: That was different!\nRachel: What? Why?!\nRoss: This is weird for me!\nRachel: Ross look, look this is good for you. Okay? Lets face it, so far the guys not lovin ya! But I can turn that around! I got the inside track! We can all go out to dinner, yknow? And I can talk you up! Ross, the guy is a very, very successful lawyer!\nRoss: How is that important?\nRachel: Oh its important!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 10, "scene_id": "S06E21_010", "location": "Joey and Rachel's", "scene_description": "scene is continued from earlier.", "characters": ["Paul", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_010"}}
{"id": "S06E21_011", "text": "[Scene: Monica, Chandler, and Phoebe's, Joey is telling everyone about his impending termination at Mac and C.H.E.E.S.E.]\nJoey: Apparently, theres like a million guys out there that can play Mac, and theres only this one robot and this one guy who controls it! I didnt know he could get me fired! What am I going to do?\nMonica: Well yknow Joey, youre a pretty charming guy.\nJoey: Thanks, but I kinda have a problem to deal with here.\nMonica: No sweetie, youve got to win over the guy that controls C.H.E.E.S.E.! Youve got to kiss some serious robot ass!\nJoey: Thats not a bad idea. Yeah. Okay, but if I got to turn on the charm tomorrow Im not wasting anymore of it over here with you guys. (Starts to leave, but stops and turns to Phoebe.) Well, actually I got a little bit saved for you Pheebs. (Exits.)\nChandler: So do you think uh, Joeys more charming than me?\nMonica: Yeah! Thats why Im sleeping with him on the side.\nChandler: Yeah, you wish. (Stops to think about it and gets depressed.)\nPhoebe: (writing in her book) \"You wish.\"\nMonica: Phoebe, stop writing about us!\nPhoebe: Im not writing about you! Im writing about other people.\nChandler: Who?\nPhoebe: Marcia and Chester.\nMonica: Okay fine! Fine! Then you know what, Ill just write about Phyllis! Hmm!\nChandler: Hmm.\nMonica: (writing on a piece of paper) Phyllis is sitting in a chair.\nChandler: Oh.\nPhoebe: I see what youre doing!\nMonica: (still writing) Phyllis sees what Im doing.\nChandler: Oh-oh.\nPhoebe: Ooh, I have tasted my own medicine and it is bitter!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 11, "scene_id": "S06E21_011", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Joey is telling everyone about his impending termination at Mac and C.H.E.E.S.E.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S06E21/scenes/S06E21_011"}}
{"id": "S06E21_012", "text": "[Scene: Pier 59 Studios, Joey is walking up to C.H.E.E.S.E. and Wayne.]\nJoey: Morning! Hey, hows my favorite genius and my little robot buddy?! (Pats C.H.E.E.S.E. on the head.)\nWayne: Dont touch him!\nJoey: Okay! (He yanks his hand away.) All right. Umm, all right Wayne, level with me. Okay? I-I keep hearing all these rumors that I might get fired. Okay, they even have actors coming in to read for my part! Come on man, you-you got to give me a second chance! I mean, I love-I love this little guy! (He grabs C.H.E.E.S.E.s arm and pulls it off at the elbow.) Ah-ah!! (Wayne is shocked.) Okay, thats why you didnt want me to touch him right? Here you go! Okay? (Hands Wayne the arm and he goes to fix it. Meanwhile Joey starts to berate himself.) Stupid! I cant believe it! God! (A very beautiful woman walks by.) (To her) Hey, how you doin? (He and her go over to talk and Wayne looks on with envy.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 12, "scene_id": "S06E21_012", "location": "Pier 59 Studios", "scene_description": "Joey is walking up to C.H.E.E.S.E. and Wayne.", "characters": ["Joey", "Wayne"], "firestore_path": "/episodes/S06E21/scenes/S06E21_012"}}
{"id": "S06E21_013", "text": "[Scene: A Restaurant, Ross and Rachel are on their double date. Rachel is busy talking Ross up.]\nRachel: So it seemed that my prom date had stood me up, so Ross selflessly, offered to take me.\nElizabeth: What a nice story!\nPaul: So Ross was in college and decided to jump at the chance to take a young girl to her high school prom.\nRachel: Wow! I definitely did not see that one backfiring! Im gonna go to the bathroom.\nRoss: Yeah, take your time. \n(Rachel heads for the bathroom.)\nRoss: (to Paul) Just-just so you know I was a freshman and she was a senior. So it wasnt as bad as-as\nPaul: Ross, look, I know Ive been giving you a lot of jabs and its partly because Im very protective of Lizzie, and partly because well, they just keep coming to me. But I have to admit that after all the wonderful things that Lizzie has told me and the many, many, (pause) many stories that Rachel has told me that, well (pause) youre not (pause) all bad.\nRoss: Not all bad.\nPaul: And anyhow, Im sorry I was so harsh before, but you have to understand that I (pause) still look at Lizzie like shes a twelve-year-old girl.\nRoss: Yeah. You know what? I know what you mean; I do that too.\nPaul: I beg your pardon?\nRoss: No! No! NotI dont mean I-I see her as a twelve-year-old girl! I mean I-I have a son, whos umm six and I still think of him as a baby.\nPaul: You have a son?\nRoss: Yeah, well my-my ex-wife and I share custody of Ben and umm, uh, and just so you know, Carol and I are on excellent terms as Im sure you are with your wife! (Realizes) Oh, Im sorry! (To Elizabeth) Its unbelievable!\nPaul: Dont worry about it, I just didnt realize you were married. (Rachel returns and hears that.) \nRachel: Oh we were, but that was just a (pause as the audience reacts), I mean that was just a big drunken mistake.\nRoss: Youre back.\nPaul: You two were married?!\nRachel: Oh! Whoops! Im sorry, you were talking about Emily!\n(Ross slams his head down on the table.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 13, "scene_id": "S06E21_013", "location": "A Restaurant", "scene_description": "Ross and Rachel are on their double date. Rachel is busy talking Ross up.", "characters": ["Elizabeth", "Paul", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_013"}}
{"id": "S06E21_014", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica and Chandler are entering and theyre arguing.]\nMonica: Chandler, we said we would meet at the coffeehouse at six.\nChandler: We said seven!\nMonica: We said six!\nChandler: The only way that I said six would be if the sevens, let meet at seven, not at six.\nMonica: Yeah and if I had seven, maybe I wouldve said something like this, \"Wow! My boyfriends such a wise assseven!\"\nPhoebe: (Turning around in the chair) Hi!\nChandler: Oh my good God.\nMonica: Ugh!\nPhoebe: I know what time you said.\nChandler: What?!\nPhoebe: Well actually, I know what time Chester and Marcia said.\nMonica: What time?\nPhoebe: Quite an interesting turn of events, suddenly its my book to the rescue, huh? (Reading her book) Ooh, very interesting. Yeah, well this certainly clears things up.\nChandler: (disgusted) What does it say?!\nPhoebe: I will tell you as soon as you thank me for writing my book.\nChandler: Thank you for writing your book. Its-its uh, great book and you are the queen of everything.\nPhoebe: Thanks! So are you.\nChandler: (To Monica) I told you I should not wear this color. (Hes wearing a reddish-orange sweater.)\nPhoebe: (reading from her book) Mon (Pause as she restarts) Marcia and Chester are planning on seeing a movie on Sunday night. Marcia thinks theyre supposed to meet at six, Chester thinks its at seven.\nChandler: So you knew we were gonna miss the movie!\nPhoebe: Thats right.\nMonica: Inside of telling us you decided to write in your stupid book!\nPhoebe: (writing in her book) Marcia and Chester are mad at Phyllis.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 14, "scene_id": "S06E21_014", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica and Chandler are entering and theyre arguing.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S06E21/scenes/S06E21_014"}}
{"id": "S06E21_015", "text": "[Scene: Joeys Dressing Room, Joey and Chandler are there.]\nJoey: I cant believe Im going to lose this job!\nChandler: Oh Im so sorry man! Is there anything I can do?\nJoey: Yeah! Help me get this mini-fridge past the security guard.\n(Theres a knock on the door and Joey answers it to Wayne.)\nWayne: Hey Joey, I want to talk to you.\nJoey: Yeah? Well, I dont want to talk to you Wayne! I hate you! You ruined my life! Oh, Chandler, Wayne. Wayne, Chandler. (They shake hands.)\nChandler: Hi, how are ya?\nWayne: Joey, Joey, I-I-Ill g-get you your job back if you help me out.\nJoey: (incredulous) Why should I help you?!\nChandler: (whispering in Joeys ear) The reason he just said.\nJoey: (happily) What do you need?\nWayne: I-I-I saw you on stage talking to that beautiful woman, yknow Sarah? \nJoey: Yeah?\nWayne: I wish I could talk to her.\nJoey: What are you in love with her or something?\nWayne: Yeah. Her. All of them. Anyone.\nChandler: Yeah, Ive been there my friend.\nWayne: Listen, I-I guarantee you keep your job if you can teach me how to talk to women like you do.\nJoey: Oh wow Wayne, its not really something you can teach yknow? Its pretty much something youre born with if you(Off Chandlers look)You-you can teach it! Ill show you right how to do it.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 15, "scene_id": "S06E21_015", "location": "Joeys Dressing Room", "scene_description": "Joey and Chandler are there.", "characters": ["Chandler", "Joey", "Wayne"], "firestore_path": "/episodes/S06E21/scenes/S06E21_015"}}
{"id": "S06E21_016", "text": "[Scene: A Restaurant, Rachel is still trying to talk up Ross, not to much success.]\nRachel: I mean if you think about it, I mean Ross did learn something from each marriage.\nPaul: How to make the next one even shorter?\nRachel: Now wait a minute thats not fair. He was married to me a hell of a lot longer than he was married to Emily, he just didnt tell me. (Everyone looks at her, Ross not happily.) Maybe I have to pee again. (Gets up to try to use the bathroom.)\nPaul: Well, this is fun. So Ross, did you kill any of these wives?\nRoss: Yknow what? I-I-I I-I have had enough of this! Yknow, I-I-I care a great deal about your daughter and I have treated her with nothing but respect! So if-if youve got a problem with me, frankly\nPaul: Are you yelling at me?!\nRoss: God no!\nElizabeth: Yknow what daddy? If you dont like Ross, thats fine. It doesnt matter to me, Im gonna go out with him anyway.\nPaul: Really?! (She nods in the affirmative.)\nRoss: Well if it doesnt matter to her, it doesnt matter to me! (to Paul) Still not yelling!\nPaul: Wow. What can I say? (Pause, pointing at Ross) This doesnt make me like you any better!\nRoss: Thats okay, Im not so crazy about myself right now either.\nPaul: Then we agree?\nRoss: Uh yeah, I guessYeah! I guess so.\nPaul: Neither of us like Ross!\nElizabeth: I like Ross.\nRoss: Ohhh! Kids!\nRachel: (returning) Wait-wait-wait, I just thought of another story about how nice Ross is!\nRoss: Thats okay Rach, were not liking Ross right now.\nRachel: Oh! Ive got a lot of those too!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 16, "scene_id": "S06E21_016", "location": "A Restaurant", "scene_description": "Rachel is still trying to talk up Ross, not to much success.", "characters": ["Elizabeth", "Paul", "Rachel", "Ross"], "firestore_path": "/episodes/S06E21/scenes/S06E21_016"}}
{"id": "S06E21_017", "text": "[Scene: Macs Office, Mac is talking to C.H.E.E.S.E. about their case.]\nJoey: Well, it turns out you were right C.H.E.E.S.E.\nC.H.E.E.S.E.: The shipment never made it through Omaha?\nJoey: You got it! And the rabbis beard, 100% horsehair. Nice catch C.H.E.E.S.E.! (Pauses as he waits for C.H.E.E.S.E.s next line.) Its your line C.H.E.E.S.E.! (Suddenly C.H.E.E.S.E. goes crazy and starts flinging its arms and advancing on Joey behind the desk.) Wayne! Wayne!!\n(The camera cuts to Wayne whos busy making out with Sarah and rubbing C.H.E.E.S.E.s controller on her back causing C.H.E.E.S.E. to go crazy. Joey starts throwing books at C.H.E.E.S.E. to get him to stop.)\nEnd", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 21, "episode_id": "S06E21", "episode_title": "THE ONE WHERE ROSS MEETS ELIZABETHS DAD", "scene_number": 17, "scene_id": "S06E21_017", "location": "Macs Office", "scene_description": "Mac is talking to C.H.E.E.S.E. about their case.", "characters": ["Joey"], "firestore_path": "/episodes/S06E21/scenes/S06E21_017"}}
