{"id": "S06E08_001", "text": "THE ONE WITH ROSS'S TEETH\nWritten by: Perry Rein and Gigi McCreey Transcribed by: Aaron D. Howard-Miller", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 1, "scene_id": "S06E08_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S06E08/scenes/S06E08_001"}}
{"id": "S06E08_002", "text": "[Scene: Joey and Janines, Chandler knocks on the front door. Joey answers the door.]\nJoey: Hey.\nChandler: Hi, my names Chandler. I just moved in next door and I was wondering if you would be interested in battling me in a post-apoplectic world for control of the galaxies last remaining energy source?\nJoey: Sure, neighbor come on in.\nChandler: So, is Janine around?\nJoey: Uh, no, shes at dance class.\nChandler: Can I check out what she did to my room?\nJoey: Yeah, but, hey look, dont go through her stuff. She gets really mad.(Chandler gives him a look and walks to the door of his old room.)\nChandler: (The room is filled with flowers and a floral print sheet on the bed.) Oh my God. What is th its like a guy never lived in here. Look, youve got to be careful. This girl thing is dangerous. (Looking around the living room.) Its spreading already.\nJoey: (Looking around the room.) It is???\nChandler: (Picking up a pillow.) Yeah, is this your pretty pink pillow on the couch?\nJoey: No.\nChandler: (Pointing to the table and picking up the box.) Is that your tiny little box, thats too small to put anything in?\nJoey: No.\nChandler: No! Ok, this is not good. You are a guy. Ok? This is a guys place. If you let this go, youre going to be sitting around with your fingers soaking in stuff.\nJoey: (With Big Eyes.) All right, youre right. Ill talk to her.\nChandler: Yes talk to her. Be a man.\nJoey: Im a man.\nChandler: Defend yourself.\nJoey: (Grunting) Hmm. (Monica opens the front door and comes in.)\nMonica: Chandler come on. We have to hem the new dust ruffle.\nChandler: Be right there sweetums. (Monica leaves. To Joey.) A totally different situation.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 2, "scene_id": "S06E08_002", "location": "Joey and Janines", "scene_description": "Chandler knocks on the front door. Joey answers the door.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E08/scenes/S06E08_002"}}
{"id": "S06E08_003", "text": "[Scene: Central Perk, The gangs all here. Monica is walking in.]\nMonica: Hey guys.\nChandler: Hey, how was your breakfast with Hillary?\nMonica: It was okay. Shes still kind of depressed because she broke up with her boyfriend.\nChandler: Ohh, yeah.\nRoss: Well, is this Hillary your HOT assistant chef Hillary?\nMonica: Yeah.\nRoss: The one that always stares at me when I come in?\nMonica: No, the one who looked at you once because you got in her way.\nRoss: Still I could tell. She was into me. (Joey rolls his eyes.) Well, why dont you set us up?\nRachel: Ohh, are you setting Ross up with someone? Does she have a wedding dress?\nPhoebe: (Walking over and Sitting down.) Hey.\nRachel: Hey.\nPhoebe: Rachel?\nRachel: Yeah.\nPhoebe: Im, uhh, making up flyers trying to get new massage clients. So, can I come to Bloomingdales and use the copy machine.\nRachel: Well, sure, but they might think its kinda weird considering I dont work there anymore.\nPhoebe: Oh my God. What happened?\nRachel: I-I, got a job at Ralph Lauren.\nPhoebe: Well thats great! Congratulations!! (She hugs Rachel.)\nRachel: Yeah. (chuckling) A year ago..\nPhoebe: (Hugging her again.) Youve lasted a whole year. Good for you.\nRachel: But, Pheebs, you can still use the copy machine where I actually work. But, just come by at lunch so my boss doesnt see you. Cause Kim will just freak out and she already doesnt like me very much.\nChandler: Thats weird. I dont think my boss likes me either.\nMonica: I dont think mine likes me either.\nRoss: Maybe its a universal thing?\nJoey: Or maybe, its because youre hanging around here at 11:30 on a Wednesday. (Everybody gets up.)\nChandler: Yeah lets head off to work.\nMonica: We should go.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 3, "scene_id": "S06E08_003", "location": "Central Perk", "scene_description": "The gangs all here. Monica is walking in.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E08/scenes/S06E08_003"}}
{"id": "S06E08_004", "text": "[Scene: Rachels office, Phoebe hands Rachel a key card.]\nPhoebe: Thank you.\nRachel: Sure.\nPhoebe: Now you will not believe this. But, I was in the copy room, making copies, and Ralph Lauren came in.\nRachel: Oh my God. Did you talk to him?\nPhoebe: Yeah a little. He seems really nice. Good kisser.\nRachel: What? What!?! You kissed him?\nPhoebe: Totally.\nRachel: (Gasps) Phoebe are you serious?\nPhoebe: Yeah. I was just in there. He introduced himself and the next thing I know, were making out. You know.\nRachel: Phoebe, I mean, you do know hes married?\nPhoebe: No!\nRachel: Phoebe\nPhoebe: What am I supposed to do? Ask every guy I make out with if hes married? (Rachel looks at her.) No, yeah, I should.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 4, "scene_id": "S06E08_004", "location": "Rachels office", "scene_description": "Phoebe hands Rachel a key card.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E08/scenes/S06E08_004"}}
{"id": "S06E08_005", "text": "[Scene: Joey and Janines apartment, Joey stares at a picture of a bay on the wall. Janine comes out of her room.]\nJanine: Hey Joey.\nJoey: Hey. Uh, can I talk to you for a second? This, uh, kid in this picture. Do you, uh, know this kid? Is that like a relative or something?\nJanine: No, I just thought it was cute.\nJoey: Yeah, thats what I was afraid of.. Okay, uhhLook Janine I really want you to feel at home here, but some of this new stuff. Itstoo girly.\nJanine: Ohh. Like what?\nJoey: Like this. (pointing to the picture) Pictures of cute babies we dont know. We..we cant have that.\nJanine: Joey, its Anne Geddes. Shes a famous artist.\nJoey: Look I dont know this baby. I dont know if shes a famous artist or not. You know, and I dont want to be a jerk but youre changing too much around here.\nJanine: Well, Im sorry. I just thought Id try to make the place a little nicer.\nJoey: Yeah but its too much stuff. You know like, you got the candles and the foofy schmoofer thing here and over here you got a picture of a watering can.\nJanine: Well I just thought\nJoey: Im sure its a famous watering can, okay. But, come onand what is with the really hot stick in the bathroom?\nJanine: Its a curling iron.\nJoey: Ohh, well, thats ok then. But, okay my towels for instance. I come in to the bathroom here and my towel is not on the floor where keep it. Its up here on some hook..andsmells different.\nJanine: Its clean.\nJoey: Yeah, well, it feels different.\nJanine: Its dry.\nJoey: Alright, I can make my peace with the clean dry towelsAlso what is with these chips you bought?\nJanine: No no no no, its potpourri. Youre supposed to smell it. (Joey takes a big whiff of the potpourri.)\nJoey: (Voice cracking) Well thats like summer in a bowl.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 5, "scene_id": "S06E08_005", "location": "Joey and Janines apartment", "scene_description": "Joey stares at a picture of a bay on the wall. Janine comes out of her room.", "characters": ["Janine", "Joey"], "firestore_path": "/episodes/S06E08/scenes/S06E08_005"}}
{"id": "S06E08_006", "text": "[Scene: Elevator at the Ralph Lauren offices, Rachel gets on her boss Kim is there.]\nRachel: Oh, Kim, Hi. (Kim doesnt even look up from her report.)\nKim: Uhh-huh.\nRachel: So you know, II handed in that marketing report and I never got to hear what you thought.\nKim: I didnt read it.\nRachel: Ahh.SoWowThe spring line, its really going to be great this year, huh?\nKim: Yeah.\nRachel: So I hear the Ralph Lauren fooled around with someone in the copy room. (Kim stops the elevator and turns to Rachel.)\nKim: Tell me everything.\n[Scene; Central Perk, Monica and Chandler are on the couch. Ross walks in.]\nRoss: Hey guys.\nChandler and Monica: Hey.\nRoss: Whats up? (He smiles. His teeth are freakishly white.)\nChandler: You knowOh My God.\nMonica: What happened to your teeth.\nRoss: I whitened them.\nChandler: (Sarcastically) Really.\nRoss: Yeah. What do you think.\nMonica: Well, I think I shouldnt look directly at them.\nRoss: Come on, seriously.\nMonica: Ross theyre really, really, really white.\nChandler: Yeah, what was wrong with your oldhuman teeth.\nRoss: Ahh, I-I did leave the gel on a little longer then it said to.\nMonica: How much longer?\nRoss: A-A day.\nMonica: Ross you know that tonight is your date with Hillary?\nRoss: I know. Thats why I did it. (With a big smile) Come on, are they really that bad?\nChandler: No, no no no. Youll be fine. (turning to Monica) Hillarys bind, right?\nMonica: She will be after tonight.\nChandler: Yeah. (Rachel walks in.)\nRoss: Oh, hey, hey Rach, do you notice anything..ahh\nRachel: Yeah. Your teeth? Yes, I saw them from outside. (Sitting down on the couch.) You guys are never going to believe this. But, Phoebe made out with Ralph Lauren.\nChandler: What???\nMonica: Oh my god.\nRachel: Yeah I know. She ran into him at my office and they justmade out. And the craziest thing is, now my boss likes me because I told her about it and she said it was the best gossip shed heard all year.\nChandler: I am proud of all my friends today.\nMonica: My God, Rachel, I cant believe Phoebe made out with Ralph Lauren. Ohh, Im so jealous. (Chandler looks at her.)\nChandler: Hi, Im Chandler. Your live-in boy\nMonica: Chandler, please, come on. Look at him. (Pointing to a picture of Ralph on a magazine,.)\nChandler: Oh, I am no women, but that is one tasty dish. (Phoebe walks in.)\nPhoebe: Hey. Here. (Hands Chandler a copy of her flyer and sees the picture of Ralph.) Ohh, whos the silver fox?\nRachel: That-that is your make out buddy. Dont you recognize him? (Holding up the magazine in front of her face.) Oh wait. Ohh, Phoebe I love you. Kiss me please.\nPhoebe: Thats not Ralph Lauren. Sounds like him though.\nRachel: What?\nPhoebe: Yeah, no, Ralph doesnt look anything like that guy. Hes-hes young and hes got long hair and a beard and a hacky sack.\nRachel: Oh My God, Phoebe, thats not Ralph Lauren. Thats Kenny the copy guy.\nPhoebe: What?\nRachel: Oh..Go..Oh..and I told my boss that someone made out with Ralph Lauren. If she finds out that I lied to her, she is going to hate me even more. Phoebe!!\nPhoebe: Why would the copy guy say he was Ralph Lauren?\nRachel: To get you to make out with him!!!\nPhoebe: Ohhh.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 6, "scene_id": "S06E08_006", "location": "Elevator at the Ralph Lauren offices", "scene_description": "Rachel gets on her boss Kim is there.", "characters": ["Chandler", "Chandler and Monica", "Kim", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E08/scenes/S06E08_006"}}
{"id": "S06E08_007", "text": "[Scene: Rosss Apartment, Ross and Monica are there.]\nMonica: (Holding a shirt in front of Ross.) Okay, maybe this will make your teeth look less white. (Ross has a big smile.) Nope. Okay, colors that dont work are blue, yellow, green, red, black, white, orange, and purple.\nRoss: I dont know what Im going to do. That date starts in like an hour.\nMonica: Hey Ross, maybe if your skin was lighter. Your teeth wouldnt look so bright.\nRoss: Oh great. So all I need to do is get some new skin. Thank you.\nMonica: Im just saying, if we put just a little bit of makeup on you.\nRoss: Whoa. Whoa. Whoa. Were not 13 anymore.\nMonica: Ross this is the only thing left that has a shot at working.\nRoss: But, wont she notice I have makeup on?\nMonica: Please. Half the guys out there have makeup on.\nRoss: What??\nMonica: All right, half the people. I mean, just try it and see.\nRoss: No. I am not putting on makeup. (Knock at the door. Phoebe enters.)\nPhoebe: Hello. Oh good. Ross could you put up some of these flyers for me? (He smiles at her.) OH!! Demon!! Demon!!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 7, "scene_id": "S06E08_007", "location": "Rosss Apartment", "scene_description": "Ross and Monica are there.", "characters": ["Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S06E08/scenes/S06E08_007"}}
{"id": "S06E08_008", "text": "[Scene: Chandlers and Monicas apartment, Chandler and Monica are sitting at the kitchen table making potpourri sachets.]\nMonica: Now are drawers will smell nice and we didnt waste these pantyhose.\nChandler: Yes, God forbid we throw out old underwear. You-you know what? Im going to go over to Joeys.\nMonica: Wait, were supposed to organize the wrapping paper drawer.\nChandler: Yes, but I feel like Ive really gotten in touch with my feminine side enough today. You know. In fact I think were two sachets away from becoming a lesbian couple.\nMonica: You know what? This has been kind of a girlie day. Youre right, Im sorry.\nChandler: Nah, Nah, its okay. I feel like I need to be in guy place. You know, do kind of like a man thing.\nMonica: Yeah. Go over to Joeys. Go over to Joeys and drink some beer and hammer up some drywall.\nChandler: You know when guys hang out they dont just drink some beer and hammer up drywall?\nMonica: When girls hang out, we dont have pillow fights in our underwear. (Chandler gets a hurt look on his face.) Im sorry. We do. We do. I dont know why I said that.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 8, "scene_id": "S06E08_008", "location": "Chandlers and Monicas apartment", "scene_description": "Chandler and Monica are sitting at the kitchen table making potpourri sachets.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E08/scenes/S06E08_008"}}
{"id": "S06E08_009", "text": "[Scene: Joey and Janines apartment, Chandler walks in. Joey and Janine are knitting at the kitchen counter.]\nJoey: Hey Chandler. Come on in. Were knitting pot holders.\nChandler: No thanks, Josephine.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 9, "scene_id": "S06E08_009", "location": "Joey and Janines apartment", "scene_description": "Chandler walks in. Joey and Janine are knitting at the kitchen counter.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S06E08/scenes/S06E08_009"}}
{"id": "S06E08_010", "text": "[Scene: Rosss apartment, Chandler enters. Ross is putting on makeup.]\nChandler: Hey Ross, I was wondering if Oh my God!! Where are all the men???", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 10, "scene_id": "S06E08_010", "location": "Rosss apartment", "scene_description": "Chandler enters. Ross is putting on makeup.", "characters": ["Chandler"], "firestore_path": "/episodes/S06E08/scenes/S06E08_010"}}
{"id": "S06E08_011", "text": "[Scene: Elevator at the Ralph Lauren offices, Kims waiting for it. The door opens and Rachel is inside.]\nRachel: Ohh, hi, Kim.\nKim: Hi Rachel.\nRachel: Yeah, remember that thing I told you that happened yesterday? Well it didnt happen.\nKim: You didnt cancel the fabric order from Taiwan?\nRachel: Okay, two things didnt happen. Remember I told you that someone made out with Ralph Lauren in the copy room? Well, it turns out thats not true.\nKim: Thats not true?\nRachel: No.\nKim: Oh thats interesting? Because I checked and only one keycard was used to access the copy machine yesterday during lunch and that keycard belonged to you, Rachel.\nRachel: Oh no, no, no. Oh God, you think I made out with him.\nKim: Listen to me. If you think sleeping with Ralph is going to get you my job. You are sadly mistaken.\nRachel: I-I dont want your job. I-I dont. Ohh this is such a mistake. I did not make out with him. Nobody made out with him. I did not use my keycard yesterday. I dont even know how to use my keycard. (The elevator stops. Ralph steps on.)\nKim: Hi Ralph.\nRalph Lauren:: Hi Kim. (Dead silence until Ralph gets off the elevator.)\nKim: Yeah, nothing happen. You could cut the sexual tension in here with a knife.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 11, "scene_id": "S06E08_011", "location": "Elevator at the Ralph Lauren offices", "scene_description": "Kims waiting for it. The door opens and Rachel is inside.", "characters": ["Kim", "Rachel", "Ralph Lauren"], "firestore_path": "/episodes/S06E08/scenes/S06E08_011"}}
{"id": "S06E08_012", "text": "[Scene: Hillarys apartmen,. Hillary and Ross are having dinner. He is avoiding opening his mouth.]\nHillary: And after that, what could I do except become a chef.\nRoss: Mmm-Hmm.\nHillary: And someday soon, I hope to open my own restaurant.\nRoss: Mmm.\nHillary: You know, youre a really great listener. Most guys I go out with, they just talk and talk.\nRoss: Mm-Hmm.\nHillary: After a while its like, shut your mouth, you know?\nRoss: (Chuckling) Hmm-Hmm.\nHillary: Ive probably been talking too much. Why dont we talk about you a little bit?\nRoss: Mmm-Unmm.\nHillary: Come on. I want to know.\nRoss: Hmm-Hmm-Hmm. (Putting his hand up to block his mouth.) Okay. I, uh, am from Long Island. I-I came to the city for college. Um, I, um, have a 5 year old son and in my spare time I like to read spy novels. But, but, lets talk more about you. Hmm.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 12, "scene_id": "S06E08_012", "location": "Hillarys apartmen", "scene_description": ". Hillary and Ross are having dinner. He is avoiding opening his mouth.", "characters": ["Hillary", "Ross"], "firestore_path": "/episodes/S06E08/scenes/S06E08_012"}}
{"id": "S06E08_013", "text": "[Scene: Joey and Janines apartment, Joey and Monica are arranging flowers. Chandler walks in.]\nJoey: So whats really neat. If you sear the stems of the flowers first in a frying pan, your arrangement will look fresh much longer.\nMonica: Oh my God, Joey, that is such a great tip.\nChandler: Monica, could you excuse us for a second? I need to talk to the girl with the flowers.\nMonica: Okay. Oh but Joey, come over later because Im going to teach you to make a bird feeder out of just a pine cone and some peanut butter.\nJoey: Ohh, I love birds. (Monica leaves. Chandler shuts the door.)\nChandler: What is the matter with you ?!?\nJoey: What?\nChandler: Youre arranging flowers! (Pointing to the dish on the table.) You got dead flowers! You got a picture, a picture, of a baby dressed like flowers! This is not Joey!!\nJoey: Hey. Hey look I am still Joey, okay. Flowers theyre just, you know, theyre nice to look at. And that happens to be a picture by a famous artist. Of a famous baby.\nChandler: Youre turning into a women.\nJoey: No Im not. Why would you say that? Thats just mean.\nChandler: Now Ive upset you? What did I say?\nJoey: Its not what you said. Its the way you said it.Oh My God, Im a women!!!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 13, "scene_id": "S06E08_013", "location": "Joey and Janines apartment", "scene_description": "Joey and Monica are arranging flowers. Chandler walks in.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E08/scenes/S06E08_013"}}
{"id": "S06E08_014", "text": "[Scene: Central Perk, Phoebe and Rachel are there.]\nRachel: Now, she thinks that I made out with him and I did it to get her job.\nPhoebe: But why didnt you just tell her the truth.\nRachel: I did but she doesnt think anyone would be stupid enough to confuse Kenny the copy guy with Ralph Lauren.\nPhoebe: Well, hey, what if Kenny were the real brains behind the whole company? You know. What if Kenny hired that Ralph Lauren guy to be the pretty front man? Huh, did she ever think of that?\nRachel: You were with Kenny today, werent you?\nPhoebe: Just for a second.\nRachel: Ohh, Phoebe, what am I going to do?\nPhoebe: Well, the only thing you can do. Sleep with Ralph Lauren.\nRachel: Im not going to sleep with Ralph Lauren. I mean, I could, but I wouldnt.\nPhoebe: Ohh, sleep with Kenny.\nRachel: That wouldnt help me.\nPhoebe: Ohh, yes it would.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 14, "scene_id": "S06E08_014", "location": "Central Perk", "scene_description": "Phoebe and Rachel are there.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E08/scenes/S06E08_014"}}
{"id": "S06E08_015", "text": "[Scene: Hillarys apartment, Hillary and Ross are finishing up their date.]\nHillary: Ive had a really good time tonight.\nRoss: Mmm.\nHillary: You know, I rarely connect with someone this much on the first date.\nRoss: (Giggling) Hmm-Hmm-Hmm. (Picking up a piece of bread and covering his mouth.) Me, neither. Ive had a really good time too, you know. (Putting the bread down.)\nHillary: Are you going to eat that bread?\nRoss: (Putting the bread up to his nose.) Ohh, I just like the smell. (Sniffing it.) Mmmm.\nHillary: (Laughing) You make me laugh.\nRoss: Hmm-Hmm.\nHillary: Would you like to move over to the couch?\nRoss: Mmm-Hmm. (Picking up their wine glasses.)\nHillary: Maybe Ill just turn the lights down a little.\nRoss: (Covering his mouth with the glass.) How about all the way.\nHillary: Okay. (She goes to turn the lights off and Ross sits on the couch. She has some black light posters on the wall.)\nRoss: (Looking at the posters.) Wow, cool poster. Or should I say groovy poster? (They sit down on the couch. Ross smiles and the black light fluoresces his teeth.) So, ahh, where were we?\nHillary: Are those your teeth??\nRoss: Ohh, you can see them, huh?\nHillary: Yes. Theyre insanely white.\nRoss: I-I, did that for you.\nHillary: Whats a matter with you?\nRoss: Whats a matter with me? Youve got a black light. Its 1999!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 15, "scene_id": "S06E08_015", "location": "Hillarys apartment", "scene_description": "Hillary and Ross are finishing up their date.", "characters": ["Hillary", "Ross"], "firestore_path": "/episodes/S06E08/scenes/S06E08_015"}}
{"id": "S06E08_016", "text": "[Scene: Elevator at the Ralph Lauren Offices, Rachel gets in . Kim is there.]\nRachel: Kim, hi.\nKim: Hi Rachel. Ohh, Ive been meaning to ask you. Have you seen the new Ralph Lauren sheets? Ohh, what am I thinking. Of course you have.\nRachel: Okay..Okay.. Look. Im sorry that I lied to you before. You were right. Ralph and I were an item but were not anymore.\nKim: Oh, really?\nRachel: (Faking crying.) Yeah, he dumped me. He said, \"Rachel, I cant do this. Even though you are a very, very, very beautiful women. I cant do this. Im married and Im sorry.\" And then I dont know why but he said, \"and you will never get promoted. Especially not above Kim, who is an integral cog in the Ralph Lauren machine.\"\nKim: You expect me to believe..(Doors open, Ralph steps in.) Hi Ralph.\nRalph Lauren:: Hi Kim. (Dead silence again until he gets off.)\nKim: Oh my God. He just gave you the coldest look I have ever seen. Its like he hates you. Then it is true.\nRachel: Of course its true and it hurts so bad.\nKim: Ohh honey come here. (Hugging Rachel.) Ohh it will be ok. Weve all been there.\nRachel: You and Ralph?\nKim: Kenny the copyboy.\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 16, "scene_id": "S06E08_016", "location": "Elevator at the Ralph Lauren Offices", "scene_description": "Rachel gets in . Kim is there.", "characters": ["Kim", "Rachel", "Ralph Lauren"], "firestore_path": "/episodes/S06E08/scenes/S06E08_016"}}
{"id": "S06E08_017", "text": "[Scene: Joey and Janines apartment, Joey paces the floor waiting for Janine. She walks in.]\nJanine: Hey.\nJoey: Hey, uhh, I need to talk to you.\nJanine: Whats the matter? Are you upset?\nJoey: Im sorry but weve got to get rid of all this girlie stuff in here. I, uh, I got to be a man! Okay. The living room has to remain a guy place, okay? Thats just the way it has to be.\nJanine: Well, if thats what you want. Ill just put it all in my room.\nJoey: GreatGreatand thanks for being so understanding. I mean, I didnt want to make a big deal out of this, you know. (She starts to collect all the girlie stuff up.) You could, uh, put the picture of the famous baby in my room. I mean, if you want to.\nJanine: Okay.\nJoey: And, uhh, maybe the watering can there.\nJanine: Sure.\nJoey: And a couple of these little tiny boxes.\nJanine: Joey? Do you want me to put it all in your room?\nJoey: (Smiling) Okay.\nEnd", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 8, "episode_id": "S06E08", "episode_title": "THE ONE WITH ROSS'S TEETH", "scene_number": 17, "scene_id": "S06E08_017", "location": "Joey and Janines apartment", "scene_description": "Joey paces the floor waiting for Janine. She walks in.", "characters": ["Janine", "Joey"], "firestore_path": "/episodes/S06E08/scenes/S06E08_017"}}
