{"id": "S06E25_001", "text": "THE ONE WITH THE PROPOSAL: Part 2", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 1, "scene_id": "S06E25_001", "location": "", "scene_description": "", "characters": ["THE ONE WITH THE PROPOSAL"], "firestore_path": "/episodes/S06E25/scenes/S06E25_001"}}
{"id": "S06E25_002", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica is taking out the garbage as Phoebe and Joey enter. Phoebe gasps.]\nJoey: Oh my God, youre back!\nPhoebe: Ohh, let me see it! Let me see your hand! (Chandler is frantically trying to wave them off.)\nMonica: Why do you want to see my hand?\nPhoebe: I wanna see whats in your hand. I wanna see the trash. \nJoey: Yeah.\n(Chandler puts his face in his hands as Joey and Phoebe start to examine the trash.)\nPhoebe: Eww! Oh, its all dirty. You should throw this out.\nMonica: (suspiciously) Okay. (Exits to carry out Phoebes wishes.)\nChandler: (after the door closes) What did you guys just do?!\nPhoebe: What happened?\nChandler: Richard was there so I couldnt do it!\nJoey: What?! Noooo (Phoebe gasps.)\nChandler: Im gonna do it tomorrow yknow, and-and surprise her, but now youve ruined it!\nJoey: We didnt ruin it!\nChandler: Who walks into a room and asks to see a persons hands?!\nPhoebe: Well, a palm reader, a manicurist, a hand doctor\nJoey: Glove salesman!\nPhoebe: Good one! Yeah.\nChandler: This is terrible. What am I going to do?\nPhoebe: Look, she only suspects something okay? She doesnt know for sure, so just throw her off the track.\nChandler: Thats right, I can throw her off. I can make her think marriage is the last thing on my mind.\nPhoebe: Yeah! Yeah! Convince her that-that youre scared of commitment! Convince her that youre a little coward!\nChandler: I can do that, Ive had 30 years of practice.\nJoey: Hey, being you is finally gonna pay off! (They give each other fives.)\nMonica: (entering) I had to go all the way to the basement because some idiot keeps stuffing the trash chute with pizza boxes!\nJoey: That guys still doing that?!\nRachel: (entering) Hey! (Sees Monica, gasps, and runs over to her.) Oh my God youre here, let me see your hand!!\nPhoebe: No, youre too late!!! She already took out the trash!!!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 2, "scene_id": "S06E25_002", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica is taking out the garbage as Phoebe and Joey enter. Phoebe gasps.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S06E25/scenes/S06E25_002"}}
{"id": "S06E25_003", "text": "[Scene: Outside of Elizabeths dormitory, Ross is exiting after breaking up with her and we can hear his thoughts.]\nRoss: (in his head) Wow! I have never had such a healthy break-up! She was such a grown-up about it! She didnt seem too immature for me! Did I just make a huge mistake?\nElizabeth: (sticking her head out her window) Ross! Wait!\nRoss: Elizabeth, thank God! I was just thinking about\nElizabeth: You suck!! \nRoss: What?!\n(She throws a water balloon at him and hits him on the head and hits him again at the waist with another one.)\nRoss: Okay, break-ups still on!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 3, "scene_id": "S06E25_003", "location": "Outside of Elizabeths dormitory", "scene_description": "Ross is exiting after breaking up with her and we can hear his thoughts.", "characters": ["Elizabeth", "Ross"], "firestore_path": "/episodes/S06E25/scenes/S06E25_003"}}
{"id": "S06E25_004", "text": "[Scene: Central Perk, Chandler is looking out the window and Joey is sitting on the couch.]\nChandler: Okay, okay, here she comes! (Sits on the couch next to him.) How do I look? Do I look like a guy who doesnt want to get married?\nJoey: Yeah! And also, a little like a French guy. (They both squint at each other.) I never noticed that before.\nMonica: (entering) Hi guys!\nJoey: Hey!\nChandler: Hey!\nMonica: What are you up too?\nChandler: Oh, just hanging out, talkin about uh, websites. (Joey laughs.) Yeah, we saw this really interesting website about marriage and how totally unnecessary it is and how its just a way for the government to keep tabs on you.\nJoey: (laughs) Yeah, Big Brother.\nMonica: Well thats a little crazy. Although I am yknow glad to hear that youre branching out on what you look at on the Internet.\nChandler: Yeah, well Yknow, it just got me thinking though, why would anybody ever want to get married huh?\nMonica: Why?! To celebrate your relationship! To solidify your commitment! To declare your love for one another to the world!\nChandler: Eh\nMonica: Okay well thats good to know.\n(We hear the backup horn of a truck and see through the window that the Mr. Bowmont has arrived.)\nJoey: (all excited) The Mr. Bowmonts here!!! (Jumps over the back off the couch and runs out into the street.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 4, "scene_id": "S06E25_004", "location": "Central Perk", "scene_description": "Chandler is looking out the window and Joey is sitting on the couch.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E25/scenes/S06E25_004"}}
{"id": "S06E25_005", "text": "[Scene: Monicas Restaurants kitchen, shes cooking as a waitress sticks her head in.]\nWaitress: Hey Monica, theres a customer who wants to complement the chef, should I let him in?\nMonica: Sure, I love this part! (Starts to look busy.)\nWaitress: (to the customer) Come on in.\n(The customer turns out to be)\nRichard: Hi!\nMonica: Richard!\nRichard: Actually, Im not here to complement the chef.\nMonica: Ohh Oh, thats okay I hate when people come back to complement the chef. Like I have nothing better to do! So whats up?\nRichard: Well, it was great seeing you the other night.\nMonica: Oh, good to see you too. Did you come down here to tell me that?\nRichard: No! I came here to tell you something else. (Pause) I came here (Pause) to tell you I still love you.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 5, "scene_id": "S06E25_005", "location": "Monicas Restaurants kitchen", "scene_description": "shes cooking as a waitress sticks her head in.", "characters": ["Monica", "Richard", "Waitress"], "firestore_path": "/episodes/S06E25/scenes/S06E25_005"}}
{"id": "S06E25_006", "text": "[Scene: Monicas Restaurant, continued from earlier.]\nMonica: What uhWhat did youWhat?!\nRichard: I still love you. And I know I probably shouldnt even be here telling you this, I mean youre with Chandler a guy I really like, and if you say hes straight Ill believe you! After seeing ya the other night I knew if I didnt tell ya Id regret it for the rest of my life. Letting you go was the stupidest thing I ever did.\nMonica: Yknow youre really not supposed to be back here!\nRichard: Well yeah, Im sorry. I know this is the wrong time and the wrong place but I had to tell ya! I wanna spend my life with you. I wanna marry you. I wanna have kids with you.\nMonica: Oh God (Starts looking around.) Why dont they put chairs back here?!\nRichard: I know this is crazy but am I too late?\nMonica: What the Yes youre too late! Where was all this three years ago?!\nRichard: Well I know I was an idiot! And I tried to forget you, I really did! Yknow after we had lunch last year I spent six months in Africa trying to get you out of my head!\nMonica: What were you doing in Africa?\nRichard: Working with blind kids.\nMonica: Ohhh! What are you doing to me?! Oh look, I-I Im sorry but umm, this-this-this-this is not going to happen.\nRichard: Okay thats fine, Ill walk away. And Ill never bother you again, but only if you tell me Chandlers willing to give you everything I am.\nMonica: Well he is! Yeah, I mean marriage is all he talks about! My goodness, in fact, Im the one thats making him wait!\nRichard: You are?\nMonica: Yeah!\nRichard: Why?\nMonica: Why? Because of the government.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 6, "scene_id": "S06E25_006", "location": "Monicas Restaurant", "scene_description": "continued from earlier.", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S06E25/scenes/S06E25_006"}}
{"id": "S06E25_007", "text": "[Scene: Central Perk, Rachel is bringing Phoebe some coffee.]\nRachel: Isnt it incredible?! Monica and Chandler, gettin married.\nPhoebe: I know, theyre gonna be so happy together.\nRachel: Ohh I mean two best friends falling in love, how often does that happen?\nPhoebe: Not that often!\nRachel: No! Im so happy for them!\nPhoebe: Me too! So happy for them!\nRachel: Im so happy and not at all jealous.\nPhoebe: Oh no! No God, definitely not jealous!\n(They both take a drink of coffee.)\nRachel: I mean Im probably 98% happy, maybe 2% jealous. And I mean whats 2%? Thats nothing.\nPhoebe: Totally. Im like 90/10.\nRachel: Yeah me too.\n(Joey enters looking like Captain Stubing from the Love Boat.)\nJoey: Hey uh, have you guys scene Chandler?\nRachel: (staring at him) Whno, but yknow who did stop in here looking for ya, Tennille.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 7, "scene_id": "S06E25_007", "location": "Central Perk", "scene_description": "Rachel is bringing Phoebe some coffee.", "characters": ["Joey", "Phoebe", "Rachel"], "firestore_path": "/episodes/S06E25/scenes/S06E25_007"}}
{"id": "S06E25_008", "text": "[Scene: A Pizza Joint, Chandler and Monica are eating lunch.]\nMonica: So that marriage stuff that you were saying yesterday, you dont really believe that do you?\nChandler: Sure I do. In fact, I think the whole concept of marriage is unnatural. I mean look at pigs. Lets take a second here and look at pigs. Okay pigs dont mate for life. I mean a pig can have like a hundred sexual partners in a lifetime, and thats just an ordinary pig not even a pig thats good at sports!\nMonica: Yeah, but thats pigs not people!\nChandler: If marriage worked, Id be all for it. But do you know what the divorce rate in this country is? 97%.\nMonica: Wait a minute. Are you honestly telling me that-that you may never want to get married?\nChandler: Well, never say never but yknow probably uh yeah, never.\nMonica: Oh my God! Then-then-then what are we even doing?! What is this?!\nChandler: Whoa! Whoa! Whoa! What is all this pressure?! Is this some new kind of strategy? Why dont you put down your copy of The Rules huh mantrap?!\nMonica: Yknow what?! I gotta go! Ugh! \n(She gets up and storms out. The people at the other tables are staring at Chandler.)\nChandler: (to them) Its okay, I got a plan.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 8, "scene_id": "S06E25_008", "location": "A Pizza Joint", "scene_description": "Chandler and Monica are eating lunch.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E25/scenes/S06E25_008"}}
{"id": "S06E25_009", "text": "[Scene: Central Perk, Phoebe and Rachel are still talking.]\nRachel: Were gonna find love!\nPhoebe: Definitely!\nRachel: Yeah, Im pretty confident about that. Thats what makes it so easy for me to be 80% happy for Monica and Chandler! It would be nice to have a little guarantee though.\nPhoebe: What do you mean?\nRachel: Well yknow, some people make deals with a friend, like if neither of them are married by the time theyre 40, they marry each other.\nPhoebe: You mean a backup?\nRachel: Exactly!\nPhoebe: Yeah, yeah I got that.\nRachel: You do?\nPhoebe: Hm-mmm.\nRachel: Who?\nPhoebe: Joey.\nRachel: Joey?!\nPhoebe: Yeah!\nRachel: Are you serious?!\nPhoebe: Yeah, I locked him years ago!\nRachel: Wh So If neither of you are married by the time youre 40, youre gonna marry Joey.\nPhoebe: Yep, we shook on it. Yeah but believe me that is not how he wanted to seal the deal.\nRachel: Oh, seriously?\nPhoebe: Ohh, yeah. I think his exact words were (She makes two clicking sounds with her tongue and purrs.)\nRachel: Charming.\nPhoebe: Well hey, its just a backup.\nRachel: Yeah.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 9, "scene_id": "S06E25_009", "location": "Central Perk", "scene_description": "Phoebe and Rachel are still talking.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E25/scenes/S06E25_009"}}
{"id": "S06E25_010", "text": "[Scene: Joey and Rachel's, Joey, still looking like Captain Stubing, is practicing his slipknots as Monica enters.]\nJoey: Hey Monica!\nMonica: Have you seen Rachel? Or a mirror?\nJoey: This is for my boat, pretty cool huh?\nMonica: Yeah, its great.\nJoey: Whoa-whoa, whats the matter?! Talk to the captain!\nMonica: Im just having one of those days where you realize youre in a dead-end relationship!\nJoey: Chandler giving you a hard time huh?\nMonica: Its not like I want to get married tomorrow! Its just that I-Id like to believe that Im in a relationship thats actually going somewhere, that Im not just wasting my time!\nJoey: Well, you know Chandler.\nMonica: No I dont know Chandler! Not anymore! Its like its like somethings changed.\nJoey: Maybe you changed?\nMonica: I didnt change!\nJoey: Maybe thats the problem.\nMonica: What?!\nJoey: Chandler is a complex fellow, one who is unlikely to take a wife.\nMonica: Is that some kind of boat talk?\nJoey: I dont know! (All excited) I havent totally decided how to talk on my boat yet.\nMonica: What does he think? Does he think Im just gonna wait around for nothing?\nJoey: Monica face it, Chandler is against marriage. And-and always will be!\nMonica: (starts for the door) Well theres some people who do want to marry me.\nJoey: There are?\nMonica: Yeah! Richard!\nJoey: R-R-Richard said he wants to marry you?! (Monica nods yes.) And-and Chandlers tellin ya how much he hates marriage?!\nMonica: Thats right.\nJoey: Chandler loves marriage!!\nMonica: You just told me that he hates marriage! That-that hes a-a complex fellow whos unlikely to take a wife! That-that hes against marriage and always will be!\nJoey: You got that from what I said?!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 10, "scene_id": "S06E25_010", "location": "Joey and Rachel's", "scene_description": "Joey, still looking like Captain Stubing, is practicing his slipknots as Monica enters.", "characters": ["Joey", "Monica"], "firestore_path": "/episodes/S06E25/scenes/S06E25_010"}}
{"id": "S06E25_011", "text": "[Scene: Ross's apartment, Ross is watching a show about the extinction of the dinosaurs.]\nNarrator: When the Cretaceous period ended, the dinosaurs were gone.\nRoss: What happened you guys?\n(Theres a knock on the door, he shuts the TV off, and answers it.)\nRoss: Rach!\nRachel: Hey you!\nRoss: Hey, come on in.\nRachel: Oh thank you. Hey yknow, Im so sorry to hear about you and Elizabeth.\nRoss: Oh, thanks. Yeah, I really thought wed be able to make it work, but uh, I guess it just wasnt meant to be.\nRachel: Yeah, love. Its a tricky business isnt it?\nRoss: I guess so.\nRachel: So what do you say we make a pact? If you and I are both single by the time were 40, we get married. I mean, we know each other, we like each other, and weve-weve already slept together so yknow therell be no surprises there! You know what I mean? No like, \"Whats that?!\"\nRoss: Right. Ohh! You-you want me to be your backup.\nRachel: Exactly.\nRoss: Ohh, yeah I already have one.\nRachel: What? Who?\nRoss: Phoebe.\nRachel: Phoebe?! Wait abut-but she just, she said that Joey was her backup.\nRoss: Ohh, I dont think so.\nRachel: Ross! I just had a conversation with her, and she said that she and Joey made a deal!\nRoss: Thats impossible! I mean we have had a deal for years! We-we-we shook on it, although believe me she wanted to do a lot more than that.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 11, "scene_id": "S06E25_011", "location": "Ross's apartment", "scene_description": "Ross is watching a show about the extinction of the dinosaurs.", "characters": ["Narrator", "Rachel", "Ross"], "firestore_path": "/episodes/S06E25/scenes/S06E25_011"}}
{"id": "S06E25_012", "text": "[Scene: Monica, Chandler, and Phoebe's, Chandler is entering to find Joey, still looking like Captain Stubing, on the phone.]\nJoey: Where the hell have you been?!\nChandler: I was making a coconut phone with the professor.\nJoey: Richard told Monica he wants to marry her!\nChandler: What?!\nJoey: Yeah! Yeah, Ive been trying to find ya to tell to stop messing with her and maybe I would have if these (lifts a leg) damn boat shoes wouldnt keep flying off!\nChandler: MyOh my God!\nJoey: I know! They suck!!\nChandler: Hes not supposed to ask my girlfriend to marry him! Im supposed to do that!\nJoey: I know!\nChandler: Well what Yknow what Im gonna do? Im gonna go over there; Im gonna kick his ass! (Pause) Will you help me?!\nJoey: Look, Chandler I dont think us getting our asses kicked is a solution. Okay? Just go and find Monica!\nChandler: Youre right.\nJoey: Yeah!\nChandler: Okay. (Starts running for the bedroom) Im gonna get the ring! Im gonna get the ring! (Does so) Im gonna go find her and (starts running for the door) Im just going to propose!\nJoey: Okay.\nChandler: Okay great.\nJoey: Dude-dude-dude!\nChandler: What?!\nJoey: Let me know about that coconut phone, it might great for the boat.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 12, "scene_id": "S06E25_012", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Chandler is entering to find Joey, still looking like Captain Stubing, on the phone.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S06E25/scenes/S06E25_012"}}
{"id": "S06E25_013", "text": "[Scene: Richards Apartment, hes smoking a cigar and reading a book as there is a knock on the door. He gets up and opens the door to reveal]\nMonica: Hi.\nRichard: Hi.\nMonica: I dont know why Im here.\nRichard: I didnt ask. You wanna come in?\nMonica: I dont know.\nRichard: Oh, okay. Well, Ill just leave the door open and go sit on the couch. (Does so.)\nMonica: (entering) Chandler is such an idiot!\nRichard: (standing up quickly) Drink?\nMonica: Yeah, Ill have a scotch\nRichard: on the rocks with a twist? I remember. (Goes to make her drink.)\nMonica: (moving over to the couch) Still smoking cigars?\nRichard: Uh, no! No! Thatsart! If it bothers you I can put my art out.\nMonica: No thats, thats okay.\nRichard: So Monica let me ask you a question. Yknow, since we broke up do you ever, think about me?\nMonica: Uh yeah, I-I actually I thought about you a couple months ago.\nRichard: Oh really?\nMonica: Yeah but it was because I-I had an eye exam and I dont like my new eye doctor.\nRichard: Who is it?\nMonica: Edward Nevski?\nRichard: Yeah hes no good. Do you ever (pause) think about me in a (pause) non-eye doctor way?\nMonica: No.\nRichard: Ahh.\nMonica: But getting over was the hardest thing that Ive ever had to do. And I never let myself think about you.\n(Richard mouths, \"Wow!\")", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 13, "scene_id": "S06E25_013", "location": "Richards Apartment", "scene_description": "hes smoking a cigar and reading a book as there is a knock on the door. He gets up and opens the door to reveal", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S06E25/scenes/S06E25_013"}}
{"id": "S06E25_014", "text": "[Scene: Central Perk, Phoebe is reading as Rachel enters.]\nRachel: Phoebe! You picked Joey and Ross?! You can not have two backups!\nPhoebe: Of course I can! Its just good sense to backup your backup! Look, Ive already lost Chandler!\nRachel: What?!\nJoey: (entering) Hey!\nRoss: (entering) Hey!\nJoey: Phoebe! Were both (points at Ross and himself) your backup?!\nRoss: Phoebe, how could you do this to me?!\nPhoebe: I dontLook I dont know what youre complaining about now? You were both aware of the situation!\n(At the same time.)\nJoey: No we werent!\nRoss: I was not!\nPhoebe: Okay, this kind of back talk is not gonna fly when were married!\nRachel: Phoebe you cant have both of them! You have to pick one!\nJoey: Pick me!!\nRoss: No! Pick me! I dont want to end up an old maid!\nPhoebe: All right well lets see, Ross is a good father, but Joey has a boatThis is hard!\nJoey: This is crazy! Hey look, I wanna switch to Rachel!\nRoss: Ooh, I wanna switch to Rachel too!\n(Rachel gets all happy.)\nPhoebe: No wait! JustOkayJust wait! You guys! Wait you guys! Dont make any rash decisions, okay? Just remember my promise, when we get married, three times a week.\nRachel: Oh God, Phoebe!\nPhoebe: (To Rachel) Im talking about massages.\nRachel: Oh. \n(She turns her head away and when shes not looking, Phoebe shakes her head and mouths, \"No, Im not.\" Both Joey and Ross smile, look at each other, and then stop smiling.)\nRachel: Okay, yknow what?! I know-I know how to settle this! All right here, this is what were gonna do! Im gonna write Joey on one napkin (does so) and Im gonna right Ross on the other napkin (does so) and we are going to pick one! And that person is going to be our backup! Okay?\nJoey: Okay thats fair.\nRoss: All right.\nPhoebe: Good!\n(Rachel mixes them up in her hands, moves them all around, and puts her hands behind her back.)\nRachel: Pick one.\nPhoebe: Left! (Rachel hands her the napkin in her left hand and they both unfold and read them.) Thank you.\nRachel: Youre welcome.\nPhoebe: (reading) Ross!\nRachel: (reading) Joey! (Pause) We should just switch.\nPhoebe: Yeah absolutely! (They both switch.)\nJoey: Yeah.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 14, "scene_id": "S06E25_014", "location": "Central Perk", "scene_description": "Phoebe is reading as Rachel enters.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E25/scenes/S06E25_014"}}
{"id": "S06E25_015", "text": "[Scene: Richards Apartment, Monica is looking around and notices an African mask hanging on the wall.]\nMonica: (to the mask) I missed you-you ugly, flat faced old freak!\nRichard: Excuse me?\nMonica: Oh! (Laughs and points at the mask.) Him.\nRichard: Oh. (Laughs.) Whew!\nMonica: I missed this apartment! Now, this is a grown-ups apartment! Yknow, I-I should be with a grown-up, do you know what I mean?!\nRichard: Yeah! Youre saying, you need to be with someone more mature. Maybe someone with, a license to practice medicine. Or a mustache.\nMonica: Yknow, lets face it, Im not a kid anymore! I-I need to be with someone who-who wants the same things that I do! I mean coming to my place of work and telling me that you love me, I want that! Talking about pig sex over lunch, I dont want that!\nRichard: I think thats fair.\nMonica: Fair? Please dont even talk to me about fair! Fair wouldve been you wanting to marry me back then! Or fair wouldve been Chandler wanting to marry me now! Believe me, nothing about this is fair! Nothing! Nothing! Nothing! Nothing! Nothing! Nothing! Nothing! Nothing! Nothing! Nothing!\nRichard: Its okay! Shh! Hey. Hey. (Hugs her) Shhhh. \nMonica: Nothing. (She backs away a little bit but is still in his arms and looks up at his eyes.) I dont knUmm. I dont know. Umm\nRichard: I know. (Backs away.)\nMonica: Yknow, I-I I have to figuresome stYknow, some stuff before I can\nRichard: Yeah, I understand. Take as much time as you want. (Pause) Ten, even twenty minutes if you need it. Ill be here. Not smoking. (Monica leaves.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 15, "scene_id": "S06E25_015", "location": "Richards Apartment", "scene_description": "Monica is looking around and notices an African mask hanging on the wall.", "characters": ["Monica", "Richard"], "firestore_path": "/episodes/S06E25/scenes/S06E25_015"}}
{"id": "S06E25_016", "text": "[Scene: Richards Apartment, time lapse. Richard is smoking as he hears a knock on the door. He quickly puts out his cigar and opens the door.]\nRichard: Chandler.\nChandler: Where is she? Im not scared of you! (Averts his eyes and walks in.)\nRichard: Shes not here and please come in.\nChandler: (examining the coffee table) Scotch on the rocks, with a twist, on a coaster? Ha-ha, Monica! Monica!\nRichard: Okay, she was here, but she left.\nChandler: Well where did she go?\nRichard: Well she said she had to think things over.\nChandler: Oh my God, I cant believe this! Yknow, I thoughtI thought you were a good guy.\nRichard: Oh, hey look nothing happened.\nChandler: Nothing happened? Nothing? So you didnt tell my girlfriend that you love her?\nRichard: Well all right, one thing happened?\nChandler: Yknow what? I cant believe this! Do you know what you did? My girlfriend is out there thinking things over! You made my girlfriend think!!\nRichard: Well Im sorry.\nChandler: And what does she have to think about? I love her!\nRichard: Well, apparently Im willing to offer her things that you are not.\nChandler: But I am willing to offer her all those things. This was just a plan, yknow? A way to throw her off course so that when I offered her all these things, shed be surprised!\nRichard: Well if it helps, it worked very well.\nChandler: It was working until you showed up, you big tree! I mean, this isnt fair. You had your chance with her! You had your chance and you blew it! And this is my chance and I am not going to blow it because we are meant for each other! And this is all just been one stupid mistake! (Sits down heavily.) I was gonna propose tonight.\nRichard: You were gonna propose? (Sits on the arm of the couch.)\nChandler: Yeah I even (pause) got a ring. (Puts in on the center cushion.) Did you get a ring?\nRichard: No I dont have a ring! (Pause) You go get her Chandler. (Pause) And can I give you a piece of advice? If you do get her, dont let her go. Trust me.\nChandler: Yknow Richardyou are a good guy.\nRichard: I know. (Pause) I hate that!\n(Chandler gets up and runs out, but as soon as the door closes behind him he opens it, runs back in, picks up his ring Richard is holding up for him, and runs back out.)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 16, "scene_id": "S06E25_016", "location": "Richards Apartment", "scene_description": "time lapse. Richard is smoking as he hears a knock on the door. He quickly puts out his cigar and opens the door.", "characters": ["Chandler", "Richard"], "firestore_path": "/episodes/S06E25/scenes/S06E25_016"}}
{"id": "S06E25_017", "text": "[Scene: The Hallway, Chandler is running up the stairs and towards his apartment, but Joey is taking out the garbage at the same time and stops him in the hall.]\nJoey: Dude!\nChandler: I cant talk to you now, I gotta find Monica!\nJoey: Shes gone.\nChandler: What?\nJoey: Shes gone. She had a bag and she left.\nChandler: What are you talking about?\nJoey: She was all crying. She-she said you guys want different things, and that and that she needed time to think.\nChandler: Well why didnt you stop her?! Why didnt you just tell her it was a plan?!\nJoey: I-I did! I told her everything, Chandler! But she wouldnt believe me.\nChandler: Well where Where did she go?\nJoey: To her parents I think and she said you shouldnt call her. But if I were you I would.\nChandler: I cant believe I ruined this.\nJoey: I am so sorry man.\n(He walks dejectedly into his apartment to find it lit with about a thousand candles and Monica standing in the living room.)\nMonica: You wanted it to be a surprise.\n(He turns to look at Joey who smiles slyly and closes the door leaving them alone.)\nChandler: Oh my God.\n(Monica gets down on one knee.)\nMonica: Chandler In all my life I never thought I would be so lucky. (Starting to cry.) As tofall in love with my bestmy best Theres a reason why girls dont do this!\nChandler: Okay! (He joins her on one knee) Okay! Okay! Oh God, I thought (Starting to cry, pauses) Wait a minute, I-I can do this. (Pause) I thought that it mattered what I said or where I said it. Then I realized the only thing that matters is that you, (Pause) you make me happier than I ever thought I could be. (Starting to cry again.) And if youll let me, I will spend the rest of my life trying to make you feel the same way. (Pause as he gets out the ring.) Monica, will you marry me?\nMonica: Yes.\n(The crowd goes wild as he puts the ring on her finger. They hug and kiss this time as an engaged couple.)\nMonica: I knew you were likely to take a wife!\n(They hug again.)\nJoey: (yelling through the door) Can we come it yet?! Were dying out here!\nMonica: Come in! Come in! (Joey, Rachel, and Phoebe burst through the door.) Were engaged!!!\n(Everyone screams and has a group hug.)\nRachel: Ohhh, this is the least jealous Ive ever been!\nPhoebe: Oh no wait no, this is wrong! Ross isnt here!\nMonica: Oh\nRachel: Oh hell, hes done this three times! He knows what its about!\nJoey: Yeah!\n(They all hug again.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 17, "scene_id": "S06E25_017", "location": "The Hallway", "scene_description": "Chandler is running up the stairs and towards his apartment, but Joey is taking out the garbage at the same time and stops him in the hall.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S06E25/scenes/S06E25_017"}}
{"id": "S06E25_018", "text": "[Scene: Monica, Chandler, and Phoebe's, its just Monica and Chandler dancing to Wonderful Tonight on the Slowhand album by Eric Clapton. And you can buy that album from the CFSI, just click on the CDNow link.]\nEnd", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 25, "episode_id": "S06E25", "episode_title": "THE ONE WITH THE PROPOSAL: Part 2", "scene_number": 18, "scene_id": "S06E25_018", "location": "Monica", "scene_description": "Chandler, and Phoebe's, its just Monica and Chandler dancing to Wonderful Tonight on the Slowhand album by Eric Clapton. And you can buy that album from the CFSI, just click on the CDNow link.", "characters": [], "firestore_path": "/episodes/S06E25/scenes/S06E25_018"}}
