{"id": "S06E11_001", "text": "THE ONE WITH THE APOTHECARY TABLE\nTeleplay by: Brian Boyle Story by: Zachary Rosenblatt Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 1, "scene_id": "S06E11_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S06E11/scenes/S06E11_001"}}
{"id": "S06E11_002", "text": "[Scene: Monica and Chandler's, everyone is there as Joey enters happily.]\nJoey: Hey!\nRoss: Hey!\nJoey: Listen, do you guys think I have a chance with Janine?\nMonica: Honey, we have been through this before!\nRachel: Yeah. Dont do this to yourself.\nPhoebe: Shes made it pretty clear, it is not going to happen.\nJoey: Well all right then, I guess I shouldnt get to excited about the fact (excitedly) that I just kissed her!\nMonica: You serious?!\nChandler: Thats great!\nMonica: Really?!\nPhoebe: Yeah well, well see.\nRoss: You kissed her.\nJoey: Oh we kissed it up real nice.\nChandler: So you kissed her, so what happened after that?\nJoey: I came over here to tell you guys.\nChandler: So shes just waiting over there for ya?\n(Joey nods yes, but suddenly realizes what he did and runs out of the apartment and back to his place.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 2, "scene_id": "S06E11_002", "location": "Monica and Chandler's", "scene_description": "everyone is there as Joey enters happily.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E11/scenes/S06E11_002"}}
{"id": "S06E11_003", "text": "[Scene: Central Perk, Joey and Janine are pretty much making out at one of the tables as Monica and Rachel look on from the couch.]\nJanine: I gotta go.\nJoey: Okay. (They kiss.)\nJanine: Im gonna be really late for dance class!\nJoey: Okay. (They kiss.)\nJanine: Okay, now Im really late. (Gets up.)\nJoey: Okay, Im all right, okay, but hey, could you just leave your lips? (She kisses him on the cheek and starts to leave.)\nJanine: (to Monica and Rachel) Bye.\nMonica: Bye. (Janine exits.)\nJoey: Have you kissed her yet? Its awesome! I could do it forever! Yknow what? She-she kisses better than my mom cooks!\nMonica: I am so glad you said cooks.\nRachel: I know.\nChandler: (entering) Oh hey Rachel, sweetheart? You have got to tell the post office that you have moved. Okay? We are still getting all your bills and stuff. (Hands her all of her bills and stuff.)\nRachel: Oh-oh, Pottery Barn! (Grabs the aforementioned catalog and holds the rest back out to Chandler.) You can throw the rest away.\nChandler: Im not your garbage man. Im your mailman.\nRachel: Monica look! Look-look-look! Here is that table that I ordered. (Shows her the picture.)\nMonica: You got it from Pottery Barn?!\nRachel: Yeah! Its an apothecary table. Does anyone even know what an apothecary is?\nChandler: A pharmacist. (Rachel mocks him.)\nMonica: Rach, Phoebe hates Pottery Barn.\nJoey: I hate Pottery Barn too. They kicked me out of there just because I sat on a bed!\nChandler: You took off your pants and climbed under the sheets!\nJoey: (indignant) I was tired!\nRachel: Phoebe hates Pottery Barn?!\nMonica: Yeah, she hates all mass produced stuff. She thinks her furniture should have a history, a story behind it.\nRachel: Well this has story behind it! I mean they had to ship it all the way from the White Plains store.\nMonica: Its gotta be one of a kind. Yknow like umm, yknow uh, whats that God awful ceramic fruit bowl she has on her counter?\nJoey: Hey! I made that for her!\nChandler: You made pottery?\nJoey: Yeah! I made it of this fruit bowl I found in the garbage.\nMonica: Im tellingIf you put that in her apartment youll never hear the end of it.\nRachel: Okay fine! Ill-Ill just tell her its an antique apothecary table, she doesnt have to know where it came from. Oh! Look at this little drawers! Oh look-look it says that it holds 300 CDs.\nChandler: Ahh, just like the apothecary tables of yore", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 3, "scene_id": "S06E11_003", "location": "Central Perk", "scene_description": "Joey and Janine are pretty much making out at one of the tables as Monica and Rachel look on from the couch.", "characters": ["Chandler", "Janine", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S06E11/scenes/S06E11_003"}}
{"id": "S06E11_004", "text": "[Scene: The Hallway between the apartments, Joey, Janine, Chandler, and Monica are returning from a double date. Chandler is telling a joke.]\nChandler: so then the farmer says, \"Thats not a cow and youre not milking it.\" (Everyone laughs.) \nMonica: I am so glad you guys got together, Chandler and I are always looking for a couple to go out with and now we have one!\nChandler: Look at us, were a couple of couples!\nJanine: I had so much fun tonight, and what a great restaurant.\nMonica: Yeah.\nJoey: And Chandler I cant believe I let you pay for this one. (They hug and he whispers in his ear.) Thanks man.\nMonica: So do you guys gonna come over tomorrow? Ill make that pasta thing I was telling you about.\nJanine: Oh that would be great!\nJoey: Oh, but hey look, at least let us bring the wine.\nMonica: Joey, you dont have too!\nJoey: Nope-op! I insist! (He hugs Chandler again and whispers to him.) You get the wine right?\nChandler: Yeah all right. (They part.) Okay, good night guys.\nJoey: See ya tomorrow!\nMonica: Tomorrow!\nJanine: Cant wait! (They each go into their respective apartments.)\n[Cut to Joey and Janines.]\nJanine: How are we gonna get out of that one?\nJoey: What?\nJanine: I cant handle two nights in a row with them.\nJoey: What-whats wrong with Monica and Chandler?\nJanine: I dont know, theyre just a little blah!\nJoey: Blah?!\nJanine: Well yknow, hes blah, shes justshes very loud for such a small person.\nJoey: Uh, theyre like my best friends. Are you saying we cant hang out with them? Cause that would kinda be a problem.\nJanine: No! Of course we can still hang out with them. Just yknow, not two nights in a row. Okay?\nJoey: I guess.\nJanine: Thank you. (They kiss.)\nJoey: If you want, Ill sell my friends and use the money to buy you presents.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 4, "scene_id": "S06E11_004", "location": "The Hallway between the apartments", "scene_description": "Joey, Janine, Chandler, and Monica are returning from a double date. Chandler is telling a joke.", "characters": ["Chandler", "Janine", "Joey", "Monica"], "firestore_path": "/episodes/S06E11/scenes/S06E11_004"}}
{"id": "S06E11_005", "text": "[Scene: Phoebe and Rachel's, Rachel is placing CDs into her antique apothecary table as Phoebe returns home.]\nPhoebe: Hey!\nRachel: Hey!\nPhoebe: (sees the table) Ooh, what a great table! Where-where did you get it?\nRachel: Guess!\nPhoebe: Umm, a flea market?\nRachel: Ha! See, I knew, I knew youd get it on the first guess. Isnt it cool! Its an apothecary table.\nPhoebe: Wow! Oh you can just imagine that this is where (Shes opening and closing the drawers) they kept all the stuff to make their potions.\nRachel: Ohh, yes.\nPhoebe: Yknow? Ooh, you can almost smell the opium.\nRachel: Almost.\nPhoebe: How much was it?\nRachel: It was only 500 bucks.\nPhoebe: 500 bucks at a flea market?!\nRachel: Oh, okay see I thought, I thought you meant how much was it when it was new, yknow like back then.\nPhoebe: Oh no.\nRachel: Yeah no, I mean it was at a flea market, so it was yknow, it was like a dollar.\nPhoebe: A dollar?\nRachel: And fifty. So it was like one and fifty dollars.\nPhoebe: Ohh, okay, they gave you the old time pricing.\nRachel: Yeah.\nPhoebe: Well, what period is it from?\nRachel: Uh, its from yore. Like the days of yore. Yknow?\nPhoebe: Yes, yes I do. God, oh its just perfect! Wow! I bet it has a great story behind it too. Did they tell you anything? Like yknow where it was from or\nRachel: Yes! That I know, this is from White Plains.\nPhoebe: (gasps) White Plains. Oh, it sounds like such a magical place.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 5, "scene_id": "S06E11_005", "location": "Phoebe and Rachel's", "scene_description": "Rachel is placing CDs into her antique apothecary table as Phoebe returns home.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E11/scenes/S06E11_005"}}
{"id": "S06E11_006", "text": "[Scene: Rosss apartment, Rachel is entering as Ross comes out of the kitchen carrying popcorn.]\nRachel: Hey! Were here!\nRoss: Hey!\nRachel: (seeing his new table) Ohh! Oh my God!\nRoss: You like it? \nRachel: Oh no!\nRoss: Its my new apothecary table!\nRachel: Ross! Phoebes gonna be here any second, she cannot see this!\nRoss: Well why not?! Shell-shell love it! Its the real thing! I got it at Pottery Barn.\nRachel: I know you did! I bought the same one! And if she sees your table shes gonna know that I lied to her. I told her ours was an original.\nRoss: Why did you do that?\nRachel: Because she hates Pottery Barn.\nRoss: She hates Pottery Barn?!!\nRachel: I know! I know, she says its all mass-produced, nothing is authentic, and everyone winds up having the same stuff. (Ross looks at his table.) So come on, shes gonna be here any second! Can we please just cover this up with something?! Please?\nRoss: What? No! No! I am not gonna hide it from PhoebeOoh, although I did get some great Pottery Barn sheets! (Gets them.)\nRachel: Ooo! Oh, I forgot they made sheets!\nRoss: Uh, yeah! I still cant believe she hates Pottery Barn!\nRachel: Ross, get over it! Its not like she hates you.\nRoss: Yeah but Pottery Barn! Yknow what I think? Its just she-shes weird. Yknow its because shes a twin. Twins are weird.\nRachel: Ross, shes not weird, she just wants her stuff to be one of a kind.\nRoss: Huh. Yknow whats not one of a kind? A twin!\nPhoebe: (entering) Hey!\nRachel: Hey!\nRoss: Hey!\nRachel: Ooh, Phoebes here! Okay, lets turn out all the lights and well just watch the movie!\nPhoebe: Okay. HeyOoh, cool sheets! (Notices the sheet over the table.) \nRoss: Oh, you like it? You wanna know where I got it? \nPhoebe: Sure!\nRachel: He got it a flea market!\nPhoebe: You bought your sheets at a flea market? Ross come on, you gotta loosen the purse strings a little.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 6, "scene_id": "S06E11_006", "location": "Rosss apartment", "scene_description": "Rachel is entering as Ross comes out of the kitchen carrying popcorn.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E11/scenes/S06E11_006"}}
{"id": "S06E11_007", "text": "[Scene: Joey and Janines, Joey is pacing around as Chandler and Monica enter.]\nMonica: Hey!\nJoey: Hi!\nMonica: The dinner will be ready in twenty minutes. This is so exciting.\nChandler: And here is the bottle of wine for you to bring over tonight. (Hands it to him.) You were also going to buy Monica flowers but you couldnt afford it, because you paid dinner last night.\nJoey: Thanks. Thanks, but uh actually its just gonna be me again tonight.\nMonica: What happened to Janine?\nJoey: Oh, shes uh-uh really sick.\nChandler: Oh thats too bad.\nJoey: Yeah, shes been in there all day (Points to her room), uh high fever, a nose problem Phlegm! Phlegm! Phlegm-phlegm-phlegm!\nJanine: (entering from her room) Monica! Chandler! Im really-really sorry about tonight. I dont know if Joey told you; I just couldnt get out of going to this play. Im sorry. Have a great time.\nJoey: Kay!\nJanine: Bye. (Exits)\nChandler: Thats funny, I saw no phlegm.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 7, "scene_id": "S06E11_007", "location": "Joey and Janines", "scene_description": "Joey is pacing around as Chandler and Monica enter.", "characters": ["Chandler", "Janine", "Joey", "Monica"], "firestore_path": "/episodes/S06E11/scenes/S06E11_007"}}
{"id": "S06E11_008", "text": "[Scene: Joey and Janines, continued from earlier.]\nJoey: No-no, she really is sick!\nChandler: Then why-why is she going to a play?!\nJoey: Uh, yknow, starve a fever, go to a play for a cold.\nMonica: Joey! Why is Janine not coming over for dinner?!\nJoey: Well uh, she didnt want to hang out with you guys two nights in a row. Im so sorry.\nChandler: Well, why does she not want to hang out with us?!\nJoey: Because she uh, she-she thinks that you are blah and that you, Monica, are too loud.\nMonica: (loudly) What?!! (Quietly) What?\nChandler: So she was just pretending to have a good time last night? She was lying to our faces?!\nMonica: Ugh, I can not believe this! I mean, who is she to judge us? We could not have been nicer to her!\nChandler: And I am not blah, I am a hoot!\nJoey: I know! I know! Come on, please-please you guys, dont-dont be mad. Im sure she just, she just said that stuff because she was nervous and you guys are like my best friends! Yknow? And it was our first date! Plus, shes really sick!\nChandler: No, you shNo you said you made that up!!\nJoey: I know, but dont you think the sick thing is way better than the play thing?\nChandler: Eh, theyre both good. I generally just go with, Monicas drunk again. (Monica glares at him.) \nJoey: Come on you guys, come on please-please just give her another chance, huh? Shell come around I promise.\nMonica: Of course we will, come on we gotta make dinner.\nChandler: Okay.\n(They exit and close the door.)\nMonica: (from the hallway) I do not like that woman!\nJoey: (shouting) I can hear you!\nMonica: I am loud!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 8, "scene_id": "S06E11_008", "location": "Joey and Janines", "scene_description": "continued from earlier.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E11/scenes/S06E11_008"}}
{"id": "S06E11_009", "text": "[Scene: Ross's apartment, Ross, Rachel, and Phoebe are watching a movie.]\nAll: Aww! (They all laugh.)\nRachel: Thats funny. (Phoebe puts her feet up on Rosss table.)\nRoss: Hey Pheebs, could you please not put your feet up on my new(On Rachels glare)old sheet?\nPhoebe: Oh sure! (She goes to take her feet off, but drags the sheet with her which spills the wine.) Noo!\nRachel: Ohh!!\nRoss: My apothecary table!!!\nPhoebe: What?!\nRachel: Noooooo!! (Phoebe lifts up the sheet to discover the exact same apothecary table they have.) \nPhoebe: Ross, where did you get this?!\nRoss: I got it at Pottery Barn!! Okay?!\nRachel: Oh my God, Phoebe, Pottery Barn has ripped off the design of our antique!\nPhoebe: Wow! Oh my God, well if theyve ripped off our table ours must be much more than one and fifty dollars!\nRachel: Oh yes.\nPhoebe: Well this doesnt even smell like opium.\nRoss: Of course not, it smells like wine, which you spilled! And thanks for wrecking my sheet by the way.\nPhoebe: Oh Ross, calm down, Ill give you the 80 cents. (Ross glares at Rachel)", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 9, "scene_id": "S06E11_009", "location": "Ross's apartment", "scene_description": "Ross, Rachel, and Phoebe are watching a movie.", "characters": ["All", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E11/scenes/S06E11_009"}}
{"id": "S06E11_010", "text": "[Scene: Monica and Chandler's, Monica and Chandler are sitting at the kitchen table.]\nChandler: Okay, one more time.\nMonica: Chandler, would you like some more orange juice?\nChandler: Perfect decibel.\nMonica: (loudly) I know!!!\nJoey: (entering) Hey!\nChandler: Hey.\nJoey: So uh, what are you guys doing?\nChandler: Oh nothing, were just talking. Yknow, blah-blah-blah.\nJoey: Look, come on you guys, you said you were gonna try! All right look, I came over here to invite you guys to a movie with me and Janine.\nMonica: Well, Id like to but, (extremely quietly) Im not sure we have time to go.\nJoey: Ha-ha, very funnyLook! I dont know what to do! I really want you guys to get along. Just please come to the movie with us. I mean you owe me!\nMonica: We owe you?!\nJoey: Thats right! I helped you guys out a lot in the start of your relationship. Huh? I helped you guys sneak around for like six months, and I looked like an idiot! And I was humiliated. And I only made 200 dollars!\nMonica: We didnt give you any money! (Chandler is motioning, \"No!\")\nJoey: You dont think I know that!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 10, "scene_id": "S06E11_010", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler are sitting at the kitchen table.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E11/scenes/S06E11_010"}}
{"id": "S06E11_011", "text": "[Scene: Phoebe and Rachel's, Rachel is showing Ross around the newly decorated living room.]\nRachel: see I cant decide whether it would go better next to the new wicker dining chair, the Sahara desk, or the Parker console table.\nRoss: Wow! I didnt know that there was a Pottery Barn up here.\nRachel: I know, I know. I went a little crazy.\nRoss: A little? Your place looks like page 72 of the catalogue. Oh look at that! The ornamental bird cage! Large!\nPhoebe: (entering) Hey!\nRachel: Hey.\nPhoebe: (sees Ross) Oh Ross no. Be careful, that is very old! Okay? Early Colonial bird merchants used to bring their birds to market in that.\nRoss: (glaring at Rachel) Fascinating.\nPhoebe: (gasps) Another amazing find! Wow! Oh I bet this has a great story too!\nRachel: Oh it does, it does! It is a room separating apparatus from Colonial times.\nPhoebe: Ah!\nRoss: Hmm, a lot of this stuff is from Colonial times. Hey, what are some other time periods Rachel? (She glares at him.)\nRachel: Well theres yore. And uh, yknow, yesteryear.\nPhoebe: Yeah no, Im telling you Rachel has such a great eye for this stuff. Ross, yknow if you ever decide you need to redecorateAnd I think that you should. You should, you should ask Rachel to help.\nRachel: Oh honey he doesnt need my help.\nPhoebe: Oh, come on! I think hes ready to get rid of, what did you call it? The cheap knock-offs and dinosaur junk.\nRoss: Really?! (To Rachel) Hey, yknow what? Since you have such a great sense of what I need, uh ooh, heres-heres 60 bucks, why dont you take Phoebe down to that Colonial flea market of yours and get me some stuff.\nRachel: (not sure of what to do) Yknow what? I dont, I dont think Phoebe really wants to come.\nPhoebe: No! I do want to!\nRachel: Oh, she does want to.\nRoss: She does want to.\nPhoebe: Yeah!", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 11, "scene_id": "S06E11_011", "location": "Phoebe and Rachel's", "scene_description": "Rachel is showing Ross around the newly decorated living room.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E11/scenes/S06E11_011"}}
{"id": "S06E11_012", "text": "[Scene: The Street, Phoebe and Rachel are heading back from that Colonial flea market.]\nRachel: Pheebs, I dont know what to say. I guess the flea market was just better last time.\nPhoebe: Well at least I got these sheets for Ross.\nRachel: Yeah.\n(They walk by a Pottery Barn window display.)\nPhoebe: Uck, look at this! Pottery Barn, yuck!\nRachel: Yeah, yknow what? Dont look at it. (Realizes the display is their living room) Seriously, dont look at it. (Tries to pull Phoebe away.)\nPhoebe: No! Look-look! Theres the coffee table they stole from us!\nRachel: Ugh, those bastards! Lets go.\nPhoebe: That fan kinda looks like ours. And the birdcage and thewait a sec! This is our exact living room!\nRachel: No! No! No! No its not! No its not! Come on! Phoebe, ours is totally different! I mean we dont have the (Looks desperately for something different.) We dont have thethat lamp! And-and that screen is yknow, on the other side.\nPhoebe: Oh my God. This is where you got all our stuff, Pottery Barn! Oh my God!\nRachel: Okay! Okay-okay lookno I did, I just wanted this stuff and I know how you feel about Pottery Barn. Just Come on dont be mad.\nPhoebe: No-no-no, but I am mad! I am mad! Because this stuff is everything that is wrong with the world! And its all sitting up in my living room and all I can think about is how I dont have that lamp!\nRachel: Well then honey, buy the lamp! Hey, we have that 60 bucks from Ross.\nPhoebe: I cant! I cant! Unless Well are you saying that-that you would move out if-if I didnt buy that lamp?\nRachel: What?! No! Im not gonna move out!\nPhoebe: But are you saying that you would move out if I didnt buy that lamp?\nRachel: (gets it) Oh. Yes! I would so move out!\nPhoebe: Okay then I dont have a choice! I have to buy that lamp!\nRachel: Thats right!\n(They start to go inside.)\nPhoebe: But at least the apothecary table is real.", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 12, "scene_id": "S06E11_012", "location": "The Street", "scene_description": "Phoebe and Rachel are heading back from that Colonial flea market.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E11/scenes/S06E11_012"}}
{"id": "S06E11_013", "text": "[Scene: The hallway, Joey, Janine, Monica, and Chandler are returning from their second date.]\nJoey: Well, this-this-this was great. Didnt everybody have a great time?\nJanine: Well I did. I really did. And you guys, Ive got to say, Im sorry if I was a little weird after the last time we went out. I guess I was just nervous or something.\nChandler: Thats totally understandable.\nMonica: Dont worry about it.\nJanine: So we can go out again?\nChandler: Oh yeah!\nMonica: Absolutely!\nJanine: Oh good.\nJoey: Oh well then, good night!\nMonica: Good night! (They go into their respective apartments.)\n[Cut to Joey and Janines, theyre entering.]\nJoey: See? Eh, wasnt that fun?\nJanine: We have got to move!\nMonica: (bursting in) I knew it!! Yknow, youre not so quiet yourself, missy!\nChandler: And Im blah? Listen, the only thing more boring than watching modern dance is having to listen to you talk about it, (Imitating her) \"Oh Chandler, I just lost myself in the moment.\"\nJanine: Yknow, I know youre talking, but all I hear is, \"Blah. Blah. Blah-blah-blah.\"\nMonica: (steps up and points at her) All right! You and me! Lets go! Right now!\nJoey: All right! All right! Enough! Enough! Enough!! Enough! (To Chandler and Monica) You two go home! I-I-I gotta talk to Janine! (They start to leave.)\nChandler: (To Monica) Yknow I think you can take her.\nMonica: (to Janine) Youd better hope I dont see you in the hallway!! (They exit.)\nJoey: All right, uh, weve got a little bit of a problem here. These people are my friends; you cant treat them that way.\nJanine: They said stuff to me too, yknow!\nJoey: I know! I know! And Im going to talk to them about it. They mean so much to me. They Theyre like my family. If you guys are gonna be fighting all the time, I-I I dont think we can be together. It just, it just cant work. It cant. (Starts to break up) Im very upset.\nJanine: Okay. Okay. Would, would it help if I went over and apologized?\nJoey: Yeah! Yeah! That would be very helpful! Yeah. (He opens the door for her and she exits into the hallway.)\n[Cut to the hallway, Janine is entering as Monica is taking out the garbage.]\nMonica: What did I tell you about the hall?!\nJanine: I was just coming over here to apologize for my behavior! Id really like it if we could be friends.\nMonica: Well, I know that would make Joey happy, so, I would like that too.\nJanine: Great.\nMonica: Now come on. (They hug like men.) Well, Im glad we worked things out.\nJanine: Me too.\nMonica: Okay.\nJanine: Ill see you.\nMonica: Bye. (Leaves to resume her garbage removal task.)\nJanine: (muttering to herself) Or Ill hear you.\nMonica: (hearing that) Thats it big girl! (Hits Janine in the butt with the garbage bag) Come on!\nJanine: Wait! (Janine pauses, then runs down the stairs.)\nMonica: (chasing her) Youd better run! \n(Joey and Chandler both come into the hallway.)\nChandler: Did you hear that?\nJoey: Yeah uh, what am I gonna do?\nChandler: Yeah, Im sorry man. (Pause) You wanna go watch?\nJoey: Yeah! (They head downstairs.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 13, "scene_id": "S06E11_013", "location": "The hallway", "scene_description": "Joey, Janine, Monica, and Chandler are returning from their second date.", "characters": ["Chandler", "Janine", "Joey", "Monica"], "firestore_path": "/episodes/S06E11/scenes/S06E11_013"}}
{"id": "S06E11_014", "text": "[Scene: Central Perk, Ross, Chandler, and Monica are there as Joey enters.]\nRoss: Hey!\nJoey: How ya doin?\nChandler: Hey so, did uh, did she move out?\nJoey: Pretty much, yeah.\nMonica: I cannot believe you broke up with her just like that.\nJoey: Well, when its not right, you know it.\nChandler: You okay?\nJoey: Yeah! Yeah. Ill be all right.\nRoss: Yknow what would cheer you up?\nJoey: What?\nRoss: Im giving this lecture on erosion theories tomorrow night, I think you should come.\nJoey: (laughing hysterically) Youre right! That did cheer me up!\nEnd", "metadata": {"chunk_type": "scene", "season": 6, "episode_number": 11, "episode_id": "S06E11", "episode_title": "THE ONE WITH THE APOTHECARY TABLE", "scene_number": 14, "scene_id": "S06E11_014", "location": "Central Perk", "scene_description": "Ross, Chandler, and Monica are there as Joey enters.", "characters": ["Chandler", "Joey", "Monica", "Ross"], "firestore_path": "/episodes/S06E11/scenes/S06E11_014"}}
