{"id": "S07E03_001", "text": "THE ONE WITH PHOEBES COOKIES\nWritten by: Sherry Bilsing & Ellen Plummer Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 1, "scene_id": "S07E03_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E03/scenes/S07E03_001"}}
{"id": "S07E03_002", "text": "[Scene: Central Perk, Rachel, Phoebe, Joey, Ross, and Monica are all there as Chandler enters wearing glasses.]\nChandler: Hey, you guys!\nRoss and Rachel: Hey!\nChandler: So, what do you think?\nRoss: About what?\nRachel: Yeah, what?\nJoey: What?\nChandler: Are you kidding? Okay, Ill give you a hint; Ill give you a hint. (Points to his glasses.)\nJoey: Eyes! No, no. Your eyes! No. Chandlers eyes!\nChandler: I got glasses!\nRoss: Well, you-youve always had glasses.\nChandler: No I didnt!\nRoss: Are you sure?\nRachel: Yeah-yeah, did-didnt you use to have a pair? They were really round, burgundy, and they made you look kind of umm\nJoey: Feminine.\nRachel: Yes!\nChandler: No!\nMonica: Sweetie, I think the glasses look great. They make you look really sexy.\nChandler: Really?\nMonica: Yeah!\nChandler: (sitting down on the arm of her chair) You didnt think I used to wear glasses, right?\nMonica: Of course! (She mouths, \"I have no idea,\" to the rest of the gang.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 2, "scene_id": "S07E03_002", "location": "Central Perk", "scene_description": "Rachel, Phoebe, Joey, Ross, and Monica are all there as Chandler enters wearing glasses.", "characters": ["Chandler", "Joey", "Monica", "Rachel", "Ross", "Ross and Rachel"], "firestore_path": "/episodes/S07E03/scenes/S07E03_002"}}
{"id": "S07E03_003", "text": "[Scene: Monica, Chandler, and Phoebe's, Rachel, Phoebe, Chandler, and Monica are making some sandwiches.]\nPhoebe: So what do you guys want for an engagement present?\nChandler: Thats okay Pheebs, were not having a party or anything, so you dont have to get us\nMonica: (interrupts him) If someone wants to give us a present, we dont want to deprive them of that joy.\nRachel: Oh, yknow what you should get em? One of those little uh, portable CD players.\nMonica: Oh, I already have one. \nPhoebe: Not unless someone borrowed it and left it at the gynecologist.\nRachel: Yeah, and-and-and by someone, she means Joey.\nMonica: Hey, I know I what I want!\nChandler: What we want honey.\nMonica: No, you dont want this. I want to have your grandmothers cookie recipe.\nPhoebe: You mean the chocolate chip cookie recipe?\nMonica: Uh-huh, yeah.\nPhoebe: You mean the one that my grandmother made me swear on her deathbed that I would never let out of our family?\nChandler: Dying people say the craziest things.\nMonica: I wanted it for years! I was gonna make cookies for my children.\nPhoebe: Break my heartOh, all right.\nMonica: Okay. Im gonna be the mom that makes the worlds best chocolate chip cookies.\nChandler: Our kids are gonna be fat arent they.\nJoey: (entering) Ahoy!\nChandler: Hey! Hows the boat?!\nJoey: Great! Im finally getting into this sailing stuff.\nMonica: Oh, so you finally took it out of the marina huh?\nJoey: Why would I do that? It took three guys to get the thing in there!\nPhoebe: If you dont sail your boat, what do you do on it?\nJoey: Oh, its great! Its a great place to just kinda, sit, hang around, drink a few beers, eat some chips. (He says that as he sits, hangs around, drinks a beer, and eats a chip.)\nChandler: Well, its good that you finally have a place to do that.\nRachel: Yknow Joey, I could teach you to sail if you want.\nJoey: You could?\nRachel: Yeah! Ive been sailing my whole life. When I was fifteen my dad bought me my own boat.\nPhoebe: Your own boat?\nRachel: What?! What?! He was trying to cheer me up! My pony was sick.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 3, "scene_id": "S07E03_003", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Rachel, Phoebe, Chandler, and Monica are making some sandwiches.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E03/scenes/S07E03_003"}}
{"id": "S07E03_004", "text": "[Scene: Central Perk, Chandler and Monica are there. He takes off his glasses and starts chewing on the ear piece.]\nChandler: Do you know what I was thinkin?\nMonica: What?\nChandler: Nothing, I just like to go like this. (Does it again.)\nRoss: (entering from the bathrooms) Hey Chandler, what are you doing tonight?\nChandler: Uh why, do you have a lecture?\nRoss: No, why?\nChandler: Then free as a bird. Whats up?\nRoss: My dad wanted to know if you wanted to play racquetball with us.\nMonica: Wow! Thats great! Dad must really like you, he doesnt ask just anyone to play.\nRoss: Yeah and he didnt really ask for you, he asked for Chancy, I assumed he meant you.\nChandler: Well, did-did you correct him?\nRoss: No, I-I thought it would be more fun this way.\nMonica: This is so cool, maybe this is something you can do every week.\nRoss: Or you can sit with him on the front porch and make sure no one steals the trash cans. He does that every week too.\nMonica: Oh, just so you know, you-you have to let him win.\nRoss: Yeah.\nMonica: He hates to lose.\nChandler: Oh no problem, maybe Ill play with my left hand.\nRoss: Youre not a lefty? \nChandler: Does anybody know me?!\n(Phoebe enters, walks up to Monica, and exhales exasperatedly.)\nMonica: Whats wrong Phoebe?\nPhoebe: I just went to my old apartment to get you the-the cookie recipe and the stupid fire burned it up!\nMonica: No!! Why didnt you make a copy and-and keep it in a fireproof box and keep it at least a hundred yards from the original?!!\nPhoebe: (pauses as he figures out how to answer that) Because Im normal! That was the one legacy my grandmother left me, and I know you wanted it as an engagement present.\nRoss: Oh, we have to get you an engagement present?\nChandler: Dont worry about it Pheebs.\nRoss: No one got me an engagement present.\nPhoebe: Okay, here I wish you health and happiness. (She hands Monica a cookie in a plastic baggie.) \nChandler: An old cookie?\nMonica: (To Chandler) This is what happens when you dont register for gifts!\nPhoebe: See no-no, I made a batch and I froze it, and this is the only one left.\nChandler: We cant accept this.\nPhoebe: Why not?\nChandler: Cause its gross.\nMonica: No! Wait! I think I can figure out the recipe from this cookie! I do stuff like this at work all the time.\nPhoebe: Really?!\nMonica: Yeah! I bet I can do it.\n(Chandler looks over and sees Ross glaring at them.)\nChandler: Okay, we owe you a present.\nRoss: Two! Ive been engaged twice!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 4, "scene_id": "S07E03_004", "location": "Central Perk", "scene_description": "Chandler and Monica are there. He takes off his glasses and starts chewing on the ear piece.", "characters": ["Chandler", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_004"}}
{"id": "S07E03_005", "text": "[Scene: The Mr. Bowmont (Joeys boat), shes shown to be in one of the waterways around New York, but in reality shes in a sound stage on the Warner Bros. lot and we see New York from the water in some rather poor green screen shots. Rachel and Joey are on board.]\nJoey: (drinking a beer) Look at this clown! Just because hes got a bigger boat he thinks he can take up the whole river. (Yelling) Get out of the way jackass! (To Rachel) Who names his boat Coast Guard anyway?\nRachel: That is the Coast Guard. \nJoey: What are they doing out here? The coasts all the way over there. (Points to the coast, meanwhile there is coast behind him.)\nRachel: Joey, just ignore the boats all right? Were not finished with the lesson yet.\nJoey: All right.\nRachel: Okay, Im just gonna go over the basic points just one more time, are you ready?\nJoey: Come on Rach, not again. I got it! Okay? Lets start sailing, and I want to go over there (Points) where that boatload of girls is! (Yelling to them) Yo-ho-ho!\nRachel: Oh, okay. Is that what you want to do? You wanna go over and give a little shout out to the old, hot chickas? Okay, lets do that Sailor Joe. Quick question though, (grabs some of the rigging) whats this called?\nJoey: Uh, boat rope.\nRachel: Wrong! How do you get the mainsail up?\nJoey: Uhh, rub it?\nRachel: No. What do you do if I say we are coming about?\nJoey: Id say, come again. No-no, wait I-I-I know this one, I know this one, uh\n(Rachel blasts an air horn in his ear.)\nRachel: Times up, now your dead.\nJoey: And deaf!\nRachel: Okay, you just go on and make your little jokey-jokes, but if you do not know what you are doing out at sea you will die at sea. Am I getting through to you sailor?! (She punctuates each word by slapping him on the forehead.)\nJoey: Yes.\nRachel: Dont just say yes! This isnt a game, Joey you can really get hurt out here. Okay, so do you want to pay attention or do you want to die?!\nJoey: I want to make a ship to shore call to Chandler.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 5, "scene_id": "S07E03_005", "location": "The Mr. Bowmont (Joeys boat)", "scene_description": "shes shown to be in one of the waterways around New York, but in reality shes in a sound stage on the Warner Bros. lot and we see New York from the water in some rather poor green screen shots. Rachel and Joey are on board.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E03/scenes/S07E03_005"}}
{"id": "S07E03_006", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica and Phoebe are trying to determine the cookie recipe by eating small pieces.]\nMonica: All right, I definitely taste nutmeg.\nPhoebe: You do?\nMonica: You dont? (Laughs) Well, thats the difference between a professional and a layman.\nPhoebe: That and arrogance.\nJoey: (entering) Hey.\nMonica: Hey! How was sailing?\nJoey: I dont want to talk about it. Yknow, you couldve at least saved me a whole cookie. (He grabs whats left of the cookie and pops in his mouth.)\nMonica and Phoebe: No-wait-no-no!!!!!!!\nJoey: (recoils in horror) Women are mean!!! (Storms out.)\nPhoebe: I cant believe that! Now the only thing left of my grandmothers legacy is this crumb. (She picks it up with her finger and holds it out to Monica.) I wish you a long and happy marriage.\nRoss: (entering with Chandler) Hey.\nMonica: Hey! How was it?\nRoss: Well I had a great time! Umm, Chancy on the other hand\nChandler: I will tell the story! It was going great. I let him win. We were bonding. He even said I could call him dad.\nRoss: And what did he ask you not to call him?\nChandler: Daddy. All right look, heres the story. (Flashback to Chandler about to enter the steam room as he does the voice-over.) Well, we had just finished playing racquetball and we were gonna take a steam. I walk into the steam room and it was really steamy. (The flashback shows his glasses fog up and him trying to find his way around the steam filled room. He takes off his glasses.) So I take off my glasses and thats when in happened.\n[Cut to the flashback, Chandlers no longer doing the voice-over.]\nChandler: Guys?\nRoss: Over here. (You can see Ross sitting at the far wall.)\nMr. Geller: Have a seat son. (You can see Mr. Geller sitting closer to the door as Chandler walks over and sits in his lap.) Hey!! (Chandler quickly jumps off and sits next to him with a shocked expression on his face.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 6, "scene_id": "S07E03_006", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica and Phoebe are trying to determine the cookie recipe by eating small pieces.", "characters": ["Chandler", "Joey", "Monica", "Monica and Phoebe", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_006"}}
{"id": "S07E03_007", "text": "[Scene: Monica, Chandler, and Phoebe's, Chandler is finished telling everyone what happened.]\nMonica: Oh my God Chandler! I cant believe it!\nChandler: I know.\nMonica: You gave my father a lap dance!\nChandler: Why do they put so much steam in there?!\nRoss: Cause otherwise theyd have to call it the room room.\nChandler: Why? Okay? Why? Wh-wh-why did that have to happen?\nPhoebe: Come on, its not that big a deal!\nChandler: Not that big a deal? Therethere was touching of things.\nRoss: Now, I know you wanted to bond with my dad, but did you really have to bond to that part?\nMonica: Listen, Im sure that dad doesnt care. He probably thought this was funny; hell be telling this story for years!\nChandler: I dont want him to tell this story for years.\nRoss: Oh, but he will. He still tells the story how Monica tried to escape from fat camp.\nMonica: I wasnt escaping.\nRoss: Then how did you get caught in the barbed wire?\nMonica: I was trying to help out a squirrel.\nRoss: You were trying to eat it!\n(The phone rings.)\nChandler: If that is your father calling to tell this story then the marriage is off!\nMonica: (takes the phone from Ross) Come on. (Answering phone) Hello? (Listens) Im sorry you have the wrong number. (Listens) (Whispering) Okay, Ill call you later dad. I love you. (Hangs up.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 7, "scene_id": "S07E03_007", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Chandler is finished telling everyone what happened.", "characters": ["Chandler", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_007"}}
{"id": "S07E03_008", "text": "[Scene: Central Perk, Chandler, Ross, and Rachel are there.]\nChandler: (getting up) All right, Im off to see your dad.\nRoss: Whoa-whoa, arent you a little over dressed?\nRachel: (laughing) Yeah, and-and you better make sure he tips you this time.\nChandler: Look, I figured I would try to convince him not to tell the story anymore, and I figure the best way to do that is face to faceAnd by face I dont mean his lap. And by face, I dont mean my ass. (Exits.)\nRoss: (To Rachel) Hey are you getting Monica and Chandler an engagement present?\nRachel: I dont know. Yknow, they didnt get us anything.\nRoss: Thank you!\nJoey: (entering) Hey.\nRoss: Hey.\nRachel: Well hello! So, when are we gettin back out on the water matey? \nJoey: Oh uh, I dont know the boat way to say this, but uh never!\nRachel: Why not?\nJoey: Because! Youre mean on the boat!\nRachel: What? I was just trying to teach you.\nJoey: Well, lesson learned! Rachel is mean!\nRoss: Yeeeeeep Yep-yep-yep-yep-yep. I remember when she took out on her dads boat she wouldnt let me help at all.\nRachel: Excuse me, I wanted you to help, but you couldnt move your arms because you were wearing three life jackets.\nRoss: You have to respect the sea! (Storms off.)\nRachel: Look Joey, Im sorry if-if you thought that was mean, but I gotta tell ya something. That was not mean. Okay, my father is mean. He used to yell at me all the time on the boat, I mean it was horrible. I was just being a good teacher.\nJoey: Does a good teacher say, \"Put down the beer pinhead!?\"\nRachel: Well, does a good student drink seven beers during his first lesson?\nJoey: Six and a half! You knocked that last one out of my hand! Remember?\nRachel: Yeah, I didnt want you to get hit by the boom!\nJoey: Well it hit me anyway! And it wouldve hurt a lot less if I had finished that last beer.\nRachel: All right, yknow what? I-Im sorry. I will try to tone it down and uh stop yelling.\nJoey: You wont boss me around anymore?\nRachel: I wont boss you around.\nJoey: And youll be nice?\nRachel: And, Ill be nice.\nJoey: And youll be topless?\nRachel: AndJoey!\nJoey: Do you want me to learn?!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 8, "scene_id": "S07E03_008", "location": "Central Perk", "scene_description": "Chandler, Ross, and Rachel are there.", "characters": ["Chandler", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_008"}}
{"id": "S07E03_009", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica is trying out different cookie recipes. Ross and Phoebe are the tasting group.]\nMonica: Okay, heres batch 22. Ohh, maybe thesell taste a little like your grandmothers. This has a little bit of orange peel, but no nutmeg.\nRoss: Lets give it a shot.\nMonica: Okay. Man, I have not made this many cookies since I was in the ninth grade.\nPhoebe: Oh, what was that for? Like a bake sale?\nMonica: No, just a Friday night.\n(They all take a bite.)\nRoss: Ohh, these are pretty good.\nPhoebe: Yeah, but not as good as batch 17.\nRoss: Which one was that?\nMonica: The ones we had right after you almost threw up.\nRoss: Oh yeah! Batch 17 was good. I did not like batch 16. (Burps a little bit.) Im okay.\nPhoebe: Are there anymore from the good batch? Cause we could just work off of those.\nRoss: Yeah, ooh yeah, I think there is one from batch 17 left, uh (Grabs a cookie and takes a big bite out of it and doesnt like it.) Its batch 16! 16 people! Get out of the way! (Gets up and runs for the bathroom.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 9, "scene_id": "S07E03_009", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica is trying out different cookie recipes. Ross and Phoebe are the tasting group.", "characters": ["Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_009"}}
{"id": "S07E03_010", "text": "[Scene: The Mr. Bowmont, its Joeys second lesson with Rachel as the resident sailing expert.]\nRachel: Okay Joey honey, youre doing really good! All right, now Im just gonna need you to step to the port side. (Joey pauses as he tries to remember which side is the port side.) Remember? Remember how we talked about the port side?\nJoey: Ohh yeah.\nRachel: Right?\nJoey: Nope.\nRachel: Its left sweetie, but thats okay sweetie, thats a tough one.\nJoey: I dont know why you just dont say left.\nRachel: Okay, go to the left. (Joey goes starboard or sits on the right side of the boat.) The left!\nJoey: Huh?\nRachel: (yelling) Just sit over there!! (Points to the port side.)\nJoey: (hurrying over) Okay! Okay, youre yelling again! See that?\nRachel: No! No-no, no-no-no, very quiet, said with love, no yelling.\nJoey: Oh, yknow what? Since Im here, I think Im gonna have me a little beer on the port side. (Grabs and opens one.)\nRachel: Okay Joey, were luffing a little bit, so could you tighten up the cunningham? (The mainsail has started to flap in the wind and has stopped working efficiently; she wants him to tighten it so that it starts working again.)\nJoey: Uh, wow, you just said a bunch of stuff I didnt know there.\nRachel: Joey, come on! We just went over this! (She does it instead.)\nJoey: Oh, yknow, when we did that was when that bird was flying overhead with the fish in his mouth. Did you see it? It was gross!\nRachel: (angrily) No! All right?! I did not see the bird! I did not see the fish! I did not see the piece of Styrofoam that was shaped like Mike Tyson! I did not, because I was trying to teach you how to sail a boat! Which obviously is an impossible thing to do!\nJoey: All right thats it! Youre yelling and I dont see you taking your top off! I quit!\nRachel: What do you mean you quit?! You cant quit!\nJoey: Why not?!\nRachel: Because youre not finished yet and I wont have it! Greens do not quit!\nJoey: Greens? Im a Tribbiani! And Tribbianis quit!\nRachel: Oh my God, wait did II just said Greens dont quit didnt I? (Pause) (Angrily) Did I just say Greens dont quit?!\nJoey: Yes! Yes! You did and youre still yelling at me!\nRachel: No! No! No! Im not yelling at you, Im just yelling near you. Oh God Joey, ohh Im my father. Oh my God, this is horrible! Ive been trying so hard not to be my mother I did not see this comin. Oh, Joey, Im sorry. Im so sorry. I just wanted you to learn.\nJoey: Well, hey I did learn.\nRachel: Really?\nJoey: Yeah! Come on.\nRachel: Awww\nJoey: Yeah, its okay. I know what a mainsail is. (Points to it. Its the larger sail.) I know, I know to duck when the boom comes across. I-I know port is right.\nRachel: Left.\nJoey: Damnit!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 10, "scene_id": "S07E03_010", "location": "The Mr. Bowmont", "scene_description": "its Joeys second lesson with Rachel as the resident sailing expert.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E03/scenes/S07E03_010"}}
{"id": "S07E03_011", "text": "[Scene: Monica, Chandler, and Phoebe's, the cookie trying period has pasted. Monica, Phoebe, and Ross are reflecting on the days events.]\nPhoebe: Yknow, I bet it would actually make my grandmother very happy to know that were trying to figure out her recipe. I bet shes l-l-lookin up at us and smiling right now.\nRoss: Looking up?\nPhoebe: Oh yeahNo, she was really nice to me, but shes in hell for sure.\nMonica: Well, Ive tried everything. I give up. I guess Im not gonna be the mom who makes the worlds best chocolate cookies. I do make the best duck confit with broccoli rabe. Kids love that right.\nRoss: Aww, Pheeb, come on isnt there any relative that would have the recipe? What about, what about your sister?\nPhoebe: Oh no-no, no, I made a promise to myself that the next time I would talk to Ursula would be over my dead body. And thats not happening til October 15th, 2032.\nRoss: Thats the day youre gonna die? Seedarnit, Ive got shuffleboard that day.\nPhoebe: Thats what you think.\nMonica: Well, I mean what about friends of your grandmothers? Wouldnt they have the recipe?\nPhoebe: Well, yknow I may have relatives in France who would know. My grandmother said she got the recipe from her grandmother, Nesele Tolouse.\nMonica: What was her name?\nPhoebe: Nesele Toulouse.\nMonica: Nestle Tollhouse?!\nPhoebe: Oh, you Americans always butcher the French language.\nMonica: (grabbing a bag of Nestle Tollhouse chocolate chips) Phoebe, is this the recipe? (Tosses her the bag.)\nPhoebe: (reading the recipe on the back of the bag) Yes!! (Realizes.) Ohh.\nMonica: I cannot believe that I just spent the last two days trying to figure out the recipe and it was in my cupboard the whole time!\nPhoebe: I know! You see it is stuff like this which is why (Looking down) youre burning in hell!!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 11, "scene_id": "S07E03_011", "location": "Monica", "scene_description": "Chandler, and Phoebe's, the cookie trying period has pasted. Monica, Phoebe, and Ross are reflecting on the days events.", "characters": ["Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E03/scenes/S07E03_011"}}
{"id": "S07E03_012", "text": "[Scene: The Gym, Chandler and Mr. Geller are heading for the whirlpool room.]\nChandler: So you understand, Id feel a lot more comfortable if you didnt tell people what happened. Yknow, Im a littleIm a little embarrassed about it.\nMr. Geller: I understand completely, theres nothing more horrifying than embarrassing yourself in front of your in-laws. As a matter of fact, when I started dating Judy I was unemployed, and her father asked me what I did for a living and I told him I was a lawyer.\nChandler: What did you do when they found out?\nMr. Geller: They never did, so if ever see me giving them legal advice just nod along. Shall we? \n(Chandler nods along and they enter the whirlpool room and remove their robes. Only Chandler is lacking a certain item of clothing. You see this is a coed whirlpool, which means swimsuits, and in fact there are two women already there and Chandler didnt seem to wear his. Needless to say, everyone is shocked, including Chandler.)\nChandler: So I guess we wear swimsuits in here!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 12, "scene_id": "S07E03_012", "location": "The Gym", "scene_description": "Chandler and Mr. Geller are heading for the whirlpool room.", "characters": ["Chandler"], "firestore_path": "/episodes/S07E03/scenes/S07E03_012"}}
{"id": "S07E03_013", "text": "[Scene: The Mr. Bowmont, is tied up alongside the pier; Joey and Rachel are relaxing.]\nRachel: Well Joey, I hate to admit it, your way of sailing is a lot more fun.\nJoey: Yeah, yeah. Hey, why dont you give a pull on that rope? (Points.)\nRachel: Ohh were not sailing.\nJoey: Just pull on it.\nRachel: All right. (She does so and it brings the cooler closer together.) Hey-hey-hey!! (Sees whats in the cooler.) Sandwiches!\nJoey: What else?\nRachel: (hands him one) Here you go.\nJoey: Thank you.\nRachel: Oh wow! (She takes a bite, but holds the sandwich vertically so that the stuff falls out.)\nJoey: What are you doing?\nRachel: Ohh, sorry.\nJoey: What youdont hold it like that! Youre lettin all the good stuff fall out.\n(More falls out.)\nRachel: Ohh whoops.\nJoey: Careful! Youre wasting good pastrami! (Gasps.) Oh my God! Im my dad!\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 3, "episode_id": "S07E03", "episode_title": "THE ONE WITH PHOEBES COOKIES", "scene_number": 13, "scene_id": "S07E03_013", "location": "The Mr. Bowmont", "scene_description": "is tied up alongside the pier; Joey and Rachel are relaxing.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E03/scenes/S07E03_013"}}
