{"id": "S07E12_001", "text": "THE ONE WHERE THEYRE UP ALL NIGHT\nWritten by: Zack Rosenblatt Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 1, "scene_id": "S07E12_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E12/scenes/S07E12_001"}}
{"id": "S07E12_002", "text": "[Scene: The Buildings Roof, the entire gang plus Tag are there to look for a comet. Theyre looking for a comet on a roof of a New York apartment building. Yeah, thats realistic. You might as well look for the moon on a bright sunny day.]\nMonica: (looking up) Ross, whens this comet thing start?\nRoss: Well, technically it seven billion years ago (Well, technically youd be able to see it for days, well nights; that is if you could see it with all of the bright lights of New York.)\nAll: (groaning) Oh no! Oh no! (They all start to get up a leave.)\nRoss: Okay! Okay! Fine, Ill stop! No teaching, okay? Well just watch the pretty light streaking across the sky. (Comets dont streak across the sky, meteors do.) Okay? Whos official name is Bapstein-King.\nAll: Okay! Okay! (They start to leave again.)\nPhoebe: (looking up) There it is! Oh, look at that! Isnt Mother Nature amazing?\nChandler: (looking up with her) Thats a plane!\nPhoebe: Well, all right. 1700 bags of peanuts flying that high, thats pretty amazing too.\nTag: Hey, I wonder if you can see my apartment from up here.\nRachel: No. No, you cant.\nTag: What?\nRachel: Oh I dont-I dont know.\nRoss: Man, look at all those stars! (Yeah, you can see what? Five of them from the city?) Infinite space. It really, really makes you wonder, doesnt it?\nJoey: (looking through his binoculars at a nearby building) Yknow what else makes you wonder?\nRoss: Huh?\nJoey: Check out the rack on this chick! (Turns around to point it out to Ross and finds that Ross is glaring at him. So he quickly puts his binoculars to his eyes and starts looking for the comet.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 2, "scene_id": "S07E12_002", "location": "The Buildings Roof", "scene_description": "the entire gang plus Tag are there to look for a comet. Theyre looking for a comet on a roof of a New York apartment building. Yeah, thats realistic. You might as well look for the moon on a bright sunny day.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Tag"], "firestore_path": "/episodes/S07E12/scenes/S07E12_002"}}
{"id": "S07E12_003", "text": "[Scene: The Roof, continued from earlier.]\nMonica: Okay, weve been out here for two hours and we havent seen any stupid comets. Can we go now? I mean, Chandlers getting chilly. (She walks over to where Chandler is bundled up in a big coat and shivering.)\nChandler: (with a quivering voice) No, Im not!\nJoey: Then why are you wearing Monicas jacket?\nChandler: Because its flattering! (Shivers harder) Come on Monica! Come on Monica! (He goes inside.)\nRachel: Yeah actually, I think were gonna take off too. We rented a movie.\nPhoebe: Oh! I wont say, no to a movie!\nRachel: Uh Pheebs, we just actually kinda wanted to be alone.\nPhoebe: Shh! Get me out of here.\nRachel: Oh. (They leave, leaving just Joey and Ross.)\nJoey: (whispering) Ross!\nRoss: What?\nJoey: Come here, check this out!\nRoss: What? Is it the comet? (Runs over to where Joeys standing.)\nJoey: No! No-no. Look, theres a bug stuck in tar right here. (Bends down to get a closer look.)\nRoss: Joey comeI cant believeI bring you here to see the Bapstein-King comet, one of natures most spectacular phenomenon, and all you care about are bugs stuck in tar and-and some woman!\nJoey: (standing up) Yknow, theres two women dude.\nRoss: Show me where?\nJoey: Right-right up here. (Starts looking at them through a piece of pipe.)\nRoss: (noticing the pipe and looking at the door) Joey wheres the pipe that was holding the door open?\nJoey: (annoyed) I dont know! (Goes back to looking through the pipe.) (Pause) Yeah, I do.\nRoss: Joey!\nJoey: What?! All rightHey! Dont look at me! Youre the one who wanted to come up and look for some stupid Burger King comet!\nRoss: Its called the Bapstein-King comet, okay? (Joey starts to groan.) Hey! Hey! Bapstein was a very well respected astronomer! \nJoey: (covering his ears and yelling) Oh no! No! No! (He starts banging on the door.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 3, "scene_id": "S07E12_003", "location": "The Roof", "scene_description": "continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E12/scenes/S07E12_003"}}
{"id": "S07E12_004", "text": "[Scene: Monica and Chandlers bedroom, Monica is sleeping and Chandlers sitting in bed, wide awake.]\nChandler: (whispering) Monica!\nMonica: Shes sleeping.\nChandler: I know, just quick-quick question, quick question. Which one was Deep Impact and which one was Armageddon?\nMonica: Deep Impact was the one with Robert Duval, Armageddon is whats going to happen to you if you wake me up.\nChandler: Sorry, I justcant sleep. Ooh! (Turns on the light and Monica groans.) Where is that book that you are reading with the two women who were ice-skating and wearing, wearing those hats with the flowers on it? Because every time I look at that cover Im like(Fake snores.)\nMonica: It is in the living room where there is also a light! And no one will kick you in the shin.\nChandler: What?! (Monica kicks him in the shin.) Ow! (He gets out of bed and heads into the living room.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 4, "scene_id": "S07E12_004", "location": "Monica and Chandlers bedroom", "scene_description": "Monica is sleeping and Chandlers sitting in bed, wide awake.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_004"}}
{"id": "S07E12_005", "text": "[Scene: Phoebe's apartment, there is a beeping noise coming from the living room and Phoebe sleepily goes to investigate.]\nPhoebe: (crossing her fingers and closing her eyes) Please dont be a space ship. Please dont be a space ship. (She turns on the light and looks around and finds that its the smoke detector thats beeping.) Oh thank God! (She moves a chair over and starts to investigate how to make the beeping turn off, in frustration she yanks the thing off of the wall. She sets it down and heads for bed, just as she gets there it beeps again. She opens the cover and removes the battery, but it still beeps.) How could you be beeping?! I just disconnected you! I took out your battery! How can\nSmoke Detector: Beep!\nPhoebe: Dont interrupt me!!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 5, "scene_id": "S07E12_005", "location": "Phoebe's apartment", "scene_description": "there is a beeping noise coming from the living room and Phoebe sleepily goes to investigate.", "characters": ["Phoebe", "Smoke Detector"], "firestore_path": "/episodes/S07E12/scenes/S07E12_005"}}
{"id": "S07E12_006", "text": "[Scene: The Roof, Ross and Joey are banging on the door.]\nRoss: Rachel!! Monica!!\nJoey: Come on!\n(Ross gets fed up with Joeys banging and stops him by pulling him away from the door.)\nRoss: I cant believe this!!\nJoey: All right well, yknowI guess we know what we have to do to get down.\nRoss: (standing at the edge of the roof) Yeah, I guess we dont have a choice. (Screaming to the street) Help us! Please help us! Were stuck up on the roof and we cant get down!!!\nJoey: Ross. I was thinking we could just go down the fire escape. (Points it out.)\nRoss: (To Joey) I know, I wasnt finished. (Joey motions him to finish.) (Yelling at the street) But dont worry! Were gonna go down the fire escape!!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 6, "scene_id": "S07E12_006", "location": "The Roof", "scene_description": "Ross and Joey are banging on the door.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E12/scenes/S07E12_006"}}
{"id": "S07E12_007", "text": "[Scene: Monica and Chandler's kitchen, Chandler has a jug of milk in his hands and decides to make some warm milk. He opens up the cabinet to get a pot and manages to knock several other pots onto the floor making a lot of noise.]\nChandler: Shhhhhhhhh!!! (Monica enters) Im sorry, I thought maybe Id make some warm milk and it would help me sleep.\nMonica: With a wok? (Chandlers holding a wok.) I thought you were going to read my boring book to put you asleep.\nChandler: It got interesting! Damn you Oprah!\nMonica: Here, let me make the milk, Im up anyway.\nChandler: Hey, yknow what we can do? Yknow, now that we are up? We can just like talk to each other all night long, yknow like we did when we were first going out. Itd be fun!\nMonica: Okay that does sound like fun. \nChandler: Okay, so how bummed were you when the second sister died huh?\nMonica: The second sister dies?!\nChandler: (Pause) No. No, I-I was, I was talking about the book I was reading.\nMonica: The second sister dies in Archie and Jughead Double Digest?\nChandler: Thats correct.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 7, "scene_id": "S07E12_007", "location": "Monica and Chandler's kitchen", "scene_description": "Chandler has a jug of milk in his hands and decides to make some warm milk. He opens up the cabinet to get a pot and manages to knock several other pots onto the floor making a lot of noise.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_007"}}
{"id": "S07E12_008", "text": "[Scene: Joey and Rachel's, Rachel and Tag are making out on the couch.]\nRachel: You wanna go in the bedroom? Its a little more comfortable.\nTag: Sure.\nRachel: Okay. (They start to head for the bedroom) Oh wait! Umm, did you send those contracts to Milan?\nTag: If this is your idea of sexy talk? (Shakes his head that its not working.)\nRachel: No seriously, yknow the contracts I gave you, did you overnight them?\nTag: What contracts?\nRachel: Okay please tell me that this is just one of your jokes that you do that I dont get.\nTag: Like what?\nRachel: Yknow, like the thing when you put the phone in your pants? (He starts laughing.) Tag! Im serious! This isnt funny! Those contracts absolutely had to go out today!\nTag: Rach, Im sorry, but you didnt give me any contracts!\nRachel: Yes I did! And I put a little Post-It on it that said, \"Must go out today,\" and underlined today three times and, and then I put a little heart in the corner because I didnt want to seem to bossy.\nTag: Im telling you, you never gave them to me.\nRachel: Yknow what Tag, if we went down to the office you would see those contracts sitting on your desk.\nTag: No, I would see you looking embarrassed because they are not on my desk!\nRachel: Or maybe you would see me looking embarrassed because you are talking on the phone with your crotch!\nTag: You wanna go down to the office right now?\nRachel: No! Come on its late, were not gonna go down to the office.\nTag: Okay I understand. (Sits down.) I wouldnt want to be proved wrong either.\nRachel: Okay get your coat! (They get their coats and start to leave. Rachel suddenly stops and sticks the hand up the back of her shirt.) Oh! When did you unhook this? (Her bra.) Nice work!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 8, "scene_id": "S07E12_008", "location": "Joey and Rachel's", "scene_description": "Rachel and Tag are making out on the couch.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E12/scenes/S07E12_008"}}
{"id": "S07E12_009", "text": "[Scene: The Fire Escape, Joey and Ross have reached the last landing. Joey is tugging on the ladder that extends to the ground, but it wont budge.]\nJoey: All right, it wont go down any further. Its stuck.\nRoss: Ugh. Well, were just gonna have to jump. (Joey looks at him.) Yeah. Now, were gonna have to make sure to land to the right of that patch of ice, okay? Not hit the dumpster on the other side and uh, and try to avoid that-that weird brownish red stuff in the middle. So, when you get down thereyou go up to the roof and you let me in.\nJoey: Oh whoa-whoa wait a minute! I have to do it?!\nRoss: Yeah! Oh yeah, youll be fine! It-itll be uh, just like bungy jumping. Yknow? But instead of bouncing back up you-you wont.\nJoey: What if I smack my head on the concrete?\nRoss: Well, Im gonna lie to you Joey, its a possibility.\nJoey: (looks at the ground and at Ross) I dont know Ross! I-I tell you what, lets flip to see who does it, okay? You-you call it in the air, all right?\nRoss: Oh, all right. (Joey flips the coin.) Tails! (The coin bounces off of the landing above them and falls to the ground.) Can you-can you see what it is?\nJoey: No.\nRoss: Okay. Well, you be careful.\nJoey: What? No! No Ross! No-no! Stop! Im not jumping! Okay, look I have an audition tomorrow and I cant go if I break my leg.\nRoss: Well Im jumping! I have a son! Okay? He wont have a father if-if I die!\nJoey: Well all right so, it looks like were even!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 9, "scene_id": "S07E12_009", "location": "The Fire Escape", "scene_description": "Joey and Ross have reached the last landing. Joey is tugging on the ladder that extends to the ground, but it wont budge.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E12/scenes/S07E12_009"}}
{"id": "S07E12_010", "text": "[Scene: Phoebe's apartment, Phoebe is still investigating the smoke detector trying to figure out how to stop the beeping.]\nPhoebe: Okay. So, this wire is connected to this wire which plugs into here. (She points at each as she says it.) Okay so, to get the beeping to stop all I have to do (She picks up a shoe and proceeds to pummel the smoke detector. She then gets up and heads to bed, stops, quickly turns around, and is satisfied that the beeping has stopped.) Well done, Pheebs. (She resumes her trek to bed, but is stopped at the entrance to the hallway by the now steady and extremely loud tone emanating from the smoke detector.) (Yelling.) What do you want from me?!!!!!!!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 10, "scene_id": "S07E12_010", "location": "Phoebe's apartment", "scene_description": "Phoebe is still investigating the smoke detector trying to figure out how to stop the beeping.", "characters": ["Phoebe"], "firestore_path": "/episodes/S07E12/scenes/S07E12_010"}}
{"id": "S07E12_011", "text": "[Scene: Monica and Chandler's bedroom, Monica is entering with a mug.]\nMonica: Okay, heres your milk. What do you want to talk about? (She sees that Chandler has fallen asleep and slams the door loudly to wake him up.)\nChandler: (startled) What? What? What?\nMonica: Ohh! Ohhhh! Were you sleeping sweetie? Im sorry. Here. (Hands the mug of milk to him.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 11, "scene_id": "S07E12_011", "location": "Monica and Chandler's bedroom", "scene_description": "Monica is entering with a mug.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_011"}}
{"id": "S07E12_012", "text": "[Scene: Rachels Outer Office, Tag and her are arriving.]\nTag: Okay! Feel free to look, but Im telling you those contracts are not on this desk.\nRachel: Oh how can you possibly know? Look at this mess, Tag! I mean, this is what Im talking about! You have to be organized! Youve got newspapers! Youve got magazines! You gotOhh! (Finds a picture.) And who is this chippy? A little young for you Tag, but whatever.\nTag: Its my sister.\nRachel: Okay, very cute braces. Anyway yknow what, the point is Tag, start looking because you are going to find those contracts on your desk. (She goes into her office.)\nTag: So when do you imagine you gave them to me? In the morning or in the afternoon?\nRachel: In the afternoon. Mr. Zelner came into my office after lunch. He put them on my desk, and then I put a Post-It on it (Looks down onto her desk and finds the folder with the Post-It on it that contains the contracts she imagined she gave Tag) that said, \"Must go out today.\" So you just keep looking in there! All right?\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 12, "scene_id": "S07E12_012", "location": "Rachels Outer Office", "scene_description": "Tag and her are arriving.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E12/scenes/S07E12_012"}}
{"id": "S07E12_013", "text": "[Scene: Rachels outer office, Tag has finished searching his desk and Rachel comes out to try to plant the folder on the desk.]\nTag: Its not here.\nRachel: Puzzler. A bit of a puzzle. Why dont you um, check the copy room, maybe you left the contracts in there?\nTag: How could I have left them in the copy room?\nRachel: I dont know Tag! How can your genitals make phone calls? Okay? Its not a perfect world! Just go please.\nTag: Fine.\nRachel: Thank you. (He leaves and she proceeds to plant the folder in his bottom drawer. She then picks up the phone and holds it to her breasts.) Hello? (Hangs up the phone.) I still dont get it.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 13, "scene_id": "S07E12_013", "location": "Rachels outer office", "scene_description": "Tag has finished searching his desk and Rachel comes out to try to plant the folder on the desk.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E12/scenes/S07E12_013"}}
{"id": "S07E12_014", "text": "[Scene: Monica and Chandler's bedroom, Chandler has his eyes closed, while Monica is fully awake.]\nMonica: Are you still awake?\nChandler: Yeah! You?\nMonica: You do know that was me who just said that right? (He doesnt respond and she turns on the light, waking him.) Hey. As long as were both up\nChandler: (intrigued) Yeah? (Monica nods yes.) I hope youre not thinking about cleaning the living room.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 14, "scene_id": "S07E12_014", "location": "Monica and Chandler's bedroom", "scene_description": "Chandler has his eyes closed, while Monica is fully awake.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_014"}}
{"id": "S07E12_015", "text": "[Scene: The fire escape, Joey and Ross are still trying to figure out how to get down.]\nJoey: Man, Im starving! What the hell was I thinking at dinner?! \"Do you want soup or salad?\" Both! Always order both!\nRoss: (looking in the window behind them) Yknow, yknow Im lookin and I dont think anyones home here. I say we just break the window, crawl through, and-and yknow explain later.\nJoey: Yeah? Really? No ones home?\nRoss: I dont think so. Hello? (Knocks on the glass, which angers the big, large, angry dog behind the glass and causes them to jump to the other side of the landing.) When you get in there (Joey nods his disapproval.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 15, "scene_id": "S07E12_015", "location": "The fire escape", "scene_description": "Joey and Ross are still trying to figure out how to get down.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E12/scenes/S07E12_015"}}
{"id": "S07E12_016", "text": "[Scene: Phoebes apartment building, in desperation she has wrapped up the smoke detector in a blanket and is going to throw it into the trash chute.]\nPhoebe: Okay, this is where you and I part ways. (She drops the blanket into the chute.) Noisy bitch!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 16, "scene_id": "S07E12_016", "location": "Phoebes apartment building", "scene_description": "in desperation she has wrapped up the smoke detector in a blanket and is going to throw it into the trash chute.", "characters": ["Phoebe"], "firestore_path": "/episodes/S07E12/scenes/S07E12_016"}}
{"id": "S07E12_017", "text": "[Scene: Monica and Chandler's bedroom, Chandler is turning on the light to awaken a now sleeping Monica.]\nMonica: What?! What are you doing?!\nChandler: Do you know what just happened?\nMonica: Yeah. We-we had sex and then we fell asleep.\nChandler: No. We were in the middle of sexand you fell asleep.\nMonica: Nooo! No, thats not true. No, best time ever! Yeah, you rocked me world! (She turns out the light to go back to sleep.)\nChandler: (turning the light back on) Monica?\nMonica: What?!\nChandler: I was giving you some of my best moves, and you missed it. So please wake up so we can do it right!\nMonica: Okay. Okay, Im ready. Come on big fella!\nChandler: Okay.\nMonica: Give me the good stuff.\nChandler: Yeah! (Monica falls asleep) No! No! No! Dont fall asleep! Okay, I am going to make you some coffee. (Monica doesnt move as he gets out of bed and as hes heading for the door.) And I probably wont spill coffee grounds all over the kitchen floor.\nMonica: Okay, Im up! Im up!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 17, "scene_id": "S07E12_017", "location": "Monica and Chandler's bedroom", "scene_description": "Chandler is turning on the light to awaken a now sleeping Monica.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_017"}}
{"id": "S07E12_018", "text": "[Scene: Rachels outer office, shes returning with two coffee cups in hand to find Tag sitting there.]\nRachel: Hi! I got you some coffee. To, uh (She looks for a place to set it on his messy desk and he clears a spot for her to set it down.) fair enough. So! Do you got anything for me?\nTag: Still no luck.\nRachel: Oh my God! Did you check your entire desk! Did you check all the drawers!\nTag: Do you want me to check again?\nRachel: Well yeah, I wish that you would. (He opens the top drawer.) Well, no its not in there! (Closes it.) How about that drawer? (She points to the bottom one and he opens it. She doesnt see the folder she planted and bends over to check.)\nTag: Well, its not out here. Is there any chance it could be in your office?\nRachel: (thinks) Yknow, I dont-I dont know. Let me, let me check. (As she heads for her office, she stops glances over her should at Tag, looks into her office, and finds the folder on her desk.)\nTag: (smirking) Any luck?\nRachel: Can I see you in my office for a minute?\nTag: (entering) Yeah? (She holds up the folder) You found them!! (Rachel is not amused, because shes still going to try to blame him for her mistake like every good boss.) Yknow what? Im not even going to gloat. Im just really relived this whole thing is over.\nRachel: You put these on my desk!\nTag: I did not!\nRachel: Oh really? So youre saying they just slid out of your bottom drawer, crawled across the floor, then jumped on to my desk?! (I think Dogbert should have a line here.)\nTag: How did you know they were in my bottom drawer?\nRachel: (pause as she realizes her lame attempt to shift the blame has failed) I am so hot for you right now.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 18, "scene_id": "S07E12_018", "location": "Rachels outer office", "scene_description": "shes returning with two coffee cups in hand to find Tag sitting there.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E12/scenes/S07E12_018"}}
{"id": "S07E12_019", "text": "[Scene: Phoebe's apartment, there is someone pounding on the door and Phoebe sleepily walks over and answers it. As she nears the door, the pounding stops and she can hear the smoke detectors wail.]\nPhoebe: Oh my God! How did you get back here?!\nA Disembodied Voice: (yelling through the door) Phoebe Buffay?!\nPhoebe: (scared) Fire alarm? (She opens the door to reveal a fireman holding the blanket with the smoke detector.) Oh! Hi, officerfireman, can-can I help you?\nThe Fireman: We found your fire alarm in the trash chute.\nPhoebe: Thats not mine.\nThe Fireman: Yes it is.\nPhoebe: How do you know?\nThe Fireman: The next time you want to dump a fire alarm in a trash chute, dont wrap it in a blanket that says, \"Property of Phoebe Buffay not Monica.\"\nPhoebe: Okay do youOkay, do you have a search warrant? Because the last time I checked this was still America!\nThe Fireman: Please reattach this, its against the law to disconnect them.\nPhoebe: Fine! (She takes the blanket.) But please God; tell me how to stop them from going off!\nThe Fireman: Theres a reset button under the plastic cover.\nPhoebe: Theres a reset button?! Ugh, thank you! Thank you! (He exits and she goes to shut it off.) Theres a reset button! My God! Why didnt I see that! (She takes off the plastic cover and looks for the button.) Reset button, reset button, where is there a reset button? (Finds it.) Oh here it is! (Picks it up off of the floor.) Oh! (She presses it hard, but of course it would help if the button was still attached to the detector. In frustration she presses it so hard it causes pain in her thumb.) Ohh, God!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 19, "scene_id": "S07E12_019", "location": "Phoebe's apartment", "scene_description": "there is someone pounding on the door and Phoebe sleepily walks over and answers it. As she nears the door, the pounding stops and she can hear the smoke detectors wail.", "characters": ["A Disembodied Voice", "Phoebe", "The Fireman"], "firestore_path": "/episodes/S07E12/scenes/S07E12_019"}}
{"id": "S07E12_020", "text": "[Scene: The fire escape, Joey is now hanging off of the bottom rung of the ladder that wont move and Ross is watching from above.]\nRoss: Okay, do-do you have a good grip?\nJoey: Yeah!\nRoss: Okay, Im going to start climb down you now.\nJoey: All right! Just hurry up!\nRoss: Okay. Now-now-now should I climb down your front so were face to face or-or should I climb down your back so were-were butt to face.\nJoey: I think face to face.\nRoss: I would say that.\nJoey: Face to face, yeah!\nRoss: Okay, here I go.\nJoey: All right. \n(Ross steps onto the bottom rung of the ladder and then steps on Joeys chest.)\nJoey: (grunting) Oh my How much do you weigh Ross?!\nRoss: I prefer not to answer that right now, Im still carrying a little holiday weight.\n(Ross continues to climb down. He puts his other foot further down on Joeys torso, but that doesnt work very well and hes forced to wrap his legs around Joey. Which then forces Joey to get a nice and close view of Rosss crotch.)\nJoey: Yknow, when we talked about face to face, I dont think we thought it all the way through.\nRoss: So what do you want me to do?\nJoey: Well, just shimmy down me and drop!\n(Ross continues his trek south, and when they get face to face.)\nRoss: Hi.\nJoey: Hi.\nRoss: (looking down) M-maybe I should hang and you can climb down me.\nJoey: (angrily) Yeah? Maybe we should talk about that for a little while!\nRoss: Its still looks pretty far!\nJoey: Its not that far! Just drop!\nRoss: Do not rush me!!\n(Ross continues south and his now wrapped around Joeys legs.)\nJoey: Ross, you should know that my pants are startin to come down and Im not wearing any underwear!\n(Ross panics and falls off, dropping to the ground with a huge crash.)\nRoss: Oww!! My ankle! I really hurt my ankle! I think I twisted it when IOoh, a quarter!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 20, "scene_id": "S07E12_020", "location": "The fire escape", "scene_description": "Joey is now hanging off of the bottom rung of the ladder that wont move and Ross is watching from above.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E12/scenes/S07E12_020"}}
{"id": "S07E12_021", "text": "[Scene: Monica and Chandler's bedroom, theyre cuddling.]\nMonica: That really was some of your best work.\nChandler: Hm-hmm, I told you! (Looks at the clock) I cant believe that Ive only got two hours before I call in sick for work.\nMonica: I have to be up in seven minutes.\nChandler: Well, youre not gonna believe this, but if you have seven minutes\nMonica: Really?!\nChandler: Do you wanna?\nMonica: Okay! You get the vacuum cleaner and Ill get the furniture polish!\n(She runs off leaving a stunned Chandler behind.)\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 12, "episode_id": "S07E12", "episode_title": "THE ONE WHERE THEYRE UP ALL NIGHT", "scene_number": 21, "scene_id": "S07E12_021", "location": "Monica and Chandler's bedroom", "scene_description": "theyre cuddling.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E12/scenes/S07E12_021"}}
