{"id": "S07E18_001", "text": "THE ONE WITH JOEYS AWARD\nTeleplay by: Brian Boyle Story by: Sherry Bilsing & Ellen Plummer Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 1, "scene_id": "S07E18_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S07E18/scenes/S07E18_001"}}
{"id": "S07E18_002", "text": "[Scene: Central Perk, Phoebe and Monica are there as Joey is entering excitedly.]\nJoey: Hey! You guys! Youre not gonna believe this! I just got off the phone with my agent\nPhoebe: Oh my God! (Joey looks at her.) Im sorry, too soon. You go.\nJoey: Okay. I got nominated for my part on Days of Our Lives!\nMonica: Joey!\nPhoebe: Good for you!\nMonica: Congratulations! Wow! I cant believe youre nominated for an Emmy!\nJoey: No-no.\nMonica: Oh Soap Opera Digest award!\nJoey: No! Im up for a Soapie!\nMonica: Honey? Is that something youre making up?\nJoey: No, no, no! Its real! And it has been since 1998. (Rachel returns from the bathroom.) Hey Rach! Rach! Im up for a Soapie!\nRachel: (gasps) Oh my God! Oh my God!! That is like the third most prestigious soap opera award there is!\nJoey: Thank you! Well, I guess now I know who Im taking to the awards. (Points to Rachel.)\nRachel: Oh, stop that! Dont kid about that! (Gasps) Will all the stars be there?\nJoey: Many are scheduled to appear.\nRachel: Oh my God! Oh my God! I cant go! Im gonna be too nervous!\nMonica: (to Joey) Okay, Ill go!\nRachel: No!! You are getting married! This is all I have.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 2, "scene_id": "S07E18_002", "location": "Central Perk", "scene_description": "Phoebe and Monica are there as Joey is entering excitedly.", "characters": ["Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E18/scenes/S07E18_002"}}
{"id": "S07E18_003", "text": "[Scene: N.Y.U, Ross is giving a lecture.]\nRoss: and it was Ernst Muhlbrat who first hypothesized that the Velociraptor would expand its collar and emit a high pitched noise to frighten its predator. (A student raises his hand.) Yes Mr. Lewis? \nLewis: What kinda noise?\nRoss: Just a high pitched intimidating noise.\nLewis: But like how?\nRoss: Well we-we dont know for sure. But in my head it-it sounded something like this. (He makes a high pitched noise and Alan doesnt know what to make of it.) Of course, this is just conjecture. Okay, thats uh, thats all for today. (Everyone starts to get up.) Uh Mr. Morse, can I see you for a moment? \nMorse: Yes sir.\nRoss: Mr. Morse I need to talk to you about your mid-term exam, Im afraid I-I had to fail you.\nMorse: (shocked) Why?!\nRoss: Well you need 60% to pass\nMorse: Whatd I get?\nRoss: Seven.\nMorse: Thats not so good.\nRoss: No-no its not. What-what happened there Ned?\nMorse: Well maybe you can cut me some slack. Im sort of in love.\nRoss: Well Im sorry but, that-thats really not my problem.\nMorse: Im in love with you.\nRoss: Well that brings me in the loop a little.\nMorse: You see, thats why I did so bad on this test. Im having a hard time concentrating. When youre up there (Points to the podium) and youre teaching and your face gets all seriousyou look so good. (In a sexy voice) You wear that tight little turtleneck sweater\nRoss: Okay! (Walks away from him.) Umm, I uh, Im your teacher. Im sorry, youre-youre a student and I-and I like women. In spite of what may be written on the backs of some of these chairs.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 3, "scene_id": "S07E18_003", "location": "N.Y.U", "scene_description": "Ross is giving a lecture.", "characters": ["Lewis", "Morse", "Ross"], "firestore_path": "/episodes/S07E18/scenes/S07E18_003"}}
{"id": "S07E18_004", "text": "[Scene: Central Perk, Monica and Phoebe are drinking coffee and Phoebe notices a cute guy checking them out.]\nPhoebe: Oh my God! That guy at the counter is totally checking you out!\nMonica: Really? (Looks.) My God, hes really cute.\nPhoebe: Go for it.\nMonica: Phoebe, Im engaged!\nPhoebe: Im just saying, get his number just in case. But no Chandler is in an accident and cant perform sexually and he would want you to take a lover to satisfy the needs that he can no longer fulfill.\nThe Cute Guy: (To Monica) Hi!\nMonica: Op, can I just tell you something? Very flattered but umm, Im engaged. (Points to her ring.)\nThe Cute Guy: Wow! Uh, this is kind of embarrassing. I was actually coming over to talk to your friend.\nMonica: Well you should be embarrassed. (Leaves.)\nThe Cute Guy: (To Phoebe) I thought you knew I was looking at you.\nPhoebe: I did, but that was really fun.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 4, "scene_id": "S07E18_004", "location": "Central Perk", "scene_description": "Monica and Phoebe are drinking coffee and Phoebe notices a cute guy checking them out.", "characters": ["Monica", "Phoebe", "The Cute Guy"], "firestore_path": "/episodes/S07E18/scenes/S07E18_004"}}
{"id": "S07E18_005", "text": "[Scene: Joey and Rachel's, Joey is sitting in the chair.]\nJoey: (pretending to be an announcer) And the winner isJoey Tribbiani! (He then gets excited and goes over to the counter to practice his acceptance speech using a bottle of maple syrup as the award.) Oh Wow! I honestly never expected this. I uh, I didnt prepare a speech. But umm, Id like to thank (Rachel enters quietly) my parents, whove always been there for me. Id also like to thank my friends, Chandler, Monica, Phoebe, Rachel\nRachel: Im fourth! (Joey is startled.) Look at you with your little maple syrup award!\nJoey: Yeah may-maybe you dont tell anyone about this.\nRachel: What? No! Its not a big deal! I do that too, with my shampoo bottle.\nJoey: Really?\nRachel: Yeah.\nJoey: What award are you practicing for?\nRachel: Grammy, Best New Artist.\nJoey: Oh, hey listen! The Soapies called today and I also get to present an award.\nRachel: Ohh thats great!\nJoey: Yeah!\nRachel: So youll definitely get onstage, even if you dont win.\nJoey: (confused) What you-you dont think Im gonna win?\nRachel: Well of course I do! But yknow, favorite returning character is a tough category Joey. I mean youre up against the guy who survived his own cremation.\nJoey: Yeah. No-no I-I know I might not win, but its justIve never even been nominated before! I want it so much.\nRachel: Well Joey, youll probably get it. But you should probably your-your gracious loser face. Yknow when like the cameras are on you and you wanna look disappointed but also that your colleague deserved to win. Yknow? So its sorta like (Does it, youll have to see it.)\nJoey: Hey! (Likes it.)\nRachel: Yknow?\nJoey: You practice losing the Grammies too?\nRachel: Oh no, at the Grammies I always win.\nJoey: Ah.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 5, "scene_id": "S07E18_005", "location": "Joey and Rachel's", "scene_description": "Joey is sitting in the chair.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E18/scenes/S07E18_005"}}
{"id": "S07E18_006", "text": "[Scene: Monicas Restaurant Kitchen, shes cooking as Phoebe enters.]\nPhoebe: Oh hey!\nMonica: Hey! Howd your date go with Jake?\nPhoebe: Oh, great! We couldnt keep our eyes off each other all night and then every once and a while yknow, hed kinda lean over and stroke my hair and touch my neck. (Does that to Monica.)\nMonica: Okay, stop it Phoebe, youre getting me all tingly.\nPhoebe: (laughs) All I could think of was yknow, \"Is he gonna kiss me? Is he gonna kiss me?\"\nMonica: And did he?\nPhoebe: Im a lady Monica, I dont kiss and tell. But this hickey speaks for itself. (She starts to open up her blouse.)\nMonica: Okay-okay, I got it. I got it.\nPhoebe: I just like him so much that I just feel like Ive had 10 drinks today and Ive only had six.\nMonica: Oh, I havent had that feeling since I first started going out with Chandler. Wow, Im never gonna have that feeling again am I?\nPhoebe: You sound like a guy.\nMonica: No, a guy would be saying, \"Im never gonna get to sleep with anyone else.\" Oh my God! Im never gonna get to sleep with anyone else! Ive been so busy planning the wedding that I forgot about all the things that Id be giving up! I mean, IIm never gonna have a first kiss again.\nPhoebe: Youll have a last kiss.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 6, "scene_id": "S07E18_006", "location": "Monicas Restaurant Kitchen", "scene_description": "shes cooking as Phoebe enters.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S07E18/scenes/S07E18_006"}}
{"id": "S07E18_007", "text": "[Scene: Joey and Rachel's, Ross is helping Joey with his tie.]\nRoss: Can I ask you something? Have you ever had a guy have a crush on you?\nJoey: Is that why you wanted to tie my tie?\nRoss: Theres this kid in my class who said hes in love with me.\nJoey: Whoa!\nRachel: (entering from her room) Whoa what?\nJoey: Ross has a boyfriend.\nRoss: I do-I do not have a boyfriend. Theres a guy in one of my classes who-who has a crush on me.\nRachel: Really?\nRoss: Yeah! I dont know. I mean, last year Elizabeth now-now this kid. What-what-what-what is it?! Am I giving out some kind ofsexy professor vibe? (Rachel and Joey both look at him.)\nRachel: Not right now.\nRoss: It-itThe point is my natural charisma has made him fail his midterm.\nRachel: Oh, see now I feel bad for the kid! I had a crush on a teacher once and it was so hard! Yknow youI couldnt concentrate and I blushed every time he looked at me. I mean come on, you remember whats its like to be 19 and in love.\nRoss: Yeah. I guess I can cut him some slack.\nRachel: Yeah.\nJoey: Howd you get over that teacher?\nRachel: I didnt. I got under him.\nJoey: (To Ross) Problem solved.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 7, "scene_id": "S07E18_007", "location": "Joey and Rachel's", "scene_description": "Ross is helping Joey with his tie.", "characters": ["Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S07E18/scenes/S07E18_007"}}
{"id": "S07E18_008", "text": "[Scene: Central Perk, Phoebe is saying good-bye to her boyfriend Jake at the door to Central Perk.]\nJake: Bye Phoebe.\nPhoebe: Okay bye. (They kiss.)\nJake: All right. Bye. (Backs out the door.)\nPhoebe: Bye! (Phoebe goes over and joins Monica on the couch.) We said good-bye at the door so as not to flaunt our new love.\nMonica: Phoebe, its okay. You dont have to tip toe around me. I-Ive been thinking about it and umm, yknow what? Im okay about not having that new relationship feeling\nJake: (yelling through the window to Phoebe) I miss you already!!\nPhoebe: (yelling back) I miss you too!!!! (He walks away.)\nMonica: See? Thats what I mean. I mean that, thats great! But I wouldnt trade in what I have for that. I mean Im gonna be with Chandler for the rest of my life, and thats what makes me happy. (Chandler approaches.) Hey sweetie, come here! Come sit down. Hey Phoebe and I were just talking about how our relationship is deep and meaningful. It really is dont you think?\nChandler: Oh totally! (Holds up his finger.) Pull my finger.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 8, "scene_id": "S07E18_008", "location": "Central Perk", "scene_description": "Phoebe is saying good-bye to her boyfriend Jake at the door to Central Perk.", "characters": ["Chandler", "Jake", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E18/scenes/S07E18_008"}}
{"id": "S07E18_009", "text": "[Scene: The 2001 Soapie Awards, Joeys category is up next and the presenter walks to the podium.]\nAnnouncer: Presenting the award for Favorite Returning Male Character is McKensize\n[Cut to Joey and Rachels table.]\nJoey: (To Rachel) This is it! This is my category.\nRachel: I know! My God! Do you have your speech?\nJoey: Yeah, I got my speech!\nRachel: Do you got your gracious loser face?\nJoey: Yeah. (Does it.)\nRachel: Now Joey remember, if you win you have to hug me! You hug me!\nJoey: Okay. Can I squeeze your ass?\nRachel: On TV?! Yeah!\nJoey: Kay! \n[Cut to the presenter.]\nThe Presenter: in the category of Favorite Returning Male Character the nominees are: John Wheeler from General Hospital (Applause), Gavin Grant from The Young and the Restless (Applause), Dunkin Harrington from Passions (Applause), and Joey Tribbiani from Days of Our Lives (Applause). And the Soapie goes to(She opens the envelope)Gavin Grant from The Young and the Restless!\nJoey: What the?! (Joey pounds the table and starts yelling at Rachel, and which is drowned out by applause. Rachel is desperately trying to tell Joey that hes on TV right now. He finally notices and he does his gracious loser face.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 9, "scene_id": "S07E18_009", "location": "The 2001 Soapie Awards", "scene_description": "Joeys category is up next and the presenter walks to the podium.", "characters": ["Announcer", "Joey", "Rachel", "The Presenter"], "firestore_path": "/episodes/S07E18/scenes/S07E18_009"}}
{"id": "S07E18_010", "text": "[Scene: The 2001 Soapie Awards, the announcer is introducing the next presenter.]\nAnnouncer: Presenting the award for Favorite Supporting Actress is Joey Tribbiani from Days of Our Lives. (Applause as Joey angrily walks to the podium and eyes the trophy.)\nJoey: (angrily and monotone) Any one of the brilliant actresses nominated for this award tonight deserves to take it home. Unfortunately only one can. (Shakes his head in disgust.) The nominees for Best Supporting Actress are from Passions Erin Goff. (There is applause, which Joey disgustedly waits to dye out.) From One Life to Live Mary Loren Bishop (They start to applaud again, but Joey interrupts in with the rest of the nominees), from All My Children Sarah Mchann, and from Days of Our Lives Jessica Ashley. And the winner is(Opens the envelope)Jessica Ashley from Days of Our Lives. (Applause) Uh, unfortunately Jessica couldnt be with us tonight so Ill be accepting this award on her behalf. (Realizes something) And Im sure that Jessica would like to thank my parents who always believed in me. Shed also like to thank my friends, Chandler, Monica, Ross, Phoebe, and Rachel whos sittin right there! (Points at Rachel.) (The music starts and his microphone is turned off, this angers Joey again and he disgustedly exits.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 10, "scene_id": "S07E18_010", "location": "The 2001 Soapie Awards", "scene_description": "the announcer is introducing the next presenter.", "characters": ["Announcer", "Joey"], "firestore_path": "/episodes/S07E18/scenes/S07E18_010"}}
{"id": "S07E18_011", "text": "[Scene: Joey and Rachel's, Joey and Rachel are entering.]\nRachel: Joey! Why did we have to rush out of there so fast?!\nJoey: Rach we had to get out of there because, look what I won! (He whips out the award for Best Supporting Actress that he accepted for Jessica.)\nRachel: Oh my God you stole her award!\nJoey: No-no! No, Im accepting it on her behalf. (He puts it up above the TV to display it.)\nRachel: Joey I dont think you know what behalf means.\nJoey: Sure I do! Its a verb! As in, \"I behalfin it!\"\nRachel: Joey, you have got to take this back!\nJoey: But why?! I shouldve won one and I really want it and she didnt even care enough to come to the thing! It could also be a Grammy.\nRachel: (looking at the award) No! Joey!\nJoey: Come on Rach! No one saw me take it! There was a whole table full of em.\nRachel: Do you really want an award you didnt win?\nJoey: No! I want an award I did win! But nobodys giving me any of those! PlusHey Rach, if-if I put it up there (Points to the TV) right? When people come over theyll see it and theyll think I won it.\nRachel: Joey is says Best Supporting Actress!\nJoey: I can scratch that right off.\nRachel: Joey no, this is wrong! You have to take it back, okay? You dont want to win an award this way. Youre very talented. And someday youre gonna win one of these for real and that one is gonna mean something.\nJoey: All right!\nRachel: All right? (He sets the award down.) Thank you.\nJoey: Ill take it back tomorrow.\nRachel: Thank you.\n(He goes into his room and closes the door. Rachel goes to pick it up and)\nJoey: (opening his door) If I cant have it you cant have it! (Rachel walks away angrily.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 11, "scene_id": "S07E18_011", "location": "Joey and Rachel's", "scene_description": "Joey and Rachel are entering.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E18/scenes/S07E18_011"}}
{"id": "S07E18_012", "text": "[Scene: Rosss Classroom, he is writing on the board and Alan is coming in to see him.]\nLewis: Professor Geller?\nRoss: (turning towards him) Yes Mr. Lewis, how can I help you?\nLewis: I know I didnt do well on my midterms and stuff but, I was kinda hoping you could change my grade.\nRoss: And why exactly would I do that? (Goes back to writing on the board.)\nLewis: Because Im in love with you.\nRoss: (turning around and dragging the chalk down the board) What?!\nLewis: Yeah, Im allin love with you and stuff. So could you change my grade?\nRoss: No!\nLewis: Well why not you changed Neds grade!\nRoss: Well thats different! Okay? Because he, he was actually in love with me!\nLewis: No hes not! Hes totally yanking your chain! Hes done this with three other teachers!\nRoss: What?\nLewis: Hes got a girlfriend!\nRoss: I cant believe someone would do that for a grade.\nLewis: I know! Its awful. I love you.\n(Ross glares at him.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 12, "scene_id": "S07E18_012", "location": "Rosss Classroom", "scene_description": "he is writing on the board and Alan is coming in to see him.", "characters": ["Lewis", "Ross"], "firestore_path": "/episodes/S07E18/scenes/S07E18_012"}}
{"id": "S07E18_013", "text": "[Scene: Central Perk, Phoebe is sitting on the couch as Monica enters.]\nMonica: Have you seen Chandler?\nPhoebe: No. Why?\nMonica: Cause I just keeping thinking about all these things that Im not gonna have and its freaking me out. I dont know what to do about it.\nPhoebe: Okay, dont sweat it. (Looking around her.) Chandler is nowhere around so go ahead get it out of your system. That guys cute. (Points to a guy sitting behind Monica.)\nMonica: Phoebe! Come on Im serious! I just got to talk to him about all this.\nPhoebe: No that is the last thing you want to do!\nMonica: Why?\nPhoebe: Because youre marrying him!\nMonica: You gotta help me out here Pheebs.\nPhoebe: All right, Ive never been engaged and Ive never really been married, but I can only tell you what my mother told me. Whenever you have doubts or fears or anxieties about a relationship, do not communicate them to your husband.\nMonica: So Im not supposed to share my doubts and fears with the guy Im gonna spend the rest of my life with?\nPhoebe: That is correct! Yes, youre supposed to take all of that stuff and put it in a little box in your mind and then lock it up tight.\nMonica: Your mother told you this?\nPhoebe: Yes!\nMonica: The woman that got married a bunch of times and killed herself when you were 13?\nPhoebe: Oh my God! Youre right! Go! (Monica starts to leave.) Go tell Chandler! Hurry before its too late! Wait no! (Monica stops.) Does this also mean putting out doesnt get you love? (Monica is shocked.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 13, "scene_id": "S07E18_013", "location": "Central Perk", "scene_description": "Phoebe is sitting on the couch as Monica enters.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S07E18/scenes/S07E18_013"}}
{"id": "S07E18_014", "text": "[Scene: Silvercup Studios, Joey and Rachel are there to give Jessica her award.]\nRachel: I cannot believe Im gonna meet Jessica Ashley!\nJoey: Okay wait-wait p-please be cool! Okay? I work with this woman.\nRachel: Okay, Im totally cool! (She coolly knocks on the door)\nJessica Ashley: Come in.\n(The enter.)\nJoey: Hey Jessica.\nRachel: (coolly) Hey Jess.\nJoey: Ah, this is my friend Rachel.\nJessica Ashley: Hi.\nRachel: Sup? (Joey glares at her.)\nJoey: Uh listen, heres your Soapie. I accepted it for ya. (Hands it to her.)\nJessica Ashley: (shocked) Oh my God! I won! Do you have any idea what this means?! (She rolls her eyes and throws it onto the couch.)\nJoey: Well, that-that-thats it? Youre gonna, youre gonna put it on your self or anything?\nJessica Ashley: No, I try to save that for real awards. Now, if youll excuse me. (She exits.)\nJoey: (To Rachel) Take it back?\nRachel: Absolutely.\nJoey: Y-y-yeah! (As they start to leave, Rachel pauses and steals a vase with flowers in it.) Yeah you do. (They exit.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 14, "scene_id": "S07E18_014", "location": "Silvercup Studios", "scene_description": "Joey and Rachel are there to give Jessica her award.", "characters": ["Jessica Ashley", "Joey", "Rachel"], "firestore_path": "/episodes/S07E18/scenes/S07E18_014"}}
{"id": "S07E18_015", "text": "[Scene: Monica and Chandler's, Monica is talking to Chandler.]\nMonica: Honey, as we get closer to the wedding, is there anything that you would like to talk about or share?\nChandler: Okay. Well, I think the centerpieces are too big\nMonica: Youre wrong! The centerpieces are fine! Do you ever get scared at all?\nChandler: Kinda. Theyre really big.\nMonica: Doesnt it ever just freak you out that-that youre never gonna be with anybody new again?\nChandler: What?\nMonica: Just, I love you so much. JustIts just sometimes it bothers me that Im never gonna have that feeling. Yknow when you meet someone for the first time and its new and exciting? Yknow that rush?\nChandler: No. No, see when I first meet somebody its uh its mostly panic, anxiety, and a great deal of sweating.\nMonica: Okay, but all right youre a guy, does it not freak you that youre never gonna sleep with anybody else?\nChandler: Sleeping with somebody new, anxiety, panic, and Im afraid even more sweating.\nMonica: Even with me?\nChandler: I was dangerously dehydrated during the first six months of our relationship. (Monica laughs.) Look, for me the rush is knowing that we are gonna be together for the rest of our lives.\nMonica: Really?\nChandler: Well yeah! But now that I know that youre having these thoughts, Im back to panic, anxiety, and uh Im definitely gonna need some kind of sports drink.\nMonica: Come here! Come here! (They hug.) Sweetie you dont have to worry. No, besides yknow what? Im gonna have a lot of new things with you. The first time we buy a house. Our first kid. Our first grandkid\nChandler: (hoarsely) Water! Water! Water!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 15, "scene_id": "S07E18_015", "location": "Monica and Chandler's", "scene_description": "Monica is talking to Chandler.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E18/scenes/S07E18_015"}}
{"id": "S07E18_016", "text": "[Scene: Rosss classroom, he has just finished his lecture and the students are filing out.]\nRoss: Uh Mr. Morse, can I speak to you for a moment?\nMorse: (walking up) That was a great lecture today. Did you get a little hair cut?\nRoss: Uh-hmm, yeah-yeah do you like it? Do-do you looove it? I just want you to know that Im changing your grade back.\nMorse: What?! Why?\nRoss: Cause I know what youre trying to pull here. Okay? Its not gonna work.\nMorse: Im not trying to pull anything. Look I love you dude.\nRoss: Yknow what? I-Im not even gonna talk about this. Okay? This little thing is over. I know you have a girlfriend! Okay(Ned looks shocked)Yeah! And I know about the other professors! How do you think that makes me feel Ned?! You used me! You dont love me and you never did! (Ross turns around to make a grand exit but runs into two colleagues.) Ah Professor Winston, Professor Fredrickson, Ill be right with you. (To Ned) Dont make this worse and Ill give you a C. (To the professors) Shall we? (They leave.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 16, "scene_id": "S07E18_016", "location": "Rosss classroom", "scene_description": "he has just finished his lecture and the students are filing out.", "characters": ["Morse", "Ross"], "firestore_path": "/episodes/S07E18/scenes/S07E18_016"}}
{"id": "S07E18_017", "text": "[Scene: Joey and Rachel's, Phoebe is entering.]\nPhoebe: Rach? \nRachel: Ill be out in a second.\n(Phoebe notices the Soapie on the counter.)\nPhoebe: Oh. (Picks it up.) Its just so unexpected! II uhBoy Ill tell you its just such an honor to be nominated for a Nobel Prize and yknow to win one for a massage. Especially after having just won a Tony award for best actress in\nRachel: (entering from her room) Honey, we have to go. Our reservations are at 8:00.\nPhoebe: in Reservations at 8:00 by Neil Simon. (To an imaginary Neil Simon) Thank-thank you Neil. Thank you for the words. (Blows him a kiss.)\nRachel: Okay honey, you can finish this later were gonna be late. We gotta go.\nPhoebe: Please, dont play the music. Just uh one more. LIVE FROM NEW YORK! ITS SATURDAY NIGHT!!\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 18, "episode_id": "S07E18", "episode_title": "THE ONE WITH JOEYS AWARD", "scene_number": 17, "scene_id": "S07E18_017", "location": "Joey and Rachel's", "scene_description": "Phoebe is entering.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S07E18/scenes/S07E18_017"}}
