{"id": "S07E16_001", "text": "THE ONE WITH THE TRUTH ABOUT LONDON\nTeleplay by: Zachary Rosenblatt Story by: Brian Buckner & Sebastian Jones Directed by: David Schwimmer Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 1, "scene_id": "S07E16_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S07E16/scenes/S07E16_001"}}
{"id": "S07E16_002", "text": "[Scene: Joey and Rachel's, Rachel is filing her nails as Ross and Ben enter.]\nRoss: Hi.\nRachel: Hi! Hi Ben!\nBen: Hi.\nRoss: Hi, we have a little bathroom emergency.\nRachel: Oh, yeah go ahead.\n(Ben starts to go, but Ross stops him.)\nRoss: Uh, before we do uh, are any of Joeys special romance magazines in there?\nRachel: No. No.\nRoss: (to Ben) Okay! All clear!\nBen: (running to the bathroom) Thanks Phoebe!\nRachel: Ben, its Rachel! (He closes the door.) But whatever.\nRoss: (to Ben) Everything okay in there?\nBen: Dont talk to me now!\nRachel: Awww, just like his daddy.\nRoss: Hey listen can you do me a big favor? The deans office just called and said there was an urgent meeting. Can you watch Ben for like an hour?\nRachel: What-what about Monica?\nRoss: Oh, she isnt home.\nRachel: (nervous) So it would just be, me alone?\nRoss: Well, Ben would be there.\nRachel: Huh umm\nRoss: Whats the matter?\nRachel: Well thatyknow its just uh, Ive never done that before. Me and him alone.\nRoss: Rach, hes not an ex-con.\nRachel: Okay. Okay. Okay. Uh, what do I, what do I do with him?\nRoss: I dont know! Just-just talk to him-entertain him and keep him alive.\nRachel: Okay.\nRoss: Okay. (Ben enters) Ben? Come here. All right, Im gonna leave you here with Aunt Rachel for about an hour. Okay? Are you gonna be okay?\nRachel: Yeah I think so.\nRoss: (To Rachel) I wasnt talking to you.\nBen: Ill be okay.\nRoss: Okay, Ill see you soon buddy. (He hugs and kisses him.) Be back in an hour.\nBen: Bye dad.\nRachel: Bye. (Ross exits.) Ahhh (Silence) So this is fun, huh?\nBen: Not really.\nRachel: Okay. Uh, want something-want something to drink?\nBen: Okay.\nRachel: Uh great! How do you feel about Diet Coke?\nBen: Im not allowed to have soda.\nRachel: Okay. Well thats pretty much all that we haveOh! Oh! Have you ever had a virgin margarita? (Holds up a bottle of margarita mix.)\nBen: Whats a virgin?\nRachel: Water it is.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 2, "scene_id": "S07E16_002", "location": "Joey and Rachel's", "scene_description": "Rachel is filing her nails as Ross and Ben enter.", "characters": ["Ben", "Rachel", "Ross"], "firestore_path": "/episodes/S07E16/scenes/S07E16_002"}}
{"id": "S07E16_003", "text": "[Scene: Central Perk, Monica and Chandler are talking. Joey and Phoebe are getting coffee.]\nMonica: What about the second minister we meet with? I kinda liked him.\nChandler: You mean the spitter?\nMonica: Come on! It wasnt that bad!\nChandler: Easy for you to say; youll be wearing a veil.\nMonica: All right, what about the third guy?\nChandler: You mean the guy who kept staring at your chest?\nMonica: Can you blame him?\nChandler: Sorry, I just dont like the idea of when I say, \"I do,\" hes thinking, \"Yeah, Id do her too!\"\nMonica: Well then we still have a problem.\nChandler: Yeah!\nPhoebe: (returning with Joey) With what?\nMonica: Well, were trying to find someone to perform our wedding and theyre all either boring or annoying or yknow, cant stop staring at the ladies. (Points to her chest.)\n(Joey nods his approval.)\nPhoebe: Oo! You should have one of us do it!\nMonica: Phoebe, were getting married, married; not sixth grade married.\nPhoebe: No! No! Its-its uh a real thing! Anyone can get ordained on the Internet and perform like weddings and stuff!\nMonica: Are you serious?\nPhoebe: Yes! A friend of mine did it and its totally legal!\nJoey: I call it!!\nPhoebe: What?! No! It was my idea!\nChandler: Guys thank you very much but neither of you is marrying us.\nJoey: Does calling it not mean anything anymore?!\nChandler: We are going to have a legitimate member of the clergy! And when I say legitimate I mean, gay and in control of his saliva!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 3, "scene_id": "S07E16_003", "location": "Central Perk", "scene_description": "Monica and Chandler are talking. Joey and Phoebe are getting coffee.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_003"}}
{"id": "S07E16_004", "text": "[Scene: Joey and Rachel's, Rachel and Ben are sitting on the couch bored out of their minds.]\nRachel: Ben yknow when uh, when you were a baby, you and I used to hang out all the time. Cause I was, I was your daddys girlfriend.\nBen: But youre not anymore!\nRachel: No, Im not.\nBen: Cause you guys were on a break.\nRachel: Hey! We were not on aOkay. Thats fine! Fine. Yknow what Ben? One day when you are a lot older I am going to tell you that entire story over a pitcher of real margaritas, okay?\nBen: Whens my daddy coming back?\nRachel: (checks her watch) Fifty-two minutes. (Pause) So no-no brothers and sisters, huh? That must be nice. You dont have to share stuff.\nBen: Sharing is good.\nRachel: Oh, youre one of those. But yknow what? I have two sisters of my own and we just-just tortured each other.\nBen: Really? Like how?\nRachel: Well yknow, we would umm, repeat everything the other said, or uh, wed jump out of closets to scare each other, or switch the sugar for the salt so theyd put salt on their cereal.\nBen: (laughs) Thats a good one.\nRachel: Yeah? You like that one?\nBen: Yeah, youre funny.\nRachel: Im funny? Oh thank God! Well hey, Ive got a ton of these! Umm, oh hearDo you want a good one? Heres a good one. Umm, you uh, you take a quarter, take a quarter and, and you blacken the edge. Right? (Does so.) And then you say to person, I bet you cant roll this quarter from your forehead to your chin without it leaving your face. And then when they do it, theyre left with a big black pencil line right down the center of their face.\nBen: Can I do it to you?\nRachel: Yeah, I-I-I-Im funny Ben, but Im not stupid. Okay?", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 4, "scene_id": "S07E16_004", "location": "Joey and Rachel's", "scene_description": "Rachel and Ben are sitting on the couch bored out of their minds.", "characters": ["Ben", "Rachel"], "firestore_path": "/episodes/S07E16/scenes/S07E16_004"}}
{"id": "S07E16_005", "text": "[Scene: Monica and Chandler's, Monica and Chandler are eating lunch as Joey enters.]\nJoey: So, did you uh, find anyone to marry you guys yet?\nChandler: No, but Horny for Monica Minister called, wanting to know if we were still together.\nMonica: Were never gonna find anybody.\nJoey: Well then let me do it!\nChandler: Joe\nJoey: No-no-no! Look, Ive been thinking about it. Im an actor right? So I wont get nervous talking in front of people.\nMonica: Joey look its really sweet\nJoey: No-no-no-no look no! I wont spit, and I wont stare at Monicas breasts! Yknow? Everyone knows Im an ass man!\nMonica: That is true.\nJoey: Yeah and the most important thing is that it wont be some like, stranger up there who barely knows you. Itll be me! And I swear Ill do a really good job. Plus, yknow I love you guys and-and it would really mean a lot to me.\nChandler: (To Monica) Yknow, we havent found anybody else.\nMonica: It might be kinda cool.\nJoey: So I can do it?\nChandler: Yeah you can do it.\nJoey: All right!!! Okay!! All right! Okay-okay, I gotta get started on my speech! Oh, wait a minute, Internet ministers can still have sex right?\nChandler: Yeah.\nJoey: Okay.\n(Phoebe enters slowly.)\nMonica: Hey Pheebs, hows it going?\nPhoebe: Oh, I have a headache. A horrible headache!\nMonica: Oh, Im sorry. Can I get you something?\nPhoebe: Oh my God, youve got to stop chattering!\nMonica: Here, take a couple of these. (She gets up to grab a couple of pills.)\nPhoebe: What is it?\nMonica: Its Hexadrin.\nPhoebe: Oh no, I dont believe in Western medicine. No, if you just apply pressure to these points right here. (Shes pinching the bit of skin between her right thumb and forefinger with her left hand.) Then your hand starts to hurt and you still have a headache, so thanks. (Takes the pills.)\nMonica: Okay, while were waiting for these pills to kick in, Im gonna sit you down on the couch. Come on. (Phoebe gets up and goes with her.) Get some nice soft pillows under your head, Im gonna turn the TV on and you can watch whatever you want. And ImSit down(She sits down on the couch)gonna make you some tea. And then, Im gonna rub your feet.\nPhoebe: Oh.\nJoey: Oh! My head! Oh! (Hes sitting on the chair, lies back, and puts his feet up for Monica to rub.) Oh!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 5, "scene_id": "S07E16_005", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler are eating lunch as Joey enters.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_005"}}
{"id": "S07E16_006", "text": "[Scene: Joey and Rachel's, Rachel is reading and there is knock on the door which she answers.]\nRachel: Coming. \n(She opens the door to reveal Ross with a pencil mark from his forehead to his chin.)\nRoss: I have a bone to pick with you.\nRachel: Uh-oh.\nRoss: Yes! Ben learned a little trick.\nRachel: Oh yeah? Did he pull the old (She is waving her hand up and down her face. Shes thinking about the pencil mark.)\nRoss: Thats right! Thats right! Saran Wrap on the toilet seat so the pee goes everywhere!\nRachel: Oh that.\nRoss: Yeah that! You know I hate practical jokes! Theyre mean and theyre stupid and-and I dont want my son learning them!\nRachel: Oh, come on! Saran Wrap on the toilet seat, you dont think thats just a little funny?!\nRoss: I was barefoot. Now tell me, the toilet thing is the only thing you taught him right?\nRachel: (looking at his mark) Yes.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 6, "scene_id": "S07E16_006", "location": "Joey and Rachel's", "scene_description": "Rachel is reading and there is knock on the door which she answers.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S07E16/scenes/S07E16_006"}}
{"id": "S07E16_007", "text": "[Scene: Central Perk, Phoebe, Chandler, and Monica are there.]\nPhoebe: Its amazing! My headache is completely gone! What are those pills called?\nMonica: Hexadrin. (She gets the box out of her purse.)\nPhoebe: Oh, I love you Hexadrin! (She kisses the box.) Oh look! It comes with a story! (She pulls out the instructions and side affects paper.)\nMonica: No Phoebe, those are like the side affects and stuff.\nPhoebe: Say what?\nMonica: Yknow, the possible side affects.\nPhoebe: Oh my God! (Starts reading them.) Dizziness, nervousness, drowsiness, facial swelling, nausea, headacheHeadache. Vomiting, stomach bleeding, liver damage! Now okay, I dont recall any of this coming up when you gave me these little death capsules! Oh Im sorry, extra strength death capsules!\nMonica: Phoebe, relax none of that stuff ever happens! They just put it on there for legal reasons!\nPhoebe: Why?\nMonica: In case it happens.\nJoey: (entering) Hey!\nChandler: Hey!\nJoey: Say hello to Reverend Joey Tribbiani! (Holds up the piece of paper bearing the proof of his ordination.)\nChandler: Hey!\nMonica: You did it! You got ordained?!\nJoey: Yeah, I just got off the Internet! Man, there is a lot of porn out there!\nChandler: Our minister\nPhoebe: I have liver damage. Ow! Oh! (She grabs the left side of her torso.)\nMonica: Phoebe, your liver is right here. (She points to the right side of her torso.)\nPhoebe: Okay, then I must be disoriented.\nJoey: Anyway, I started working on what Im going to say for the ceremony, do you wanna hear it?\nChandler: Okay.\nMonica: Yeah!\nJoey: Now-now, listen this is just a first draft so (Starts to read the piece of paper he brought.) \"We are gathered here today on this joyous occasion to celebrate the special love that Monica and Chandler share.\" (Monica and Chandler like it so far.) Eh? (He continues reading.) \"It is a love based on giving and receiving. As well as having and sharing. And the love that they give and have is shared and received. And through this having and giving and sharing and receiving.\" (Phoebe nods her approval.) \"We too can share and love and have and receive.\"\nChandler: (To Monica) Should we call the spitter?\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 7, "scene_id": "S07E16_007", "location": "Central Perk", "scene_description": "Phoebe, Chandler, and Monica are there.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_007"}}
{"id": "S07E16_008", "text": "[Scene: Carol and Susans, there is a knock on the door and Carol opens it to reveal Rachel.]\nCarol: Hey Rachel! (The camera cuts to her face and we see that Ben pulled the quarter trick with her as well.)\nRachel: Hi!\nCarol: What a nice surprise! What are you doing here?\nRachel: Well yknow I was just in the neighborhood and I passed by your building and I thought to myself, \"Whats up with Carol and sweet, little Ben?\"\nCarol: Can I ask whatCome on in.\nRachel: Okay.\nCarol: Umm uh, Ill make some coffee and we can uh, chat.\nRachel: Id love that. I would loooove (Carol goes to make the coffee and she sits down.) So uh, so where is sweet little Ben? I would love to have a little...\nBen: (jumping up from behind her chair) Gotcha!! (Rachel jumps up startled.)\nRachel: I found him! (To Ben) Very funny, come here! (She sits down on the coffee table and Ben walks up.) That is exactly why Ive come here to talk to you okay?\nCarol: (from the kitchen) Rach, do you want some sugar in your coffee?\nRachel: Yes oh(To Ben)Do I want sugar in my coffee? (Ben nods no.) No, just some milk would be good Carol. Thanks. (To Ben) Okay, do you remember all that stuff I taught you yesterday?\nBen: (mimicking her) Remember all that stuff I taught you yesterday?\nRachel: Dont do that.\nBen: Dont do that.\nRachel: Seriously, your dad doesnt like pranks.\nBen: Seriously, your dad doesnt like pranks.\nRachel: Oh damnit!\nBen: Oh damnit!\nRachel: No! Dont say that! Dont say that!\nBen: Damnit!\nRachel: No dont! Go back to repeating!\nBen: Damnit!\nRachel: Oh crap!\nBen: Oh crap!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 8, "scene_id": "S07E16_008", "location": "Carol and Susans", "scene_description": "there is a knock on the door and Carol opens it to reveal Rachel.", "characters": ["Ben", "Carol", "Rachel"], "firestore_path": "/episodes/S07E16/scenes/S07E16_008"}}
{"id": "S07E16_009", "text": "[Scene: Monica and Chandler's, Phoebe, Joey, Chandler, and Monica are returning from Central Perk.]\nPhoebe: I feel like my face is swelling. (To Monica) Is my face swelling?\nMonica: Phoebe, your face is fine! Come on, none of this stuff is going to happen to you! Stop being such a baby!\nPhoebe: Oh, interesting you should call me that! Now that I may never have one! (Holds up the warning label.)\nJoey: Okay you guys, I got a little more written. Are you ready?\nChandler: Yeah. O-okay.\nJoey: (reading) \"When I think of the love that these two givers and receivers share, I can not help but envy the lifetime ahead of having and loving and giving and\" And then I cant think of a good word for right here. (He points to the stop on the paper where he left off.)\nMonica: How about receiving?\nJoey: Yes!\nChandler: See Joe, not that thats not grrreat! But, one of the cool things about having somebody we know perform the ceremony is that it can be about us! Yknow, it can be more personal. You can tell stories about us!\nJoey: Ooh, like the time you and I went to Atlantic City and I made you laugh so hard you threw up your whole steak?! Remember?\nChandler: No, not us (Motions Joey and him.) Us! (Motions Monica and him.)\nMonica: I gotcha. Sorry. (To Monica) So, did you ever make him throw up a whole anything?\nPhoebe: Did you ever feed him a poison capsule that made him bleed from the eyes?\nMonica: It doesnt say that!\nPhoebe: Oh! Suddenly somebody knows all about the side affects!\nChandler: See Joe, we want you to tell stories but yknow, romantic stories. Nice stories.\nJoey: Oh. Okay. Ooh! Ooh! Okay, maybe Ill talk about London! Yknow when you two hooked up! Only, only I wont say hooked up. Ill say, \"Began their beautiful journey\"\nMonica: There you go!\nJoey: \"by doin it.\"\nChandler: Joe?\nJoey: Okay. All right. Umm, so uh, so how did it happen? Did your eyes meet across the room? And then the next thing yknow youre in the bathtub together and shes feeding you strawberries?\nChandler: Isnt that what happened with you and the brides maid?\nJoey: Yeah!! I call that London style.\nMonica: No that is not what happened with us. Well, I was umm, I was really sad that night because this guy that I was Rosss mom.\nJoey: Oh.\nMonica: And then Chandler was, was really sweet and he consoled me. And well we drank too much\nJoey: Yeah baby!\nChandler: And I was a perfect gentleman and I walked her to her hotel room and said goodnight.\nJoey: Oh.\nChandler: But then later that night\nJoey: Yeah baby!\n[Cut to London, Chandlers hotel room. He is getting ready for bed by doing push-ups. One push-up. Just as he gets under the covers, theres a knock on the door.]\nChandler: (answering the door) Hey!\nMonica: (standing outside) Cute PJs! Youre really livin it up here in London huh?\nChandler: Well I was I was exactly expecting company after(He looks at his watch.) 9:15.\nMonica: (entering) Is Joey here?\nChandler: Well, last time I saw him he was heading out the door with the brides maid and a bucket of strawberries. So uh, youre not still upset about what that guy told ya are ya?\nMonica: Wouldnt you be?\nChandler: Well, look its been a really emotional time yknow, and youve had a lot to drink. And youve just got to let that go okay? I mean you were the most beautiful in the room tonight!\nMonica: Really?\nChandler: You kidding? Youre the most beautiful woman in most rooms (She jumps up and kisses him.) (Breaking the kiss.) Whoa! Whoa! Whoa! Whats going on? You and I just made out! You and I are making out?\nMonica: Well, not anymore.\nChandler: But we dont do that.\nMonica: I know, I just thought it would be fun.\nChandler: How drunk are you?\nMonica: Drunk enough to know that I want to do this. Not so drunk that you should feel guilty about taking advantage.\nChandler: (thinks) Thats the perfect amount!\nMonica: Okay!\n(They run to the bed, sit down, and start making out again.)\nMonica: (breaking the kiss) Yknow whats weird?\nChandler: What?\nMonica: This doesnt feel weird!\nChandler: I know.\nMonica: Youre a really good kisser.\nChandler: Well, I have kissed over four women. (They kiss again.) Do you wanna get under the covers?\nMonica: Hm-hmm!\nChandler: Okay!\n(They do so and they take off their clothes.)\nMonica: Wow! You are really fast!\nChandler: It bodes well for me that speed impresses you.\nMonica: Were gonna see each other naked.\nChandler: Yep!\nMonica: Do you wanna do it at the same time?\nChandler: Count of three?\nMonica: One!\nChandler: Two!\nMonica: Two!\nMonica and Chandler: Three! (They lift up the covers and check each other out, then come back up with silly grins on their faces.)\nChandler: Well I think its safe to say that our friendship is effectively ruined.\nMonica: Eh, we werent that close anyway!\nChandler: Eh!\n(They start making out again, and it takes Joey trying to enter to stop them.)\nChandler: Joey! Joey! Joey! J-J-Joey-Joey-J-Joey! (Monica hides under the covers as Joey enters. Remember?)\nJoey: Hey!\nChandler: Hey Joe! I was just watching a movie-e-e (Notices that the TV is turned off.)\nJoey: Oh, dude Im so sorry!\nChandler: No! No! No!\nJoey: Hey no-no-no-no! Its cool! Its cool! I-Ill only be a second, Im still with my brides maid, I justWhere are those condoms you brought?\nChandler: Theyre in my bag over there. (Points.)\nJoey: Ah. (Joey walks to Chandlers bag by getting as far away from Chandlers bed as possible.)\nChandler: Uh, could you leave me one?\nJoey: (pause) For just you?\nChandler: Yeah.\nJoey: Hey listen, why dont you come downstairs with me? Theres some really nice girls down there.\nChandler: No I-I-Im fine.\nJoey: All right, here you go buddy. (He tosses him one.) Go nuts. (Exits.)\n[Cut back to Monica and Chandler telling Phoebe and Joey the story.]\nJoey: Thats what that was?! Cause that other thing? I thought you were on to something, but it did nothing for me.\nMonica: Okay, can we change the topic? Because its really doing nothing for me.\nJoey: Oh (To Chandler) Can you imagine if I hadnt left you that last one? You two mightve never gotten together. Ooh-ooh! Could you imagine if I sent that hooker up to the room like I was gonna?! Its like it was in the stars!\nPhoebe: Yeah, its totally meant to be. (To Monica) Tell him who you originally wanted to hook up with that night.\nMonica: What?!\nChandler: What?\nPhoebe: (To Joey) What?!\nChandler: Who did you originally want to hook up with?\nMonica: Okay, fine but please dont be upset! Okay? I was really depressed okay? And really drunk! I just wanted something stupid and meaningless. I just wantedjust sex. So, when Iwent to your room that nightI was actually lookingfor Joey. (Joey smiles.)\nJoey: Yeah baby! (Chandler glares at him.) No baby!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 9, "scene_id": "S07E16_009", "location": "Monica and Chandler's", "scene_description": "Phoebe, Joey, Chandler, and Monica are returning from Central Perk.", "characters": ["Chandler", "Joey", "Monica", "Monica and Chandler", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_009"}}
{"id": "S07E16_010", "text": "[Scene: Monica and Chandler's, scene continued from earlier.]\nChandler: (To Monica) So you came to the room looking for Joey? Did you ever in-intend on telling me about this?\nMonica: No because it-it didnt seem important.\nChandler: Oh, its not important? Its not important?! If it wasnt for a brides maid youd be marrying him (Points to Joey) not me!\nMonica: Noo!! The point is that is was you that was there that night! It is you that I am marrying! It is you that I feel in love with!\nJoey: And it is a love that is based on having and giving and receiv(Shuts up on Monicas glare.)\nChandler: I dont believe it. The most romantic night of my life and Im runner up.\nMonica: Chandler, please! Do you know how unbelievably glad I am that Joey was not there that night?!\nJoey: Hey! (Monica turns and looks at him) Now Im a man of the cloth, but I still have feelings!\nChandler: (To Joey) Look there is no way youre doing this wedding now. Okay?\nJoey: What?! Thats not fair! Its not my fault! I was off with my brides maid! And whos to say I wouldve even said yes?! (To Monica) I mean I wouldve said yes. Chandler look y-y-you are making way to big a deal out of this, all right? Look, everything worked out okay!\nChandler: Okay, its just weird! Okay? I dont want to be standing their saying my vows and then having the mental image of you and Monica! I-I-I needI dont know what I need. I need a walk.\nMonica: Wait Chandler come on, letsits not a big deal!\nChandler: It is to me. You wanted to sleep with Batman, and instead you had to settle for Robin. (Walks out and slams the door.)\nJoey: This is crazy.\nPhoebe: I know! Robin is so gay!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 10, "scene_id": "S07E16_010", "location": "Monica and Chandler's", "scene_description": "scene continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_010"}}
{"id": "S07E16_011", "text": "[Scene: Carol and Susans, Rachel is talking with Ben.]\nRachel: So now what have we agreed?\nBen: No more pranks.\nRachel: And-and what else?\nBen: That you and daddy were not on a break.\nRachel: Very good.\n(Theres a knock on the door and Ross enters.)\nRoss: Rachel! What are you doing here?\nRachel: Im just visiting my good friend Carol.\nRoss: Your good friend?\nRachel: Yeah!\nRoss: Whats her last name?\nRachel: CarolLesbian?\nRoss: Nice. And by the way that uh, that line down my face?\nRachel: What line?\nRoss: Wh-wh-what line? The line that prompted a student in my last class of the day to say uh, (In a college frat boy voice) \"Dude, dont you ever was your face?\"\nRachel: All right, Im sorry. Im sorry I didnt tell you but you were so mad already!\nRoss: Of course I was mad! I told you I-I hate this stuff! Okay? It-its not funny!\nCarol: (entering from the kitchen) Hey Ross!\nRoss: Hi.\nCarol: Whats not funny?\nRoss: Practical jokes.\nCarol: Oh II think theyre funny.\nRoss: You have a line down your face.\nCarol: What? (Goes and checks.)\nRachel: Okay, maybe they are not funny to you\nCarol: (yelling from the bathroom) Oh my God!\nRachel: Or Carol! But theyre funny to kids and who is it hurting?!\nRoss: Uh, yknow what? Ill tell you who it hurts! It hurts the kid who has all his clothes stolen in gym class so he has to go to the principals office wearing nothing but a catchers mitt!\nRachel: That was you?! We heard about you in Junior High! Did you really just shake your fist in the air and shout, \"I will be revenged?!\"\nRoss: I will be! Listen, I dont want you teaching my son that stuff anymore. Okay?\nRachel: Fine. Fine, but Ill have you know that once I taught him that stuff he called me Fun Aunt Rachel. And I loved being Fun Aunt Rachel but Ill go back to being Boring and Uncomfortable Aunt Rachel if thats what you want!\nRoss: No thats not what I want. Uh, Im glad you guys were bonding but I\nRachel: Look he doesnt have any brothers or sisters, somebodys gonna have to teach him this stuff! And I havent taught him anything that a normal 6-year-old doesnt know anyway!\nBen: (yelling from off camera) Crap!!\nRachel: I gotta go! (Runs out.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 11, "scene_id": "S07E16_011", "location": "Carol and Susans", "scene_description": "Rachel is talking with Ben.", "characters": ["Ben", "Carol", "Rachel", "Ross"], "firestore_path": "/episodes/S07E16/scenes/S07E16_011"}}
{"id": "S07E16_012", "text": "[Scene: Central Perk, Chandler is sulking on the couch as Joey enters to talk with him.]\nJoey: Hey.\nChandler: Hey. Do you want this scone? (Holds up his plate) It came for me but it would probably rather sleep with you!\nJoey: Chandler, come on nothing even happened!\nChandler: Look Joe, I know you wanted to do the wedding\nJoey: No-hey-no! If you dont want me to do it, I except that. I dont care about that. I justI dont want you to be upset.\nChandler: How can I not be upset? Okay? I finally fall in love with this fantastic woman and it turns out that she wanted you first!\nJoey: Yeah for like a half an hour one night! Chandler, she wants you for the rest of her life! Youre so lucky! Look what I missed out on by not being there! Although you know what? It could never have worked like you guys did, cause you guys are perfect for each other. Yknow, we look at you and-and we see you together and it justit-it fits. Yknow? And you just know its gonna last forever.\nChandler: Thats what you should say.\nJoey: What?\nChandler: When youre marrying us; thats what you should say.\nJoey: Really? I can do it?\nChandler: Id love it if you would do it.\nJoey: Hey! (They hug.)\nChandler: But those are the words! Those exact words!\nJoey: Well I dont know remember exactly but, its-its pretty much about having and giving and sharing and receiving.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 12, "scene_id": "S07E16_012", "location": "Central Perk", "scene_description": "Chandler is sulking on the couch as Joey enters to talk with him.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S07E16/scenes/S07E16_012"}}
{"id": "S07E16_013", "text": "[Scene: Joey and Rachel's, Rachel is in the kitchen as Ross and Ben are entering.]\nRoss: Hey!\nRachel: Hey!\nRoss: Hey Im sorry to do this to you again but uh, is there any way you can look after Ben for a little bit? I-Ive got this meeting at school. And-and he-he asked for his uh, Fun Aunt Rachel, so\nRachel: Ohhh! Well of course I will watch him! We have fun, dont we Ben? (He nods yes.)\nRoss: Okay, Ill see you later pal.\n(Ross turns to leave.)\nRachel: Ohh, okay. (Ross has a sign on his back that reads Poop.) WhAh-ha! (Ross stops and turns.) Wait a minute. Uh Ben, I cant do it.\nRoss: What?\nRachel: I cant let him go out that way, hes got a meeting. (To Ross) Youve got something here on your back.\nRoss: What? (She takes the sign off and hands it to him.) Thats great. That is great. (Crumples up the paper and throws it down in anger.) What did we just finish talking about Ben?!\nRachel: Oh I\nBen: What did we just finish talking about Ben?!\nRoss: All right, thats it! (He runs over to Ben, but he runs past him and out the door.) Comeyouno! You are in big trouble young man!\nRachel: No! Wait! Come on!\n[Cut to the hallway, Ben runs upstairs with Ross in pursuit.]\nRoss: Wait! No! Ben, come here! I am not kidding!\nRachel: No you guys (She walks out into the hallway.)\nRoss: I-I-am(Suddenly Ross starts screaming and comes falling down the stairs landing just in front of Rachel.)\nRachel: EHHHHHHHHHHH!!!!!!! My God!!!!!!!!!!! Oh my God!!!!!!! (She runs over to him and finds that it was a dummy and that she had been had.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 13, "scene_id": "S07E16_013", "location": "Joey and Rachel's", "scene_description": "Rachel is in the kitchen as Ross and Ben are entering.", "characters": ["Ben", "Rachel", "Ross"], "firestore_path": "/episodes/S07E16/scenes/S07E16_013"}}
{"id": "S07E16_014", "text": "[Scene: Central Perk, Chandler and Monica are entering. Phoebe and Joey are sitting on the couch.]\nJoey: Hey!\nMonica: Hey-hey.\nJoey: So are guys doing okay?\nChandler: Yeah, we talked and Monica made me see that I over reacted a little bit and some things in life are more important.\nMonica: Yeah baby! (Phoebe and Joey nod.)\nPhoebe: Im really glad you guys are okay but, I just keep thinking what would happen if-if you two (Points to Monica and Joey) actually had hooked up.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 14, "scene_id": "S07E16_014", "location": "Central Perk", "scene_description": "Chandler and Monica are entering. Phoebe and Joey are sitting on the couch.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_014"}}
{"id": "S07E16_015", "text": "[Scene: Monica and Joeys, Monica is cooking.]\nMonica: Honey! Dinners ready!\n(Joey, whose new diet is working out great, he looks like he only weighs 375 down from 420 enters from the bedroom.)\nFat Joey: Whats my little chef got for me tonight?\nMonica: Your favorite!\nJoey: Ho-ho-ho, (pausing for a rest next to the fridge) fried stuff with cheese!\nMonica: Yep! And lots of it!\nFat Joey: Thanks sweetheart. Give me a little sugar here. (They kiss.) Okay.\n(Joey sits down.)\nMonica: Okay, in we go.\n(Monica gets behind him and in combination with his sliding the chair forward and her pushing with her leg manages to get up to the table.)\nFat Joey: Here we go! Here we go! Here we go! (Groans and picks up a piece of food.) How you doin?\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 15, "scene_id": "S07E16_015", "location": "Monica and Joeys", "scene_description": "Monica is cooking.", "characters": ["Fat Joey", "Joey", "Monica"], "firestore_path": "/episodes/S07E16/scenes/S07E16_015"}}
{"id": "S07E16_016", "text": "[Scene: Central Perk, Joey is getting Phoebe some coffee.]\nJoey: Here you go.\nPhoebe: (still reading the label) Oh my God! This is a six-hour pill! (Checks her watch) Thats it! Im out of the woods! Ohh! What a relief!\nJoey: Good for you!\nPhoebe: Oh, its like huge weight has been lifted! Cause look, (reads the side affects) no hair loss, not a rash, no hives, Im just so happy! Because no shortness of breath, no temporary euphoriaOh.\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 16, "episode_id": "S07E16", "episode_title": "THE ONE WITH THE TRUTH ABOUT LONDON", "scene_number": 16, "scene_id": "S07E16_016", "location": "Central Perk", "scene_description": "Joey is getting Phoebe some coffee.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S07E16/scenes/S07E16_016"}}
