{"id": "S07E02_001", "text": "THE ONE WITH RACHELS BOOK\nWritten by: Andrew Reich & Ted Cohen Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 1, "scene_id": "S07E02_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E02/scenes/S07E02_001"}}
{"id": "S07E02_002", "text": "[Scene: Monica, Chandler, and Phoebe's, everyone is there having breakfast and Joey enters carrying a loaf of bread.]\nJoey: Hey!\nRoss: Hi!\nJoey: Who wants French toast?\nRoss: Oh, Ill have some!\nJoey: Good, me too. (Tosses him the loaf.) Eggs and milk are in the fridge. Thanks.\nMonica: (entering from her room) Oww!\nChandler: Whats the matter honey?\nMonica: I dont know, my hand feels weird. I guess its because, Im engaged! (Shows off the ring.) How long before it starts getting annoying?\nPhoebe: It starts?\nRachel: Yeah, so lets get started on the wedding plans!\nMonica: Okay! (Runs off.)\nChandler: (incredulous) Already?!\nRachel: Yeah, we got a lot to do! We gotta think about the flowers, the caterers, the music\nChandler: Oh, I got some thoughts on that.\nRachel: Oh wait Chandler, too many cooks\nRoss: Take from me, as the groom all you have to do is show up and try to say the right name.\nMonica: (returning) Okay! (Sets down a huge 3\" 3-ring binder on the table.)\nChandler: What in Gods name is that?!\nRoss: Oh my God, the wedding book?! I havent seen that since the forth grade!\nMonica: This baby has got everything. Take yknow, locations for instance. (She opens up the binder to the locations chapter.) First, organized alphabetically, then geographically, then by square footage. \nPhoebe: That is so smart! (To Chandler, under her breath) Break it off. Break it off now.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 2, "scene_id": "S07E02_002", "location": "Monica", "scene_description": "Chandler, and Phoebe's, everyone is there having breakfast and Joey enters carrying a loaf of bread.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E02/scenes/S07E02_002"}}
{"id": "S07E02_003", "text": "[Scene: A Classroom, Ross is giving a lecture.]\nRoss: And that should conclusively prove that I had the idea for Jurassic Park first! Now lets take a look at (Phoebe rushes in.)\nPhoebe: Hey! Ross!\nRoss: Phoebe, oh my God! Wh-wh-what are you doing here?\nPhoebe: I need to talk to you, its pretty urgent. Its about Monica and Chandler.\nRoss: Oh my God! Of course, of course. (To the class.) Umm, would you please excuse me for a moment? Umm, do you know each others hometowns? Why dont you (Motions that they should learn everyones hometown.) (To Phoebe) Wh-whats going on?\nPhoebe: Well, umm, not much. But, I was just thinking that since those guys just got engaged that maybe it would be nice if they had some privacy, yknow? So, could I just move in with you for a couple days?\nRoss: Umm, okay, yeah, sure. But wh-whats wrong with Monica and Chandler?\nPhoebe: NothingWhy?!\nRoss: Phoebe, you said it was urgent!\nPhoebe: Oh yeah it is! Im going to the movies and it starts in like five minutes.\nRoss: Do you realize I have a classroom full of students?\nPhoebe: (to the students) Oh, Im sorry. Im so rude. Does anyone want to come to the movies?", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 3, "scene_id": "S07E02_003", "location": "A Classroom", "scene_description": "Ross is giving a lecture.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S07E02/scenes/S07E02_003"}}
{"id": "S07E02_004", "text": "[Scene: Monica, Chandler, and Phoebe's, Rachel and Monica are pretty much telling Chandler what the wedding plans are.]\nMonica: All right, so I havent cleared the budget with my parents yet, but tell me how this is for music.\nRachel: Okay.\nMonica: All right umm, a string quartet for the procession.\nRachel: Aw.\nMonica: A jazz trio for cocktails. The Bay City Rollers for dancing. Wait, that was from my sixth grade wedding.\nChandler: Well, you couldnt get them anyway. Ian doesnt plan anymore and Derrick (Off of Rachel and Monicas looks) And Derrick is a name I shouldnt know.\nJoey: (sitting up from the couch) Hey Mon, do you have another pillow? (Holds up one.) Yknow, something a little snugglyer?\nChandler: Why are you napping over here instead of over at your place?\nJoey: Well, the duck\nRachel: What?! The duck?! What the hell did the damn duck do now?!\nJoey: Uh, well he did not get sick somewhere in there and it was immediately found and properly cleaned up!\nChandler: Now, do I get to look at this book or is it just for people who are actually involved in the wedding?\nMonica: Of course you can look at it! Yeah, I want your opinion too!\nChandler: Okay.\nMonica: Here you go! What do you think about centerpieces?\nChandler: Centerpieces!\nMonica: Yeah! Roses or Lilies? (Holds up a picture of each.)\nChandler: Definitely roses. (Monica and Rachel exchange a look.) Well, I just think theyre a little more weddingy. (Monica holds the Lily picture closer to him.) But Lilies are the clear choice.\nMonica: Oh my God! Its like one mind.\nChandler: Uh-huh!\nJoey: (sitting up again) Guys! Guys!! You gotta let me nap! Ugh, Im gonna get cranky!\nRachel: Joey, there is a perfectly good couch across the hall!\nJoey: Yes it is perfectly good, and it is not one of the places the duck got sick!\nRachel: What?!\nJoey: All right, Im gonna go! (Gets up and heads for the door.)\nRachel: Now Joey, what did the duck do?!\nJoey: I dont know! But he did not eat your face cream!\n[Cut to Joey and Rachels, Joey enters and heads for his bedroom. He pushes open the door to find the duck.]\nJoey: Hey little buddy, how are you feeling? (The duck does not get sick and Joey recoils in horror and heads for the couch.) What the hell is in that face cream? (Hes about to try out the couch but notices the bed in Rachels room. He walks into her room and feels the bed.) Thats so soft. (He pulls back the comforter.) Pillowcases! (He climbs in and groans in delight. Suddenly, he feels something under him and pulls out a little beat up paperback book. He opens it and starts to read from it.) (In his head.) Zelda looked at the chimney sweep. Her father, the vicar(Stops reading and thinks.) The vicar? (Continues reading) wouldnt be home for hours. Her loins were burning. She threw caution to the wind and reached out and grabbed his(Out loud.) Whoa! (Reads on in silence.) Whoa-ho-ho-ho! This is a dirty book! (Continues to read.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 4, "scene_id": "S07E02_004", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Rachel and Monica are pretty much telling Chandler what the wedding plans are.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S07E02/scenes/S07E02_004"}}
{"id": "S07E02_005", "text": "[Scene: Rosss apartment, Phoebe has moved in and has a massage client on her table shes set up in the living room. Ross enters and is shocked to see a naked man lying on the table.]\nRoss: Uh, Phoebe\nPhoebe: Oh Ross, hi.\nRoss: Phoebe, what are you doing?\nPhoebe: Im sorry, Im with a client right now.\nRoss: Phoebe!\nPhoebe: Okay, lets talk outside.\n(They go into the hall.)\nRoss: Phoebe, you cant massage people in my apartment!\nPhoebe: Whats the big deal? I did it at Monica and Chandlers!\nRoss: And they knew about it?\nPhoebe: (pause as she considers it) Okay, well Ross, what is this really about?\nRoss: Look, this is my home and I want to be able to come and go whenever I want!\nPhoebe: Okay, I will find someplace else to do the rest of my appointments. I just dont know what the big deal is!\nRoss: The big deal is I dont want naked, greasy strangers in my apartment when I want to kick back with a puzzlebeer! Cold beer.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 5, "scene_id": "S07E02_005", "location": "Rosss apartment", "scene_description": "Phoebe has moved in and has a massage client on her table shes set up in the living room. Ross enters and is shocked to see a naked man lying on the table.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S07E02/scenes/S07E02_005"}}
{"id": "S07E02_006", "text": "[Scene: Joey and Rachel's, Joey is sweeping up as Rachel enters.]\nRachel: Hey Joey, what cha doing?\nJoey: Sweepin. Why? Turn you on?\nRachel: No.\nJoey: Huh. What if I was sweeping a chimney?\nRachel: Joey, did you my face cream?\n(She walks into her bedroom.)\nJoey: Where are you going? The vicar wont be home for hours.\n(She comes back out.)\nRachel: Joey, (nervously) where did you learn that word?\nJoey: Where do you think, (pause) Zelda?\nRachel: (gasps) You found my book?!\nJoey: Yeah I did!\nRachel: Joey, what-what are you doing going into my bedroom?!\nJoey: Okay, look Im sorry, I went in there to take a nap and I know I shouldnt have, but you got porn!\nRachel: Hey-hey, yknow what? I dont care! Im not ashamed of my book. Theres nothing with a woman enjoying a littleerotica. Its just a healthy expression of female sexuality, which by the way, you will never understand. (She goes into her room.)\nJoey: You got porn!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 6, "scene_id": "S07E02_006", "location": "Joey and Rachel's", "scene_description": "Joey is sweeping up as Rachel enters.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E02/scenes/S07E02_006"}}
{"id": "S07E02_007", "text": "[Scene: Ross's apartment, Ross is coming out of the living room carrying his salad and a puzzlebeer! Cold beer. And he decides to fold up Phoebes massage table, but being Ross has trouble with it as there is a knock on the door. He sets the table back up and opens the door to reveal a beautiful woman.]\nRoss: Hello.\nWoman: Hi, is uh Phoebe here?\nRoss: Uh no-no, she-shes out for the night.\nWoman: Ohh great.\nRoss: Can I, can I help you with something?\nWoman: Well, I dont know. Are you a masseur?\nRoss: (deadpan) Yes I am.\nWoman: Great! (Calls down the hall) Dad! (Her old father walks in.) Thank you so much, Ill be back to pick him up in an hour. (She walks away.) \n(Ross isnt happy and closes the door slowly.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 7, "scene_id": "S07E02_007", "location": "Ross's apartment", "scene_description": "Ross is coming out of the living room carrying his salad and a puzzlebeer! Cold beer. And he decides to fold up Phoebes massage table, but being Ross has trouble with it as there is a knock on the door. He sets the table back up and opens the door to reveal a beautiful woman.", "characters": ["Ross", "Woman"], "firestore_path": "/episodes/S07E02/scenes/S07E02_007"}}
{"id": "S07E02_008", "text": "[Scene: A Restaurant, Monica and Chandler are having dinner with her parents.]\nMrs. Geller: So Chandler, youre parents mustve been thrilled when you told them you were engaged.\nChandler: Oh yeah, I should probably call them.\nMr. Geller: I remember when we first got engaged.\nChandler: Oh, I dont think I ever heard that story.\nMonica: Oh dad, really you dont need to\nMr. Geller: (ignoring her) Well, Id gotten Judy pregnant. I still dont know that happened.\nMrs. Geller: (incredulous) You dont know how that happened?! Your dog thought my diaphragm was a chew toy!\nChandler: What a sweet story.\nMonica: Well, at least youre not hearing it for the first time at your fifth grade Halloween party.\nMr. Geller: What?! They wanted a scary story!\nMonica: Anyway, were really excited about our wedding plans, and well I guess pretty soon well be making a big withdrawal from the Monica wedding fund. (Chandler and her laugh, but her parents dont.) What?\nMrs. Geller: You tell her Jack, I cant do it.\nMonica: What happened? You still have the Monica wedding fund dont you?\nMr. Geller: We have it. Only now, we call it the beach house.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 8, "scene_id": "S07E02_008", "location": "A Restaurant", "scene_description": "Monica and Chandler are having dinner with her parents.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E02/scenes/S07E02_008"}}
{"id": "S07E02_009", "text": "[Scene: A Restaurant, scene continued from before the break.]\nMonica: I dont believe you spent my wedding fund on the beach house!\nMrs. Geller: Were sorry honey, but we just assumed if you got married after you turned 30 youd pay for it yourself.\nMonica: You bought the beach house when I was 23!\nMr. Geller: Which means you had seven years of beach fun and you cant put a price on that sweetie.\nMrs. Geller: We really do feel bad about this though.\nMr. Geller: We started saving again when you were dating Richard and then that went to hell, so we redid the kitchen.\nMonica: What about when I started dating Chandler?\nMrs. Geller: Well it was Chandler! We didnt think hed ever propose!\nChandler: Clearly I did not start drinking enough at the start of the meal. (Starts to make up for lost time and takes a big swig of his drink.)\nMonica: I cant believe it! That there is no money for my wedding?!\nMrs. Geller: We might still have some money, if your father didnt think it was a good idea to sell ice over the Internet.\nMr. Geller: It seemed like such a simple idea.\nMrs. Geller: Stupid Jack, the word is stupid.\nMr. Geller: All right, enough! I dont want to hear about it anymore! (Under his breath) Good luck, Chandler. (Chandler takes another drink.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 9, "scene_id": "S07E02_009", "location": "A Restaurant", "scene_description": "scene continued from before the break.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E02/scenes/S07E02_009"}}
{"id": "S07E02_010", "text": "[Scene: Ross's apartment, his massage client is on the table and Ross is reluctantly starting his massage. He spreads some lotion in his hands, and doesnt like it.]\nRoss: Okay! Now, Im going to touch you. (He does so, very gingerly.) Ohh, thats soft. (He starts poking him and notices his salad spoons and starts to massage him with those.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 10, "scene_id": "S07E02_010", "location": "Ross's apartment", "scene_description": "his massage client is on the table and Ross is reluctantly starting his massage. He spreads some lotion in his hands, and doesnt like it.", "characters": ["Ross"], "firestore_path": "/episodes/S07E02/scenes/S07E02_010"}}
{"id": "S07E02_011", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica and Chandler are returning from dinner, Rachel is already there.]\nMonica: I cant believe this. Do you think that your parents could help pay for it?\nChandler: I dont know, my mother spent most of her money on her fourth wedding. Shes saving the rest for her divorce. And any extra cash my father has he saves for his yearly trips to (Pause) Dollywood.\nRachel: Well what happened at dinner?\nMonica: My parents spent the money for our wedding!\nPhoebe: (gasps) My God! What did you order?!\nRachel: Wait, but theres no money! Well this is terrible! You guys are gonna have to get married in like a, rec. center!\nChandler: Honey, its gonna be okay.\nMonica: No! No its not! Its not gonna be okay! It sucks! No swing band! No lilies!\nRachel: No, yknow what? Its gonna be okay. I mean you dont have to have this rustic Italian feast. Yknow? And-and you dont need, you dont need this custom-made, empire waisted, duchess, satin gown; you can wear off the rack. (She starts to cry, as does Monica.)\nChandler: Look, it really is gonna be okay. The important thing is that we love each other and that were gonna get married.\nRachel: Do you even understand what off the rack means?!\nPhoebe: Look, why dont you just pay for it yourself?\nMonica: How? I dont have any money.\nChandler: Well, I have some.\nMonica: How much?\nChandler: Well, close to (Notices Rachel leaning in to hear and decides to write it on a piece of paper and hand it to Monica as Phoebe averts her eyes.) \nMonica: Whoa!!! Are you kidding me?!\nRachel: Well what?! How-how much is it?!\nMonica: Its enough for wedding scenario eight.\nRachel: Ohh! (Whispers.) Really?!\nMonica: (To Chandler) How great are you, you little saver?! I mean, the-the amount you have is exactly the budget of my dream wedding!\nRachel: (starting to cry) Ohh, you guys are so made for each other.\nChandler: Well, youre not suggesting that we spend all of the money on the wedding?\nRachel and Monica: Ah, yeah!\nChandler: Well, come on, Ive been saving this money for six years and I kinda had some of it earmarked for the future, not just for a party.\nPhoebe: (reading the slip of paper) Wow! (In a sultry voice) Hello, Mr. Chandler.\nMonica: This is the most special day of our lives.\nChandler: No, I realize that honey, but Im not gonna spend all of the money on one party.\nMonica: Honey, umm I-I love you, (laughs) but umm, if you call our wedding a party one more time, you may not get invited. Okay? (Laughs) Listen, we could always earn more money, okay? But uh, were only gonna get married once.\nChandler: Look, I understand, but I have to put my foot down. Okay? The answer is no.\nMonica: You-youre gonna have to put your foot down?\nChandler: Yes, I am!\nPhoebe: Wow, money and a firm hand. Finally a Chandler I can get on board with.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 11, "scene_id": "S07E02_011", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica and Chandler are returning from dinner, Rachel is already there.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Rachel and Monica"], "firestore_path": "/episodes/S07E02/scenes/S07E02_011"}}
{"id": "S07E02_012", "text": "[Scene: Central Perk, Joey and Ross are there as Rachel enters and sees Joey sitting there.]\nJoey: Hey Rach.\nRachel: (quietly) Joey.\nJoey: Hey Rach, do you smell smoke?\nRachel: Uh-huh, I get it, smoke, chimney, chimney sweep, very funny, ha-ha.\nJoey: No-no-no, Im serious. You dont smell it? Somethings on fire.\nRachel: Well no, I dont smell anything.\nJoey: Oh, yknow what? Its probably just your burnin loins.\nRoss: (sitting down) Hey, what are you guys, what are you guys talking about?\nRachel: Nothing!\nRoss: (takes a drink) Damn, this coffees cold! Hey Rach, do you mind if I heat this up on your loins? (Joey and he both laugh.)\nRachel: Yknow, I can not believe you told him, Joey!\nRoss: So I guess you bought that book after we broke up huh?\nRachel: Uh-huh, yeah I did, because I wore out my first copy when I was with you. (Exits.)\nRoss: (chases her) Oh yeah, yeah? Well uh, when we were going out, I read tons of porno magazines! (Realizes a table of women overheard him.) (To that table.) Sup?\nPhoebe: (entering) Ross! How could you do that to an old man?!\nRoss: (looking at the table) Excuse me ladies. (To Phoebe) Im sorry?\nPhoebe: My massage client, Arthur? His daughter called and said that some guy that worked for me gave him a really weird massage this afternoon.\nRoss: (incredulous) I gave him an extremely professional massage!\nPhoebe: He said you poked at him with wooden spoons.\nRoss: Okay, so it wasnt uh, a traditional massage. But I did give him accu-pressure with a pair of chopsticks. And, and I gently exfoliated him with, with a mop.\nPhoebe: Well, hes never coming back! Okay? You just cost me eight dollars a week!\nRoss: Hey, yknow what? This is your fault! Youre the one that didnt move his-his appointment.\nPhoebe: Oh, its my fault?! You didnt have to massage him! You couldve sent him away! You couldve not rolled Tonka trucks up and down his back!\nRoss: He said he liked that!! Oh youre right, youre right. Im sorry.\nJoey: Dude, what are you massaging an old man for?\nRoss: His daughter was hot.\nJoey: Gotcha.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 12, "scene_id": "S07E02_012", "location": "Central Perk", "scene_description": "Joey and Ross are there as Rachel enters and sees Joey sitting there.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E02/scenes/S07E02_012"}}
{"id": "S07E02_013", "text": "[Scene: Monica, Chandler, and Phoebe's, Chandler is looking at the wedding book as Monica enters.]\nMonica: Hey.\nChandler: Hey.\nMonica: Listen umm, Ive been thinking, its not fair for me to ask you to spend all of your money on our wedding. I mean, you work, you work really hard for that.\nChandler: Ehh.\nMonica: Eh, you work for that.\nChandler: Look, I thought about it too, and Im sorry. I think we should spend all of the money on the wedding.\nMonica: You do?!\nChandler: Yeah, Im putting my foot down. Yeah look, when I proposed I told you that I would do anything to make you happy, and if having the perfect wedding makes you happy then, then thats what were gonna do.\nMonica: Oh, youre so sweet. (They hug and kiss.) Oh, but wait, what about our, what about the future and stuff?\nChandler: Eh, forget about the future and stuff! So we only have two kids, yknow? Well pick our favorite and that one will get to go to college.\nMonica: You thought about that?\nChandler: Yeah.\nMonica: How many kids were we gonna have?\nChandler: Uh, four, a boy, twin girls and another boy.\nMonica: What else did you think about?\nChandler: Well, stuff like whered we live, yknow? Like a small place outside the city, where our kids could learn to ride their bikes and stuff. Yknow, we could have a cat that had a bell on its collar and we could hear it every time it ran through the little kitty door. Of course, wed have an apartment over the garage where Joey could grow old.\nMonica: (laughs) Yknow what? I-I dont want a big, fancy wedding.\nChandler: Sure you do.\nMonica: No, I want everything you just said. I want a marriage.\nChandler: You sure?\nMonica: Uh-hmm.\nChandler: I love you so much.\nMonica: I love you. (They kiss.) Hey listen umm, when, when you were talkin about our future you said cat, but you meant dog right.\nChandler: Oh yeah, totally!\nMonica: Oh good.\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 13, "scene_id": "S07E02_013", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Chandler is looking at the wedding book as Monica enters.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E02/scenes/S07E02_013"}}
{"id": "S07E02_014", "text": "[Scene: Joey and Rachel's, Rachel is balancing her checkbook as Joey enters from his room wearing a hockey helmet, gloves, and shin guards.]\nJoey: Hello, Zelda.\nRachel: Who are you supposed to be?\nJoey: The vicar!\nRachel: Do you even know what a vicar is?\nJoey: Like a goalie, right?\nRachel: (sarcastically) Yeah. Look Joey, its enough all right?! You keep making these stupid jokes and this sleazy innuendoes and itsIm notits just not funny anymore!\nJoey: All right, Im sorry. Rach IRach Im sorry. Okay? Im sorry! Maybe I can make up for it by, taking you roughly in the barn. (Giggles.)\nRachel: All right! Yknow what? Thats it! You wanna do it?! Lets do it!\nJoey: Huh?\nRachel: (starting to move closer to him) Thats right, I wanna do it with you! Ive been trying to fight it, but you just said all the right things.\nJoey: (nervously backing away) I-I-I-I did? (He puts a stool in front of her.)\nRachel: (moves the stool out of the way) Yeah! Ohh, Ive been waitin so long to get on that body!\nJoey: This body? (He backs into the kitchen.)\nRachel: Yeah thats right! Come on Joey; sex me up!\nJoey: Hey-hey, youre startin to sound like the butchers wife there in-in chapter seven.\nRachel: Oh, come on now, dont keep me waiting. Get those clothes off! But, I would keep that helmet on because youre in for a rough ride! (He backs into the door.)\nJoey: I dont want to, Im scared.\n(Rachel walks away, pleased with her self.)\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 2, "episode_id": "S07E02", "episode_title": "THE ONE WITH RACHELS BOOK", "scene_number": 14, "scene_id": "S07E02_014", "location": "Joey and Rachel's", "scene_description": "Rachel is balancing her checkbook as Joey enters from his room wearing a hockey helmet, gloves, and shin guards.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E02/scenes/S07E02_014"}}
