{"id": "S07E23_001", "text": "THE ONE WITH MONICA AND CHANDLER'S WEDDING: Part 1\nOriginally written by Ira Ungerleider. Teleplay by Brown Mandell. Transcribed by Eric B Aasen. HTMLed by guineapig.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 23, "episode_id": "S07E23", "episode_title": "THE ONE WITH MONICA AND CHANDLER'S WEDDING: Part 1", "scene_number": 1, "scene_id": "S07E23_001", "location": "", "scene_description": "", "characters": [], "firestore_path": "/episodes/S07E23/scenes/S07E23_001"}}
{"id": "S07E23_002", "text": "[Scene: Central Perk, the whole gang is there as Joey enters]  \nRACHEL: Hey Joey, how'd the audition go?  JOEY: Incredible! I met the director this time and you'll never believe who it was.  ALL: Who?  JOEY: All right. I'll give you one hint. Warren Beatty.  \nALL: Wow!  \nJOEY: Yeah, there's just one thing that might be kind've a problem. See, I, uh, had to kiss this guy.  \nCHANDLER: 'Cause he was just so darn cute.  JOEY: No, as part of the audition. See, I'm up for this part of this guy, who the main guy kisses.  \nROSS: Well, hey. You're an actor, I say you just suck it up and do it. (Rachel looks at him in disbelief) Or you just do it.  \nJOEY: I did do it, I'm a professional.  \nMONICA: Then what's the problem?  JOEY: See after the scene, Mr. Beatty comes up to me and says 'good actor, bad kisser'. Can you believe that, me not a good kisser, that's like, like Mother Theresa, not a good mother.   \nPHOEBE: Well, come on, who cares what that guy thinks. What does Warren Beatty know about kissing (Chandler and Monica, give her a look that says 'think about it') Ooh.  \nOPENING CREDITS  [Scene: continued from earlier]  \nCHANDLER: Hey, what did your agent say?  JOEY: Yep, this kiss thing is defiantly a problem, Mr. Beatty wants to see it again on Monday. Man, I gotta figure out what I'm doing wrong. Oh, okay, one of you girls come over here and kiss me.  \nMONICA: What, forget it!  RACHEL: Yeah, right.  JOEY: Come on, I need your help here.  \nPHOEBE: All right. I'll do it, I kissed him before I can do it again.  \nJOEY: You see this, this is a friend.  \nPHOEBE: Uh-huh, let's go. (they move in to kiss) Oh, wait I have gum. Okay. (they kiss rather passionately) Good, very good, firm but tender. I'd recommend you to a friend.  \nJOEY: Then I don't know what it is. What's the problem?  MONICA: Joey, you know, maybe your just not used to kissing men, maybe you just tensed up a little, maybe that's what you need to work on.  JOEY: Yeah, that makes sense. (looks at Ross)  \nROSS: Over my dead body! (Joey looks at Chandler)  CHANDLER: And I'll be using his dead body as a shield.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 23, "episode_id": "S07E23", "episode_title": "THE ONE WITH MONICA AND CHANDLER'S WEDDING: Part 1", "scene_number": 2, "scene_id": "S07E23_002", "location": "Central Perk", "scene_description": "the whole gang is there as Joey enters", "characters": ["ALL", "CHANDLER", "JOEY", "MONICA", "PHOEBE", "RACHEL", "ROSS"], "firestore_path": "/episodes/S07E23/scenes/S07E23_002"}}
