{"id": "S07E20_001", "text": "THE ONE WITH RACHELS BIG KISS\nWritten by: Shana Goldberg-Meehan and Scott Silveri Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 1, "scene_id": "S07E20_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E20/scenes/S07E20_001"}}
{"id": "S07E20_002", "text": "[Scene: Central Perk, Joey, Monica, and Rachel are sitting on the couch and Ross is sitting on the chair, and theyre all talking.] \nRachel: Hey! Out of all of us, who do you think is gonna get married next?\nJoey: Probably Monica and Chandler.\n(A woman walks up to Gunther in the background.)\nWoman: (to Gunther) Hi. Could I have a pack of Newport Lights, please?\nGunther: Oh umm, uh we dont sell cigarettes, but they have them at the newsstand across the street. (Points.)\nWoman: Thatd be great, thanks. (Gunther goes and gets them.)\nRachel: (to the gang) Oh my God, Melissa Warburton. I dont think I have the energy for this.\nMelissa: (Gasps when she notices Rachel) Oh my God! Ray-ray Green?! (Screams)\nRachel: (screaming) Melissa!\nMelissa: You have been M.I.A for the past seven sorority newsletters, whats up with you?!\nRachel: Wh(Turns and looks at the gang whos staring)Why dont I tell you over here? (She walks Melissa away from the gang.)\nMelissa: So last I heard you were gonna get married. (Grabs Rachels hand and notices that she doesnt have a ring on it.) (Sadly) Oh poor Ray-ray.\nRachel: Oh no-no, no! Its good! Its all good! I-I actually work at Ralph Lauren!\nMelissa: Shut up!\nRachel: I will not! Im the divisional head of mens sportswear!\nMelissa: Oh shut up more! Now, are you friends with Ralph?\nRachel: Oh please\nMelissa: (excitedly) Are you?!\nRachel: No.\nMelissa: Listen, we-we have to have dinner. What-what are you doing tomorrow night?\nRachel: Oh tomorrow, oh I dont know. Um\nMelissa: You do now. Youre having dinner with me.\nRachel: Shut up.\nMelissa: I-Ive got to go. This has been so great Ray-ray! (Gunther returns with her cigarettes.) Oh, there you are. (Takes them from Gunther.) (To Rachel) Umm, so listen, just call me. Heres my card. (Hands the card over.)\nRachel: Oh, wow thanks! (Reading the card) Oh youre in real estate!\nMelissa: Oh no, thats-thats an old card. Umm, I wanted to get out of that and-and do something where I can really help people and-and make a difference.\nRachel: Wow! What do you do now?\nMelissa: (quietly) Im a party planner. Ill see you tomorrow. (Exits.)\nRachel: Okay! (Joins the rest of the gang.)\nJoey: Hey guys! Look whos back! Its Ray-ray!\nRachel: Shut up that was my friend Melissa from college.\nRoss: She seems really, really fun!\nRachel: Shes actually very sweet and we used to be very close.\nMonica: Wait a minute, she isnt Shes not the one who you\nJoey: (excitedly) Who you what? Who you what?!\nRachel: (To Monica) Yes.\nMonica: Wow!\nJoey: (excitedly) Wow? Wow what?! Wow what?! Who youwhat?!!\nRachel: Its not a big deal!\nMonica: (To Joey) They were lovers.\nRoss: What?!\nJoey: What?!\nRachel: No we werent! It was nothing! It was one night, senior year we went to a party, had a lot of sangria and yknow, ended upkissing for a bit.\nRoss: So thats two of my wives.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 2, "scene_id": "S07E20_002", "location": "Central Perk", "scene_description": "Joey, Monica, and Rachel are sitting on the couch and Ross is sitting on the chair, and theyre all talking.", "characters": ["Gunther", "Joey", "Melissa", "Monica", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S07E20/scenes/S07E20_002"}}
{"id": "S07E20_003", "text": "[Scene: Monica and Chandler's, Monica is working on the seating chart while Chandler looks on and Rachel reads.]\nMonica: (telling Chandler the seating arrangement) Okay so this is where the band is. (Points.) And this is where the bar is. (Points) And all these pins have peoples names on them. (She has pins to show the seating at each of the tables.) And Rach, here you are. (Points to Rachels place.)\nRachel: Oh wow. Why dont we just take me (Grabs her pin) and put me with a Manhattan in my hand, talking to the cute bartender. (Puts her pin at the bar and laughs. Monica just glares at her.) These pins arent for playing are they?\nMonica: (To Chandler) Okay, the red ones are my guests and the blue ones are yours.\nChandler: This is so sad. I mean, I only have like ten pins.\nMonica: Chandler, relax its not a contest. (To Rachel) Certainly not a close one.\nJoey: (entering) Hello!\nRachel: Hey!\nJoey: Hey Rach. (Stares at her.) \nRachel: Stop picturing it!!\nMonica: Okay, I think thats it. The seating chart is done. This is our wedding. They all look like theyre having fun dont they?\nJoey: Hey, so where are my parents gonna be?\nMonica: Oh! (Gets up) Lets see, wellif this is the wedding hall then umm (Walks away) youre parents will be at home in Queens.\nJoey: What theyre not invited?! Oh no, thats terrible! Theyre gonna be crushed!\nMonica: Why would they think theyre invited?\nJoey: (looking around) You got me. I dont\nMonica: Joey!\nJoey: Well, Im sorry. I thought parents were coming! Yknow? Your parents are comin! Chandlers parents are comin! Rosss parents are comin!\nMonica: Rosss parents are my parents!\nJoey: Well-wellsee? Parents are comin!\nChandler: Yknow I think we should invite them.\nMonica: Oh please, you just want more blue pins.\nChandler: Well this is just sad!\nMonica: All right, all right. Maybe I can fit them in if I just do some rearranging. But uh, Rachel may actually have to sit at the bar!\nRachel: That is not a problem.\nJoey: (leaning down to her) Maybe youll order a little sangria?\nRachel: Oh, get out of here! (Jumps back and walks away.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 3, "scene_id": "S07E20_003", "location": "Monica and Chandler's", "scene_description": "Monica is working on the seating chart while Chandler looks on and Rachel reads.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_003"}}
{"id": "S07E20_004", "text": "[Scene: Ralph Lauren, Rachel is showing Chandler the selection of tuxedos.]\nRachel: (motioning to a rack) So now, these are all the tuxedos that we make and if theres anything that you like, we can make you a deal. Anything at all. (Grabs a few) But these are the three that Monica pre-approved.\nChandler: Well, thanks a lot for hookin me up Rach. I want you to know that I want you to attend our wedding as my guest.\nRachel: Im Monicas maid of honor. Okay? Dont try to blue pin me!\nChandler: (sees another rack) Well, whats the deal with these? These-these look nice.\nRachel: Oh they are nice. We-we custom-make tuxedos for celebrities and then when theyre done with them they just send em back.\nChandler: You mean like for award shows?\nRachel: Some of them.\nChandler: You mean these tuxes have been down the red carpet with people yelling, \"You are you wearing?! You look fabulous!\"\nRachel: Honey, might I suggest watching a little more ESPN and a little less E!?\nChandler: Okay, who wore those? (Points to the tuxedos.)\nRachel: Umm, well lets see uh, this one is Tom Brokaw.\nChandler: Not bad.\nRachel: (reading a tag) This one is uh Paul ONeil.\nChandler: Whos that?\nRachel: He plays for the Yankees. Seriously, ESPN! Just once and a while, have it on in the background. (Chandler nods and Rachel grabs another tux) Ooh, this one was Pierce Brosnan!\nChandler: Pierce Brosnan?\nRachel: Uh-huh.\nChandler: Are you serious?\nRachel: Yeah.\nChandler: 007?! This is James Bonds tux?!\nRachel: Yeah.\nChandler: Oh, I have to get married in James Bonds tux!\nRachel: Its a pretty cool tux.\nChandler: Oh, its not just that, I would be Englands most powerful weapon. Jet setting heartbreaker on her majestys secret service. A man who fears no one; with a license to kill. (Worried.) Would Monica let me wear this?", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 4, "scene_id": "S07E20_004", "location": "Ralph Lauren", "scene_description": "Rachel is showing Chandler the selection of tuxedos.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_004"}}
{"id": "S07E20_005", "text": "[Scene: Joey and Rachel's, Joey and Phoebe are moving chess pieces around on the board and hitting the timer at random.]\nJoey: We should really learn how to play the real way. (Moves another piece.)\nPhoebe: I like our way. Oh! (Grabs a piece and jumps a bunch of Joeys like in Checkers.) Chess!\nJoey: Nice move.\nPhoebe: Yeah.\nRachel: (entering) Hey!\nJoey: Hey!\nPhoebe: Hey!\nRachel: So Joey I just hooked Ross and Chandler up with some tuxedos for the wedding, do you need one?\nJoey: No, Im performing the ceremony. Im not wearing a tux.\nRachel: Well, what are you going to wear?\nJoey: Multi-colored robes! Ooh, and maybe a hat.\nRachel: Huh. Does Monica know about this?\nJoey: I dont think so.\nRachel: Can I please be there when you tell her? (Joey nods yes.)\nPhoebe: Hey oh, Rach wait! Do you want to go to a movie tonight?\nRachel: Oh, yknow what? I cant. I have to have dinner with that Melissa girl.\nJoey: (excitedly) Can I come?! I wont even talk! Youll just hear the noise from my video camera.\nPhoebe: What is this? Whats going on?\nJoey: Oh good! Can I tell her?! Can I tell her?!\nRachel: Well, do you want to hear what actually happened or Joeys lewd version?\nPhoebe: Joeys!\nJoey: Okay\nRachel: Hey, come on! I had this friend from college and I made the stupid mistake of telling Joey that one timeshe and I yknowkissed a little bit.\nPhoebe: (laughs) Yeah, Im sure that happened.\nRachel: It-it did!\nPhoebe: Sure!\nJoey: Hey. (Laughs then seriously) It happened!\nRachel: Yeah, it was senior year in college. It was after the Sigma Chi luau and Melissa and I got very drunk! And we ended up kissing! For several minutes! \nPhoebe: (To Joey) Which means she had a couple spritzers and a quick peck on the cheek.\nJoey: Why are you taking this away from me?\nRachel: Yeah, why is it so hard for you to believe?!\nPhoebe: Okay! I justI didnt know that you are a lesbian. (Joey smiles and nods lewdly.)\nRachel: Im not saying that Im a lesbian! Im just saying that this happened!\nPhoebe: Okay, it just seems pretty wild and youre soyknow sovanilla.\nRachel: (shocked) Vanilla?!\nPhoebe: Yeah.\nRachel: Im not vanilla! Ive done lots of crazy things! I mean I got-I got drunk and married in Vegas!\nPhoebe: To Ross.\nRachel: All right, yknow what? If you dont want to believe me about this, why dont you just come with me to dinner tonight and she will tell you.\nPhoebe: Okay! All right! Yeah! Cause I just cant picture it.\nJoey: Oh-ho, you should get inside my head.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 5, "scene_id": "S07E20_005", "location": "Joey and Rachel's", "scene_description": "Joey and Phoebe are moving chess pieces around on the board and hitting the timer at random.", "characters": ["Joey", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_005"}}
{"id": "S07E20_006", "text": "[Scene: Central Perk, Chandler is on the couch reading as Ross enters carrying a garment bag.]\nRoss: Hey! Guess what I got for your wedding! (Holding up his garment bag.)\nChandler: A freakish thin date with a hanger for her head?\nRoss: No. Rachel hooked me up with a tux! But not just any tux, Batmans tux!\nChandler: What?\nRoss: Thats right! Made expressly for Val Kilmer and worn by him in the hit filmthat Batman film he was in.\nChandler: You cant wear that! Im wearing the famous tux! James Bonds tux!\nRoss: So?\nChandler: SoIf you wear that youll make mine less special.\nRoss: Well, you need something to make this day special? Hello! You-you-you have the most special thing of all! You are marrying the woman you love.\n(Chandler mimics him.)\nChandler: Please, dont take away my cool thing. Please?! Pretty please?!\nRoss: Pretty please? Not very uh, 007.\nChandler: Look, its my wedding day okay? If you were getting married I would never do anything to upset you.\nRoss: When I got married you slept with my sister.\nChandler: That was pretty 007.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 6, "scene_id": "S07E20_006", "location": "Central Perk", "scene_description": "Chandler is on the couch reading as Ross enters carrying a garment bag.", "characters": ["Chandler", "Ross"], "firestore_path": "/episodes/S07E20/scenes/S07E20_006"}}
{"id": "S07E20_007", "text": "[Scene: Monica and Chandler's, Monica is still working on the seating chart as Joey enters.]\nJoey: Hey.\nMonica: Hey. Oh good-good youre here! All right, I figured it out. Im gonna take two tables of eight, Im gonna add your parents, and Im gonna turn them into three tables of six. Okay? And I called the caterer; I added two extra meals, we are good to go!\nJoey: Yeah, theyre not coming.\nMonica: (looking at him) What?!\nJoey: Somehow they got the idea that you only invited them because of me. Theyfeel a little unwanted.\nMonica: Oh thats too bad. Its true, but too bad.\nJoey: Look Mon, if you could just call my mom\nMonica: Oh Joey!\nJoey: Come on! Look just-just telllet her know that you really want them to be there. Lets not forget, this is a woman that has sent you many lasagnas over the years.\nMonica: No she hasnt.\nJoey: Is it her fault that some of them didnt make it to you?\nMonica: Well, what am I going to say?\nJoey: I dont know. Just uh, just tell em it was a mix-up with the invitations, orNo-no-no! Blame it on the post office. They hate the post office. And the Irish! But I dont think you can blame it on them so (He dials the phone and hands it to Monica.)\nMonica: (on phone) Hello? (Listens) Yeah, hi! Mrs. Tribbiani? (Listens) Hi, this is Monica Geller. (Listens) Yeah Im just calling to say that Chandler and I uh, really hope you can make it to the wedding. Yeah, apparently a bunch of invitations that we sent werent delivered. Umm, I guess there was some screw up at the damn post office! (Joey nods his approval.) (Listens) T-Tell me about it! (Listens) Yeah, yeah, the US Post Office? No, more like US lost office! (Listens) What are they Irish?! (Joey gives her a thumbs up.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 7, "scene_id": "S07E20_007", "location": "Monica and Chandler's", "scene_description": "Monica is still working on the seating chart as Joey enters.", "characters": ["Joey", "Monica"], "firestore_path": "/episodes/S07E20/scenes/S07E20_007"}}
{"id": "S07E20_008", "text": "[Scene: A restaurant, Melissa, Rachel, and Phoebe are talking.]\nMelissa: anyway, his name is Allan and weve been going out for three years. He was my first client when I became a party planner. He was planning a party for his girlfriend at the time. Oh well. (Rachel and Phoebe politely laugh) And he was Theta Beta Pi at Syracuse.\nRachel: Oh. Oh, thats great!\nMelissa: Hmm Phoebe, were you ever in a sorority?\nPhoebe: Of course! Yeah, I was uh, umm Thigh Mega Tampon.\nMelissa: What one?\nPhoebe: Yeah! Yknow, we were really huge too, but then they had to shut us down when Regina Philange died of alcohol poisoning.\nMelissa: Oh, isnt a shame when one girl ruins it for the whole bunch? (Phoebe agrees by grunting.)\nRachel: (changing the subject) Anyway, speaking of drinking too much. I was uh, tellin Phoebe about that one crazy night after the Sigma Chi luau where you and I uh, we made out.\nMelissa: (shocked) What?\nRachel: Remember?! Wecome on both had the sarongs on, and we had the-the coconut bikini tops\nMelissa: Yeah?\nRachel: we went back the house and we got really silly and wewe made out.\nMelissa: Oh wow, Ray-ray I have no idea what youre talking about.\nPhoebe: Really?!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 8, "scene_id": "S07E20_008", "location": "A restaurant", "scene_description": "Melissa, Rachel, and Phoebe are talking.", "characters": ["Melissa", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_008"}}
{"id": "S07E20_009", "text": "[Scene: Monica and Chandler's, Monica is on the couch as Chandler disgustedly enters.]\nChandler: Ross is Batman!\nMonica: Well, he did manage to keep his identity secret for a long time.\nChandler: Rachel got Ross the tuxedo that Val Kilmer wore in Batman. Okay Batman is so much cooler than James Bond!\nMonica: What are you talking about?! 007 has all those gadgets!\nChandler: Batman has a utility belt!\nMonica: 007 has a fancy car!\nChandler: Batman has the Batmobile!\nMonica: 007 gets all the ladies.\nChandler: Batman has Robin! (Pause) We get ESPN right?\nMonica: How about you go put on your 007 tuxedo and Ill make you a nice martini.\nChandler: Actually, I dont like martinis.\nMonica: How about a Youhoo with a funny straw?\nChandler: Ooh, yum! (Runs into the bedroom.)\nJoey: (entering) Hey.\nMonica: Hey.\nJoey: Listen, I know the invitation says 6:00, but does that mean that you want people to get there at six, or the show is gonna start right at six?\nMonica: The show?!\nJoey: Right. Right. The wedding, gotcha. But I mean, its gonna start a little late right? I mean, weddings start late. Right?\nMonica: Have you ever been to one of my weddings?\nJoey: Ah. Yeah. Well look, the thing is its the same day as my nieces christening and I really want my parents to be there in time to see me. Cause my parts just in the beginning Im not even in the rest of the showWedding!\nMonica: The wedding starts at six.\nJoey: Okay. Okay, I totally hear ya. Oo how about this? I vamp a little til they get there?\nMonica: Youll vamp?!\nJoey: Yeah! Yeah yknow, like warm up the crowd. Ask em where theyre from. Cause in Joey Tribbiani you get a minister and you get an entertainer. Im a minis-tainer! (Rapping) There is no one better! There is no one greater!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 9, "scene_id": "S07E20_009", "location": "Monica and Chandler's", "scene_description": "Monica is on the couch as Chandler disgustedly enters.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S07E20/scenes/S07E20_009"}}
{"id": "S07E20_010", "text": "[Scene: The restaurant, continued from earlier.]\nRachel: How can you not remember us kissing?!\nMelissa: I dont know. I dont remember a lot of things that never happened.\nRachel: Wh Come on! Remember? We were on the sleeping porch! We couldnt stop giggling? And our coconuts kept knockin together?\nPhoebe: Oh, somewhere Joeys head is exploding.\nRachel: Yeahbut come onListen, Im sorry I dont want to make you uncomfortable, but I told Phoebe that it happened and she doesnt believe me.\nMelissa: Im sorry Ray-ray. I mean if I thought it happened I would say it. Maybe I passed out and you did stuff to me while I was sleeping.\nRachel: No!!\nPhoebe: Rachel, its okay. You dont have to do this. I believe you. All right? Okay, if-if you say that you kissed Melissa, then you kissed Melissa.\nRachel: Thank you Phoebe.\nMelissa: She didnt.\nPhoebe: I know.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 10, "scene_id": "S07E20_010", "location": "The restaurant", "scene_description": "continued from earlier.", "characters": ["Melissa", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_010"}}
{"id": "S07E20_011", "text": "[Scene: Monica and Chandler's, Monica and Chandler are working on the seating chart as Ross enters carrying his tux around.]\nRoss: Hey!\nMonica: You just carry that around?\nRoss: Yes. I find it to be something of a conversation piece. \nMonica: Between you and\nRoss: Gunther. (To Chandler) Hey-hey! Why dont we put them on? Yknow get a picture of Batman and James Bond together.\nChandler: I would but mine doesnt fit. The pants are a little tight.\nMonica: A little tight? I could see double-oh and seven in those pants.\nRoss: Well that stinks. I was looking forward to us wearing our celebrity tuxes together.\nChandler: Well, does that mean that youre not going to wearing yours?\nRoss: What are you kidding? Its Batmans tux!!\nChandler: (standing up) Let me try it on!\nRoss: Okay, but just the jacket. Double-oh and seven are not gettin in there.\nChandler: (trying on the jacket) Okay. Holy double-vented comfort Batman! (Finds something in the pocket) Whats this?\nRoss: What?\nChandler: An invitation for the At First Sight premiere? Oh my God! Val Kilmer didnt wear this in Batman! He wore it to the premiere of some tooty-fruity love story where he played a blind guy!\nRoss: Let me see that! (Grabs the invitation and reads it.) Oh man!\nChandler: The only superpower you have is a slightly heightened sense of smell. (Hands him the jacket and walks away.)\nJoey: (entering) Hey! Uh, Monica? Chandler? Can I talk to you guys for a second?\nMonica: All right thats it, I give up! Whatever you want you can have it! You wanna sing a song? You wanna do a dance? You want your mom stand at the Alter and scream racial slurs? I dont care!\nJoey: No! No, I-I just wanna thank you guys for what you did for my parents, that was really sweet. Theyre so happy they get to be a part of your special day.\nMonica: (defeated) Oh.\nChandler: Well, youre welcome. And tell them were really glad theyre coming.\nJoey: Okay. I will. Ohh! Check out what they got me to wear for the ceremony! (Runs to his apartment and returns wearing a rather silly hat.) Huh? I wear it like this when I marry you guys, and then this (He tilts it to the side of his head) is for party time.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 11, "scene_id": "S07E20_011", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler are working on the seating chart as Ross enters carrying his tux around.", "characters": ["Chandler", "Joey", "Monica", "Ross"], "firestore_path": "/episodes/S07E20/scenes/S07E20_011"}}
{"id": "S07E20_012", "text": "[Scene: Outside the restaurant, Melissa, Phoebe, and Rachel are emerging.]\nRachel: It happened! I am telling you it happened!\nMelissa: Okay. (To Phoebe) Well, it was great meeting you. And uh Rachel, I-I dont think Ill be calling you (hails a cab) because umm, yknow youve gotten weird. (The cab pulls up.) Take care you guys.\n(Shes about to get in when)\nRachel: What?! Wait a minute! No wait a minute! (She does so.) Okay? Look, that night was the one wild thing I have ever done in my entire life, and Im not gonna let you take that away from me! Okay, so if you dont remember that, maybe you will remember this! (She grabs Melissa and kisses her on the lips.)\nMelissa: My God! You love me!\nRachel: (shocked) What?\nMelissa: Of course I remember our kiss. I think about it all the time. I can still hear the coconuts knockin together I (Phoebe is shocked.) I just didnt want to tell you cause I didnt think that youd return my love, and now that you have (Leans in to kiss Rachel.)\nRachel: (moving away) Whoa! Whoa-whoa-whoa-whoa! Whoa! Whoa!\nMelissa: Aww, look whos being suddenly shy. You cant tell me you dont feel what I feel. Nobody can kiss that good and not mean it. (Goes in again.)\nRachel: (moves away again) I-I-I-Im justIm just a good kisser!\nMelissa: (suddenly frightened) Shut up!\nRachel: Im sorry!\nMelissa: (laughs) Oh you dont have to be (Laughs again) sorry. ImIm obviously kidding. Im not in love with you. (To Phoebe) Im not in love with her. I dont hear coconuts banging together. Yeah, I dontpicture your face when I make love to my boyfriend. Anyway, I gotta go. Ehkiss good-bye? (Rachel stares at her stunned.) No? Okay. (Hurries into the cab and drives off.)\nRachel: Wow! I mean I had no idea that that was gonna\n(Suddenly, Phoebe leans in and kisses her on the lips!)\nRachel: What the hell was that?!\nPhoebe: I just wanted to see what all the fuss was about.\nRachel: And?\nPhoebe: Ive had better.\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 12, "scene_id": "S07E20_012", "location": "Outside the restaurant", "scene_description": "Melissa, Phoebe, and Rachel are emerging.", "characters": ["Melissa", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_012"}}
{"id": "S07E20_013", "text": "[Scene: Ralph Lauren, Rachel is hooking Chandler up with another tuxedo.]\nChandler: (yelling from the changing room) All right! I found one that fits!\nRachel: Well yknow what they say, the 23rd times the charm. (Chandler enters.) Aww, look at you all handsome!\nChandler: Whose is it?\nRachel: Oh does it matter?! All that matters is that you look so handsome.\nChandler: Whose is it?\nRachel: I dont want to say.\nChandler: Oh, come on! I dont care! Come on! Whose is it?\nRachel: Diane Keeton.\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 20, "episode_id": "S07E20", "episode_title": "THE ONE WITH RACHELS BIG KISS", "scene_number": 13, "scene_id": "S07E20_013", "location": "Ralph Lauren", "scene_description": "Rachel is hooking Chandler up with another tuxedo.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E20/scenes/S07E20_013"}}
