{"id": "S07E05_001", "text": "THE ONE WITH THE ENGAGEMENT PICTURE\nTeleplay by: Patty Lin Story by: Earl Davis Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 1, "scene_id": "S07E05_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S07E05/scenes/S07E05_001"}}
{"id": "S07E05_002", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica and Phoebe are going through a bunch of pictures as Chandler enters.]\nChandler: Hey.\nMonica: Whats the matter?\nChandler: Someone on the subway licked my neck! Licked my neck!!\nPhoebe: Oh Willies still alive!\nChandler: What are you guys doing?\nMonica: Oh, my mom called, theyre gonna run our engagement announcement in the local paper, so were looking for a good picture of us.\nChandler: Oooh, Im afraid that does not exist.\nMonica: Thats not true, there are great pictures of us!\nChandler: No, there are great pictures of you standing next to a guy whos going like this (Makes what can only be described as a toothy frown. Henceforth, this shall be known as The Face.)\nPhoebe: Oh my God! Thats the creep that youre with at the Statue of Liberty.\nChandler: I dont know what it is, I just cant take a good picture.\nMonica: (looking at one) Oh, heres a great one.\nChandler: Yeah, Im not in that.\nMonica: I know, but look at me all tan.\nPhoebe: Hey, why dont you guys go, get portraits done by a professional photographer.\nMonica: Thats a good idea! I bet they have one of those wind machines! Yknow (Does the whole hair blowing in the wind model type poses.)\nPhoebe: Yeah thats great! Next to that, Chandler wont look so stupid.\nMonica: Chandler what do you say?\nChandler: All right, but I should warn you, Im not going. Im going. (Does The Face while saying that last part.)\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 2, "scene_id": "S07E05_002", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica and Phoebe are going through a bunch of pictures as Chandler enters.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E05/scenes/S07E05_002"}}
{"id": "S07E05_003", "text": "[Scene: Central Perk, Rachel is siting on the couch as Ross and Chandler enter after playing basketball.]\nRoss: (To Chandler) Dude, that reverse lay-up! Oh\nChandler: How about those three pointers?\nRoss: Amazing!\nChandler: And those guys were this (Doing the standard \"This Close\" gesture) close to lettin us play this time too.\n(They both get dejected and go sit down.)\nRachel: Hey look-look, Phoebes talking to uh, Cute Coffeehouse Guy.\nRoss: Oh, you guys call him Cute Coffeehouse Guy, we call him Hums While He Pees.\nChandler: Yes, and we call Ross Lingers In The Bathroom.\nPhoebe: (returning) Hey you guys, Hums While He Pees just asked me out!\nRachel: Hey, I thought that guy was married.\nPhoebe: He is! But hes getting divorcedRoss! Maybe you know him.\nRoss: Its not a club.\nRachel: Phoebe, if this guys going through a divorce, is it such a good idea to start going out with him?\nRoss: Hey, divorced men are not bad men!\nChandler: They have that on the napkins at the club.\nRachel: Oh, I gotta get back to work.\nPhoebe: You dont have to be back for a half-hour!\nRachel: Yeah but, my assistant Tag does sit-ups in the office during lunch. Ohh! I could just spread him on a cracker.\nChandler: Rach, if you have a crush on this guy, why would you hire him? I mean yknow you cant date him right?\nRachel: Oh no, I know that. I know that. Although, we made a joke that we spend so much time together he should call me his work wife.\nRoss: Soon hell be able to call you, that lady he knew who got fired.\nRachel: I am not gonna get fired, because Im not gonna act on it.\nPhoebe: So you wouldnt mind if he was dating someone else?\nRachel: Why? Is he? He is! Isnt he? Hes dating that slut in marketing!\nRoss: Maybe I should open a divorced mens club.\nChandler: Dude that is so sad.\nRoss: I could put uh-uh a basketball court in the back.\nChandler: Could I play?", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 3, "scene_id": "S07E05_003", "location": "Central Perk", "scene_description": "Rachel is siting on the couch as Ross and Chandler enter after playing basketball.", "characters": ["Chandler", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E05/scenes/S07E05_003"}}
{"id": "S07E05_004", "text": "[Scene: Rachels Outer Office, shes returning from lunch to see Tag not doing his sit-ups.]\nRachel: Oh, no sit-ups today Tag?\nTag: I just did them.\nRachel: Oh, well drop and give me ten more!\nTag: What?\nRachel: Uh, I-I had a drink with lunch. Did those cost reports come in?\nTag: Yeah, I filled them out last night?\nRachel: Oh, great could you make me four copies of those?\n(He gets up to make the copies leaving Rachel alone with his stuff. She notices his sweater in his backpack and holds it up to her nose as Melissa, a coworker, walks up.)\nMelissa: Hey Rachel!\nRachel: (startled) Ahh, hi! Hi! Melissa, whats up? Im just uh, about to umm, go out to the store to get some stuff to put in my backpack. Yknow, like dried fruit and granola and stuff. Whats up? (She has put on the backpack.)\nMelissa: Umm, is Tag here?\nRachel: No. Why?\nMelissa: Oh, I was gonna talk to him about doing something tonight.\nRachel: Really?! Got a little crush on Tag there do ya?\nMelissa: Well, weve been flirting back and forth, but I was hoping that tonight it would turn into something a little more than that.\nRachel: Okay, whoa-whoa easy there Melissa! This aint a locker room, okay? But, yknow I remember him saying that-that he had plans tonight.\nMelissa: Oh no!\nRachel: Oh yeah. All right, back to work.\nMelissa: Hey! Isnt that Tags backpack.\nRachel: Yeah Melissa, I dont want to be known as the uh, office bitch, but I will call your supervisor.\n(Melissa beats a hasty retreat.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 4, "scene_id": "S07E05_004", "location": "Rachels Outer Office", "scene_description": "shes returning from lunch to see Tag not doing his sit-ups.", "characters": ["Melissa", "Rachel", "Tag"], "firestore_path": "/episodes/S07E05/scenes/S07E05_004"}}
{"id": "S07E05_005", "text": "[Scene: A Portrait Studio, Chandler and Monica are trying to take their engagement picture. Monica has a beautiful smile, while Chandler isnt.]\nThe Photographer: (taking pictures) Great! Thats great Monica! Great! Now, Chandler, you want to give us a smile?\nChandler: Okay. (Does The Face.)\nThe Photographer: Im sorry, is the seat uncomfortable?\nChandler: No, I am.\nMonica: Chandler, listen to me sweetie, I know you can do this. Okay? You have a beautiful smile.\nChandler: I do? (He smiles, beautifully.)\nMonica: Yeah! (They turn to the camera, and Chandler does The Face again.) All right, maybe you dont have to smile. Lets try something else. Lets try umm, try looking sexy.\nChandler: Okay. (Youll have to see it, I cant describe the face he makes, but it isnt good.)\nMonica: Or not.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 5, "scene_id": "S07E05_005", "location": "A Portrait Studio", "scene_description": "Chandler and Monica are trying to take their engagement picture. Monica has a beautiful smile, while Chandler isnt.", "characters": ["Chandler", "Monica", "The Photographer"], "firestore_path": "/episodes/S07E05/scenes/S07E05_005"}}
{"id": "S07E05_006", "text": "[Scene: Rachels Office, Joey is knocking on the door holding a hand over a spot on his shirt.]\nRachel: Hi Joey! What are you doing here?\nJoey: Uhh, well Ive got an audition down the street and I spilled sauce all over the front of my shirt. (Removes his hand to reveal a huge sauce stain.) You got an extra one?\nRachel: Yeah, sure. Ummhere. (Hands him one.)\nJoey: Great. (He doesnt like it.) You got anything thats not Ralph Lauren?\nRachel: Yeah, I dont think so Joe.\nJoey: All right, I guess this will be fine.\nRachel: Hey, listen umm, what-what are you doing tonight?\nJoey: Nothing, why?\nRachel: How would you feel about taking out my assistant Tag? Ill pay.\nJoey: Huh, Rach I got to say its gonna take a lot of money for me to go out on a date with a dude.\nRachel: Im not asking you to go on a date with him!\nJoey: Really? Cause I could kinda use the money.\nRachel: Joey, just-just he-hes new in town and I know he doesnt have any guy friends. Just take him to like a ball game or something. Ill really appreciate it.\nJoey: Yeah, okay.\nRachel: Yeah?\nJoey: Sure, no problem. (Sees something.) OohHey, donuts!\nRachel: Yeah!\nJoey: Okay. (He grabs a jelly donut, takes a bite, and guess what he spills all over himself. He tries to clean it up and smears it all over the shirt.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 6, "scene_id": "S07E05_006", "location": "Rachels Office", "scene_description": "Joey is knocking on the door holding a hand over a spot on his shirt.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E05/scenes/S07E05_006"}}
{"id": "S07E05_007", "text": "[Scene: A Portrait Studio, Chandler and Monica are still trying to get the picture taken.]\nMonica: I know. Lets try a lookof far offwonderment. Okay, well-well gaze into our future and well think about our marriage and the days to come. (Chandler is still not getting it.) Chandler! What is the matter with your face?! I mean this picture is supposed to say \"Geller and Bing to be married,\" not \"Local woman saves drowning moron!\" (The photographer laughs.) Hey! Dont laugh at him! Hes my drowning moron!\nChandler: Aww! (Smiles.)\nMonica: Thats it! Take it! Take it! Take it!\n(Chandler turns to the camera and does The Face.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 7, "scene_id": "S07E05_007", "location": "A Portrait Studio", "scene_description": "Chandler and Monica are still trying to get the picture taken.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E05/scenes/S07E05_007"}}
{"id": "S07E05_008", "text": "[Scene: Central Perk, Chandler, Monica, and Ross are going over the picture proofs.]\nRoss: I like this one. (Points to it.) It seems to say, \"I love you and thats why I have to kill you.\"\nMonica: They cant all be bad. (To Chandler) Find the one where you make your bedroom eyes. Ohh, there it is.\nChandler: Oh my God! Those are my bedroom eyes?! Why did you ever sleep with me?\nMonica: Do you really want to pull at that thread?\n(Phoebe enters with Hums While He Pees also known as Kyle.)\nPhoebe: Im having a really good time!\nHums While He Pees: Me too! Im sorry that guy in the subway licked your neck.\nPhoebe: Ohh. No thats okay, hes a friend.\nHums While He Pees: Hey uh, I dont mean to be presumptuous but I have these two tickets to the ballroom dancing finals tomorrow night if you want to go?\nPhoebe: Yeah, I Well yknow I-I mean I missed the-the semi-finals, so Id just be lost.\nHums While He Pees: I know its really lame, but I got these tickets from my boss andOh no! No! No! My God!\nPhoebe: Okay, dont freak out. Ill go.\nHums While He Pees: No its Uh, my ex-wife Whitney is out there. I cannot deal with her right now. That woman is crazy!\nPhoebe: Okay, I know. Hold on. (She walks over to the couch.) Hey Ross?\nRoss: Yeah?\nPhoebe: Yeah, umm thats Whitney (Points), Kyles ex-wife out there, now do you think that you can yknow divert her so that we can slip out?\nRoss: What?! No!\nPhoebe: Well okay but I have two tickets to the ballroom dance finals. (She holds up the tickets that Kyle gave her.)\nRoss: Look, I dont think so Pheebs. (Pause) All right, Ill do it. But just because youre a friend. (Grabs the tickets and heads to divert Whitney.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 8, "scene_id": "S07E05_008", "location": "Central Perk", "scene_description": "Chandler, Monica, and Ross are going over the picture proofs.", "characters": ["Chandler", "Hums While He Pees", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E05/scenes/S07E05_008"}}
{"id": "S07E05_009", "text": "[Scene: Ross's apartment, Ross is dancing around his living room as Phoebe enters, catching and startling him.]\nPhoebe: Hi Ginger.\nRoss: All right! I want my key back!\nPhoebe: I dont have it!\nRoss: Its right there! (Points to her hand.)\nPhoebe: Ugh, okay Sherlock! (Hands over the key.)\nRoss: Look, Im sorry but you-you-you better go Pheebs.\nPhoebe: All right, well I just wanted to say thank you though for diverting Kyles ex. \nRoss: Oh yeahNoYoure welcome. Well talk about it later.\nPhoebe: Okay.\n(Ross opens the door to reveal Whitney standing there.)\nRoss: Hi Whitney.\nWhitney: Hi Ross! You ready for breakfast?\nRoss: Yep. (Phoebe slams the door shut.) Okay.\nPhoebe: (To Ross) Kyles ex-wife? You were supposed to divert her not date her!\nRoss: (opens the door and to Whitney) Hi! Im sorry, but can you give me a second while I talk to this woman, who by the way did not spend the night.\nWhitney: Sure.\nRoss: Okay. (Closes the door.) (To Phoebe) I did divert her and we ended up having a great time! Okay?\nPhoebe: Watching ballroom dancing?\nRoss: Yes! Thats where we realized we were both super cool people!\nPhoebe: Well look-look, okay Ross, Kyle just told me some really bad stuff about her.\nRoss: Like what?\nPhoebe: Like shes really mean, and shes over critical, and-andNo! She will paint a room a really bright color without even checking with you!\nRoss: Okay.\nPhoebe: And! She uses sex as a weapon!\nRoss: Fine! Thank you for warning me. At breakfast Ill be on full alert for room painting and sex weapons.\nPhoebe: Youre still gonna go out with her?!\nRoss: Yeah!\nPhoebe: Well, didnt you just hear what I said?!\nRoss: Pheebs come on! I mean, consider the source! Of course her ex-husbands gonna say that stuff. Now, if youll excuse me\nPhoebe: (interrupting him) No listen to me! She is crazy!\nWhitney: (outside the door) Uh, your door isnt sound proof.\nPhoebe: You see? Nothing is good enough for her!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 9, "scene_id": "S07E05_009", "location": "Ross's apartment", "scene_description": "Ross is dancing around his living room as Phoebe enters, catching and startling him.", "characters": ["Phoebe", "Ross", "Whitney"], "firestore_path": "/episodes/S07E05/scenes/S07E05_009"}}
{"id": "S07E05_010", "text": "[Scene: Rachels Office, Tag is arriving as Rachel is standing there.]\nTag: Good morning.\nRachel: Hi Tag! Hey, so did you have fun with uh, with Joey last night?\nTag: Oh yeah! We went to the Knicks game.\nRachel: Ohh thats nice.\nTag: Then we went to this bar and he hooked us up with all these women! \nRachel: Wo-women? You mean like old women?\nTag: Well kinda old, like 30.\nRachel: (Pause) Oh.\nTag: And I never used to be able to just talk to girls in bars, but I got like 20 phone numbers last night.\nRachel: Thats great! Wow man, so Joey mustve really taught you some stuff huh?\nTag: A little.\nRachel: Yeah?\n(A beautiful women walks up.)\nTag: (To her, in the Joey voice) How you doin?\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 10, "scene_id": "S07E05_010", "location": "Rachels Office", "scene_description": "Tag is arriving as Rachel is standing there.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E05/scenes/S07E05_010"}}
{"id": "S07E05_011", "text": "[Scene: Joey and Rachel's, Joey is teaching Chandler how to smile. Chandler is smiling.]\nJoey: See? Thats a great smile! Easy. Natural. Now, pretend I have a camera. (Chandler immediately does The Face.) Youre changing it!\nChandler: I cant help it!\nJoey: All right, all right, all right, all right, you wanna know what I do when I take resume shots?\nChandler: Borrow money from me?\nJoey: Okay, firstfirst of all, you want to make it look spontaneous. I look down (Looks down), look down, keep looking down; then I look up. (Looks up and smiles.) See? All right, now you try. Look down (Chandler looks down), youre looking down, keep looking down\nChandler: Why is there jelly on your shoe?\nJoey: I had a donut. (Chandler nods.)\nRachel: (entering) Hi!\nJoey: Hey!\nChandler: Hey!\nRachel: So uh, heard you had some fun with Tag last night.\nJoey: Yeah! That guys all right!\nRachel: Yeah and you had fun teaching him how to be all Joey.\nJoey: What?\nRachel: Yknow, all the women.\nJoey: Hey well, you cant teach someone to be good with women. Yknow, thats why I never had any luck with Chandler.\nChandler: (Pause) Im right here!\nRachel: All right, would-would you mind just not going out with him again? Okay, just the idea of you and he and all these women, its justAnd I know hes my assistant and I cant date himbut it just bothers me, all right?!\nJoey: Hey! No-no-no-no, you cant take him away from me! I got a great partner to pick up girls with! Finally!!\nChandler: Im still right here!\nRachel: All right, will you, will you at least tell him how hollow and unsatisfying this, dating tons of women thing is!\nJoey: (shocked) What?!\nRachel: I just dont want him to meet anybody until I am over my crushAnd I will get over it. Its-its not like I love him, its just physical! ButI mean I get crushes like this all the time! I mean hell, I had a crush on you when I first met ya!\nJoey: I know, Monica told me.\nChandler: Did you have a crush on me, when you first met me?\nRachel: Yeah. Sure. (Joey nods his head questioningly and Rachel nods no.)\nChandler: Can you people not see me?! (He waves his arms around to get their attention.)\nRachel: (To Joey) So, will you talk to him?\nJoey: I dont know Rach.\nRachel: Oh, come on! Ill give you ten free Ralph Lauren shirts.\nJoey: One! (Pause.) No ten! You said ten! You cant take that back!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 11, "scene_id": "S07E05_011", "location": "Joey and Rachel's", "scene_description": "Joey is teaching Chandler how to smile. Chandler is smiling.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S07E05/scenes/S07E05_011"}}
{"id": "S07E05_012", "text": "[Scene: Central Perk, Joey is there as Tag enters carrying a bag.]\nTag: Hey Joey, you wanted to talk to me?\nJoey: I dont know. You uh, you got something for me?\nTag: Oh, yeah, this is from Rachel.\n(He hands Joey the bag and he quickly counts its contents.)\nJoey: Ten. Okay. Now Tag theres such a thing as to many women.\nTag: Really?\nJoey: Yeah, for you!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 12, "scene_id": "S07E05_012", "location": "Central Perk", "scene_description": "Joey is there as Tag enters carrying a bag.", "characters": ["Joey", "Tag"], "firestore_path": "/episodes/S07E05/scenes/S07E05_012"}}
{"id": "S07E05_013", "text": "[Scene: The Portrait Studio, Monica is waiting for Chandler to make another attempt at taking a good picture.]\nMonica: (seeing him approach) Hey! There you are!\nChandler: There I am!\nMonica: Are you okay?\nChandler: Yeah, Joey said I uh, I needed to relax so he gave me an antihistamine.\nMonica: What?!\nChandler: Yeah, and then I fell asleep on the subway and went all the way to Brooklyn. Brooklyn is f-far!!\nMonica: Chandler, what were you thinking?\nChandler: I dont know, but dont worry, dont worry, because I know how to take a picture now. (They get ready) Okay, see? Look down (Looks down), look down, look down (He falls asleep.)\nMonica: Chandler?\nChandler: (awakens) Yeah! (Looks up and does The Face.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 13, "scene_id": "S07E05_013", "location": "The Portrait Studio", "scene_description": "Monica is waiting for Chandler to make another attempt at taking a good picture.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E05/scenes/S07E05_013"}}
{"id": "S07E05_014", "text": "[Scene: Central Perk, Ross and Phoebe are there.]\nPhoebe: Hi.\nRoss: Hi.\nPhoebe: So, how are things going with crazy? Has she cooked your rabbit yet?\nRoss: Listen, you are hearing one side of the story, okayand F.Y.I she mustve shown Kyle over 30 paint samples before she painted that room! And his response to each one was, \"I dont give a tiny rats ass.\"\nPhoebe: Yeah well, maybe she shouldve spent a little less time decorating and a little more time in the bedroom.\nRoss: Well, I dont think we are gonna have that problem, but maybe thats just because I am not emotionally unavailable!\nPhoebe: You think hes emotionally unavailable?\nRoss: I think he can be.\nPhoebe: Well, maybe he wouldnt be she didnt bring the office home every night!\nRoss: Well, excuse her for knowing what she wants to do with her life!\nPhoebe: Yeah well, she certainly knew what she was doing New Years Eve 1997.\nRoss: (angrily) I knew you were gonna throw that in my face!! That was three years ago! She apologized and she apologized! What more do you want?!!\nPhoebe: (gets up and starts to leave) We want the last six years back!!\nRoss: So do we!! So do we!! (Ross notices a couple has been staring at them.) Im sorry you had to see that.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 14, "scene_id": "S07E05_014", "location": "Central Perk", "scene_description": "Ross and Phoebe are there.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S07E05/scenes/S07E05_014"}}
{"id": "S07E05_015", "text": "[Scene: Rachels Office, Tag is entering.]\nTag: Good morning Rachel.\nRachel: Hi! (He hands her, her mail) Thanks, hey so uh whatd you do last night?\nTag: Went out with Joey.\nRachel: Oh yeah? Another night of birdogging the chickas?\nTag: No. We had a really good talk. I dont think Im gonna do that bar scene anymore.\nRachel: Wow! I did not see that coming.\nTag: Its just not really who I am. Y'know, Ive always been happier whenWhy am I telling you this? You dont care about this stuff.\nRachel: Oh no, yes I do! I do! I mean, come on go on, you were, you were saying I am happier when uh, yknow?\nTag: When Im in a relationship, I love having a girlfriend.\nRachel: Really?\nTag: Someone I can spoil, yknow?\nRachel: Sp-spoil?\nTag: Uh-huh! Let me ask you something?\nRachel: Uh-huh.\nTag: Do you believe that there is one perfect person for everyone?\nRachel: Well, I-Im startin too.\nTag: And if that person is already in your life, you should do something about it right?\nRachel: Yes! Hell yes!\nTag: All right then, its settled.\nRachel: Okay.\nTag: Im gettin back together with my ex-girlfriend.\nRachel: Id love to!\nTag: What?\nRachel: (panics, turns around, picks up the phone, and pretend to talk on it) Hello?! (Listens) Oh, yeah! (To Tag) This is gonna be a while. Excuse me. (Tag leaves and she closes the door behind him, disgustedly.) Yeah!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 15, "scene_id": "S07E05_015", "location": "Rachels Office", "scene_description": "Tag is entering.", "characters": ["Rachel", "Tag"], "firestore_path": "/episodes/S07E05/scenes/S07E05_015"}}
{"id": "S07E05_016", "text": "[Scene: Central Perk, Ross and Phoebe are there again, only now theyre not talking to each other. Phoebe is loudly stirring her coffee.]\nRoss: My God!\nPhoebe: Oh, Im sorry. Is that annoying? And speaking about being selfish in bed, hows Whitney?\nRoss: Well maybe she wouldnt have to be selfish in bed if someone else knew where everything was!\nPhoebe: Oh he knows! (Quietly) For the most part.\n(Kyle and Whitney enter.)\nKyle: Oh hey! Good, youre both here.\nWhitney: We kinda need to talk.\nPhoebe: Both of you together?\nRoss: Wh-whats up?\nWhitney: Well, I went over to Kyles last night to pick up a few things and we got to reminiscing\nKyle: we talked through most of the night and we realized that the reason we were so angry at each other was because there are still feelings there. So (Pause)\nRoss: Oh just say it Kyle!\nKyle: Were gonna give it another try.\nPhoebe: What about her whining and her constant need for attention?!\nWhitney: Im gonna work on that.\nPhoebe: Oh right, because youre so capable of change.\nRoss: (To Whitney) Yknow, he hums when he pees!\nWhitney: I do know.\nRoss: It makes him miss the bowl, but whatever.\nWhitney: Were so sorry. (They get up to leave.)\nRoss: Thats all right, we-we dont need you. In fact, hey Im over it already.\nPhoebe: Yeah, and yknow what? I dont give a tiny rats ass.\nKyle: Yeah, were gonna go. (They leave.)\nRoss: (To Phoebe) Im sorry. Ugh, Pheebs, you were, you were right about her. Yknow, she did try to use sex as a weapon! Yeah, I hurt my back a little.\nPhoebe: Oh. Yknow, he hums while he does other stuff to.\nRoss: Yeah, were better off without them.\nPhoebe: And yknow, even if they break up again, youd better not let him in your sad mens club!\nRoss: Divorced mens club.\nPhoebe: Potato, Potaato. (Shes pronounces potato with the both the short and long As.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 16, "scene_id": "S07E05_016", "location": "Central Perk", "scene_description": "Ross and Phoebe are there again, only now theyre not talking to each other. Phoebe is loudly stirring her coffee.", "characters": ["Kyle", "Phoebe", "Ross", "Whitney"], "firestore_path": "/episodes/S07E05/scenes/S07E05_016"}}
{"id": "S07E05_017", "text": "[Scene: Central Perk, Phoebe, Chandler, and Joey are there as Monica enters with the local paper that has the engagement picture in it.]\nMonica: Hey guys check it out! My mom sent me the paper!\nPhoebe: Ooh, lets see it!\nChandler: Ahhh.\nMonica: Okay. (She opens it up and shows it to them.)\nChandler: Oh yeah, that looks good.\nPhoebe: You guys make a very attractive couple. (The camera cuts to a shot of the picture and we see that Monica is posing with Joey instead of Chandler.)\nJoey: Yeah, we look great together.\nMonica: Yeah, we really do!\nChandler: Okay.\nMonica: Wow! Imagine what our kids would look like!\nJoey: Yknow, we dont have to imagine.\nChandler: Im marrying her.\nJoey: Well just see.\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 5, "episode_id": "S07E05", "episode_title": "THE ONE WITH THE ENGAGEMENT PICTURE", "scene_number": 17, "scene_id": "S07E05_017", "location": "Central Perk", "scene_description": "Phoebe, Chandler, and Joey are there as Monica enters with the local paper that has the engagement picture in it.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E05/scenes/S07E05_017"}}
