{"id": "S07E13_001", "text": "THE ONE WHERE ROSITA DIES\nTeleplay by: Brian Buckner & Sebastian Jones Story by: Sherry Bilsing & Ellen Plummer Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 1, "scene_id": "S07E13_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S07E13/scenes/S07E13_001"}}
{"id": "S07E13_002", "text": "[Scene: Joey and Rachel's, Rachel is trying to move Joeys chair and not having much luck at it as Joey enters.]\nJoey: Hey.\nRachel: Hey.\nJoey: What are you doing?\nRachel: Well, yknow I was thinking of moving the couch over here.\nJoey: (laughs) Why would you want to do that?\nRachel: So that there will be a decent place for me to sit.\nJoey: Rach, there is a decent place to\nRachel: And your lap does not count! Okay? Come on help me move this.\nJoey: No. No. No.\nRachel: No?\nJoey: No. Rosita does not move.\nRachel: Im sorry, Rosita? As in\nJoey: As in Rosita does not move.\nRachel: Joey, its just a chair! Whats the big deal?\nJoey: The big deal is that it is the exact equal distance from the bathroom to the kitchen and its at the perfect angle so you dont get any glare coming of off Stevie.\nRachel: Stevie the TV?\nJoey: (glaring at her) Is there a problem?\nRachel: No! (Joey sets his beer and bag of chips down and heads into his room.) Oh what does he know! Come on Rosita, us chichas got to stick together! (She tries pulling on the back of the chair, until the hinge breaks and the back falls off.) You bitch!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 2, "scene_id": "S07E13_002", "location": "Joey and Rachel's", "scene_description": "Rachel is trying to move Joeys chair and not having much luck at it as Joey enters.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_002"}}
{"id": "S07E13_003", "text": "[Scene: Central Perk, Chandler and Ross are on the couch talking. Phoebe is getting coffee.]\nRoss: Hey, yknow whats weird? After you guys get married, when you introduce me to people youre gonna have to say, \"This is my brother-in-law Ross.\" Not, \"My friend Ross,\" \"brother-in-law Ross.\" Thats weird isnt it?\nChandler: Couldnt I just say, \"This is Ross?\"\nRoss: (disappointed) Sure, do whatever you want.\n(Phoebe sits down between Chandler and Ross.)\nMonica: (entering, carrying a newspaper) Hey Ross! So, I was checking out the uh, real estate section\nRoss: Yeah?\nMonica: Look at this. (Hands him the newspaper.)\nRoss: Oh, it looks like mom and dads house. Oh, it even has a tree with a broken limb out front and the uh, the window in the attic isOh my God!!\nPhoebe: What? What happened to the window in the attic?!\nMonica: I cant believe mom and dad are selling the house!\nRoss: I cant believe they-they didnt even tell us!\nPhoebe: I cant believe I still dont know what happened to the window in the attic!\n(Ross calls his parents on his cell phone.)\nRoss: (on phone) Uh, hello dad! Monica and I just saw the house in the paper! (Listens) Yes were surprised! (Listens) Who did you leave a message with?\nChandler: (knocking on the window while outside) Sorry! (Runs off.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 3, "scene_id": "S07E13_003", "location": "Central Perk", "scene_description": "Chandler and Ross are on the couch talking. Phoebe is getting coffee.", "characters": ["Chandler", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_003"}}
{"id": "S07E13_004", "text": "[Scene: Joey and Rachel's, Joey is examining the injury to Rosita while Rachel is apologizing to him.]\nRachel: Joey, Joey I am so sorry.\nJoey: I told you not to move it! Rach, how would you feel if say, I wanted to move you mom, and you said dont, and I did it anyway and her head fell off?\nRachel: Okay, come onJoey, Ill buy you a new one! All right? Well go down to the store right now and well-well get you a new chair.\nJoey: (slowly turning and glaring at her) Shes not even cold yet!\nRachel: But dont you think Rosita wouldve wanted you to move on? I mean yknow, she did always putyour comfort first.\nJoey: Thats true.\n(Rachel turns for the door and makes the \"Wow!\" face.)\nRachel: (grabbing her coat) Okay? You ready?\nJoey: Yeah, I (Shuts off the TV.) I dont want Stevie to see her like this.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 4, "scene_id": "S07E13_004", "location": "Joey and Rachel's", "scene_description": "Joey is examining the injury to Rosita while Rachel is apologizing to him.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_004"}}
{"id": "S07E13_005", "text": "[Scene: Monica and Chandler's, Ross and Monica are still going on about the house.]\nRoss: I cant believe we have to say goodbye to the house we grew up in. Man, some-some strangers gonna be living in my room.\nMonica: Well, after 15 years of mom and dad keeping it as a shrine to you, its time the velvet ropes came down.\nRoss: They kept your room for a while.\nMonica: Oh please! Dad turned my room into a gym 20 minutes after I moved out! I gotta say, a tanning bed and a stack of Victorias Secret catalogues, not a gym!\nRoss: Come on, you know they love you.\nMonica: As much as they love you?\nRoss: I was their first born! They thought she was barren! Its not my fault.\nPhoebe: (entering) Hey.\nRoss: Hey.\nMonica: Hey!\nPhoebe: Ugh, I hate this year!\nRoss: Whats wrong with this year?\nPhoebe: Well okay, its already February and Ive only given two massages and they were both the worst tippers in the world!\nMonica: That was me and Ross.\nPhoebe: Oh thats right!\nRoss: Hey, yknow if you want to pick up some extra cash? Some friends of mine made good money doing telemarketing.\nMonica: Oh thats a great idea. Youre really good on the phone.\nPhoebe: Yeah and yeah, and it would probably be better than the last telephone job I had. Yknow, I probably wouldnt have to say spank as much. (Monica and Ross are shocked.) \nRoss: What?\nPhoebe: Oh yeah, like you never called!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 5, "scene_id": "S07E13_005", "location": "Monica and Chandler's", "scene_description": "Ross and Monica are still going on about the house.", "characters": ["Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_005"}}
{"id": "S07E13_006", "text": "[Scene: The telemarketing office, Phoebe is getting shown to her desk by the supervisor.]\nSupervisor: So basically this is very easy. You read from the script and try to sell as much toner as you possibly can.\nPhoebe: Okay, I can do that! Oh, by the way, I love my office.\nSupervisor: (laughs) Why dont we do a trial run.\nPhoebe: Oh okay. Umm, all right. (Picks up the phone and starts reading from the script.) Hi, this is Phoebe from Empire Office Supplies, can I speak to your supply manager please?\nSupervisor: Im the supply manager.\nPhoebe: Umm, okay I would like to talk to you about your toner needs.\nSupervisor: We dont need any toner.\nPhoebe: Oh okay, well Im sorry to bother you. Bye-bye. (Hangs up the phone.) Yeah youre right, this is easy.\nSupervisor: Okay, what was wrong with that call?\nPhoebe: Oh well, all rightum, no offense, but you were kind of rude.\nSupervisor: Theyre always going to tell you they dont need toner, but thats okay because whatever they say, you can find the answer to it here in this script.\nPhoebe: Oh.\nSupervisor: So, I think youre ready to sell toner, do you have any last questions?\nPhoebe: No. (Pause) Oh wait yes! I do, I do have one question. What is toner?", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 6, "scene_id": "S07E13_006", "location": "The telemarketing office", "scene_description": "Phoebe is getting shown to her desk by the supervisor.", "characters": ["Phoebe", "Supervisor"], "firestore_path": "/episodes/S07E13/scenes/S07E13_006"}}
{"id": "S07E13_007", "text": "[Scene: Joey and Rachel's, Chandler is entering.]\nChandler: Joey! Joe! (Sees that hes not here and starts investigating. He picks up the bag of chips.) Full bag. (He picks up the beer.) Beers still cold. Something terrible mustve happened here! (He decides its not that important; sits down on Rosita, and the back falls off causing him to flip over.) Oh no-no-no-no-no-no! (Runs over to Stevie.) Stevie, I was never here! (Runs out.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 7, "scene_id": "S07E13_007", "location": "Joey and Rachel's", "scene_description": "Chandler is entering.", "characters": ["Chandler"], "firestore_path": "/episodes/S07E13/scenes/S07E13_007"}}
{"id": "S07E13_008", "text": "[Scene: Ross and Monicas parents garage, Ross and Monica are arriving to go through their things. Mr. Geller is in the garage.]\nRoss: Dad?\nMr. Geller: Im here!\nRoss: (entering with Monica) Hey!\nMr. Geller: Hi. God, it seems like just yesterday you guys used to come out to watch me work.\nRoss: Dad, we-we cant believe youre selling the house.\nMr. Geller: Well, its time for a new family to start their memories here and hopefully their check will clear before they find the crack in the foundation and the asbestos in the ceiling.\nRoss: (To Monica) Lets grab our stuff and get the hell out of here.\nMr. Geller: Im sorry we cant store your childhood things anymore.\nMonica: Oh, thats okay, I cant wait to see everything again! All of the memories\nMr. Geller: Well, I dont know whats in the boxes down here, but I do know there are six or seven Easy Bake Ovens in the attic.\nMonica: I used to love to play restaurant.\nRoss: Yeah, not as much as you used to love to play uncooked batter eater.\nMonica: Hey, it is unreasonable to expect a child to wait for a light bulb to cook brownies! (She goes to the attic.)\nMr. Geller: So, I think youre boxes are over here. (They walk over to them.)\nRoss: Wow! Great! (Finds a pack of cigarettes.) Wait, dad who-whos cigarettes are these?\nMr. Geller: I dont know. They-they must be your mothers, but please, please dont ask her. Ill throw these away. (He puts them in his pocket as Ross finds something of interest in one of his boxes.)\nRoss: Cool! Dad! My report cards! Hey, check this out dad, (reading his grades) Math, A. Science, A. History, A. Gym(He puts it away and finds something else.) Oooh, my rock polisher!\nMr. Geller: Oh look, look theres your old makeup kit!\nRoss: Its a clown kit! Clown kit!\nMr. Geller: Well, the white seems to be untouched. (He throws it back into the box as Mr. Geller moves a tarp and makes a discovery.) Uh-oh.\nRoss: What?\nMr. Geller: Yknow how the garage floods every Spring?\nRoss: How are you ever going to sell this place?\nMr. Geller: I think I accidentally used Monicas boxes to keep the water away from the Porsche.\nRoss: Oh no. Dad! Dad! What(He goes to open one of her boxes and it rips apart.) Oh Godeverythings ruined! Dad, shes gonna be crushed!\nMr. Geller: You dont secretly smoke do you?\nRoss: No!\nMr. Geller: So its just your mother then.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 8, "scene_id": "S07E13_008", "location": "Ross and Monicas parents garage", "scene_description": "Ross and Monica are arriving to go through their things. Mr. Geller is in the garage.", "characters": ["Monica", "Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_008"}}
{"id": "S07E13_009", "text": "[Scene: The telemarketing office, Phoebe is hard at work.]\nPhoebe: (on phone) Hi, this Phoebe from Empire Office Supplies, can I speak to your supply manager please? (Listens) Earl, thanks. (Listens) Hi Earl, this is Phoebe from Empire Office Supplies Id like to talk to you about your toner needs. (Shes reading from the script.)\n[Cut to Earls office, who is played by Jason Alexander, George from Seinfeld. They cut back and forth between Phoebes and Earls offices with each of their lines.]\nEarl: I dont need any toner.\nPhoebe: Im hearing what youre saying, but at our prices everyone needs toner.\nEarl: Not me.\nPhoebe: May I ask why?\nEarl: You wanna know why. You wanna know why?\nPhoebe: I surely do!\nEarl: Okay, I dont need any toner because Im going to kill myself.\n(Phoebe desperately tries to find the scripted response to that line.)\nPhoebe: (doesnt have any luck) Umm, is-is that because youre out of toner?\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 9, "scene_id": "S07E13_009", "location": "The telemarketing office", "scene_description": "Phoebe is hard at work.", "characters": ["Earl", "Phoebe"], "firestore_path": "/episodes/S07E13/scenes/S07E13_009"}}
{"id": "S07E13_010", "text": "[Scene: The telemarketing office, Phoebe is still talking to Earl.]\nEarl: Okay, sono toner today. Thanks anyway, bye-bye.\nPhoebe: No-no wait-wait! I cant just let you hang up! Just please talk to me.\nEarl: WellI only have one thing to do today. (He looks at his board in his office that reads, \"Todays Tasks: KILL SELF.\") I guess I could push it back.\nPhoebe: Yeah! Now, why do you want to kill yourself?\nEarl: Its just that I uh, have been working for ten years now at this meaningless, dead-end job and nobody here even knows I exist!\nPhoebe: Chandler?\nEarl: I-Im sorry?\nPhoebe: No look, I-Im sure that people know you exist!\nEarl: Oh yeah? I work in a cubicle surrounded by people. Ive been talking to you for five minutes now about killing myself and no ones even looked up from their desk. Hang-hang on. (To the people standing around his cubicle.) Hey everybody! Uh, Im gonna kill myself! (Theres no response; no one even looks up.) Ill get back to ya. (To Phoebe) I got nothing. Wait. (He sets the phone down.) Uh, hey Marge! (Mimes putting a gun to his head, pulling the trigger, and splattering his brain on the wall behind him. Then points to himself. Marge watches this, then goes back to work.) (To Phoebe) Ehh, nothing. Nothing.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 10, "scene_id": "S07E13_010", "location": "The telemarketing office", "scene_description": "Phoebe is still talking to Earl.", "characters": ["Earl", "Phoebe"], "firestore_path": "/episodes/S07E13/scenes/S07E13_010"}}
{"id": "S07E13_011", "text": "[Scene: Joey and Rachel's, Chandler has replaced Rosita with his chair.]\nChandler: My chair. Now, if anybody asks, your name is Rosita! (He runs out the door, grabs the back of Rosita, and we can hear Joey and Rachel talking as they are coming up the stairs. Neither of them have reached the landing yet.)\nRachel: You will like it!\nJoey: No I wont.\n(Chandler runs to check on them coming up the stairs.)\nRachel: You dont even know!\nJoey: Because, I know what I like and what I dont like! Its not the same thing!\n(Chandler throws the back of Rosita into his apartment and quickly starts pushing the base into his apartment.)\nRachel: Well look, if you dont like this(The audiences laughter at Chandlers progress cuts out the rest of Rachels line.)\nJoey: I dont know why you say that so soon.\n(Joey and Rachel reach the landing just as Chandler closes the door.)\nRachel: Come on Joey, I just bought you a new chair! The most expensive one in the store! Hey, yknow what I was thinking? We could name her Francette.\nJoey: Francette? What is she? A couch?\n(They enter their apartment.)\nJoey: Poor thing. Cut down in her prime.\nRachel: Joey, the new chair will be here in an hour. Maybe we should actually move Rosita out of here. Yknow, start the heeling process?\nJoey: Well, I guess youre right. Maybe, maybe Ill take her down to the incinerator. Its gonna be so said, and kinda cool. (He goes to remove the back, but it doesnt come off. So he sits down in it, puts his feet up, stands up, and looks back at it.) Shes heeled!\nRachel: Thats weird.\nJoey: No its not weird, its a miracle!\nRachel: Its not a miracle Joey! Im sure theres some explanation.\nJoey: Oh there is! If you want something enough and your heart is pure, wondrous things can happen!\nRachel: Joey, I really dont\nJoey: (interrupting her) Can you tell me how this happened?\nRachel: Well no.\nJoey: Miracle!\nRachel: No, yknow what? Maybe somebody came in here and fixed it! Or something!\nJoey: Someone like anangel?\nRachel: Thats right Joey, the chair angel came in and heeled your chair. (She sits down in the chair.)\nJoey: (angrily) Get your non-believer ass outta my chair! (She gets up and heads for her room.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 11, "scene_id": "S07E13_011", "location": "Joey and Rachel's", "scene_description": "Chandler has replaced Rosita with his chair.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_011"}}
{"id": "S07E13_012", "text": "[Scene: The Gellers Garage, continued from earlier. Ross and Mr. Geller are still deciding what to do.]\nMr. Geller: Well, shell understand right? Its not like I did it on purpose.\nRoss: Dad that wont matter to her. Look, all my stuff is safe and dry and all her is-is, is growing new stuff! See, this is exactly the kind of thing that makes her think you guys love me more than you love her.\nMr. Geller: Oh my God, does she really thinks that?\nRoss: Well, can you blame her?\nMr. Geller: Well I dont know, I-I suppose we may have favored you unconsciously, you were a medical marvel! The doctor said your mother could\nRoss: Dad, dad I dont want to hear about it.\nMr. Geller: Really?\nRoss: Well, not right now. Okay look, Monica came here for some memories and damnit, were gonna give her some! Okay, grabgrab some empty boxes. Okay? Well-well take stuff from mine and whatever we can pass off as hers well-well put em in their. \nMr. Geller: Great!\nRoss: Like uh yknow like this! This! (He picks up one of those art projects that kids make in kindergarten and first grade.) She-she couldve made this!\nMr. Geller: Sure!\nRoss: Right? And this! (He picks up a trophy) She-she couldve won this!\nMr. Geller: (grabbing a glove) This couldve been hers!\nRoss: Sure! Ooh-ooh, what about this?\nMr. Geller: Your make-up kit? Id feel better.\n(Ross angrily throws the kit into one of Monicas new boxes.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 12, "scene_id": "S07E13_012", "location": "The Gellers Garage", "scene_description": "continued from earlier. Ross and Mr. Geller are still deciding what to do.", "characters": ["Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_012"}}
{"id": "S07E13_013", "text": "[Scene: Joey and Rachel's, Joey is sitting the now heeled Rosita as Rachel is sitting in the newly arrived Francette. Francette is one of those new chairs from La-Z-Boy that has and does everything except cook and go to the bathroom for you. Its got a small refrigerator under one armrest it has phone jacks for the Internet and regular phone, and so much more.]\nRachel: (grabbing a beer out of the chairs fridge) I am so psyched I kept this chair for myself!\nJoey: Yeah, me too. (He flips up his armrest in disgust.)\nRachel: Hey, howshows the uh, miracle chair?\nJoey: Fine.\nRachel: Yeah? Wow! Yknow, that this thing has speakers in the headrest!\nJoey: No. Really?\nRachel: Yeah! You can hook it up to your TV and you get radio!\nJoey: (quietly) My chair heels itself.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 13, "scene_id": "S07E13_013", "location": "Joey and Rachel's", "scene_description": "Joey is sitting the now heeled Rosita as Rachel is sitting in the newly arrived Francette. Francette is one of those new chairs from La-Z-Boy that has and does everything except cook and go to the bathroom for you. Its got a small refrigerator under one armrest it has phone jacks for the Internet and regular phone, and so much more.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_013"}}
{"id": "S07E13_014", "text": "[Scene: The telemarketing office, Phoebe is still trying to talk Earl out of suicide.]\nPhoebe: Earl, youre not hearing me! All Im saying is that youre not alone all right? Everybody hates the people they work with! (One of her coworkers overhears that, and she mimes that she didnt mean him.)\nGuy: (walking past Earls desk) Hey guy!\nPhoebe: Wait, what was that? That sounded like someone being nice to you.\nEarl: No! Thats just the \"Hey Guy\" guy. He says that to everybody! Hes the worst! Id like to take him with me!\nPhoebe: All right so Earl, lets just forget about the people at the office, okay? There-theres gotta be someone else in your life worth sticking around for! What about-what about your family, your friends, or maybe your girlfriend?\nEarl: (laughs) Yeah! Right!\nPhoebe: Oh sorry, boyfriend!\nEarl: Oh no.\nPhoebe: No, whatever! Anything!\nThe \"Hey Guy\" Guy: Hey guy!\nPhoebe: Yeah, hes gotta go.\nEarl: Okay, I should, I should probably be getting back to my thing now. See ya. (Hangs up.)\nPhoebe: No! Im not finished yet! Dont! Dont you dare hang up on me!!!\nSupervisor: (walking by and overhearing that) (to the rest of the staff) The new girls good.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 14, "scene_id": "S07E13_014", "location": "The telemarketing office", "scene_description": "Phoebe is still trying to talk Earl out of suicide.", "characters": ["Earl", "Guy", "Phoebe", "Supervisor"], "firestore_path": "/episodes/S07E13/scenes/S07E13_014"}}
{"id": "S07E13_015", "text": "[Scene: The Gellers Garage, Mr. Geller and Ross are finishing up recreating Monicas memories as Monica enters.]\nMonica: Hey guys! Hey!\nRoss: Hey.\nMonica: Hey, I just whipped us up some Easy Bake treats, they should be ready in about three days.\nMr. Geller: (overacting) Thats a good one! Do you hear that Ross? Three days!\nRoss: (overacting as well) Yeah! Yeah! (Laughs.) Oh, this will make a great memory.\nMonica: (wary) Okay. So, which boxes are mine?\nRoss: Well, these. These are yours right here. (Pointing to the boxes they just created for her.)\nMonica: Okay. (Starting to go through them) Oh! A coloring book! (Holding it up.)\nRoss: Yeah. Yeah, oh you loved that thing. You always had it with you. You never went anywhere without-without that coloring book.\nMonica: (looking through it) Really? Wow! It looks like I had some trouble staying inside the lines.\nRoss: Nu-uh! (Grabs it and examines it.)\nMonica: (holding up a glove) Oh, an old glove?\nMr. Geller: Oh, yeah you loved that glove! You took it every place you went. You never went any place without that glove.\nMonica: Wow! Look at this! (Picking up a shirt.) I cant believe I even fit into this shirt! (She holds it up and it reads: Tyrannosaurus Ross.) (She turns it around and looks at it.) Oh, this is yours. (Hands it to Ross.)\nRoss: Oh, I dont know how that got in there.\nMonica: (holding up a small cowboy hat) This isnt mine. (Sets it down and looks at the rest of the boxes.) Hey, this isnt, this isnt my stuff! Ugh, Ross! (Grabs and holds up a doll.) These are your boxes! Where are my boxes?\nRoss: Umm, your boxes are umm\nMonica: What?\nRoss: Dad?\nMr. Geller: Well, the garage flooded sweetie and it ruined everything in your boxes. Im sorry.\nMonica: Just mine?\nMr. Geller: Im afraid so.\nMonica: So why-why wasnt Rosss stuff ruined? (Pause) And if you say the words medical marvel Im going to Easy Bake your head!\nMr. Geller: Well, I used your boxes to divert water away from the Porsche.\nMonica: So wait, Rosss stuff is fine, but I have no memories because you wanted to keep the bottom two inches of your car away from water!!!\nMr. Geller: There was also leaves and guk and stuff.\nMonica: I cant believe this! (Storms out.)\nMr. Geller: (To Ross) Screw it! Im having one. (Takes out and lights a cigarette.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 15, "scene_id": "S07E13_015", "location": "The Gellers Garage", "scene_description": "Mr. Geller and Ross are finishing up recreating Monicas memories as Monica enters.", "characters": ["Monica", "Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_015"}}
{"id": "S07E13_016", "text": "[Scene: Monica and Chandler's, Chandler is writing a letter by the bay window as Rachel enters.]\nRachel: Hey Chandler!\nChandler: Hey!\nRachel: How would you like to sit in a chair that fully reclines, has a rolling massage, and speakers in the head rest?\nChandler: Yeah, Id love to but Ive tried that so many times they wont even let me in the store anymore.\nRachel: Well what if I told you, you can do it in my apartment?\nChandler: (excitedly) Are you telling me that you bought the chair that is making all other lounge systems obsolete? The chair that Sit magazine called the Chair of the Year?\nRachel: I just purchased the La-Z-Boy E-cliner 3000. (Which is an actual product by the way, Im not sure about the 3000 part.)\nChandler: Thats awesome! Thats great! What made you do it?!\nRachel: Well, its a long story, but umm I broke Joeys chair\nChandler: Whoa-whoa-whoa! You broke Joeys chair?\nRachel: Yeah.\nChandler: I thought I broke Joeys chair! Thats why I replaced it with mine!\nRachel: Ohhhhh. Thats how it got fixed!\nChandler: Well, what did you think, that-that elves came in and fixed it?\nRachel: Noo! (Laughs) Angels.\nChandler: Im gettin my chair back! (Heads for Joey and Rachels.)\nRachel: What? Wh-hey!\n(They enter Joey and Rachels to find that Joey has broken Chandlers chair.)\nJoey: Well, it looks like it wasnt heeled after all! Yeah! So, I guess this chair is mine now! (Sits down in it and groans.)\nChandler: Joey you broke my chair!!\nJoey: Your chair?!\nRachel: Yeah, he thought he broke your chair so he switched the chairs!\nJoey: So, there was no miracle?!\nRachel: No Joe, no miracle.\nJoey: (sarcastic) Oh no this is devastating! My faith is shaken. Im so glad I have the new chair to get my through this difficult time in my life.\nRachel: Uh-huh! Nice try, but you dont get that chair anymore! All right? That is my chair now! You can sit on my lap! (Joey starts to get up.) No I take that back!\nChandler: I think I should get the chair!\n(Rachel and Joey both laugh at that suggestion.)\nJoey: How do you figure?\nChandler: Because you (Points to Joey) broke a chair and you (Points to Rachel) broke a chair! The only one around here that hasnt broke a chair, is me!\nRachel: No-no-no! This chairs not going anywhere.\nChandler: Well, wheres the logic in that?!\nRachel: The logic is, that there are two of us and we are both strong enough to break a chair in half!\nChandler: So Joey breaks my chair and I get nothing!\n(Joey whispers in Rachels ear to confirm his response.)\nJoey: Thats right!\nChandler: What are you guys? Like a gang or something?!\n(They confer again.)\nJoey: Yeah! We are!\n(Rachel whispers in Joeys ear.)\nRachel: Were the Cobras!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 16, "scene_id": "S07E13_016", "location": "Monica and Chandler's", "scene_description": "Chandler is writing a letter by the bay window as Rachel enters.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_016"}}
{"id": "S07E13_017", "text": "[Scene: Earls Office, Earl has his head in his hands as Phoebe enters.]\nPhoebe: (to Marge) Excuse me! Can you tell me where I can find Earl? Hes the supply manager around here.\nMarge: Sorry, I dont know any Earl.\nEarl: (screaming) Im right here!!!!\nPhoebe: (goes over to his desk) Earl! Im Phoebe.\nEarl: Phoebe? The lady who sells toner?\nPhoebe: Umm, look it, you-you cant kill yourself.\nEarl: (exhales) Look, um I really appreciate your coming down\nPhoebe: No-no I cant! I cant let you do it!\nEarl: Why?!\nPhoebe: Because it was fate that made me call you today!\nEarl: I thought it was toner.\nPhoebe: No! Think about it okay? This isnt even my regular job! Okay? And my first day on the job, youre my first call! And-and somebody else mightve hung up on you, but I wouldnt do that because I know about this stuff. My mom killed herself.\nEarl: Really?!\nPhoebe: Yes.\nEarl: How?\nPhoebe: Im not gonna give you tips! Look dont you see that this-thisthis all came together so that I could stop you from doing this.\nEarl: Couldnt it just be a coincidence?\nPhoebe: No, its fate!\nEarl: It doesnt really seem like enough to be fate.\nPhoebe: Oh. Well umm, okay heres a weird thing. My mother was also a supply manager.\nEarl: Im actually the office manager.\nPhoebe: Oh my God! So was she! And! Get this, okay? Your-your name is Earl, right? Her name was Pearl, P-Earl.\nEarl: Well, was there anything else?!\nPhoebe: Sure! (Thinks.) Umm, where are you from?\nEarl: Philadelphia.\nPhoebe: Oh my God! So was she! Oh, Ive got-Ive got goose bumps. (She holds out her arm.)\nEarl: (inspecting it) Really?\nPhoebe: Well, yknow Im wearing layers and its warm.\nEarl: Yeah-yeah.\nPhoebe: But ifno look, okay. These jerks might not care about you, but the universe does! And that says a lot!\nEarl: (To All) Did you hear that?! I dont need you guys to care about me! Because the universe cares! The whole universe! (Laughs as everyone ignores him.) (To Phoebe) I really wished theyd care just a little bit though.\nPhoebe: Yknow, I dont-I dont think its you. This is a freaky place. (To All) Hey! Guys! (Everyone looks up.) (To Earl) Oh no, its you.\nEarl: Yeah.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 17, "scene_id": "S07E13_017", "location": "Earls Office", "scene_description": "Earl has his head in his hands as Phoebe enters.", "characters": ["Earl", "Marge", "Phoebe"], "firestore_path": "/episodes/S07E13/scenes/S07E13_017"}}
{"id": "S07E13_018", "text": "[Scene: The Gellers Garage, Monica is picking through her ruined childhood heirlooms with Ross.]\nMonica: Oh, this terrible! Everything is destroyed! Look at this. (She picks up some kind of furry thing.) It obviously meant enough for me to save it, and I dont even know what it is! Ohh, its still soft. (She rubs it against her cheek.) What do you think this is?\nRoss: All right. I think it was a mouse.\n(Monica screams, throws the mouse down, and rubs her hands on Rosss sweater to clean them.)\nMr. Geller: (entering) How are you honey?\nMonica: How do you think I am?! Youve wrecked all my childhood memories. You love Ross more than me. And I just rubbed a dead mouse on my face!\n(Ross gets up to let his dad sit next to Monica.)\nMr. Geller: Sweetheart, we love you just as much as Ross! Now, Im sorry about everything that happened and Id probably never be able to make it up to you, but heres a start. (He hands her a small box.)\nMonica: (opening it) Whats this?\nMr. Geller: Its the key to my Porsche. Well, the key to your Porsche.\nMonica: (shocked) What?!\nRoss: (even more shocked) What?!!!\nMr. Geller: Ive been thinking about getting rid of it. I was driving it the other day and saw my reflection in a store window. Your mothers right, I do look like an ass.\nMonica: Wait, youre giving me your Porsche, youre kidding me right?!\nRoss: Well w-w-w-w-wait, w-wait, wait, wait a minute! I mean a couple of stupid boxes get wet and she gets a Porsche?!\nMr. Geller: (To Monica) Why dont we take it for a spin?\nMonica: All right!\nRoss: Well, what about me?! Im a medical marvel!!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 18, "scene_id": "S07E13_018", "location": "The Gellers Garage", "scene_description": "Monica is picking through her ruined childhood heirlooms with Ross.", "characters": ["Monica", "Ross"], "firestore_path": "/episodes/S07E13/scenes/S07E13_018"}}
{"id": "S07E13_019", "text": "[Scene: Joey and Rachel's, Rachel is sitting in Joeys lap on Francette, and theyre both groaning.]\nJoey: Oh yeah.\nRachel: Ahhhh.\nJoey: Ahhh (To Rachel) Eh?\nRachel: Uh-huh.\nMonica: (entering) Hey guys!\nRachel: Hey!\nJoey: Hey!\nMonica: Do you guys know what happened to Chandlers barca lounger?\nRachel: Oh yeah, Joey broke it. Had to get rid of it.\nMonica: Are you kidding?! I get a Porsche and the barca loungers gone?! This is the best day ever! (Runs out.)\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 13, "episode_id": "S07E13", "episode_title": "THE ONE WHERE ROSITA DIES", "scene_number": 19, "scene_id": "S07E13_019", "location": "Joey and Rachel's", "scene_description": "Rachel is sitting in Joeys lap on Francette, and theyre both groaning.", "characters": ["Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S07E13/scenes/S07E13_019"}}
