{"id": "S07E06_001", "text": "THE ONE WITH THE NAP PARTNERS\nWritten by: Brian Buckner & Sebastian Jones Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 1, "scene_id": "S07E06_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E06/scenes/S07E06_001"}}
{"id": "S07E06_002", "text": "[Scene: A Restaurant, Phoebe, Rachel, and Monica are having brunch.]\nMonica: Okay, the reason why I asked you guys out to brunch today is because I have been doing some thinking about who should be my maid of honor.\nRachel: Oh my God! This is it! (She and Phoebe hold hands.) (To Phoebe) I really hope its you!\nPhoebe: I hope its you.\nRachel: Me too!\nMonica: First of all um, I love you both so much and youre both so important to me\nRachel: Okay, bla-bla-bla-bla!! Who is it?!\nMonica: Well umm, I was thinking that maybe we could come up with a system where we trade of being maid of honor for each other. Like hypothetically, if Phoebe were mine\nPhoebe: Yes!!! Oh!!\nRachel: Hypothetically!\nPhoebe: Still.\nMonica: If Phoebe were my maid of honor\nRachel: Uh-hmm.\nMonica: Rachel would be Phoebes, I would be Rachels, that way we all get to do it once and no one would get upset.\nRachel: Yeah thats actually a pretty good idea.\nPhoebe: Yeah, Ill do that. So who gets to be yours?\nMonica: (laughs) Well thats the best part. Umm, you guys get to decide!\nPhoebe: Wh-why is that the best part?\nMonica: Because then I dont have to!\nRachel: Well of course we will help you decide! We will do anything we can to help you! Now, I would like to make a toast, to the future Mrs. Chandler Bing (A woman at the table behind them overhears Chandlers name and starts listening closer), my best friend, and truly one of the nicest people that\nMonica: Im really not deciding!\nRachel: Fine!\n(The woman gets up and walks over to their table.)\nWoman: Excuse me, I-I couldnt help overhearing, youre marrying Chandler Bing?\nMonica: Yeah thats right.\nWoman: (sarcastically) Huh, good luck!\nPhoebe: Aww, and good luck to you too! (To Monica and Rachel) What a nice lady!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 2, "scene_id": "S07E06_002", "location": "A Restaurant", "scene_description": "Phoebe, Rachel, and Monica are having brunch.", "characters": ["Monica", "Phoebe", "Rachel", "Woman"], "firestore_path": "/episodes/S07E06/scenes/S07E06_002"}}
{"id": "S07E06_003", "text": "[Scene: Ross's apartment, Chandler, Joey, and Ross are finishing watching Die Hard on video.]\nChandler: Die Hard still great!\nJoey: Yep. Hey, what do you say we make it a double feature?\nChandler: Whatd you rent?\nJoey: Die Hard 2.\nChandler: (looking at the tape) Joey, this is Die Hard 1 again.\nJoey: Oh, well we watch it a second time and its Die Hard 2!\nRoss: Joey, we just saw it!\nJoey: And?\nRoss: And itll be cool to see it again! Yeah!\nJoey and Ross: Die Hard!!!!!!\nRoss: Dude, you didnt say Die Hard. Is everything okay?\nChandler: Yeah, I just got uh, got plans.\nRoss: Well, John McLane had plans!\nChandler: No, see the thing is I want to get out of here before Joey gets all worked up and starts calling everybody bitch.\nJoey: What are you talking about? Bitch.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 3, "scene_id": "S07E06_003", "location": "Ross's apartment", "scene_description": "Chandler, Joey, and Ross are finishing watching Die Hard on video.", "characters": ["Chandler", "Joey", "Joey and Ross", "Ross"], "firestore_path": "/episodes/S07E06/scenes/S07E06_003"}}
{"id": "S07E06_004", "text": "[Scene: Central Perk, Phoebe is bringing Rachel some coffee.]\nPhoebe: Hey Rachel?\nRachel: Yeah?\nPhoebe: Umm, when I get married will you be my maid of honor?\nRachel: Really?!\nPhoebe: Uh-hmm.\nRachel: Oh my God Phoebe! I mean Im justWait a minute. If Im your maid of honor that means you are Monicas.\nPhoebe: Oh! Well, if thats what you want\nRachel: Ohh! No way Phoebe! I want to be Monicas!\nPhoebe: But why does it even matter?!\nRachel: Why does it matter so much to you?!\nPhoebe: Because this one is now! And-and its two of our best friends! Who knows what youre gonna marry!\nRachel: What-what if I marry RossOr Joey?\nPhoebe: (gasps) You wouldnt! Okay look, Rachel I know you really want to do this, but I-Ive never been maid of honor to anyone before! And I know youve done it at least twice!\nRachel: Yeah but Phoebe\nPhoebe: And no, oh please, oh please let me finish. (Rachel stops talking.) Oh I guess that was it.\nRachel: Okay. Okay. Itssince youve never done it before you can be Monicas made of honor.\nPhoebe: Oh, thank you so much! (They hug.) Okay.\nRachel: Im gonna marry someone good yknow.\nPhoebe: Oh I know.\nRachel: Better than Chandler. (Phoebe exhales as if to say, \"Like what isnt?\")", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 4, "scene_id": "S07E06_004", "location": "Central Perk", "scene_description": "Phoebe is bringing Rachel some coffee.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S07E06/scenes/S07E06_004"}}
{"id": "S07E06_005", "text": "[Scene: Ross's apartment, Die Hard has ended, only I dont think Joey and Ross know that yet. As you see, they are both asleep. And theyre on the same couch. Which means theyre sleeping together. Not like Joey is at one end and Ross is on the other, they both happen to be lying down and sleeping together. Well, there hasnt been any clothes removed so not that kind of sleeping together. Not that theres anything wrong with that. That is unless youre a Republican in which that kind of thing will bring about the downfall of Western society, especially if they should happen to want to get married. Anyway, let me recap. No, there is too much, let me sum up. Ross and Joey are taking a nap together on top of each other and both wake-up at the same time, realize what they just did, scream, and jump up.]\nRoss: What happened?!!\nJoey: Well, I dont know!!\nRoss: We fell asleep! That is all.\nJoey: Yeah. Yep. Yeah. All right, well uh, Id better go.\nRoss: I think that would be best.\nJoey: Yeah. All right, Ill talk to you later.\nRoss: Okay. But not about this!\nJoey: No! Never! Never! (Pause, then Joey wants to shake Rosss hand.) Bye.\nRoss: No touch! No touch!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 5, "scene_id": "S07E06_005", "location": "Ross's apartment", "scene_description": "Die Hard has ended, only I dont think Joey and Ross know that yet. As you see, they are both asleep. And theyre on the same couch. Which means theyre sleeping together. Not like Joey is at one end and Ross is on the other, they both happen to be lying down and sleeping together. Well, there hasnt been any clothes removed so not that kind of sleeping together. Not that theres anything wrong with that. That is unless youre a Republican in which that kind of thing will bring about the downfall of Western society, especially if they should happen to want to get married. Anyway, let me recap. No, there is too much, let me sum up. Ross and Joey are taking a nap together on top of each other and both wake-up at the same time, realize what they just did, scream, and jump up.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E06/scenes/S07E06_005"}}
{"id": "S07E06_006", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica has just gotten back from brunch and is telling Chandler about it.]\nMonica: Yeah hey, a weird thing happened today whey I was at brunch. This woman overheard that I was marrying you and-and then sheshe wished me good luck.\nChandler: Thats sweet.\nMonica: No, its more like a (sarcastically) good luck.\nChandler: So uh, what did this woman look like?\nMonica: She was like 30, dark hair, attractive.\nChandler: Well, is there any chance you were looking into a bright, shiny thing called a mirror?\nMonica: Come on, was it somebody maybe you dated in college?\nChandler: No, no I only dated two girls in college, both blonde, both not attractive (Thinks a little while.) Hold on one second; let me check this out. (He gets up and grabs a photo album.\nMonica: What are you doing?\nChandler: Well, lets see (Finding the picture he wants.) Okay uh, is that her? (Pointing to the picture.)\nMonica: Oh my God yes! Who is she?\nChandler: Julie Grath, my camp girlfriend.\nMonica: Did you break up with her?\nChandler: (pause) No, were still together. Yeah we went out for two summers, and then I broke up with her.\nMonica: Why?\nChandler: Well, cause she came back the third summer and shed gotten really fa-aa-aw-ow\nMonica: Fat?!\nChandler: I did not say fat! I said, \"Fa-aa-aw-ow\"\nMonica: You broke up with a girl because she was fat?!\nChandler: Yeah. Yeah, but it was a really, really long time ago! Does she still feel bad?\nMonica: Well, apparently she does.\nChandler: Well, you know what they say, elephants never forget. (Monica is not amused by that statement.) Seriously, good luck marrying me.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 6, "scene_id": "S07E06_006", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica has just gotten back from brunch and is telling Chandler about it.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E06/scenes/S07E06_006"}}
{"id": "S07E06_007", "text": "[Scene: Joey and Rachel's, Joey is entering, Rachel and Phoebe are already there.]\nJoey: Hey! Whats going on?\nRachel: Phoebe is gonna be Monicas maid of honor!\nJoey: Hey! Well I hope it goes better than the last time you did it for that girl downstairs, remember? (Phoebe glares at him.)\nRachel: (shocked) You have been maid of honor before?!!\nPhoebe: See? This is exactly why you shouldnt lie!\nRachel: All right thats it! I am maid of honor!\nPhoebe: Na-uh, I am!\nRachel: How come you are?!\nPhoebe: Because I cared enough to lie!\nJoey: Hey-hey-hey-hey, I can help you decide who should do it! Yeah, we could have like uh, like an audition and see how youd handle maid of honor type situations.\nPhoebe: What are you talking about?\nJoey: Like when I want a job, I go to an audition and if Im the best of the people they see, they give me the part.\nPhoebe: Okay, so after this audition, who decides who gets it?\nJoey: Oh uh, me and Ross can be the judges.\nPhoebe: (To Rachel) Well, its better than us deciding.\nRachel: Oh, come on! This is crazy! Cant we just flip a coin?!\nPhoebe: No! Coins hate me!\nRachel: Okay. Okay fine, yknow what? We will let Ross and Joey decide. (Ross enters.) (In a sexy voice.) Hiiiii, Ross! Sweetie.\nPhoebe: Hey there, you handsome thing. (Rachel and Phoebe exit.)\nRoss: Wow, this cologne really is every bit as good as Georgio. \nJoey: Hi.\nRoss: Just uh, brought back your videos.\nJoey: Uh hey look uh Ross, look I think we need to talk about before.\nRoss: No! No we dont!\nJoey: Yes we do! Now look, that was the best nap I ever had!! \nRoss: I I dont know what you are talking about.\nJoey: Come on! Admit it! That was the best nap you ever had!\nRoss: Ive had better.\nJoey: Okay! When?!\nRoss: All right! All right! It was the best nap ever!\nJoey: Uh-huh!\nRoss: Ive said it! Okay?! But its over Joey!\nJoey: I want to do it again.\nRoss: We cant do it again.\nJoey: Why not?\nRoss: Because its weird!\nJoey: Fine! Do you want something to drink?\nRoss: Sure, what do you got?\nJoey: Warm milk and Excedrin P.M. (Ross just leaves.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 7, "scene_id": "S07E06_007", "location": "Joey and Rachel's", "scene_description": "Joey is entering, Rachel and Phoebe are already there.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E06/scenes/S07E06_007"}}
{"id": "S07E06_008", "text": "[Scene: Monica, Chandler, and Phoebe's, Monica is approaching the bathroom door behind which Chandler is using the facility.]\nMonica: Chandler! (Knocks on the door.) Chandler! I just figured out who you are!\nChandler: Can you figure out what Im doing?\nMonica: Youre Lewis Posin.\nChandler: Who?\nMonica: Lewis Posin! He was my best friend in fifth grade, and-and then one day I asked him to be my boyfriend and he said no. Do you know why?\nChandler: Because you kept talking to him while he was trying to go to the bathroom?!\nMonica: No! But because he thought I was to faaaaa. (Chandler emerges, without flushing by the way.) And every time I think about it, it makes me feel as bad as I did in fifth grade! Yknow, I-I really think that you should apologize to Julie.\nChandler: What? Are you kidding? That was like 16 years ago.\nMonica: No, I know. But yknow what? It would make me feel better if Lewis apologized to me.\nChandler: Okay, I will do it. But I have to warn you; this may make me a better person and that is not the man you feel in love with!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 8, "scene_id": "S07E06_008", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Monica is approaching the bathroom door behind which Chandler is using the facility.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E06/scenes/S07E06_008"}}
{"id": "S07E06_009", "text": "[Scene: Joey and Rachel's, Joey and Ross are laying out the ground rules for the maid of honor auditions to Rachel and Phoebe.]\nJoey: Okay, all right, this is how its going to work. Were gonna give you hypothetical maid of honor situations and you will be scored on a scale of 1 to 10, 1 being the highest.\nRoss: No, 10 is the highest.\nJoey: Why is 10 the highest?\nRoss: Because its the highest. (Joey shrugs his shoulders) Okay, Rachel youre up first. (Rachel stands up and gets ready.) Situation No. 1: Youre with Monica, the wedding is about to start when Monica gets cold feet. Go! (Joey is playing the part of Monica.)\nJoey: (crying) I dont want to marry Chandler!\nRachel: Okay, uh\nJoey: Ive got cold feet.\nRachel: its gonna be okay!\nJoey: No, one man for the rest of my life? I dont know if I can do it! This means Ill never get to sleep with Joey!\nRachel: Look Monica, getting cold feet is very common. Yknow, its-its just because of all the anticipation and you just have to remember that you love Chandler. And also, I ran out on a wedding. You dont get to keep the gifts.\nJoey: (out of his Monica character) Very good! Drawing on your own experience, I like that!\nRachel: Thanks!\nRoss: Yes, very nice Rachel.\nRachel: Thank you judges.\nPhoebe: Ugh, what a kiss ass.\nRachel: Oh!\nJoey: Okay, Phoebe\nPhoebe: Yes! Your honor?\nJoey: Were now in the ceremony, Monica is about to say, \"I do\" when her drunk uncle starts yelling. What do you do? Go!\nRoss: (playing the drunk uncle) When Monica was a little girl, I remember that(Phoebe screams and tackles him)Ooh!! Ow! Very good!\nPhoebe: Oh!\nJoey: Yes! Excellent! Perfect score!\nRachel: Wait a minute! She just made a scene in the middle of the ceremony!\nPhoebe: Hey! Do you want do you want a little taste of Pheebs?!\nRoss: It is time for you to give your maid of honor speech.\nRachel: Ohh, wait a minute, we havent pre\nRoss: Go!\nRachel: Okay! Okay! Umm, Websters Dictionary defines marriage as (Ross and Joey start writing.) Okay!! Forget that! That sucks!! Okay, never mind! Forget it! Umm, umm, okay, uh I met, I-I met, I met Monica when we were just a couple of six year olds and I became friends with Chandler when he was 25, although he seemed like a six year old.\nRoss and Joey: Oh! Thats nice.\nRachel: Thank you. Thank you very much. Umm, Ive known them separately and Ive known them together and-and to know them as a couple is to know that you are truly in the presence of love. So I would like to raise my glass (Grabs a glass and holds it up) to Monica and Chandler and the beautiful adventure they are about to embark upon together. I can think of no two people better prepared for the journey.\nJoey: Wow. (To Ross) Good speech.\nRoss: Yeah, it really was!\nRachel: Aw, thanks!\nRoss: Okay Phoebe, I guess youre next (To Joey) although I really dont see the point.\nJoey: Yeah.\nPhoebe: Okay, I cant believe that Monica and Chandler are getting married. I remember talking about this day with Rachel while we were showering together, naked. (Raises her glass and drinks.)\n(Joey and Ross pause while they picture the event.)\nJoey: And shes back in the game.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 9, "scene_id": "S07E06_009", "location": "Joey and Rachel's", "scene_description": "Joey and Ross are laying out the ground rules for the maid of honor auditions to Rachel and Phoebe.", "characters": ["Joey", "Phoebe", "Rachel", "Ross", "Ross and Joey"], "firestore_path": "/episodes/S07E06/scenes/S07E06_009"}}
{"id": "S07E06_010", "text": "[Scene: A random apartment building, Chandler and Monica are knocking on the door of the woman from the beginning.]\nChandler: (she opens the door) Julie hi! Chandler Bing, I, I guess you remember me.\nJulie: Hello Skidmark.\nChandler: (To Monica) Its a nickname, Ill explain later.\nMonica: Its pretty clear.\nChandler: Ah, uh, I owe you a long overdue apology. I never should have broken up with you because you were overweight.\nJulie: Thats why you broke up with me?\nChandler: You-you-you didnt know that. (Pause as she nods no.) Well, I guess my work here is done!", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 10, "scene_id": "S07E06_010", "location": "A random apartment building", "scene_description": "Chandler and Monica are knocking on the door of the woman from the beginning.", "characters": ["Chandler", "Julie", "Monica"], "firestore_path": "/episodes/S07E06/scenes/S07E06_010"}}
{"id": "S07E06_011", "text": "[Scene: Central Perk, Joey and Ross are giving Phoebe and Rachel the results of their election. Somewhat faster than Florida I might add.]\nJoey: All right, well first of all I would like to say that you both performed very well. Okay? You should be proud of yourselves. And-and I would also like to say that in this competition there are no losers. Well, except for RachelDamnit!\nPhoebe: Really?! I won!\nRachel: What?!\nRoss: Im sorry Rach, it was, it was really close.\nRachel: Well then I demand a recount! (Hmm, I wonder where Ive heard that before.)\nRoss: Actually, it wasnt that close.\nRachel: No! Yknow what? No! No! You thing was so stupid anyway, this was ridiculousWere gonna flip a coin! (Phoebe gasps.) All right?! (She flips the coin.) Heads! (Looks at the coin and grunts in disgust.)\nPhoebe: The coins have finally forgiven me!\nRachel: Well yknow what? I hope Monica forgives you after you throw her, her vegetarian, voodoo, goddess circley shower! (Runs out.)\nPhoebe: (running after her) Rach, its gonna be okay! (To Ross and Joey) You guys are the best!\nJoey: Boy I tell ya, that judging stuff took a lot out of me.\nRoss: Yeah?\nJoey: Yeah! I was thinking about maybe going upstairs and taking a little nap on my couch. (Raises his eyebrows, questioning Ross to see if he wants to join him.) \nRoss: Why-why would I care about that?\nJoey: No reason, Im just saying that uh Thats where Ill be. \n(Joey gets up and heads for the door. After a pause Ross decides to join him.)", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 11, "scene_id": "S07E06_011", "location": "Central Perk", "scene_description": "Joey and Ross are giving Phoebe and Rachel the results of their election. Somewhat faster than Florida I might add.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E06/scenes/S07E06_011"}}
{"id": "S07E06_012", "text": "[Scene: Monica, Chandler, and Phoebe's, Chandler and Monica have returned from Julies.]\nChandler: As bad as that went I actually enjoyed myself. I think that Im going to apologize for all of the stupid things I do.\nMonica: Why dont you just stop doing stupid things? Then you wouldnt have to apologize.\nChandler: I would really love it if could do both.\nMonica: All right, II have to ask.\nChandler: What?\nMonica: Are you gonna break up with me if I get fat again?\nChandler: What?!\nMonica: Well, you broke up with Julie Grath! How much weight could she have gained?\nChandler: A hundred and forty-five pounds.\nMonica: In one year?! My God what did she eat? Her-her family! Thats not the point.\nChandler: Look I know it was a stupid reason to break up with somebody, but I was 15!\nMonica: Well Thats not the only time this was an issue. You remember when umm, you spent Thanksgiving with us? You called me fat.\nChandler: Okay. Okay, now wait a minute that was totally different.\nMonica: How?\nChandler: You were not supposed to hear that! I said that behind you back!\nMonica: What if I have babies, okay? I mean Im gonna look different. Im okay with that, but Im not sure that you are!\nChandler: Look you have to realize I dont think of you as a thin, beautiful woman. (Monica glares at him.) See this is one of things that I can apologize for later! Look, what I mean is youre Monica! Okay? And I am in love with Monica. \nMonica: Keep going.\nChandler: So you can balloon up or you can shrink down and I will still love you.\nMonica: Even if I shrink down to two inches tall?\nChandler: Id carry you around in my pocket.\nMonica: I love you. (They hug and kiss.)\nChandler: Skidmarks still got a way with the ladies.", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 12, "scene_id": "S07E06_012", "location": "Monica", "scene_description": "Chandler, and Phoebe's, Chandler and Monica have returned from Julies.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S07E06/scenes/S07E06_012"}}
{"id": "S07E06_013", "text": "[Scene: Central Perk, Phoebe is there as Rachel enters carrying a shopping bag.]\nRachel: Hi Pheebs.\nPhoebe: Hi!\nRachel: Hi! I just want to apologize. Im really sorry I was a baby.\nPhoebe: Thats ridiculous Rachel, we were all babies once. (Rachel looks at her.) Oh, you mean today.\nRachel: Yeah. Yeah, and yknow you-you deserve to win. And-and yknow I was thinking about it, if-if youre Monicas maid of honor that means I get to be yours.\nPhoebe: Oh yeah!\nRachel: Yeah! Oh, umm when-when Monica and Chandler got engaged I started putting some stuff together, yknow just in case\nPhoebe: Oh thats so sweet thanks.\nRachel: Here is a book of poetry that I know Monica loves. And-and ohh God this is funny, look, this is a picture of one Halloween where she dressed up as a bride. (Shows Phoebe the picture.) And look, she made me carry her train, which was weird because I was Wonder Woman. Oh and heres a little purse that I found. (Hands her the purse) Yknow I just thought that maybe they could hold the rings in there.\nPhoebe: Ohh.\nRachel: And umm, vintage handkerchiefs yknow cause, people cry at weddings. (Starting to cry.) Im just gonna grab a couple of these.\nPhoebe: This stuff is great!\nRachel: Oh, I forgot this was in here. Umm, this was the uh garter that I was saving for my wedding and I wanted it to be Monicas something borrowed and its blue. (Starts to cry again.) Yeah\nPhoebe: Yknow Rach, I think that, I think you should be Monicas made of honor.\nRachel: You do? Why?\nPhoebe: Because I think it means more to you.\nRachel: But Pheebs, yknow you earned it.\nPhoebe: Its fine. I mean, this is something that youve been thinking about since you were what, 14? (Shes referring to the Halloween picture.)\nRachel: No, I was ten. I just developed early.\nPhoebe: (looking at the picture again) Man alive!\nMonica: (entering) Hey, whats going on?\nRachel: Hey!\nPhoebe: Well, we just decided that Rachel is gonna be your maid of honor.\nMonica: (gasps) Ohh, wow! Thats great! (Rachel and Monica hug.) Oh wow! We really have to start planning! I have, I have a lot of really specific ideas! We should probably get together like four times per week. You can come over to my place; well get together before work! What do you say, 6:30, my place? Im so excited! (Runs out leaving Rachel completely stunned and Phoebe laughing.)\nRachel: Yeah okay, you laugh now, but shes gonna be yours. (Phoebe gets suddenly scared.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 13, "scene_id": "S07E06_013", "location": "Central Perk", "scene_description": "Phoebe is there as Rachel enters carrying a shopping bag.", "characters": ["Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E06/scenes/S07E06_013"}}
{"id": "S07E06_014", "text": "[Scene: Joey and Rachel's, Joey and Ross are napping together again and both wake up at the same time.]\nJoey: Great nap.\nRoss: It really was.\n(Suddenly Rachel clears her throat and the camera cuts to the rest of the gang staring at them. Needless to say Joey and Ross are shocked and slowly turn their heads to see the gang.)\nJoey: (reacting first by jumping up) Dude! What the hell are you doing?! God! (Heads for his room leaving Ross.)\nRoss: (slowly stands up and says quietly) Excuse me. (Exits.)\nEnd", "metadata": {"chunk_type": "scene", "season": 7, "episode_number": 6, "episode_id": "S07E06", "episode_title": "THE ONE WITH THE NAP PARTNERS", "scene_number": 14, "scene_id": "S07E06_014", "location": "Joey and Rachel's", "scene_description": "Joey and Ross are napping together again and both wake up at the same time.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S07E06/scenes/S07E06_014"}}
