{"id": "S08E18_001", "text": "THE ONE IN MASSAPEQUA\nTeleplay by: Mark Kunerth Story by: Peter Tibbals Transcribed by: Cassie With Help From: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 1, "scene_id": "S08E18_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S08E18/scenes/S08E18_001"}}
{"id": "S08E18_002", "text": "[Scene: Central Perk, everyone is there.]\nPhoebe: Oh, Ross, Mon, is it okay if I bring someone to your parents anniversary party?\nMonica: Yeah.\nRoss: Sure. Yeah.\nJoey: So, whos the guy?\nPhoebe: Well, his name is Parker and I met him at the drycleaners.\nChandler: Oooh, did he put a little starch in your bloomers? (Sits up) Who said that?\nPhoebe: Yeah, hes really great though. He has this incredible zest for life, and he treats me like a queen, except at night when he treats me like the naughty girl I am.\nMonica: (To Ross) Oh, by the way. Would it be okay if I gave the toast to mom and dad this year?\nRoss: Uh, yeah, you sure you want to after what happened at their 20th?\nMonica: Yeah, Id really like to.\nRoss: Okay, hopefully this time mom wont boo you.\nMonica: Yes! Every year Ross makes the toast, and its always really moving, and always makes them cry. Well this year Im going to make them cry.\nChandler: And you wonder why Ross is their favorite?\nMonica: No! Really! Any time Ross makes a toast everyone cries, and hugs him, and pats him on the back and they all come up to me and say, \"God, your brother.\" Know what theyll say this year? \"God, you\"\nJoey: Well I can promise you, at least one person will be crying. (Points to himself) Im an actor, and any actor worth himself can cry on cue. (snaps fingers)\nMonica: Really you can do that?\nJoey: Are you kidding me? Watch! (Makes funny faces trying to cry) Well I cant do it with you guys watching me!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 2, "scene_id": "S08E18_002", "location": "Central Perk", "scene_description": "everyone is there.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S08E18/scenes/S08E18_002"}}
{"id": "S08E18_003", "text": "[Scene: Chandler and Monicas, theyre getting ready to leave for the party.]\nChandler: What are you doing?\nMonica: Oh Im working on my toast for the party, or as I like to call it. Sob fest 2002. Hey check this out. (Hands him a picture.)\nChandler: Its a dog.\nMonica: Its a dead dog. Thats Chi-Chi; she died when I was in high school.\nChandler: Its your parents anniversary and youre going to talk about their dead pet?\nMonica: The good stuff, huh?\n(Ross, Joey, and Rachel enter)\nRachel: Hi!\nRoss: Hey!\nJoey: Hey!\nMonica: You got a present for my parents. Thats so sweet.\nJoey: Yeah, yeah, in honor of their 35th wedding anniversary, I had a star named after them. \nRoss: Aww that is so cool.\nJoey: And I got them a book on Karma Sutra for the elderly.\nRachel: Hey, do you guys have any extra ribbon?\nChandler: Yeah, sure. What do you need? We got lace, satin, sateen, raffia, gingham, felt, (Pause) and I think my testacles may be in here too.\nRoss: (picking up Chi-Chis picture) Aww! Chi-Chi! Oh, I loved this dog! Yknow Monica couldnt get braces because Chi-Chi needed knee surgery.\nMonica: What?!\nRoss: You were the 200-pound 11-year-old who rode her!\n(Phoebe and Parker enter)\nPhoebe: Hey!\nAll: Hi!\nPhoebe: Everybody, this is Parker, Parker this is\nParker: No, no, no wait! Dont tell me. Let me guess. (Points as he says their names) Joey, Monica, Ross, Rachel and, Im sorry Phoebe didnt mention you. (Chandler makes a face) Chandler, Im kidding all ready youre my favorite!\nChandler: Ha!\nParker: Why dont all of you tell me a little about your self?\nRoss: Ah, actually, Im sorry we-we probably should get going.\nParker: (laughs) Classic Ross. Rachel, Rachel, oh how you glow. May I? (Puts hand on her stomach)\nRachel: I, uh, think you already are.\nParker: Rachel, you have life growing inside you. Is there anything in this world more miraculous thanOh a picture of a dog! Whose is this?\nMonica: Thats my old dog. He passed away years ago.\nParker: Oh well, at least you were lucky to have him. Bow-wow old friend, bow-wow. So wheres the party?\nMonica: Its out on the island. Its in Massapequa. \nParker: Maaaassapequa, sounds like a magical place. Tell me about Massapequa, is it steep in Native American history? {Transcribers Note: Interestingly Alec Baldwin was born in Massapequa.}\nRoss: Well, there is an Arbys in the shape of a tee-pee.\nMonica: Okay, I got my note cards. (To Chandler) Do you got the presents? \nChandler: Yeah.\nMonica: And Ive got the car keys.\nParker: Were driving!?\nMonica: Yeah.\nParker: Aces!\n(Everyone except Ross and Rachel leave.)\nRoss: So uh, he seems like a nice guy.\nRachel: Yeah, yeah I like him a lot.\nRoss: Ya wanna hang back and take our own cab?\nRachel: Yeah, otherwise Im not going.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 3, "scene_id": "S08E18_003", "location": "Chandler and Monicas", "scene_description": "theyre getting ready to leave for the party.", "characters": ["All", "Chandler", "Joey", "Monica", "Parker", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E18/scenes/S08E18_003"}}
{"id": "S08E18_004", "text": "[Scene: The Anniversary Party, Ross and Rachel are arriving and see his parents.]\nMr. and Mrs. Geller: Hi\nRoss: Hi! (Kisses his mom.) Hey mom.\nRachel: This is such a great party! 35 years. Very impressive, do you guys have any pearls of wisdom? \nMrs. Geller: Jack?\nMr. Geller: Why would you serve food on such a sharp stick? (Looking a toothpick)\nRoss: Thats a good question, dad. Thats a good question\nRachel: Hmmm.\nWoman: (To Ross and Rachel) Congratulations you two!\nRachel: Thank youwere so excited\nWoman: And also, congratulations on your wedding.\nRoss: WhaWhat?\nMrs. Geller: Can we talk to you for just a yknow Its just a little thing. Well we think its absolutely marvelous that youre having this baby out of wedlock, some of our friends are less open-minded. Which is why weve told them all that youre married.\nRoss and Rachel: What?!\nMrs. Geller: Thanks for going along with this.\nRoss: Dad so what we have to pretend that were married?\nMr. Geller: Son, I had to shave my ears for tonight. You can do this.\nRoss: Can you believe that?\nRachel: Yeah, if youre going to do the ears, you might as well take a pass at the nosal area.\nRoss: No, us having to lie about being married.\nRachel: No, I know I dont either, but ya know what, its their party, and its just one night. And we dont even have to lie; we just wont say anything. If it comes up again, well justsmile. Well nod along.\nWoman: Ross!\nMan: Rachel!\nRoss: Hi Aunt Lisa, Uncle Dan\nAunt Lisa: Congratulations on the baby, and on the wedding\nRoss and Rachel: Hmmmm.\nUncle Dan: Heres a little something to get you started. (Hands them a check)\nRachel: Oh\nAunt Lisa: So, hows married life treating you?\nRachel: (looking at the check) Unbelievable!\nRoss: We love marriage!\nAunt Lisa: Great!\n(The rest of the gang arrives including Parker.)\nRoss: Hey\nPhoebe: Hey!\nParker: What a beautiful place. What a great night! I have to tell you, being here with all of you in Event Room CI feel so lucky. I think of all the good times that have happened here. The birthdays, the proms, the mitzvahs both bar and bat, but none of them will compare with tonight! My God, I dont want to forget this moment! Its like I want to take a mental picture of you all! Click! (He takes a mental picture of them all.)\nChandler: I dont think the flash went off.\nParker: Dahaaa! (Punches Chandler in the arm and he makes a face of pain.) Im going to find the mens room, be right back.\nPhoebe: Ill go with you\nParker: Come on!\nChandler: Somewhere there is someone with a tranquilizer gun and a huge butterfly net looking for that man.\nJoey: I have to go to the bathroom too, but I dont want him complimenting my thing.\nRoss: Im so we werent in the car! Did he ever let up?\nMonica: He called the Long Island Expressway a concrete miracle.\nRoss: (imitating Parker) This room! This night! That waiter! His shoes! I must take a mental picture! (He backs into someone.) Ooh sorry(He looks behind him then notices its Phoebe then stops his impression.)\nPhoebe: Were you guys making fun of Parker?\nRoss: That depends, how much did you hear?\nPhoebe: So, he a little enthusiastic, whats wrong with that?\nMonica: Its just that, its so much.\nPhoebe: Well, so what I like him! Do I make fun of the people youve dated? Tag, Janice, Mona? No, because friends dont do that. But, do you want my opinion? Do you want it? Cause in my opinion, your collective dating record reads like the whos who of human crap. (Walks off)\nMonica: I feel terrible.\nJoey: I know\nRoss: What was wrong with Mona?\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 4, "scene_id": "S08E18_004", "location": "The Anniversary Party", "scene_description": "Ross and Rachel are arriving and see his parents.", "characters": ["Aunt Lisa", "Chandler", "Joey", "Man", "Monica", "Parker", "Phoebe", "Rachel", "Ross", "Ross and Rachel", "Uncle Dan", "Woman"], "firestore_path": "/episodes/S08E18/scenes/S08E18_004"}}
{"id": "S08E18_005", "text": "[Scene: The Anniversary Party, Ross and Rachel have just gotten another wedding present.]\nRachel: Open it! Open it! Open it!\nRoss: Yeah baby!\nMan: So we never got to hear about your wedding!\nWoman: We were surprise that we werent invited.\nRoss: No, no, it was just our parents and 1 or 2 friends. It was a small wedding.\nRachel: But it was beautiful. I mean it was small, but kind of spectacular.\nMan: Where did you have it?\nRachel: On a cliff, in Barbados, at sunset, and Stevie Wonder sang Isnt She Lovely as I walked down the aisle.\nWoman: Really? \nRachel: Yeah, Stevies an old family friend. (Hits Rosss chest)\nWoman: Oh my God. That sounds amazing. I would love to see pictures.\nRachel: So would I. You wouldnt think that Annie Liebawitz would forget to put film in the camera.\nRoss: Would you excuse us for a second? (Pulls Rachel off to the side) Umm. what are you doing?\nRachel: What? Im not you. This may be the only wedding I ever have. I want it to be amazing.\nRoss: Okay, okay. Ooooh, ooh maybe I rode in on a Harley. \nRachel: Okay, Ross, it has to be realistic.\n(Cut to Phoebe and Parker)\nParker: Are you okay? You seem kind of quiet.\nPhoebe: No, Im fine. Im great. Im with you.\nParker: And Im with you! What a great time to be alive! Look at this plate-bouncy thing. (Bounces the plates) What an inspired solution to mans plate dispensing problems. \nPhoebe: Hm huh, yeah.\nParker: Ah! Oysters! Let me feed you one.\nPhoebe: No, thats not necessary.\nParker: Please.\nPhoebe: No, actually I dont eat\nParker: I wont quit until you try.\nPhoebe: Okay, fine! Fine! (Takes the oyster and pretends to eat it while dropping it on the floor) Mmmhmmmmm.\nParker: What are they like? Ive never had one.\nPhoebe: Why dont you just try one?\nParker: No, they look too weird.\n(Cut to Monica and Chandler)\nChandler: What are you doin?\nMonica: Just going over my toast. Those two will never know what hit em. I cant wait. Theyre going to be crying so hard. Theyre going to be fighting for breath. \nChandler: Ya know if you want to, I can just hold them down and you could (Punches the air).\n(Cut to Rachel and Ross)\nRachel: And my veil was lace, made by blind, Belgium nuns.\nWoman: Blind?\nRachel: Well, not at first, but it was very intricate work and they said even though they lost their sight, it was all worth it.\nAunt Lisa: Ill bet you looked beautiful\nRachel: Well, I dont know about that, but some said that I looked like a floating angel.\nWoman: (To Ross) So, how did you propose?\nRachel: Oh yeah. Thats a great story.\nRoss: Well, um, actually, I-I took her to the planetarium. Thats-thats where we had our first date. Um, she walked in and I had the room filled with lilies, her favorite flower\nAunt Lisa: Oh that is so sweet!\nRachel: Shhh! I want to hear the rest!\nRoss: Then, Fred Astaire singing The Way You Look Tonight came on the sound system, and the lights came down. And I got down on one knee and written across the dome in the stars were the words \"Will you marry me?\"\n(Various oohs and ahhs)\nRachel: And the ring, was the size of my fist (makes a fist)!\n(Cut to Phoebe and Joey)\nJoey: Yeah uh, Phoebe! Look umm, I want to apologize about before, okay? We were being jerks. Parkers a nice guy and Id like to get to know him.\nPhoebe: Then you better do it now.\nJoey: Why?\nPhoebe: Because Im going to kill him\nJoey: What-what? \nPhoebe: You guys were right. Hes just too excited abouteverything. I mean Im all for living life, but this is the Gellers 35th anniversary. Okay? Lets call a spade a spade this party stinks.\nJoey: I know Im having the worst time. There was a 15-minute line for the buffet, and when I finally got up to the plates, I slipped on a giant booger!\nPhoebe: Are you sure it wasnt an oyster?\nJoey: I guess it couldve been, I didnt really look at it. Yknow, I just wiped it on Chandlers coat and got the hell out of there.\nPhoebe: Hes just such a great guy Im so excited about him.\nJoey: Oh hey, you should be excited about him. Theres nothing wrong with him hes a good guy. \nPhoebe: You think?\nJoey: Yeah. Ya know what I think; I think we were all just being too negative.\nPhoebe: Youre right. Youre right, hes just embracing life. We could all stand to be a little more like Parker. You know what? I am like him! Im a sunny, positive person. \nJoey: Actually, you have a little bit of an edge.\nPhoebe: Whats that now?\nJoey: Nothing\nPhoebe: Oh look its Parker! \nParker: Look! Its the bunny hop!\nPhoebe: Oooh I love it!\nParker: You do?!\nPhoebe: Are you kidding? People acting like animals to music. Come on!\n(Cut to Monica, at the microphone)\nMonica: Okay its time for the toast! Umm now-now, I know that Ross usually gives the toast, but this year Im going to do it.\n(Everyone sighs)\nMonica: No, no its going to be great. Really! Mom, Dad, when I got married, one of the things that made me sure I could do it was the amazing example the two of you set for me. For that and so many other things I want to say thank you. I know I probably dont say it enough, but I love you. (Pretends to cry hoping her parents will join her.) When I look around this room, Im-Im saddened by the thought of those who could not be here with us. Nana, my beloved grandmother who would so want to be here, but she cant because shes dead. As is our dog Chi-Chi. I mean look how cute she is. (Holds up the picture and pretends to cry again). Was. (To an old man by the stage.) Do me a favor and pass this to my parents. Remember shes dead. Okay, her and Nana, gone. Wow! Hey does anybody remember when Debra Winger had to say goodbye to her children in Terms of Endearment? (Chandler covers his ears) Didnt see that? No movie fans?! You want to hear something sad? The other day I was watching 60 Minutes these orphans in Romania, who have been so neglected, they were incapable of love. (Waits for people to cry, but doesnt get any tears.) You people are made of stone! Heres to mom and dad! Whatever!\nMrs. Geller: Thank you Monica that was uh, interesting. Wasnt it interesting, Jack?\nMr. Geller: (looking at the picture) Why dont I remember this dog?\nMrs. Geller: Ross, why dont you give us your toast now?\nRoss: Oh, no, Mom, its just Monica this year.\nMrs. Geller: Youre not going to say anything? On our 35th wedding anniversary\nRoss: No, of course, Um Um, everybody? Um, I-I just wanted to sayon behalf of my new bride, Rachel (She turns around and smiles), and myself. Umm, that ifif in 35 years, were half as happy as you guys are, well count ourselves the luckiest people in the world.\nMrs. Geller: (crying) Oh Ross\nMr. Geller: I just wish Nana were alive to hear Rosss toast.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 5, "scene_id": "S08E18_005", "location": "The Anniversary Party", "scene_description": "Ross and Rachel have just gotten another wedding present.", "characters": ["Aunt Lisa", "Chandler", "Joey", "Man", "Monica", "Parker", "Phoebe", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S08E18/scenes/S08E18_005"}}
{"id": "S08E18_006", "text": "[Scene: Phoebes apartment, Parker and her are entering.]\nParker: My God what a fantastically well lit hallway!\nPhoebe: Can I get you something to drink? Like a water and Valium? \nParker: I must say this apartment, its, its, There are no words\nPhoebe: Oh thank God. \nParker: Its a haven. A third-floor paradise. A modern-day Eden in the midst\nPhoebe: Yeah? I know! I know! Uh huh? Listen why dont we just um, sit and relax? You know just be with each other. Quietly! \nParker: That sounds great. (Sits down) My God this is the most comfortable couch Ive ever sat on in my entire life. (Bounces on couch)\nPhoebe: Lets try something else, lets play a game.\nParker: I love games!\nPhoebe: Shocking! Lets play the game of who can stay quiet the longest. (Giggles)\nParker: OrJenga.\nPhoebe: But, lets play this one first. And remember whoever talks first loses! \n(They sit back)\nParker: I lose, now Jenga.\nPhoebe: Oh my God! Oh my God! \nParker: Is something wrong?\nPhoebe: Wrong? Really? You know the word wrong. Everything isnt perfect? Everything isnt magical? Everything isnt a glow with the light of a million fairies? They were just brake lights, Parker! \nParker: Well, excuse me for putting a good spin on a traffic jam!\nPhoebe: You dont have to put a good spin on everything.\nParker: Im sorry thats who I am. Im a positive person.\nPhoebe: No! I am a positive person. You are like Santa Clause on Prozac, at Disneyland, getting laid! \nParker: So what do you want me to do, you want me to be more negative, less happy?\nPhoebe: Much less happy!\nParker: Fine! Well then to quote Ross, \"Id better be going.\" \nPhoebe: So long! Dont let the best door in the world hit you in the ass on your way out! (He exits and she slams the door behind him.)\n(Theres a knock on door, and Phoebe opens it.)\nParker: Isnt this the most incredible fight youve ever had in your entire life? \nPhoebe: Uh huh. (Closes door)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 6, "scene_id": "S08E18_006", "location": "Phoebes apartment", "scene_description": "Parker and her are entering.", "characters": ["Parker", "Phoebe"], "firestore_path": "/episodes/S08E18/scenes/S08E18_006"}}
{"id": "S08E18_007", "text": "[Scene: Ross and Rachels, theyre returning from the party.]\nRoss: and then, we couldve gone from the ceremony to the reception with you in the sidecar!\nRachel: Ross, it just wouldnt have been feasible.\nRoss: But having a dove place the ring on your finger wouldve been no problem?\nRachel: It was really fun being married to you tonight. \nRoss: Yeah! And! And, it was the easiest 400 bucks Ive ever made.\nRachel: Okay Ross, can I uh, can I ask you something?\nRoss: Yeah.\nRachel: That proposal, at the planetarium\nRoss: I know, I know it was stupid. \nRachel: Are you kidding?! With the, with the lilies, and-and the song, and the stars! It wasreally wonderful! Did you just make that up? \nRoss: No, actually I thought about it when, when we were going out. Its how I imagined I uh, I would ask you to marry me. \nRachel: Well, that wouldve been very hard to say no too. \nRoss: Its a good thing I didnt do it, because it sounds like it wouldve been a very expensive wedding. (Rachel laughs) Okay, good night\nRachel: Goodnight\n(They go off to their bedrooms)\nRoss: Even if the sidecar had a windscreen so your hair wouldnt get messed up? \nRachel: I will think about it. \nRoss: Thats all Im askin \nEnding Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 7, "scene_id": "S08E18_007", "location": "Ross and Rachels", "scene_description": "theyre returning from the party.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E18/scenes/S08E18_007"}}
{"id": "S08E18_008", "text": "[Scene: Central Perk, Ross and Monica are there.]\nMonica: Okay thats it. I give up. At mom and dads 40th anniversary, youre the one giving the speech. \nRoss: Yknow I dont understand why they didnt cry. It was a beautiful speech. \nMonica: Oh, come on. \nRoss: Hey! All that stuff you said about true love, you were right, I mean, we did learn a lot from Mom and Dad! And that picture of Chi-Chi with her mischievous grin. And what you said about Nana. Ohh, yeah she really wouldve wanted to be there. And you know what? I think she was. \nMonica: (starts to cry) Oh good God, Ross! How the hell do you do it? \nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 18, "episode_id": "S08E18", "episode_title": "THE ONE IN MASSAPEQUA", "scene_number": 8, "scene_id": "S08E18_008", "location": "Central Perk", "scene_description": "Ross and Monica are there.", "characters": ["Monica", "Ross"], "firestore_path": "/episodes/S08E18/scenes/S08E18_008"}}
