{"id": "S08E24_001", "text": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 1, "scene_id": "S08E24_001", "location": "", "scene_description": "", "characters": ["THE ONE WHERE RACHEL HAS A BABY"], "firestore_path": "/episodes/S08E24/scenes/S08E24_001"}}
{"id": "S08E24_002", "text": "[Scene: An Empty Hospital Room, Chandler and Monica enter.]\nMonica: I think we found a place.\nChandler: Okay. (They start kissing.)\nMonica: Umm, wait! Do you want to set the mood a little?\nChandler: Okay. Uh, well dim the lights, dim the lights. (He goes to the light switch and finds its not a dimmer switch when he flips the lights off.) Or turn them out all together. Uh, no scented candles. Okay here. Here we go. (He sprays an aerosol air freshener above her.)\nMonica: Okay! Okay! Make me sterile, but okay.\n(He hops onto the bed and they start making out.)\nMonica: Okay. Lets hurryOh wait! Do we have a condom? (He looks at her.) Oh right! (Laughs and they resume making out when a nurse catches them in the act.)\nChandler: Yes, 98.6. Youre gonna be fine.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 2, "scene_id": "S08E24_002", "location": "An Empty Hospital Room", "scene_description": "Chandler and Monica enter.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S08E24/scenes/S08E24_002"}}
{"id": "S08E24_003", "text": "[Scene: Outside Room 816, Phoebe and Joey are approaching.]\nPhoebe: Ooh, this is it! (Looks in the window.) Oh, thats him! Thats him!\nJoey: Great! Go get him.\nPhoebe: Wait a second, or maybe you can go in first.\nJoey: (looks in the window) Hes not really my type.\nPhoebe: No not you, Dr. Drake Remoray. You can ask him questions and see whats he like. People tell doctors everything.\nJoey: But you said he was this great guy!\nPhoebe: But lately all the guys I meet seem really nice at first, then they turn out to be the biggest jerks.\nJoey: You do attract some stinkers.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 3, "scene_id": "S08E24_003", "location": "Outside Room 816", "scene_description": "Phoebe and Joey are approaching.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S08E24/scenes/S08E24_003"}}
{"id": "S08E24_004", "text": "[Scene: The Semi-Private Labor Room, Dr. Long is checking on Rachel again.]\nRachel: Dr. Long, Ive been at this for seventeen hours! Three women have come and gone with their babies, you gotta give me some good news! How many centimeters am I dilated? Eight? Nine?\nDr. Long: Three.\nRoss: Just three?! Im dilated three!\nDr. Long: We are moving along, just slowly. (Rachel lies back and sighs.) Dont worry, youre doing great. Ill be back soon. (Exits.)\nRachel: Hey, yknow what? Im not waiting! Im gonna push this baby out! Im doing it! I mean its what? Three centimeters? Thats gotta be like this! (Holds her hands a couple inches apart.)\nRoss: Actually its more like this. (Pushes her hands to less than an inch apart.)\nRachel: Oh stupid metric system!\n(Another woman with a nurse and doctor enter, the woman is screaming.) \nDoctor: Oh my. Were gonna need to take you straight to the delivery room.\nRachel: Oh for the love of God! \nWoman Giving Birth: (yelling from the hallway) Its coming! Its coming!\nDoctor: And here it is! (The baby cries.)\nRachel: Oh come on!!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 4, "scene_id": "S08E24_004", "location": "The Semi-Private Labor Room", "scene_description": "Dr. Long is checking on Rachel again.", "characters": ["Doctor", "Rachel", "Ross", "Woman Giving Birth"], "firestore_path": "/episodes/S08E24/scenes/S08E24_004"}}
{"id": "S08E24_005", "text": "[Scene: Room 816, Dr. Drake Remoray is entering.]\nJoey: Hi! Im Dr. Drake Remoray and I have a few routine questions I need to ask you.\nMan: Really? Ive been dealing with Dr. Wells.\nJoey: I know, but Im a neurologist. And just to be on the safe side, Dr. Wells wanted a more comprehensive overview of you status so he sent me.\nMan: Dr. Wells is a woman.\nJoey: That was a test. Good response. All right, full name.\nMan: Clifford Burnett.\nJoey: Date of birth? \nCliff: November 16th, 1968.\nJoey: Age?\nCliff: Cant you figure that out based on my date of birth?\nJoey: Im a doctor Cliff, not a mathematician.\nCliff: Im 33.\nJoey: Okay. And uh, are you married.\nCliff: No.\nJoey: Oh really? So, 33 and still single, would you say you have commitment issues?\nCliff: Are all the questions this personal?\nJoey: (checking the list) Yes.\nCliff: Well uh if you must know Im a widower.\nJoey: Oh thats terrible. Im-Im really sorry.\nCliff: Yeah.\nJoey: Hmm. Do you sleep with women and never call them again?\nCliff: No.\nJoey: Excellent! Excellent! And uh, finally, are you into any weird stuff yknow, sexually?\nCliff: No!\nJoey: Oooh, wrong answer. (Exits.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 5, "scene_id": "S08E24_005", "location": "Room 816", "scene_description": "Dr. Drake Remoray is entering.", "characters": ["Cliff", "Joey", "Man"], "firestore_path": "/episodes/S08E24/scenes/S08E24_005"}}
{"id": "S08E24_006", "text": "[Scene: The Semi-Private Labor Room, theyre brining in yet another woman.]\nNurse: (calling to the woman) This rooms available.\nRachel: Okay! Okay wait! You listen to me! You listen to me! Since I have been waiting four women, thats four, one higher than the number of centimeters that I am dilated, have come and gone with their babies! Im next! Its my turn! Its only fair! And if you bring in one woman and she has her baby before me Im going to sue you! Not this hospital, Im going to sue you! And my husband (Points at Ross) hes a lawyer!\nRoss: Uh Rach\nRachel: Go get back on that case honey!\nNurse: I dont think the next patient is very far along.\nRachel: Okay, well then bring her in.\n(Another nurse wheels the next pregnant woman in.)\nWoman: OH.MY.GAWD!!! (Uh-huh, its Janice.)\n(Ross and Rachel are, needless to say, stunned at the arrival of Janice.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 6, "scene_id": "S08E24_006", "location": "The Semi-Private Labor Room", "scene_description": "theyre brining in yet another woman.", "characters": ["Nurse", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S08E24/scenes/S08E24_006"}}
{"id": "S08E24_007", "text": "[Scene: The Semi-Private Labor Room, continued from earlier.]\nJanice: I.cant.believe this!\nRoss: And yet somehow its true!\nJanice: I mean this is so great! Were gonna be baby buddies! (Does the laugh.)\nRoss: (To Rachel) Squeeze your legs together and cover the babys ears!\nMan: (entering, carrying a pillow) Hi sweetie!\nJanice: Hi! Hi sweetheart! This is my husband Sid, I dont think youve met him. Ross, Rachel, this is Sid. I nabbed him a year ago at the dermatologists office. Thank God for adult acne huh? (Does the laugh.)\nSid: I still cant believe it! Im the luckiest guy in the world!\nRoss: (softly) Really?\nSid: (To Janice) Whatd he say?\nJanice: Oh yknow what? You have to speak very loudly when youre talking to Sid, because hes almost completely deaf.\nRachel: Oh!\nRoss: Oh there you go!\nRachel: I get it!\nJanice: So? Congratulations you two, I didnt even know you got married.\nRachel: Oh we-we didnt.\nRoss: No-no. We\nJanice: What?!\nRoss: Um uhWere-were just having this baby together but uh, uh thats all.\nJanice: Why?!!\nRoss: Uh well ummwere just not in that place, yknow? But were very excited about this.\nJanice: Oh. Well then shut me up. (Does the laugh.)\nRachel: Just tell me how.\nJanice: Uh-oh, I feel another one coming. (She makes a sound like a goose during the contraction.)\nRoss: Sid you lucky deaf bastard.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 7, "scene_id": "S08E24_007", "location": "The Semi-Private Labor Room", "scene_description": "continued from earlier.", "characters": ["Janice", "Man", "Rachel", "Ross", "Sid"], "firestore_path": "/episodes/S08E24/scenes/S08E24_007"}}
{"id": "S08E24_008", "text": "[Scene: Outside Room 816, Joey is briefing Phoebe on Cliff.]\nPhoebe: What else? What else?\nJoey: Uh, well hes 33.\nPhoebe: Oh. Ah-uh.\nJoey: A widower.\nPhoebe: Oh.\nJoey: He seemed like a stand up guy. Oh, and hes not into anything weird sexually.\nPhoebe: Enter Pheebs.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 8, "scene_id": "S08E24_008", "location": "Outside Room 816", "scene_description": "Joey is briefing Phoebe on Cliff.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S08E24/scenes/S08E24_008"}}
{"id": "S08E24_009", "text": "[Scene: Another Hospital Room, Chandler and Monica enter and start making out.]\nChandler: Should we tell Rachel theres an empty private room right next door to hers?\nMonica: We could, or we can have sex in it.\nChandler: Well let me think about that, while I remove my pants!\n(They start making out again.)\nMonica: (lying down on the bed) Okay mister! Fertilize me!\n(Suddenly they hear Janice laughing, and it ruins the moment.)\nMonica: Does that sound like Janice?\nChandler: If its not, then theres two of them. And that would mean its the end of the world!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 9, "scene_id": "S08E24_009", "location": "Another Hospital Room", "scene_description": "Chandler and Monica enter and start making out.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S08E24/scenes/S08E24_009"}}
{"id": "S08E24_010", "text": "[Scene: The Semi-Private Labor Room, Chandler and Monica are entering to see if they in fact did hear Janice.]\nMonica: Hey!\nRoss: Hey!\nChandler: Hi.\nRachel: Oh hi.\nMonica: I cant believe this is taking so long. How are you doing?\nRachel: Oh not bad. Do you know that feeling when youre trying to blow a Saint Bernard out your ass?\nChandler: Weirdest thing. Did I hear(A nurse opens the privacy screen and Chandler sees Janice)Mother of God its true!\nJanice: Chandler Bing!\nChandler: Jan-Janice!\nRoss: Not just Janice, Janice in labor, contracting and everything.\nJanice: Oh, this should be easy. I have a very wide pelvis. You remember Chandler.\nChandler: Janice I didnt even know you were pregnant! Whos the unwitting human whos essence youve stolen?\nJanice: Its you. This is yours.\nChandler: What?!\nJanice: (laughs) Look how nervous he gets! We havent slept together in years! (Laughs again.)\nChandler: Thats funny. Does it-does it hurt? Does the labor hurt?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 10, "scene_id": "S08E24_010", "location": "The Semi-Private Labor Room", "scene_description": "Chandler and Monica are entering to see if they in fact did hear Janice.", "characters": ["Chandler", "Janice", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_010"}}
{"id": "S08E24_011", "text": "[Scene: Room 816, Phoebe is making her move on Cliff.]\nPhoebe: Okay Ive got one for you, if you had too which one would you rather eat, a seeing eye dog or a talking gorilla?\nCliff: Id have to saythe talking gorilla, because at least I can explain to him that youre making me eat him.\nPhoebe: Somebody went to college. Wow. (Cliff gets uncomfortable) What is it? Im sorry. (She moves her arm, which was resting on the same pillow his leg is.)\nCliff: No, Im sorry. Its just my foot itches like crazy.\nPhoebe: Oh, Ill get it. (She gets up and grabs a spoon.)\nCliff: Wow! I usually get to know a girl a little better before I let her spoon me.\nPhoebe: Relax, its not like were forking.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 11, "scene_id": "S08E24_011", "location": "Room 816", "scene_description": "Phoebe is making her move on Cliff.", "characters": ["Cliff", "Phoebe"], "firestore_path": "/episodes/S08E24/scenes/S08E24_011"}}
{"id": "S08E24_012", "text": "[Scene: The Semi-Private Labor Room, Janice is being moved to the delivery room and is screaming in pain.]\nRachel: Oh thats five Ross. Five women have had five babies! And I have had no babies! Why doesnt she want to come out?\nRoss: Yknow what I think it is? I think youve made such a nice home for her over the last nine months that she just doesnt want to leave.\nRachel: Oh. Look at you making up crap for me. Oh God! (Starts another contraction as Dr. Long enters.)\nDr. Long: Twenty-one hours, youre a hero.\nRachel: Doctor you gotta do something! I think you gotta give me drugs or you gotta light a fire up in there and just smoke it out.\nDr. Long: Actually, I think youre ready to go to the delivery room.\nRachel: What?\nDr. Long: Ten centimeters, youre about to become a mom.\nRachel: My God. Okay. (Another woman enters.) Ha-ha-ha beat ya! Sucker!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 12, "scene_id": "S08E24_012", "location": "The Semi-Private Labor Room", "scene_description": "Janice is being moved to the delivery room and is screaming in pain.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_012"}}
{"id": "S08E24_013", "text": "[Scene: Room 816, Phoebe and Cliff are eating some pudding with spoons.]\nCliff: Is this the same spoon that was in my cast? (Smells it.)\nPhoebe: Yknow what? This one is. (Eats another spoonful of pudding as Cliff sees something on TV.)\nCliff: Oh my God! Thats the doctor who was in my room before!\nPhoebe: Huh. Okay, Mr. Perkazet.\nCliff: Im telling you! The guy from that show was here in my room, asking me all these weird questions!\nPhoebe: Cliff, do you really believe that a character from a TV show was here in your room?\nJoey: (entering) Rachels having her baby!! (Phoebe turns and looks at him.) Which is of no interest to me, Im a neurologist.\nCliff: That-thats him! You know him?\nPhoebe: Okay. Okay. IOkay ummthisI-I sent my friend Joey in here to find out stuff about you. Umm yknow, if it helps you came off great. A lot better than Im coming off right now.\nCliff: I dont believe this. You got him to pretend he was some fake doctor?\nJoey: Fake? Excuse me? Hello? (Taps the TV screen.)\nCliff: And then you tried to make me think that I was crazy.\nPhoebe: Youre right, that was wrong. Im sorry. Im so sorry. Its just that I liked you so much. Can we just, can we just start over?\nCliff: I dont think so.\nJoey: Uh, if I may? Umm-umm look, Cliff, you told me a lot of personal stuff about you, right? And maybe-maybe it would if-if would help if-if you knew some personal stuff about her. Uh, she was married to a gay ice dancer. Uh, she gave birth to her brothers triplets. Oh! Oh! Her-her twin sister used to do porn!\nPhoebe: Uh Joey, were trying to dial down the crazy.\nJoey: Right!\nPhoebe: Umm, look we dont, we dont really know each other so it would be really easy to just forget about this, but there seems to be something between us. And I dont know about you but that doesnt happen to me a lot.\nCliff: It doesnt happen to me either.\nJoey: Me neither.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 13, "scene_id": "S08E24_013", "location": "Room 816", "scene_description": "Phoebe and Cliff are eating some pudding with spoons.", "characters": ["Cliff", "Joey", "Phoebe"], "firestore_path": "/episodes/S08E24/scenes/S08E24_013"}}
{"id": "S08E24_014", "text": "[Scene: The Delivery Room, Rachel is finally giving birth.]\nDr. Long: Push. Push. Come on push for five seconds. 54\nRachel: 3-2-1 oh!!\nDr. Long: Okay, the next contraction should be in about twenty seconds.\nRachel: I cant. I cant push anymore, I cant.\nRoss: Sweetie youre doing great.\nRachel: Oh God twenty seconds my ass!!\nDr. Long: Here we go! Okay, keep pushing! Wait! I see something.\nRoss: What? You do? You do? (Looks) Oh my God!\nRachel: Dont say, \"Oh my God!\" Oh my God what?\nRoss: What is that?\nDr. Long: Its the babys buttock, shes breech.\nRoss: Oh thank God, I thought she had two heads.\nRachel: Oh God. Is she gonna be okay?\nDr. Long: Shes gonna be fine. Okay, shes in a more difficult position so youre gonna have to push even harder now. Go! Push!\nRoss: Go!\nDr. Long: Rachel youre gonna have to push even harder, nothings happening!\nRachel: Im sorry, I cant!\nRoss: Yes you can!\nRachel: I cant!\nRoss: Hey! Hey! Come on! You can! I know you can do this! Lets go!\nRachel: I cant. Please, you do it for me.\nRoss: No! Come on letsOne more time! One final push! Ready? 123! (Rachel pushes so hard her head snaps up head-butting Ross and knocking him down.)\nDr. Long: Good!\nRoss: (from the floor) Keep pushing!\nRachel: Are you okay?\nRoss: You have no idea how much this hurts. (All of the women in the room turn and glare at him.) Keep going! Keep going!\nDr. Long: Here we go!\nRoss: Oh! Oh! Shes upside down but shes coming! Shes coming!\nRachel: Oh God!\nRoss: Oh! Oh my God oh! Oh my God shes here.\n(The newest friend cries.)\nRoss: Oh shesshes perfect.\nRachel: Oh, shes so tiny. (Starts crying) Whered she go?\nRoss: Oh its okay. Theyre just-theyre just wrapping her up.\nRachel: Okay. Well be careful with her, shes really tiny.\nDr. Long: Here she is!\n(Dr. Long hands her to Rachel.)\nRachel: Oh hey you. Thanks for coming out of me. (The baby cries.) I know. Oh. Yeah. Oh, shes looking at me. Hi! I know you.\nDr. Long: Do we have a name yet?\nRachel: No, not yet.\nDr. Long: Thats fine, for now well just call her Baby Girl Green.\nRachel: Oh no, Baby Girl Geller-Green.\n(Ross and Rachel look into each others eyes and kiss.)\nRachel: Hello baby girl.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 14, "scene_id": "S08E24_014", "location": "The Delivery Room", "scene_description": "Rachel is finally giving birth.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_014"}}
{"id": "S08E24_015", "text": "[Scene: The Recovery Room, Ross is taking pictures of Rachel holding the baby as the rest of the gang enters.]\nPhoebe: Can we come in?\nRoss: Oh, come in.\nPhoebe: Hi!\nJoey: There she is!\nPhoebe: Oh, shes so beautiful.\nRachel: Here. (Hands her to Monica.)\nMonica: Oh my God! Shes amazing. Oh, oh Im so glad you guys got drunk and had sex!\nChandler: Its incredible, I mean one minute shes inside you and then 47 hours later here she is.\nJoey: (taking the baby) She looks so real! (The gang looks at him.) Yknow what I mean! Shes this whole tiny little person. She already has eyelashes and knees anduh-oh.\nRachel: What?\nJoey: Oh no-no, no for I second there I counted six fingers, but one was from the other hand so were good.\nPhoebe: Okay, my turn. My turn. (Joey hands her to Phoebe.) Oh! Youre so cute! Oh, I could squeeze your little head! (Pause) I wont.\n(Rachel starts crying again.)\nMonica: Whats the matter?\nRachel: Oh nothing I Sorry, I just cant stop crying.\nRoss: The doctor says its completely normal with all the hormones. Plus, you-youre sleep deprived.\nRachel: So? You guys are all sleep deprived. I dont see you weeping because you put your slippers on the wrong feet. Oh God. (Starts to cry harder.)\nJoey: Whats the matter now?\nRachel: I was reliving it.\nPhoebe: Ohhh. (Hands her back to Rachel.)\nChandler: So, do you know what youre gonna call her yet?\nPhoebe: Oh, wait a minute its not gonna be Baby Girl? I thought that was so original! \nRoss: Uh actually, we-weve narrowed it down to two names.\nRachel: Yeah, and yknow what? I love them both, so why dont you just pick one and thatll be it.\nRoss: Wow! Umm, okay uheveryonethisis Isabella. (Rachel starts crying.) What?\nRachel: Thats not her name! Im sorry, she just doesnt feel like an Isabella.\nChandler: So then I guess Ferdinad is out.\nJoey: What was the other one Ross?\nRoss: Umm, Delilah.\nRachel: Oh great! Suddenly she sounds like a biblical whore.\nRoss: So I guess were back to uh, Baby Girl.\nPhoebe: Yay!\nRachel: Well what are we going to do?\nMonica: Its okay honey, youll find a name.\nRoss: Ugh, easy for you to say, you already know what your kids names are going to be.\nChandler: You do?\nMonica: Yeah, Ive had them picked out since I was fourteen.\nChandler: Oh no, its gonna be named after some snack or baked good isnt it?\nRachel: Well tell us! What are they?\nMonica: Umm, okay. If its a boy its Daniel.\nRachel: And if its a girl?\nMonica: I dont want to say.\nRachel: Oh, just tell us! Were not gonna want it!\nMonica: Okay. Its Emma.\nRachel: (gasps) Emma! (Looks at the baby and starts to cry.) See? I dont want it.\nMonica: Take it.\nRachel: What?\nMonica: Its clearly an Emma.\nRachel: Oh honey, but you love that name.\nMonica: Yeah, but I love you more. Besides yknow, nothing goes with Bing. So Im screwed. I mean (Rachel hands Emma to Monica.) Oh, hi Emma. Yeah, thats you. Youre our little Em. Oh whats that honey? What? Oh, you want a little cousin? (To Chandler) You want a cousin right now?!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 15, "scene_id": "S08E24_015", "location": "The Recovery Room", "scene_description": "Ross is taking pictures of Rachel holding the baby as the rest of the gang enters.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_015"}}
{"id": "S08E24_016", "text": "[Scene: A Janitorial Closet, Monica and Chandler are emerging slowly.]\nChandler: That was amazing.\nMonica: I know. Hey, do you realize we may have just changed our lives forever? We may have just started a family. Nine months from now we can be here, having our own baby.\nChandler: And if not, we got to do it on a bucket.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 16, "scene_id": "S08E24_016", "location": "A Janitorial Closet", "scene_description": "Monica and Chandler are emerging slowly.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S08E24/scenes/S08E24_016"}}
{"id": "S08E24_017", "text": "[Scene: The Recovery Room, Rachel is putting Emma down for a nap.]\nJanice: (entering) Yoo-hoo! Aaron Litman-Neurolic would like to say hello to his future bride.\nRachel: Ohhh! (Looks at Aaron and recoils in horror.) Wow! He kinda takes your breath away doesnt he?\nJanice: Hes a keeper. How are you feeling?\nRachel: Oh, Im fine. (Gasps in pain as she sits down.)\nJanice: Can I just say, I really admire what youre doing. Just raising her all alone.\nRachel: Oh, Im not doing it alone. I have Ross.\nJanice: Oh, sure. Now. But what happens when he meets somebody else and gets married?\nRachel: Well then he gets a divorce, its Ross!\nJanice: Im telling you Rachel, listen to Janice. They all say theyre gonna be there until they start their real family.\nRachel: Well IThats never gonna happen with Ross.\nJanice: Oh well thats what I thought about my first husband, now Im lucky if my kid gets to spend the weekend with her father and the twins and little Ms. New Boobs.\nRachel: Really?\nJanice: I hate to be the one to say it, but honey you two (Her and Emma) are on your own.\nRachel: Well ThatsyknowThatsWeve been alone for the last twenty minutes were doing okay. Besides yknow what? I-IMaybe we wont be alone, cause lately I-Ithings have been happening between me and Ross, yknow? Right before I went into labor, we-we had this kiss. Yknow? So it might be thethe beginning of something.\nRoss: (entering) Hey Janice!\nJanice: Oh hi!\nRoss: Whos this little guy? (Gasps when he sees Aaron.)\nJanice: Say hello to Aaron, your future son-in-law.\nRoss: No-no. No.\nJanice: Im gonna leave the three of you alone.\nRoss: Okay.\nJanice: Bye. (Exits.)\nRoss: Man! Did you see the kid on that nose?\nRachel: Uh-huh. (Ross takes off his coat and sets in on a chair.) Yknow what I was, I was thinking about?\nRoss: Huh?\nRachel: Ummthat kiss before we left the apartment. That was some-something huh?\nRoss: Yeah. Yeah, it really was. But wewe gotta be careful. Wewe cant let that happen again, yknow?\nRachel: (pause) Right.\nRoss: I mean we dont want to go down that road do we?\nRachel: No! No, of course not. No. Thats why I brought it up. (Pause) They didnt have any sodas?\nRoss: Oh my God! Im sorry, I was talking to this nurse, completely forgot.\nRachel: Thats all right. (He goes to get her a soda.) And so it begins.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 17, "scene_id": "S08E24_017", "location": "The Recovery Room", "scene_description": "Rachel is putting Emma down for a nap.", "characters": ["Janice", "Rachel", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_017"}}
{"id": "S08E24_018", "text": "[Scene: Outside the Nursery, Ross is looking at Emma as Phoebe walks up.]\nPhoebe: Is she in there?\nRoss: Yeah. Shes putting her down now, thats her. (Points to the nurse putting Emma now.)\nPhoebe: Oh!\nRoss: Look at Emma!\nPhoebe: I just cant decide who she looks more alike, you or Rachel?\nRoss: Oh what are you kidding? Shes gorgeous, its all Rachel.\n(Pause)\nPhoebe: Im sorry, for the last time, why arent you two together again? (Silence from Ross.) No, I know. I know, because youre not in that place. Which would be fine, except you totally are.\nRoss: Itsits complicated okay?\nPhoebe: Yeah thats true. Yeah, you love her. You always have. You have a child together. There is no right answer.\nRoss: Look, weve been together. Okay? And then apart, and then together, and then apart, and now we have a baby. (Pause) Its just if-if we got together again and it didnt work outI could never do that to Emma. I mean she-she thinking everything(Starts to cry.) Oh thatsnow me. What do they put something in the water in this place? Since Rachel and I were doing really, were doing really well right now.\nPhoebe: I know. I know. I know. I know, and if you try to make it more you might wreck it.\nRoss: Yeah, exactly.\nPhoebe: Right. (Pause) Or you might get everything youve wanted since you were fifteen.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 18, "scene_id": "S08E24_018", "location": "Outside the Nursery", "scene_description": "Ross is looking at Emma as Phoebe walks up.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S08E24/scenes/S08E24_018"}}
{"id": "S08E24_019", "text": "[Scene: The Delivery Room, Rachel is in bed as Joey enters.]\nJoey: Hey. I just saw a woman breast feeding both of her twins at the same time; it is like a freak show up here. (Notices shes wiping her eyes.) Whats the matter?\nRachel: Nothing.\nJoey: What is it? Hey!\nRachel: Really its nothing. Im just\nJoey: Rach come on, what?\nRachel: Ive just been thinking about how my baby and I are gonna be all alone.\nJoey: What are you talking about alone? What about Ross?\nRachel: Oh please, hell be with his real family, the twins and little miss new boobs.\nJoey: Okay, how long was I watching that woman?\nRachel: Im just saying that yknow, someday Ross is gonna meet somebody andhes gonna have his own life. Right?\nJoey: Yeah, I guess so.\nRachel: I just never thought I would raise this baby all by myself. Pretty dumb huh?\nJoey: Hey, listen to me, listen to meyou are never ever gonna be alone. Okay? I promise thats not gonna happen.\nRachel: Joey. Honey what would I do without you? \n(They hug.)\nJoey: You dont have to worry about that okay?\n(Pause)\nRachel: Oh, hon can you grab me my other box of tissues? Theyre right on that chair under Rosss coat.\nJoey: Sure.\nRachel: Okay.\n(He moves Rosss coat to get the tissues and the engagement ring box Mrs. Geller gave him falls out of the pocket it was inside. Joey goes to one knee, picks up the box, opens it, and sees that its an engagement ring.)\nJoey: My God.\nRachel: Joey.\n(He turns to face Rachel on one knee with the box open.)\nRachel: (seeing the ring) Oh my God. (Pause) Okay.\n(Joey is stunned.)\n[Cut to Ross getting of an elevator carrying a bouquet of flowers and walking down the hall to Rachels room.]\n[Fade to black.]\nClosing Credits\n{Transcribers Note: As with all the cliffhangers, there was no credits scene. There will be a ninth and final season of Friends starting sometime in September. See you then, have a good summer everyone.}\nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 24, "episode_id": "S08E24", "episode_title": "THE ONE WHERE RACHEL HAS A BABY: Part 2", "scene_number": 19, "scene_id": "S08E24_019", "location": "The Delivery Room", "scene_description": "Rachel is in bed as Joey enters.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S08E24/scenes/S08E24_019"}}
