{"id": "S08E13_001", "text": "THE ONE WHERE CHANDLER TAKES A BATH\nWritten by: Vanessa McCarthy  Transcribed by: Eric Aasen  With Help From: Dan Gottleib", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 1, "scene_id": "S08E13_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E13/scenes/S08E13_001"}}
{"id": "S08E13_002", "text": "[Scene: Joey and Rachels, Joey is at the counter eating a bowl of Frosted  Flakes.]\nJoey: (thinking) All right. Its a new day. All that stuff about  Rachel, you dont feel that now. It was crazy! Youre fine.  Youre better than fine! You are, as your friend Tony would say, Grrrreat!  Everythings normal! Shes just your friend Rachel! Your friend  Rachel. Your friend! Rachel.\nRachel: (coming from her room) Hi, sweetie.\nJoey: (thinking) Hey, its your girlfriend, Rachel!\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 2, "scene_id": "S08E13_002", "location": "Joey and Rachels", "scene_description": "Joey is at the counter eating a bowl of Frosted  Flakes.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S08E13/scenes/S08E13_002"}}
{"id": "S08E13_003", "text": "[Scene: Monica and Chandlers, Chandler is sitting on the couch watching TV as  Monica comes out of the bathroom.]\nMonica: (airily) Hi.\nChandler: Are you, are you high?\nMonica: I just had the most amazing bath.\nChandler: Really? I dont like baths.\nMonica: Wait, you like them with me.\nChandler: Honey, its not the bath I enjoy, its the wet, naked lady.\nMonica: Oh, baths are so relaxing!\nChandler: Really? What do you do? You just sit in there stewing in your own filth.\nMonica: How dirty do you think I am? Im telling you, if you had some candles  and some bubbles and some music, you would love it! It would take all of your stress away.\nChandler: Honey, its 2:00 on a Wednesday and Im watching Road Rules,  how stressed do you think I am?\nJoey: (entering) Hey, Chandler, you got a minute? I-I really need to talk to you.\nChandler: Oh! Uh, yeah! Is this a cold pizza talk or a leftover meatloaf talk?\nJoey: Well, neither.\nChandler: Oh my God, whats up?!\nJoey: I dont know. Its-its justlately, Ive been  feeling Okay, heres what it is (Pause) You know what? I feel a lot  better, thanks! (Starts to leave)\nChandler: Oh no-no, no you dont, just come back.\nJoey: All right. Okay. You and Monica, friends for a long time, and sure there are  rules, but then you went to London. Oh, no, but thats different. I mean, there are  rules there, too! You know what I mean?\nChandler: Do you?\nJoey: It was different for you guys! I mean, I mean, you were both in the same  place, right?\nChandler: In London?\nJoey: Yeah.\nChandler: Yes. When Monica and I were in London, we were both in London.\nJoey: You know what? This is a bad idea. Forget it. Forget it, and listen, do me a  favor, this conversation was between you and me.\nChandler: If that.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 3, "scene_id": "S08E13_003", "location": "Monica and Chandlers", "scene_description": "Chandler is sitting on the couch watching TV as  Monica comes out of the bathroom.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S08E13/scenes/S08E13_003"}}
{"id": "S08E13_004", "text": "[Scene: Central Perk, Phoebe and Rachel are sitting on the couch. Ross sits down.]\nRachel: Hi! Oh, Ross, dont forget, we have that doctors appointment  tomorrow!\nRoss: Right.\nPhoebe: Hey, are you going to find out the sex of the baby?\nRoss: No-no, we talked about it. We dont want to know. All we care about is  that its happy and healthy.\nRachel: Yep! Happy and healthy! And cute!\nRoss: And smart!\nRachel: Popular.\nRoss: With an aptitude for science.\nPhoebe: Are you two talking about the same baby? Hey! Have you started off thinking  of names yet?\nRachel: Oh yeah! Ive come up with a bunch of ideas!\nRoss: Really? Me too!\nPhoebe: Me too!\nRachel: Really?!\nPhoebe: Uh huh! If its a girl, Phoebe, and if its a boy, Phoebo!\nRoss: Maybe. But it wouldnt hurt to have a backup, you know? Uh, Rach-Rach,  what were you thinking? (Gives her a look)\nRachel: Okay! I was thinking if its a girl, how about Sandrine? Its  French.\nRoss: Huh. Thats a really pretty name for-for an industrial solvent.\nRachel: Okay fine, what do you have?\nRoss: Well, OK, its for a boy. Well, I know its a little out there,  butDarwin.\nRachel: Wow, oh my God, our child will be beaten to death in the schoolyard.\nPhoebe: Yeah, by Sandrine.\nRoss: Youre just saying that 'cause I said no to your name!\nRachel: Im really, really not.\nPhoebe: How-how about you each get five vetoes?\nRoss: All right.\nRachel: All right.\nRoss: That sounds fair.\nRachel: Yeah! I dont think youre going to need it though. Okay, check  this out. If its a girl, Rain.\nRoss: Veto.\nRachel: Why?\nRoss: Rain? Hi. Hi, my name is Rain. I have my own kiln, and my dress is made out  of wheat.\nPhoebe: I know her! I bought homemade soap from her at a Dead show!\nRoss: Okay, how about, for a guy, Thatcher?\nRachel: Ross, why do you hate our child?\nRoss: Fine, you go.\nRachel: Okay, James.\nRoss: Huh.\nRachel: But only if its a girl.\nRoss: Oh, veto. How aboutOoh, I like Ruth! What about Ruth?\nRachel: Oh! Im sorry! Are we having an 89-year-old? How about Dayton?\nRoss: Veto. Stewart?\nRachel: Veto. Sawyer?\nRoss: Veto. Helen?\nRachel: Veto.\nPhoebe: Is it me, or is veto starting to sound really good?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 4, "scene_id": "S08E13_004", "location": "Central Perk", "scene_description": "Phoebe and Rachel are sitting on the couch. Ross sits down.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E13/scenes/S08E13_004"}}
{"id": "S08E13_005", "text": "[Scene: Monica and Chandlers, Monica comes from the bathroom as Chandler enters.]\nChandler: Hey.\nMonica: Boy, do I have a surprise for you!\nChandler: Sex on the balcony?\nMonica: No, but someones really not going to get over that idea, are they?\nChandler: What is it?\nMonica: I drew you a bath!\nChandler: Honey, I dont like baths! Could you draw me a picture of us having  sex on the balcony?\nMonica: Please, could you just try it for me? Come on, I used all my best stuff!  I-I-I lit some candles. I put on some music. I used bath salts, plus bubble bath! And got  you this little plastic Navy ship. So its a boy bath!\nChandler: Well, this does butch it up a bit.\nMonica: I swear, if you try it, you will love it!\nChandler: All right, if I do this, can we at least discuss sex on the balcony?\nMonica: Absolutely.\n(Chandler runs into the bathroom)\nMonica: Bet I know how that discussions going to go.\n[Cut to Chandler laying in the bathtub. \"Only Time,\" is playing in the  background.]\nChandler: (thinking) All right, this isnt so bad. I like the flower  smell! Which is okay, because Ive got my boat.\nMonica: (entering) So?\nChandler: Oh my God.\nMonica: I told you you were a bath person! Hey, when you get out, maybe I can give you  a facial!\nChandler: Im going to need a bigger boat.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 5, "scene_id": "S08E13_005", "location": "Monica and Chandlers", "scene_description": "Monica comes from the bathroom as Chandler enters.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S08E13/scenes/S08E13_005"}}
{"id": "S08E13_006", "text": "[Scene: The Doctors Office, the doctor is writing something as Rachel is on the  table, and Ross is standing.]\nRoss: I dont think you had an open mind about the name Ruth. I mean, come on,  little Ruthie Geller, how-how cute is that?\nRachel: Oh, oh my God! I can practically hear the mahjong tiles!\nDr. Long: Okay! All your tests look fine. Now, are you two interested in knowing  the sex of the baby?\nRoss: Uh, no. No, were not.\nRachel: But you have it right there in that file? You could tell us whether  its a boy or a girl? Dayton or Sandrine? Phoebe or Phoebo?\nDr. Long: Thats right. But if you dont want to know\nRoss: No, no, we want to wait, right?\nRachel: Right. Right.\nDr. Long: (looks at her beeping pager) Oh, Ill be right back. And, uh, I know  its really not my place, but please dont name your child Phoebo.\nRachel: (looking at the bulletin board with baby pictures) So, which of these  babies do you think is the ugliest?\nRoss: What? Rach! Come on, thats terrible!  Theyreuhtheyre babies. Theyre-theyre all beautiful.\nRachel: Third one from the left?\nRoss: Yeah, why is it staring at me? I think it knows Im talking about it.  (Rachel starts to peek at the file) Dont-dont youWhWhaHey!! \nRachel: What?! \nRoss: Youre looking!\nRachel: I didnt!\nRoss: I saw you!\nRachel: Okay fine, I did. But I didnt see anything, I swear.\nRoss: Shame on you! Ugly baby judges you!\nRachel: Okay, but Ross just listen to me\nRoss: No, no, no, no! Dont tell me! I dont want to know!\nRachel: But I couldnt even if I wanted to, because I dont know! I  swear; I didnt see anything, and I dont want to know! It was just a momentary  lapse.\nRoss: Momentary lapse. Dont-dont you have any self-control?\nRachel: (holding stomach) Okay, a couple months late on the lecture, Ross.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 6, "scene_id": "S08E13_006", "location": "The Doctors Office", "scene_description": "the doctor is writing something as Rachel is on the  table, and Ross is standing.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E13/scenes/S08E13_006"}}
{"id": "S08E13_007", "text": "[Scene: Chandler and Monicas, Monica is entering.]\nMonica: Hello?\nChandler: Im in the bathroom, can you come in here? I think theres  something wrong.\nMonica: You know what? I-I think Ill wait out here. \nChandler: Im in the bathtub.\nMonica: Oh. (She goes into the bathroom.) Whats wrong?\nChandler: I drew my own bath, but I did it wrong! The waters tepid. The salt  didnt dissolve and is now lodged places. And the scents I used dont  compliment each other. Eucalyptus and chamomileOh!\nMonica: What?\nChandler: The bath salts! Theyre starting to effervesce! Its different.  (Pause) Its interesting.\nMonica: Okay, lets talk about something else.\nChandler: Yeah! Sure, sure. So, what was going on with you today? Oh-oh-oh!\nMonica: Well, I actually had the weirdest conversation with Joey. He was talking  about rules and right and wrong and\nChandler: I had the exact same conversation.\nMonica: You did? What was he talking about?\nChandler: I dont know! Joey hasnt had this much trouble getting out  words since we saw him in Macbeth!\nMonica: (groans) That was a long night.\nChandler: All right, lets break this down. What exactly did he say to you?\nMonica: Okay, he was talking about rules.\nChandler: Uh-huh.\nMonica: Umm, and looking at people differently.\nChandler: He didnt say anything about that to me.\nMonica: What did he tell you?\nChandler: He was asking all these questions about you, me, and London. And, of  course the glue that holds this all together, the rules.\nMonica: Okay. So you, me and London. Looking at people differently. Maybe he wants  to do what you and I did in London with someone.\nChandler: But what did he mean by rules?\nMonica: Wait a minute! He stopped talking the minute Phoebe came in!\nChandler: Because he was looking at her differently.\nMonica: And Phoebe is his friend, so he thinks that would be breaking the rules!\nChandler: My God! He wants to do it with Phoebe in London!\nPhoebe: (from outside the bathroom) You guys?\nMonica: Just a minute! (To Chandler) Thats Mrs. Tribbiani!\nChandler: You dont say anything.\nMonica: Why would I say anything? That two of our best friends could start the  greatest love affair of their lives! And they would have me to thank, and we could all  start having babies?\nChandler: Im not going to let you say anything.\nMonica: You just stay here! (Dumps a jar of bath salts in the bathtub)\nChandler: Oh, God!\n(Monica runs out to Phoebe, who is in the kitchen)\nPhoebe: Oh, hey, Monica, I brought back your iron.\nMonica: Oh, you had that? \nPhoebe: Uh-huh.\nMonica: I thought I lost it. I got a new one, like, a month ago.\nPhoebe: Oh, just as well, I broke this one.\n(Monica starts smiling)\nPhoebe: What?\nMonica: Nothing.\nPhoebe: Okay.\nMonica: I mean, I-I, I really shouldnt say. I mean, Im really not  supposed to.\nPhoebe: Fine.\nMonica: Its a humdinger!\nPhoebe: Then its really too bad that you cant tell me.\nMonica: Somebody likes you!\nPhoebe: (Groans) Is it Chandler?\nMonica: No!\nPhoebe: Well, then tell him to stop staring!\nMonica: Its Joey!\nPhoebe: Really?! Joey?! You dont say.\nMonica: Is it something youd be interested in?\nPhoebe: I dont know, I dont know, I dont know. You know, I mean,  on the one hand, Mother may I? But yknow on the other hand No. No, I  cant. Were friends. No, oh, no. I dont want to risk what we have.\nMonica: I guess that makes sense. So, you think youre going to talk to him?\nPhoebe: Sure, yeah. I mean, its Joey. I dont want him to get hurt.  Well, I must say, I am on fire! First Chandler, now Joey!\nMonica: Not Chandler, just Joey.\nPhoebe: Sure.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 7, "scene_id": "S08E13_007", "location": "Chandler and Monicas", "scene_description": "Monica is entering.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S08E13/scenes/S08E13_007"}}
{"id": "S08E13_008", "text": "[Scene: Central perk, Ross is sitting on the chair as Rachel walks in.]\nRachel: Hey.\nRoss: Hey.\nRachel: You know what? Ive been thinking about it. Im really coming  around on the name Ruth. I think I would actually consider naming our child that.\nRoss: Rach, I-I cant tell you how-how much that means to me! Ohh Wait a  minute. Wait a minute. You-you hated the name Ruth! Why-why would you change your mind?  Unless, you know were never going to have to use it. You did see the folder. You  know its a boy!\nRachel: I didnt see anything! I actually changed my mind about the name.\nRoss: I dont think so! Youre just giving me Ruth so youll get to  name it when its a boy, and thats when youll swoop in and name him Heath  or Blaine or Sequoia.\nRachel: I wouldSequoia?\nRoss: Veto.\nRachel: Fine.\nRoss: Unless (Rachel groans.) You anticipated that I would figure all  this out and you know that it actually is a girl, and you really do want her to be named  Ruth! Well, Im not falling for that! Okay? Ruth is off the table!\nRachel: But Ross, you want the name Ruth!\nRoss: Not like this!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 8, "scene_id": "S08E13_008", "location": "Central perk", "scene_description": "Ross is sitting on the chair as Rachel walks in.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E13/scenes/S08E13_008"}}
{"id": "S08E13_009", "text": "[Scene: Rachel and Joeys, Joey is sitting on his recliner as Phoebe enters.]\nPhoebe: Hey.\nJoey: Hey. Well, whats up?\nPhoebe: Umm, Joey, I know.\nJoey: What?\nPhoebe: I knooow.\nJoey: Whaaat?\nPhoebe: I know about your feelings.\nJoey: Oh my God. You do?\nPhoebe: Yes, and Im sorry. I-I know things worked out for Chandler and  Monica, but thats very rare.\nJoey: I know. I know. And this is so much more complicated than it was for those  guys. I mean, its Rachel for God sakes.\nPhoebe: For God sakes, its Rachel!\nJoey: I know. I know. And shes not only my friend; shes my pregnant  friend! Shes my pregnant friend whos Ross ex!\nPhoebe: Yeah thats Rachel. (To herself) Beat me over the head with it.\nJoey: What am I going to do? You know, and I keep, I keep trying to get rid of  these feelings, yknow? I stayed up all last night and made a list of everything I  dont like about her. You want to hear it?\nPhoebe: Yeah.\nJoey: She made me switch to light Mayo. Thats it! Thats all I got! And,  you know what? It tastes the same and my pants fit better!\nPhoebe: Joey, I just think youre getting worked up over nothing. This is  probably just a crush.\nJoey: You think?\nPhoebe: Absolutely! Yknow, you get this rush of feelings, but then it goes  away.\nJoey: Yeah, just a crush! Thats all this is! Its a crush! Im  Joey; I dont get deep feelings.\nPhoebe: Thats right, there you go! Crushes happen all the time! I know  Ive had them for all you guys. Well, except for Ross and Chandler. And Im sure  youve had them for us.\nJoey: Not really.\nPhoebe: Mm-hmm. (To herself) Throw me a bone here.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 9, "scene_id": "S08E13_009", "location": "Rachel and Joeys", "scene_description": "Joey is sitting on his recliner as Phoebe enters.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S08E13/scenes/S08E13_009"}}
{"id": "S08E13_010", "text": "[Scene: Central Perk, Rachel is on the couch as Ross enters.]\nRoss: So, I uh I called the doctor and now we both know the sex of the baby.\nRachel: What?\nRoss: Thats right. The student has become the master.\nRachel: Ross, I swear, I dont know.\nRoss: Oh, come on, you know its a girl!\nRachel: A what?!\nRoss: You really didnt know?\nRachel: Were having a girl?\nRoss: No.\nRachel: Thats what you just said!\nRoss: No.\nRachel: You said girl!\nRoss: Yes. Im Im sorry. Im so sorry.\nRachel: Im not! Were having a girl! Sometimes I cant believe  its with youBut still! Were having a girl!\nRoss: I know! I know. You know what? Im putting Ruth back on the table!\nRachel: Oh, yes! Well have ourselves a little baby Ruth\nRoss: Permission to veto.\nRachel: Yes, please.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 10, "scene_id": "S08E13_010", "location": "Central Perk", "scene_description": "Rachel is on the couch as Ross enters.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E13/scenes/S08E13_010"}}
{"id": "S08E13_011", "text": "[Scene: Monica and Chandlers, Chandler enters as Monica comes from the bathroom.]\nMonica: Hey.\nChandler: Do I smell essential oils?\nMonica: Yeah, Im going to take a bath. Im just going to get a magazine.\nChandler: Okay.\n(As soon as Monica leaves the room, Chandler takes off his jacket and runs to the  bathroom. Monica enters the bathroom to find Chandler in the bathtub.)\nMonica: What do you think youre doing?\nChandler: L-leaving my troubles behind?\nMonica: I know that youre new at this, but this is completely unacceptable  bath decorum.\nChandler: Oh, its so hard to care when youre this relaxed.\nMonica: Fine, you can have the bath, but I am taking your boat. Now youre  just a girl in a tub!\n(Phoebe enters the bathroom)\nChandler: (upset) Hey!\nPhoebe: Hi, Bubbles. Manly. Well, I just thought I would drop by and let you know  how it went with Joey.\nChandler: (To Monica) You told her?!\nMonica: She pulled it out of me! Shes like a conversational wizard!  Howd it go?\nPhoebe: Well, you were wrong, he doesnt like me!\nMonica: What?\nPhoebe: Yeah! How would you like it if I sent you to Lee Majors house and  told you that he liked you, and you went down there and you found out that he didnt  like you? How would you feel?\nMonica: (Pause) I dont think Id care.\nPhoebe: Really? Lee Majors is hot!\nJoey: (from outside the bathroom) Hello?\nPhoebe: Were in the bathroom!\nJoey: Why?\nChandler: (sarcastically) Because its a relaxing and enjoyable time!\nJoey: (entering the bathroom) What are you guys doing in here?\nMonica: Oh my God! A friend hes looking at differently, but its wrong.  Its Rachel!\nChandler: You like Rachel?!\nJoey: Its no big deal, okay? Phoebe and I talked about it. Its just a  crush! Its going to go away! (Looks down) Dude, you gotta rearrange your bubbles!  Oh!\nPhoebe: (checking for herself) (To Monica) Mazel tov.\nRachel: (entering) Hey! Ross and I were looking for you! What are we all doing in  here? (Looks at Chandler) Oh, my! (Covers the spot where Joey wants bubbles to be  replaced.)\nMonica: Honey, cover it up with the boat!\nRoss: (from outside the bathroom) Hello?\nChandler: (sarcastically) Yes were all in here and we would love for you to  join us!\nRoss: (entering) Well hey! Whats going on? Ooh, cool boat(Sees why the  boats there)Oh, no. (Averts his eyes by looking around the room) (To Rachel)  Hey, did you, did you tell them?\nRachel: No, I was waiting for you!\nPhoebe: Tell us what?\nRachel: Were having a girl.\nAll: Oh, wow! Yay! Wow! Hooray! Oh, man!\n(They all hug and then turn and look at Chandler)\nChandler: IllIll get you later!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 11, "scene_id": "S08E13_011", "location": "Monica and Chandlers", "scene_description": "Chandler enters as Monica comes from the bathroom.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E13/scenes/S08E13_011"}}
{"id": "S08E13_012", "text": "[Scene: Joey and Rachels, Joey is sitting at the counter eating Cocoa Puffs.]\nJoey: (thinking) All right. Its a new day, and its just a  crush, thats all! Just a little crush! All that worrying I was doing,  that was crazy. Crazy! Like my friend here the bird would say, \"it  was cuckoo!\" Everythings going to be fine. Its just a crush.\nRachel: (entering) Hi, sweetie.\nJoey: (thinking) I love you.\nClosing Credits\n[Scene: Chandler and Monicas bathroom. Both are sitting on opposite ends of the  bathtub.]\nMonica: It sure is nice to do this together, isnt it?\nChandler: Yeah. And what youre doing feels so good.\nMonica: Im not touching you.\nChandler: Youre not?\nMonica: Its the salts.\nChandler: Oh, sweet Lord. New realms of pleasure!\nMonica: (To herself) Whatever keeps you off the balcony, big guy!\nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 13, "episode_id": "S08E13", "episode_title": "THE ONE WHERE CHANDLER TAKES A BATH", "scene_number": 12, "scene_id": "S08E13_012", "location": "Joey and Rachels", "scene_description": "Joey is sitting at the counter eating Cocoa Puffs.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S08E13/scenes/S08E13_012"}}
