{"id": "S08E04_001", "text": "THE ONE WITH THE VIDEOTAPE\nWritten by: Scott Silveri Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 1, "scene_id": "S08E04_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E04/scenes/S08E04_001"}}
{"id": "S08E04_002", "text": "[Scene: The Hallway, Chandler and Monica are returning from their honeymoon.]\nChandler: Wait. Before we go in, I just want you to know I love you. I had a great time on our honeymoon, and I cant wait to go in there and spend the rest of our life together.\nMonica: Youre really sticking with the shell necklace huh? (Points to necklace of shells hes wearing.)\n(Joey and Phoebe burst forth from his apartment.)\nPhoebe: Hi!\nJoey: Hey! Youre back! (Hugs and kisses all around.)\nMonica: Hi sweetie!\nPhoebe: Come on in! \n(They grab the luggage and drag it into Joey and Rachels forcing Monica and Chandler to follow.)\nPhoebe: So how was the honeymoon?\nMonica: Oh, so much fun. But the best part is, we met this incredible couple on the way back.\nPhoebe: That was the best part? (To Chandler) Good honeymooning tiger.\nMonica: No, they were really cool. They were on their honeymoon too!\nChandler: Theyre terrific, and they live right here in the city.\nMonica: Yeah, can we go call them? Is it too soon to call? I wanna call.\nChandler: Im sorry, were just kinda excited because we finally have a couple to hang out with.\nMonica: I know.\nJoey: A couple? Like two people? Like (points to himself) one (points to Phoebe), two people?\nMonica: This is different! Greg and Jenny are in a relationship.\nPhoebe: Oh, Greg and Jenny yuck! (Angrily) Hi Greg, Im Chandler this is Monica. Hi Monica, this is Jenny. Hi Jenny. Hi Greg.\nChandler: Listen, they are really great. If you just got a chance\nJoey: Yknow what? Why dont you just give us our souvenirs and get the hell out of here?\nChandler: We reallydidnt get a chance to\nPhoebe: You have got to be kidding me!\nMonica: We didnt get anything for anyone.\nJoey: Hm-mm! Yeah nice necklace!\nMonica: That you can have.\nOpening Credits\n{Transcribers Note: Tradition was broken here as there were no commercials immediately after the opening credits, just more show.}", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 2, "scene_id": "S08E04_002", "location": "The Hallway", "scene_description": "Chandler and Monica are returning from their honeymoon.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S08E04/scenes/S08E04_002"}}
{"id": "S08E04_003", "text": "[Scene: Monica and Chandler's, Ross and Rachel are entering with the rest of the gang already inside.]\nRachel: Hi!\nAll: Hey!\nRoss: Hello!\nRachel: Welcome home.\nRoss: So, how was the honeymoon?\nMonica: It was great! It was great! How about you?! I mean youre having a baby!\nRachel: Oh! Look! I have a sonogram picture! \nMonica: Oh great! (Shows them the picture.)\nChandler: Ross! Its got your wavy black lines!\nMonica: All right, so now that Ross knows can you tell us yknow how it happened? I mean, when did it happen? How many times did it happen?\nPhoebe: Monica! Thats not right! Start with where.\n(Rachel looks at Ross and gets his approval.)\nRachel: Well it happened about six weeks ago, and uh I had just got home from work and Ross was already there cause I guess he had been hanging out with Joey.\nJoey: Youre welcome buddy.\nRoss: (glaring at him) Yeah, thanks. (Joey nods no problem.)\nRachel: And so I had a lot of work to do so Ross, nice guy that he is, offered to help me out. And then we had a little wine, we got to talking, and the next thing you know out of nowhere Ross comes on to me.\nRoss: (laughs) Umm thatsthats a little misleading.\nRachel: What is?\nRoss: The lie you just told.\nRachel: That-that you came on to me?\nRoss: Theres the one!\nRachel: But you did! I mean, lets be honest.\nRoss: Yes lets. Yknow what? Uh, its-its not important. What is important is that, is that were having a baby. And its notDoesnt matter who came on to who.\nJoey: Whom. (Everyone looks at him shocked.) Thats right.\nRachel: You know you kissed me first.\nRoss: What? What?! You were begging me to kiss you! You-you-you were sending me signals all over the place!\nRachel: I was sending you signals?\nRoss: Yeah!\nRachel: Oh please. Okay, anyone in this room think that I would send Ross begging symbols, please show of hands. (Ross raises his hand and no one else.)\nRoss: Yknow what?! It doesnt matter! It doesnt matter what you believe! What matters is what happened!\nRachel: Okay. So these signals Ross, explain this to me, cause maybe I need to be more careful. I mean, am I sending you these signals right now?\nRoss: Yknow what? Yknow what? Rachel, just-just drop it.\nRachel: No please, show me how I begged you!\nRoss: I can show you, I have it on videotape! (Stunned silence) Its an expression.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 3, "scene_id": "S08E04_003", "location": "Monica and Chandler's", "scene_description": "Ross and Rachel are entering with the rest of the gang already inside.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_003"}}
{"id": "S08E04_004", "text": "[Scene: Monica and Chandler's, time has lapsed, Phoebe, Joey, Chandler, and Monica are sitting at the kitchen table.]\nPhoebe: I cant believe he taped the two of them having sex!\nJoey: Yeah! You gotta tell a girl before you tape her. Such a rookie mistake.\nChandler: Yknow who has a great video camera?\nPhoebe: (nasally) Greg and Jenny?\nMonica: Do you still wanna call em? I wanna call em.\nChandler: Lets call em.\nJoey: Yeah! Ask them if they brought their friends any souvenirs!\n(Monica goes over and dials their number.)\nMonica: (on phone) Hello? (Listens) Eighth street deli?\nJoey: Hey, hang up! You get food poisoning just talkin to that place.\nMonica: (on phone) Uh sorry, wrong number. (Hangs up)\nChandler: Here you go. (Shows her the number again.)\nMonica: (on phone) Hello? (Listens) (To All) Its the deli again!\nJoey: All right! Ill have a sandwich!\nMonica: (hangs up) I dont think this numbers right!\n(Joey and Phoebe laugh.)\nChandler: What?\nPhoebe: You got fake numbered.\nMonica: What?! People dont do that!\nJoey: Oh I think we do.\nMonica: They gave us a fake number? Why? Why would they do that?\nChandler: I dont know! You were a delight to talk to. You asked all those insightful, great questions.\nMonica: And youve never been funnier. Joke, joke, joke, you were a hoot!\nJoey: Yknow what? Dont worry about it, you still got me and Phoebe.\nPhoebe: Excuse me, I dont want Greg and Jennys rejects.\nRoss: (entering) Rachel wont talk to me! She wont even open the door!\nPhoebe: Hmm, I wonder why. Pervert!\nRoss: Okay, listen I am not a pervert!\nPhoebe: Thats like the pervert motto! Yeah! Yeah! They have you raise your right hand, put your left hand down your pants, and repeat that!\nRoss: Filming Rachel is not something I planned. Okay look, heres what happened, and Joey you-you can back me up on this. All right, about-about a month and a half ago I came to you with a problem? Umm, a personal thing. \nJoey: Personal thing? What personal thing? I dont know.\nRoss: Aboutabout sex? (Joey looks at him confused) That I hadnt had sex in months?\nJoey: (laughs) Yeah I knew what you were talkin about.\nSix Weeks Earlier", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 4, "scene_id": "S08E04_004", "location": "Monica and Chandler's", "scene_description": "time has lapsed, Phoebe, Joey, Chandler, and Monica are sitting at the kitchen table.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_004"}}
{"id": "S08E04_005", "text": "[Scene: Joey and Rachel's, Joey is reading a cereal box as Ross enters wearing the red sweater.]\nRoss: Hey!\nJoey: Hey.\nRoss: Do you have a minute? Id like to talk to you about something Im, Im really uncomfortable talking about.\nJoey: Sure. What? About uh, you showering with your mom?\nRoss: I actually had a topic in mind! Im, Im kinda going through a dry spell, sex wise.\nJoey: Whoa, for like months?\nRoss: Five to be lying, six.\nJoey: Six months? Whoa thats rough.\nRoss: Well, I mean its not all bad. Im learning to appreciate the uh, smaller things in life. Like the sound of a bird and the color of the sky.\nJoey: The skys blue Ross and I had sex yesterday!\nRoss: Please, help me! I have a date tonight. It has to go well okayIm scared for my health!\nJoey: Okay. Okay. UmmOoh! Oh-oh, I got something. Its this story I came up with, very romantic. I swear any woman that hears it; theyre like putty.\nRoss: Really? Well then tell it to me.\nJoey: Okay. Now youre gonna want to have sex with me when you hear it, but you have to remember it is just the story.\nRoss: (sarcastic) Ill try to control myself.\nJoey: Okay. (Clears throat) Years ago, when I was backpacking across Western Europe\nRoss: (laughs) You were backpacking across Western Europe?\nJoey: Have a nice six more months Ross! (Starts to leave.)\nRoss: (stopping him) Okay! Okay! Okay. Im sorry. Please, please, you were in Western Europe and?\nJoey: I was just outside Barcelona hiking in the foothills of Mount Tibidabo. I was at the end of this path and I came to a clearing and there was a lake, very secluded. And there were tall trees all around. (Whispering) It was dead silent. Gorgeous. (Softly) And across the lake I sawa beautiful womanbathing herselfbut she was crying\nRoss: (intently listening) Why?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 5, "scene_id": "S08E04_005", "location": "Joey and Rachel's", "scene_description": "Joey is reading a cereal box as Ross enters wearing the red sweater.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_005"}}
{"id": "S08E04_006", "text": "[Scene: Ross's Apartment, Ross is on his date with Kristen and theyre drinking wine.]\nKristen: Umm, this is great wine.\nRoss: Its from FranceIn EuropeWestern Europe. Yknow umm, a few years ago I actually was backpacking across Western Europe.\nKristen: Really?\nRoss: Uh-hmmWait! It gets better. Um, yeah I was in Barcelona.\nKristen: I studied for a year in Barcelona. (Ross is stunned and worried.)\nRoss: Anyway, umm so I was um, I was hiking\nKristen: I love hiking!\nRoss: (whines) Oh thats great! I was hiking along the foothills of Mount Tibidaybo\nKristen: I think its Tibidabo.\nRoss: Okay! Do you wanna tell the story?!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 6, "scene_id": "S08E04_006", "location": "Ross's Apartment", "scene_description": "Ross is on his date with Kristen and theyre drinking wine.", "characters": ["Kristen", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_006"}}
{"id": "S08E04_007", "text": "[Scene: Joey and Rachel's, Joey is standing at the counter as Ross enters.]\nJoey: Whoa! What are you doing here? How did your date go?\nRoss: Great! Im across the street having sex with her right now. Your story sucks!\nJoey: Hey! Look, if it didnt work its because you didnt tell it right! Show me how you did it.\nRoss: No! No, I dontdont want to.\nJoey: How long since youve seen a girl naked?\nRoss: I was backpacking across Western Europe.\nJoey: Im not feeling it.\nRoss: I was just outside Barcelona, hiking\nJoey: No! No! No Ross! Im not hot! Are you hot?\nRoss: Its been six months! Im always hot!\nJoey: Well youre not selling the story! Its like; its like you dont believe it! Look, I gotta go. I got a date, but try this. Do what I do when Im preparing for an audition. Okay? Ill set you up with my video camera and you can record yourself and-and see what youre doing wrong.\nRoss: Ill try that.\nJoey: All right now All right, youre all set up. Youre good to go. Just hit record. All right?\nRoss: Thanks.\nJoey: Good luck.\nRoss: Thanks. And-and hey Joe?\nJoey: Yeah?\nRoss: Listen, if you ever have any problem with the ladies you know Ill help you out.\nJoey: (trying not to laugh) That means a lot to me man. (Exits.)\n(Ross pours himself a glass of wine, hits record, and sits down in front of the camera.)\nRoss: Hello! Can I get you anything? Huh? Lens cleaner? Your battery okay? (Rachel bursts in carrying two boxes and Ross jumps up.) Rachel!\nRachel: Oh Ross!\nRoss: Hi!\nRachel: Thank God youre here! You have to help me! Were you just talking to yourself?\nRoss: Thats less embarrassing, yes. Yes I was.\n(They sit down on the couch, which is in front of the still recording camera.)\nRoss: (voiceover) So when she came in, I got distracted and totally forgot about the camera. [Cut back to the present day.] It kept rolling and recorded everything.\n(Pause)\nChandler: Yeah, were gonna need to see that tape. (They rest of them agree.)\nMonica: Yeah, definitely.\nRoss: What a great idea! That will get Rachel to forgive me!\nJoey: Yknow what? This is not fair to her. Lets just forget the tape!\nRoss: Thank you. (Joey mouths to Ross, \"Youll show me right?\") No!\nJoey: Youre right. (Mouths, \"I know youll show me, right?)\nRoss: Joey! No!\nJoey: Loud and clear! (Mouths, \"Youll show me,\" and nods.)\n(Ross storms out.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 7, "scene_id": "S08E04_007", "location": "Joey and Rachel's", "scene_description": "Joey is standing at the counter as Ross enters.", "characters": ["Chandler", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_007"}}
{"id": "S08E04_008", "text": "[Scene: Monica and Chandler's, Monica, Chandler, Joey, and Phoebe are now sitting in the living room.]\nMonica: I still don't get why Greg and Jenny would give us a fake number.\nJoey: Yknow, if they knew what they were doing they probably didnt give you real names either.\nMonica: Okay, maybe people give out fake numbers, but they dont give out fake names.\nJoey: Oh yeah? (To Phoebe) Hi, Ken Adams, nice to meet you.\nPhoebe: Regina Philange. (Ken and Regina shake hands.)\nChandler: I still dont get it, we didnt do anything wrong.\nMonica: I know! Although, you did tell an awful lot of jokes.\nChandler: I thought you said those jokes were funny. Joke! Joke! Joke!\nMonica: (rolling her head from side to side) Joke. Joke. Blah! Blah! (Joey and Phoebe laugh.)\nChandler: Well maybe it was all of your questions.\nMonica: What about my questions?\nChandler: The sheer volume, it was like flying with the Riddler!\nMonica: Oh, Im sorry. Was that another joke?\nChandler: (angrily) Was that another question?\nRachel: (entering) Hey! Is Ross still here?\nJoey: Uh no Rach, hes gone. But listen, he told us what happened and it does, it sounds like an honest mistake.\nRachel: Oh really? Well how would you like it if I had sex with you and I taped it? (Joey smiles luridly) Oh forget it! (Ross enters.) Oh there he is now, the father of my child, the porn king of the west village.\nRoss: Look, it was accident! Okay? I-I feel bad that it happened, but I swear, I didnt even watch it! Anyway, here. (He takes the tape out of his coat pocket.) I thought you might be more comfortable destroying it yourself. (Tosses her the tape.)\nRachel: Thank you. (She sets it on the floor and is about to stomp on it with her shoe when the rest of the gang jumps up and yells simultaneously.) What? (They all yell again.) You dont want to see this do you?\nMonica: Hell yeah!!!\nRachel: I am not gonna show you this!\nPhoebe: No! Not the sex part, just the stuff leading up to it.\nRoss: Forget it, shes destroying it.\nPhoebe: Okay fine! Fine! Well just have to think of some other way to put the whole Who came onto who, thing to rest! Come on now, think!!\nRoss: Look, forget it Phoebe. Okay? Its Rachels tape and she can do whatever she wants with it. And she wants to destroy it. So, end of story.\nRachel: I wanna see it.\nRoss: What?!\nRachel: Clearly you dont want people to see this tape. Now I dont want people to see this tape either, but you so badly dont people to see it makes me want to see it. You see?\nJoey: (confused) Are we watchin the tape or not?!\nRoss: I dont want people to see it for your sake.\nRachel: Ahh, I dont believe you. I think you dont want them to see you begging me. (Goes to put the tape in the VCR)\nRoss: Rachel, please\nRachel: Ah, a little preview!\nRoss: Fine. Fine, but I want the record to show that I tried to take the high road, because in about five minutes Im gonna be saying(He laughs and points at Rachel sarcastically.)\n(They both sit down.)\nRachel: Okay, here we go. (Pushes play.)\nRoss: (on tape) Hello! Can I get you anything?\nJoey: (To Phoebe) Im so happy!\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 8, "scene_id": "S08E04_008", "location": "Monica and Chandler's", "scene_description": "Monica, Chandler, Joey, and Phoebe are now sitting in the living room.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_008"}}
{"id": "S08E04_009", "text": "[Scene: Monica and Chandler's, the scene is continued from earlier.]\nRachel: (on tape) Oh, thank God youre here! You have to help me! Were you just talking to yourself?\nRachel: There I am.\nPhoebe: Youre gonna get pregnant.\nRachel: (on tape) I screwed up so bad, I told Monica that I would stuff and send all these wedding invitations like weeks ago and I-I\nRoss: (on tape) You didnt do it?\nRachel: (on tape) I-I knowI had put them inin-in my desk at work and I completely forgot about them until today.\n(Chandler is shocked and Rachel gets scared of Monica very quickly.)\nMonica: (taking Rachels hand) Sweetie okay. Its okay. Everybody made it to the wedding. Im fine.\nRachel: Kinda hurtin my hand though.\nMonica: I know.\nRachel: (on tape) (Ross hands her a glass of wine) I cannot believe that I did this. Especially after Monica just went on and on and on about it! (Mimicking Monica) \"Okay Rachel! Here are the invitations Rachel! Now be very careful Rachel! Please, drinking no liquids around the invitations Rachel!\" (She tilts her wine glass above and moves it back and forth across the invitations) Whoa oh! Oh-oh-oh! Ohoh-oh-oh\n(Rachel hits fast forward. Monica is completely shocked.)\nChandler: Did you do it on our invitations?!\nRoss: (pause) Not on the ones we sent out.\nChandler: So, just the ones gave back to us and we had framed! (Slams the framed invitation down onto the table.)\n(Rachel stops fast forwarding.)\nRachel: (on tape) Can you believe this is already happening? I mean it seems like yesterday they just got engaged.\nRoss: (on tape) I know. Hey rememberremember the night they got engaged? How uh, you and I almost\nRachel: (on tape) Oh, I remember how we almost. Do you think we wouldve gone through with it? Yknow, if we hadnt gotten caught. Do you think we wouldve done it?\nRoss: (on tape) I mean II know I wanted to. I just, I just wasnt sure if you wanted to.\nRachel: (on tape) Oh I wanted to.\n(Ross and Rachel trade looks while watching the tape.)\nRoss: (on tape) So wewe both wanted to.\nRachel: (on tape) Interesting.\nRoss: (on tape) Yeah. (Pause) Anyway umm, it probably worked out for the best.\nRachel: (on tape) Oh yeah, sure.\nRachel: Okay, in about ten seconds youre gonna see him kiss me.\nRoss: And in about five seconds youre gonna see why.\nRachel: (on tape) Ross did I ever tell you about the time that I went backpacking through Western Europe?\n(Joeys shocked and everyone else looks at Rachel.)\nRachel: Okay, get ready to see some beggin!\nPhoebe: Oh, you came on to Ross!\nRachel: What?!\nRoss: Now Im so happy.\nRachel: What are you talking about?!\nMonica: You used the Europe story!\nChandler: Thats the magic story you use when you wanna have sex!\nRachel: How do you know about that story?!\nJoey: How do you know about that story?!\nRachel: I heard it from my friend Irene who heard it from some guy!\nJoey: (raises his hand) Some guy!! (Points to himself.)\nRachel: No. No, she told me his name was Ken Adams.\nJoey: (raises his hand and points to himself again) Ken Adams!!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 9, "scene_id": "S08E04_009", "location": "Monica and Chandler's", "scene_description": "the scene is continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E04/scenes/S08E04_009"}}
{"id": "S08E04_010", "text": "[Scene: Joey and Rachel's, Rachel is looking at the tape sitting on the counter as Ross enters.]\nRoss: Hi.\nRachel: So uh, apparently people are familiar with the Europe story?\nRoss: Yeah. Listen about that, the whole uh, who came on to who thing really doesnt matter. I mean, I think it wouldve happened either way. I mean if you hadnt initiated it I-I-I know I wouldve.\nRachel: It was an amazing night.\nRoss: It was. It was an amazing night.\n(Pause)\nRachel: You think it looked amazing?\nRoss: I uh I dont know. I mean II honestly didnt watch it.\nRachel: Yeah, me neither. Yet\nRoss: Uhhhhhhthat-that may be weird.\nRachel: Yeah, it would be really weird.\n(Ross grabs the tape and heads for the VCR as Rachel goes over and puts the chain on the door and locks it.)\nRoss: Good luck.\nRachel: Good luck to you.\n(Ross pushes play.)\nRoss: Mind if I mute?\nRachel: Oh please. (He does so.)\nRoss: Oh, oh there go the clothes.\nRachel: You are undressing very quickly.\nRoss: Six months Rachel, six months.\nRoss and Rachel: Ah. (Pause) Oh.\nRoss: Hey. We-we lookwe look pretty good.\nRachel: Thats what I was gonna say.\nRoss: Oh nice tan!\nRachel: Thank you! I had just gone to the beach that weekend.\nRoss: Ah.\nRachel: Have you been working out?\nRoss: I have been working out.\nRachel: Really? Wow, this is so much better than I\nRoss and Rachel: Ohh! Ew!\nRoss: Oh thats not pretty.\nRachel: Oh! Oh!\nRoss: No!\nRachel: Oh God!\nRoss: Oh no!\nRachel: Oh, make it stop!\nRoss: Oh no!!\nRachel: Make it stop!!\nRoss: No!!\nRachel: Have to make it stop!!\nRoss: No!!!\n(They both get out of the chair and run for the VCR.)\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 10, "scene_id": "S08E04_010", "location": "Joey and Rachel's", "scene_description": "Rachel is looking at the tape sitting on the counter as Ross enters.", "characters": ["Rachel", "Ross", "Ross and Rachel"], "firestore_path": "/episodes/S08E04/scenes/S08E04_010"}}
{"id": "S08E04_011", "text": "[Scene: Monica and Chandler's, Monica and Chandler have gone through the phone book and found Greg and Jennys number which Monica has just dialed.]\nMonica: (on phone) Hello Greg? (Listens) Hi, this is Monica from the plane? Listen, the number that you gave me 853-5 (Listens) (To Chandler) That is their old number! Jennys been giving it out since they moved!\nChandler: Jenny! That is so Jenny!\nMonica: (on phone) Hey listen umm, how would you like to get together? Say next Saturday? (Listens) Okay, how about Sunday? (Listens) Okay umm, the week after that? (Listens) The week after that? (Listens) Yknow what Greg? Yknow what? We are good, interesting, funny people with good questions and if you and your precious Jenny cant see that then (Listens) January 15th? (Chandler dances.) Well see you then! (Listens) Okay! \n(She hangs up the phone and they hug.)\nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 4, "episode_id": "S08E04", "episode_title": "THE ONE WITH THE VIDEOTAPE", "scene_number": 11, "scene_id": "S08E04_011", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler have gone through the phone book and found Greg and Jennys number which Monica has just dialed.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S08E04/scenes/S08E04_011"}}
