{"id": "S08E05_001", "text": "THE ONE WITH RACHEL'S DATE\nWritten by: Brian Buckner & Sebastian Jones Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 1, "scene_id": "S08E05_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E05/scenes/S08E05_001"}}
{"id": "S08E05_002", "text": "[Scene: Monicas Restaurant Kitchen, she is frantically working and is handing two finished dishes to a waitress.]\nMonica: Okay, now this one is rare, this one is medium well! Now go-go-go! (Phoebe enters) Hey Phoebe!\nPhoebe: Hey!\nMonica: Hey how was dinner?!\nPhoebe: Dinner was good! \nMonica: Okay!\nPhoebe: Im just saying hi! Now Im gonna go! \nMonica: Okay!\n(Phoebe turns to leave but notices an attractive man.) \nPhoebe: (To him) Oh, well hello there.\nGuy: Hi.\nPhoebe: (To Monica) I didnt see this on the menu.\nMonica: Uh Tim? This is Phoebe. Phoebe this is Tim, my new sous chef.\nPhoebe: Oh, so you're Monicas boss?\nTim: Actually shes my-my boss. Sous is French for under.\nPhoebe: Oh! I sous stand.\nMonica: Hey Tim? I need a calamari and a Caesar salad. And umm, could you get me the pesto?\nTim: Yeah.\nPhoebe: Oh youyou made pesto?\nTim: Yes I did.\nPhoebe: Would you say your pesto is the best-o?\nTim: II-I dont know, but I would say its pretty good-o. (Phoebe laughs too hard.)\n(Monica goes over and grabs the pesto.)\nMonica: All right, I still need a calamari and a Caesar salad.\nTim: I like your necklace.\nPhoebe: I made it myself.\nTim: You are so talented.\nPhoebe: Well, its no pesto.\nMonica: All right, all right! Lets just cut to the chase, okay? (To Phoebe) Youre single. (To Tim) Youre single. (To Phoebe) He gets off work at eleven. (To Tim) Shell be waiting for your call. (To Phoebe) Ill give him your number if I can get one calamari and one Caesar salad!! (Everyone in the kitchen stops.) I did not yell. I am not putting a dollar in the jar.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 2, "scene_id": "S08E05_002", "location": "Monicas Restaurant Kitchen", "scene_description": "she is frantically working and is handing two finished dishes to a waitress.", "characters": ["Guy", "Monica", "Phoebe", "Tim"], "firestore_path": "/episodes/S08E05/scenes/S08E05_002"}}
{"id": "S08E05_003", "text": "[Scene: Chandlers Office, hes working at his computer as his boss, Mr. Franklin, sticks his head in.]\nMr. Franklin: Wow Bing! Burning the midnight oil.\nChandler: You know me sir. Oh ah, I do have a question for ya. Do you know how I get around the office computer network so I can access the really good Internet porn?\nMr. Franklin: Youre a joker Bing. (Walks away.)\nChandler: Whats funny about that?\nRoss: (running up) Hey! Sorry I kept you waiting so long.\nChandler: Hey thats okay. So, where do you want to go?\nRoss: Oh ah, I think you know where I want to go.\nChandler: The Hard Rock Caf?\nRoss: Yeah!\nChandler: Again?!\nRoss: Yeah!!\n(They go out to the elevators.)\nRoss: Im telling you, I like the food!\nChandler: You like the Purple Rain display! (A guy walks up.) Hey Bob.\nBob: Hey Toby! Have a good night. (Walks by.)\nRoss: Did that guy just call you Toby?\nChandler: Yeah, he thinks thats my name.\nRoss: Well, why dont you correct him?\nChandler: Oh its been going on way to long now. Yknow, I mean the first time he said it we were just passing each other in the hallway, so I didnt say anything. And then the next time he said, \"Hey Toby, do you want a donut?\" And I-I wanted a donut. And now its five years later, the donuts gone and Im still Toby.\nRoss: Five years?! Chandler you have to tell him!\nChandler: No! That would be so awkward! LookBesides, we work in different departments. Hes on the sixth floor yknow? So he calls me Toby once in a while. Whats the big deal? It could be worse, its not like hes calling me Muriel. (Chandler suddenly freezes into place.)\nRoss: (laughs) Muriel. Wh-why would he call you Muriel? (Ross realizes something.) Oh my God! Chandler M Bing? Its not just an M, your middle name is Muriel!!\nChandler: Shh! It is a family name!\nRoss: Chandler Muriel Bing. Boy, your parents never gave you a chance did they?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 3, "scene_id": "S08E05_003", "location": "Chandlers Office", "scene_description": "hes working at his computer as his boss, Mr. Franklin, sticks his head in.", "characters": ["Bob", "Chandler", "Ross"], "firestore_path": "/episodes/S08E05/scenes/S08E05_003"}}
{"id": "S08E05_004", "text": "[Scene: Days Of Our Lives set, Joey is doing a scene with a co-star as Rachel watches on a monitor.]\nJoey's Co-Star: Drake, Ive discovered the reason for all your headaches and memory loss.\nDr. Drake Ramoray: What is it?\nJoey's Co-Star: Apparently your brain transplant was not entirely successful. It seems your body is rejecting Jessicas brain.\nDr. Drake Ramoray: Is it serious?\nJoey's Co-Star: Not if we extract tissue from the original host body, synthesize antibodies, and introduce them into your system, which could stop it from rejecting the brain.\nDr. Drake Ramoray: Well that sounds simple enough, lets just do that.\nJoey's Co-Star: We would, but when we went to exhume Jessicas body, it was gone.\n(Dramatic music plays and Joey does a little Smell-the-fart acting.)\nDirector: Cut! Very nice people!\nJoey: (To Rachel) Okay, let me just get changed and we can go to dinner.\nRachel: Well dontWhat happened to Jessicas body?!\nJoey: Im not telling, youll have to see it on TV!\nRachel: You dont know do you?\nJoey: No, couldnt care less.\nJoey's Co-Star: Hey good scene man.\nJoey: Hey you too!\nJoey's Co-Star: Alright.\n(Rachel clears her throat.)\nJoey: What? You werent in it.\nRachel: Oh! (Motions to Joeys co-star.)\nJoey: Oh sorry. Uh-uh, Kash?\nKash: Yes?\nJoey: This is my friend Rachel. Rachel, Kash, Kash, Rachel.\nRachel: Hi.\nKash: Hey! How come I havent seen you here before?\nRachel: Well, Joey probably thinks Ill just embarrass him. Yknow, he thinks Im some kind of a soap opera nutWhich Im not! Im not. Although I do know that your uh, your favorite ice cream flavor is butter pecan. (Starts stroking his arm) And uh, and that your-your dogs name is Wally. Well look at that, Im just stroking your arm.\nJoey: (grabbing her) Here we go! Here we go! (Starts to pull her away from Kash.)\nRachel: Oh, were leaving. Bye Kash.\nKash: Bye.\nRachel: Say hi to Wally.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 4, "scene_id": "S08E05_004", "location": "Days Of Our Lives set", "scene_description": "Joey is doing a scene with a co-star as Rachel watches on a monitor.", "characters": ["Director", "Joey", "Kash", "Rachel"], "firestore_path": "/episodes/S08E05/scenes/S08E05_004"}}
{"id": "S08E05_005", "text": "[Scene: Central Perk, Monica is getting coffee as Phoebe enters.]\nPhoebe: Ooh Monica!\nMonica: Hi!\nPhoebe: Oh my God! I had the best time with Tim last night. He is so sweet! Oh, I cant wait to get sous-neath him.\nMonica: II have to fire him.\nPhoebe: But why?!\nMonica: Because hes terrible! Okay, hes slow, he burns things, last night he lit my pastry chef on fire!\nPhoebe: Well maybe he was just nervous, yknow you can be very intimidating. And besides Ive met your pastry chef and she can stand to be taken down a peg or two.\nMonica: Well, now she has no eyebrows, mission accomplished.\nPhoebe: But Monica, he loves his job so much! Can you just give him another chance? Please?\nMonica: (thinks about it) All right, but if-if he lights someone else on fire he is out of there!\nPhoebe: Thats fair! Thank you so much. Thanks. Oops, it looks like when he got the pastry chef he got you a little bit too.\nMonica: I paid to have this done.\nPhoebe: Love it!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 5, "scene_id": "S08E05_005", "location": "Central Perk", "scene_description": "Monica is getting coffee as Phoebe enters.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S08E05/scenes/S08E05_005"}}
{"id": "S08E05_006", "text": "[Scene: Joey and Rachel's, Rachel is eating at the counter as Joey enters.]\nJoey: Hey!\nRachel: Hi!\nJoey: Oh you know uh Kash, really liked you the other day. He said he thought you were charming.\nRachel: I thought I was a complete idiot.\nJoey: Hey, Im with you. He even asked me if I thought youd go out with him.\nRachel: Oh! Oh, I think Im gonna throw up a little bit. What did you say?\nJoey: I said no.\nRachel: What?!\nJoey: What? II just figured since youre pregnant youre not gonna be seeing people.\nRachel: Okay Joey, first of all Kash Ford is not people. Second of all, what did he say when you told him I was pregnant?\nJoey: I didnt tell him. I didnt know if you were telling people. This is back when I thought Kash was still people.\nRachel: Good-good, dont tell him. Dont tell him. Just have him call me okay?\nJoey: Rach look, I really dont think thats such a great\nRachel: Okay, you go do it! Ill come back to that set! Ill meet more actors! Ill meet em all!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 6, "scene_id": "S08E05_006", "location": "Joey and Rachel's", "scene_description": "Rachel is eating at the counter as Joey enters.", "characters": ["Joey", "Rachel"], "firestore_path": "/episodes/S08E05/scenes/S08E05_006"}}
{"id": "S08E05_007", "text": "[Scene: Chandlers Office Building, Chandler is walking by the elevators and sees Bob standing there.]\nChandler: Hey Bob.\nBob: Hey! Hows my pal Toby doing today?\nChandler: If I see him, Ill ask.\nBob: (laughs) Toby!\n(The elevator doors opens, Bob boards the elevator, Chandler walks away, and Mr. Franklin steps out of the elevator.)\nMr. Franklin: Hey-hey! Bing? Was that Bob from six you were just talking too?\nChandler: Yeah!\nMr. Franklin: Oh then you know each other.\nChandler: Were on a semi-first name basis.\nMr. Franklin: What do you think of adding him to our team?\nChandler: Bob? Ooh, working here with us? Everyday? Yeah, I dont know if he has what it takes.\nMr. Franklin: Really? They love him down on six.\nChandler: But this is eleven. Its almost twice as hard up here.\nMr. Franklin: Okay, I hear you loud and clear. Bob will stay put.\nChandler: I think its best sir.\nMr. Franklin: But we really do need to find someone up here. The work is starting to pile up. Ive got a stack of documents on my desk this high. (Holds his hand at shoulder level.) \nChandler: Yknow what you should do, just toss em in the shedder and claim you never got em.\nMr. Franklin: (laughs) Thats a good one. (Walks away.)\nChandler: What does a guy have to do to be taken seriously around here?!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 7, "scene_id": "S08E05_007", "location": "Chandlers Office Building", "scene_description": "Chandler is walking by the elevators and sees Bob standing there.", "characters": ["Bob", "Chandler"], "firestore_path": "/episodes/S08E05/scenes/S08E05_007"}}
{"id": "S08E05_008", "text": "[Scene: Monica and Chandler's, Monica is in the kitchen as Phoebe enters.]\nPhoebe: Hey!\nMonica: Hey. Okay, I gave him another chance, but Tim has got to go!\nPhoebe: But\nMonica: No! No-no! He is totally incompetent. I called the chef who recommended him to me. He said, \"Ha-ha! Gotcha!\"\nPhoebe: Okay. Okay, but you cant fire him today.\nMonica: Why not?!\nPhoebe: Because Im dumping him today.\nMonica: What?! You said he was sweet!\nPhoebe: He is sweet. Hes too sweet. He calls me all the time. (Mimicking him) \"So did-did you get home from work okay?\" \"Did-did you get out of the shower okay?\"\nMonica: Just dont pick up your phone.\nPhoebe: Then he comes over! (Mimicking him) \"Im so worried about you.\" Uck! Be a man!\nMonica: What? So now Im not allowed to fire him?\nPhoebe: You cant fire him and dump him the same day, hell kill himself.\nMonica: Okay well then, Ill fire him today and you go out with him for another week.\nPhoebe: Are you kidding?! Another week with that sip, Ill kill myself!\nMonica: Okay well, then well both do it today and hell just have to deal with it!\nPhoebe: Okay. But the question is whos gonna go first. Cause whoever goes second is the bitch.\nMonica: What do you mean?\nPhoebe: Come on! The boss that fires a guy thats just been dumped, bitch! And the woman who dumps a guy thats just been fired, blond bitch!\nMonica: I wanted to do this days ago so I think I should go first.\nPhoebe: All right, that makes sense. (Starts towards the door.) Ugh. ButScrew you Im going first! (She grabs her purse and runs out.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 8, "scene_id": "S08E05_008", "location": "Monica and Chandler's", "scene_description": "Monica is in the kitchen as Phoebe enters.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S08E05/scenes/S08E05_008"}}
{"id": "S08E05_009", "text": "[Scene: Chandlers Office Building, Bob is standing at the elevators and sees Chandler walk up.]\nBob: Hey Toby, you got a sec?\nChandler: Sure, whats up?\nBob: I just had a meeting, I was actually hoping to get transferred up here, but I just found out its not gonna happen. Apparently somebody thinks Im not eleventh floor material. Say uh, who the hell is this Chandler?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 9, "scene_id": "S08E05_009", "location": "Chandlers Office Building", "scene_description": "Bob is standing at the elevators and sees Chandler walk up.", "characters": ["Bob", "Chandler"], "firestore_path": "/episodes/S08E05/scenes/S08E05_009"}}
{"id": "S08E05_010", "text": "[Scene: Joey and Rachel's, Rachel is getting ready for her date and Joey is reading a magazine.]\nRachel: Hey, what do you think is a better excuse for why Im not drinking on this date tonight. \"Umm, Im a recovering alcoholic. Im a Mormon,\" or \"I got so hammered last night Im still a little drunk?\"\nRoss: (entering with a pizza and beer) Hey!\nRachel: Hi!\nJoey: Hey!\nRoss: So, what do you want to do tonight? Theres a Ukrainian film at the Angelica thats supposed to be very powerful. Interested?\nJoey: No. No. But Ill go see a normal person movie with ya.\nRoss: Rach? You wanna come?\nRachel: Oh no, I cant. I got a date.\nRoss: A date?\nRachel: Yeah. Why? Is that weird for you?\nRoss: Why no, its the opposite of weird. Its-its uh, regular. Its-its uh, its mundane. Its actually uh, a little dull.\nJoey: Its no Ukrainian film.\nRachel: YeahOoh! Earrings! (Goes into her room.)\nRoss: A date?! Shes-shes got a date?! With who?\nJoey: I set her up with this actor on my show.\nRoss: You set her up?!\nJoey: No\nRoss: Joey what-what were you thinking?!\nJoey: Well, I was thinking that itd probably be okay because Ross hasnt gone out with Rachel in five years!\nRoss: Joey, Im not worried about her! Im worried about my baby! Whoever she dates my baby dates! Now-now where is this (makes the quote-marks sign) actor taking them?\nJoey: Hey! Im an (does the quote-marks thing as well) actor too! Im not sure. I think theyre taking the ferry out to some Italian place on Staten Island.\nRoss: A ferry? My baby is going on a ferry? Do you have any idea how dangerous those are?!\nJoey: Are we talking about one of those big boats that carry cars that go like five miles an hour?\nRoss: Why dont they just jump out of an airplane?! Huh?! That-thats a fun date! Or burn each other with matches?! Thats fun too! Whew!!\n(Theres a knock on the door and Joey answers it.)\nKash: Hey Joey.\nJoey: Hey Kash. Uh hey-hey this is Ross. Ross, this is Kash.\nKash: Hey.\nRoss: Hi. I-I hear youre going on a ferry tonight.\nKash: Yeah.\nRoss: A bit of a daredevil are we?\nRachel: (entering from her room) Hey guys do you think this is too sluttyHi Kash!\nKash: Hey Rachel! You ready to go?\nRachel: Yeah! All right, Ill see you guys later.\nRoss: Okay. Have a great time you guys.\nRachel: Thank you.\nKash: Thank you.\nRoss: Yes it is too slutty! (Joey slams the door before Rachel could hear the entire sentence.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 10, "scene_id": "S08E05_010", "location": "Joey and Rachel's", "scene_description": "Rachel is getting ready for her date and Joey is reading a magazine.", "characters": ["Joey", "Kash", "Rachel", "Ross"], "firestore_path": "/episodes/S08E05/scenes/S08E05_010"}}
{"id": "S08E05_011", "text": "[Scene: Central Perk, Phoebe is reading a magazine as Tim enters.]\nTim: (walks behind Phoebe) Hi! (And startles her.)\nPhoebe: Hi.\nTim: Oh, Im so glad you called. I feel like its always me calling you. So, whats up? Is everything okay with Phoebe?\nPhoebe: It will bein a minute. Listen, Tim youre a really great guy.\nTim: Its because Im with you.\nPhoebe: Aw. (Phoebe gets a bad taste in her mouth when he looks away) Im justIm in a place in my life right now where II\n(Tims beeper goes off and he answers it.)\nTim: Whoops. Sorry. (Looking at it, like a newscaster) This just in. (Phoebe fake laughs.) Oh, its 9-1-1 from the restaurant, that means Monica needs me right away. (Starts to leave.)\nPhoebe: Oh-oh no she doesnt! I know what that is. You can stay.\nTim: Awww, Ill miss you too Pheebs. (Starts to leave) And I will be holding you, right here. (Holds his hands over his heart, blows a kiss to Phoebe who catches it, and then leaves and Phoebe throws the kiss back.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 11, "scene_id": "S08E05_011", "location": "Central Perk", "scene_description": "Phoebe is reading a magazine as Tim enters.", "characters": ["Phoebe", "Tim"], "firestore_path": "/episodes/S08E05/scenes/S08E05_011"}}
{"id": "S08E05_012", "text": "[Scene: Joey and Rachel's, Joey and Ross are having dinner.]\nJoey: So what movie do you want to seeAnd not another one I have to read. Okay? I get enough of that from books.\nRoss: Books?\nJoey: All right, car magazines, cereal boxes, but its like enough!\nRoss: Well, I tell you what. Why dont we uh, why dont we just stay here? Lets not see a movie, well just hang.\nJoey: And just wait for Rachel to come back from her date?\nRoss: Hey, if thats what you want to do Im not gonna say no.\nJoey: Dude! What is going on?!\nRoss: I justI have to find out how it went.\nJoey: Why?\nRoss: This guy could be my babys stepfather!\nJoey: They go on one date and youre worried about them getting married?! Hes not you!\nRoss: I justI-I cant believe shes-shes dating?!\nJoey: Well Ross, what did you think she was gonna do?\nRoss: I dont know! I guess I just cant believe any of this is happening.\nJoey: What do you mean?\nRoss: Its just I always thought when I had another kid it would be different. Now I-I love Ben, but every time I have to drop him off at Carol and Susans, its likeIt breaks my heart a little. I mean Ive always had this picture of me and my next wife in bed on Sunday and, my kid comes running in and leaps up onto the bed. And we all read the paper together. Yknow? Maybe fight over the science section.\nJoey: Thats a nice picture. Maybe you can still have that!\nRoss: No! No I cant. I mean Rachels out with some guy. My baby went with her. If anything that picture keeps moving further away.\nJoey: Hey, can I ask you something? In this, in this picture of you and your wife, is your wife Rachel?\nRoss: It used to be. Now she doesnt really have a face. Smokin body though.\nJoey: Good call. Yeah. But, the face Ross, the face isnt Rachel.\nRoss: No but ahh! How much easier would it be if it were?\nJoey: I know, but I dont think thats what she wants.\nRoss: No, its not what I want either. I mean I-I cant force myself to fall in love with her again now.\nJoey: Thats okay Ross maybe you need a new picture. Okay? Its not gonna be what you thought, but no matter what theres gonna be a brand new little baby, your baby. Who cares what the picture looks like?\nRoss: Yeah.\nJoey: Hey, I tell you what. Lets you and me go out and have some fun. Huh? Whatever you want. Come on!\nRoss: (checks his watch) We can still catch that Ukrainian film.\nJoey: No, I said fun!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 12, "scene_id": "S08E05_012", "location": "Joey and Rachel's", "scene_description": "Joey and Ross are having dinner.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S08E05/scenes/S08E05_012"}}
{"id": "S08E05_013", "text": "[Scene: Outside Chandlers Office, Chandler is just about to go into his office when Bob calls for him from behind.]\nBob: Hey Toby!\nChandler: Hey Bobby.\nBob: Its Bob actually. Hey, you work up here, can you tell me where this Chandler Bings office is?\nChandler: Uhh yeah. Yeah, its (Points down the hall) right, right down there. (When he has Bob looking down the hall, he turns around and knocks his nameplate off of his door.) Right there, yeah. Can I ask you why?\nBob: I want to talk to that bastard, see what his problem is.\nChandler: Okay Bob listen uhh, Im the reason you didnt get the job up here.\nBob: Toby dont.\nChandler: Bob!\nBob: Toby! Im not gonna let you cover for him. Anything you say right now will just get me more upset with Chandler!\nChandler: Well that puts me in a difficult position.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 13, "scene_id": "S08E05_013", "location": "Outside Chandlers Office", "scene_description": "Chandler is just about to go into his office when Bob calls for him from behind.", "characters": ["Bob", "Chandler"], "firestore_path": "/episodes/S08E05/scenes/S08E05_013"}}
{"id": "S08E05_014", "text": "[Scene: Monicas Restaurant Kitchen, Monica is waiting for Tim who enters.]\nMonica: Hey.\nTim: I got your page, is everything okay?\nMonica: Uh well that depends, how are things with Phoebe?\nTim: Oh its great! Its great! Thank you so much for introducing us!\nMonica: Oh my pleasure. Okay, Im afraid Ive got some bad news. (Phoebe enters.) Phoebe!\nPhoebe: Monica!\nMonica: (simultaneously) Youre fired!\nPhoebe: (simultaneously) Im breaking up with you!\nTim: What?\nPhoebe: Im, Im breaking up with you.\nMonica: Youre fired.\nTim: Why?\nPhoebe: Im sorry, Im justImIm just not ready for a relationship right now.\nMonica: Yeah and-and Im sorry too. But, well I justI like things done a certain way and the chemistrys just not right.\nPhoebe: Oh thats good, the chemistry thing for us too.\nTim: Wow! Umm, okay. Umm (To Phoebe) I-I-I realize I came on a little strong but, its only because I think youre so amazing. (To Monica) And uh, I-I just wanna, I just wanna tell you how much I appreciate you giving me an opportunity here because Iyoure the most talented chef Ive ever worked for. Anyway (Starts to leave and Phoebe and Monica trade looks.)\nMonica: Tim wait!\nTim: Yeah?\nMonica: Umm, I think I spoke too quickly. There-theres a learning curve with this job and maybe we can try it again.\nTim: Really?\nMonica: Yeah.\nTim: Thank you so much! Cause I-I know I can do better!\nMonica: Okay.\n(They both look at Phoebe.)\nPhoebe: And Tim I just wanna say, good luck here. (Shakes his hand and leaves, which disgusts Monica.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 14, "scene_id": "S08E05_014", "location": "Monicas Restaurant Kitchen", "scene_description": "Monica is waiting for Tim who enters.", "characters": ["Monica", "Phoebe", "Tim"], "firestore_path": "/episodes/S08E05/scenes/S08E05_014"}}
{"id": "S08E05_015", "text": "[Scene: A Street, Ross is walking past a newsstand and sees Rachel.]\nRoss: Hello.\nRachel: Hi!\nRoss: Well, how was the date?\nRachel: Well Im alone and I just bought fifteen dollars worth of candy bars, what do you think?\nRoss: Uh-huh. What happened?\nRachel: I made the mistake of telling him that I was pregnant.\nRoss: Ah, he didnt uh, take it so well?\nRachel: Well better than you, but yknow still not what you want.\nRoss: Oh?\nRachel: He got all weird and sputtery and then he said uh, \"Yeah, I hear those hemorrhoids are a bitch.\"\nRoss: He sounds swell.\nRachel: Doesnt he?\nRoss: Hey, wannawanna a little cheering up?\nRachel: Yes.\nRoss: Sit down. \nRachel: Okay.\n(They sit on some front steps.) \nRoss: Guess whose middle name is Muriel.\nRachel: (thinks then gasps) Chandler M. Bing?\nRoss: Yeah-ha!\nRachel: Oh my God. (Laughs)\nRoss: Im sorry about your date.\nRachel: Oh its all right. Im guess Im just done with the whole dating thing. Its one more thing in my life thats suddenly completely different. This is hard.\nRoss: Yeah I know. (Pause) On the other hand in um, in about seven months youre gonna have something that youre gonna love more than any guy youve ever gone out with. Just wait. Wait until uh, wait until the first time your baby grabs your finger. You have no idea.\nRachel: Thanks sweetie.\nRoss: You wanna, you wanna grab some coffee?\nRachel: Oh no, I think Im gonna go home and eat ten candy bars.\nRoss: Hey, I thought I cheered you up.\nRachel: Oh you did, there are twenty in here.\nRoss: Right. Good night.\nRachel: Good night.\n(He kisses her on the cheek and heads to Central Perk.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 15, "scene_id": "S08E05_015", "location": "A Street", "scene_description": "Ross is walking past a newsstand and sees Rachel.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E05/scenes/S08E05_015"}}
{"id": "S08E05_016", "text": "[Scene: Central Perk, Ross is entering and Mona from the wedding recognizes him.]\nMona: Ross?\nRoss: Yeah?\nMona: Hey its Mona! From the wedding.\nRoss: Oh hi!\nMona: Hi!\nRoss: Wow! Uhhow are you?\nMona: Im good except umm, you still owe me a dance.\nRoss: Oh thats right. Well uh, would you be interested in seeing a Ukrainian film?\nMona: (laughs then stops) Oh youre serious. Sure!\nRoss: Great! Well umm\n(Ross continues to talk to her as the camera pans to show Rachel standing in the doorway.)\nMona: I think I might need one more cup of coffee.\nRoss: Sure! Uh, let me get it for ya.\nMona: Okay.\n(Rachel watches that and slowly backs out to head for home.)\nDedicated to the Memory of Richard L. Cox, Sr.\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 16, "scene_id": "S08E05_016", "location": "Central Perk", "scene_description": "Ross is entering and Mona from the wedding recognizes him.", "characters": ["Mona", "Ross"], "firestore_path": "/episodes/S08E05/scenes/S08E05_016"}}
{"id": "S08E05_017", "text": "[Scene: Chandlers Office, Bob is ransacking Chandlers office.]\nChandler: (entering) Bob. Bob! Bob!!! (He turns around) What the hell are you doing?!\nBob: I just found out this is Chandlers office! Come on Toby, give me a hand!\n(He thinks about it and decides to join in by turning over a chair and continue ransacking the place.)\nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 5, "episode_id": "S08E05", "episode_title": "THE ONE WITH RACHEL'S DATE", "scene_number": 17, "scene_id": "S08E05_017", "location": "Chandlers Office", "scene_description": "Bob is ransacking Chandlers office.", "characters": ["Bob", "Chandler"], "firestore_path": "/episodes/S08E05/scenes/S08E05_017"}}
