{"id": "S08E03_001", "text": "THE ONE WHERE RACHEL TELLS...\nWritten by: Sherry Bilsing-Graham & Ellen Plummer Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 1, "scene_id": "S08E03_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E03/scenes/S08E03_001"}}
{"id": "S08E03_002", "text": "[Scene: Monica and Chandler's, Monica and Chandler are getting ready to go on their honeymoon. Monica is entering from the bedroom.]\nChandler: Hey! Babe! Arent you excited were going on our honeymoon?\nMonica: Yeah I am!\nChandler: (singing) Bermuda, Bahama, come on pretty mama\nMonica: Thats right. Get it out of your system while were alone.\nJoey: (entering with Phoebe) Hey!\nPhoebe: Yeah! Have a great honeymoon!\nChandler: Id better go pack.\nMonica: Oh no, I already packed. The only thing I couldnt find though was your Speedo.\n(Joey looks at him, Phoebe tries not to smile, and Chandler is shocked.)\nChandler: A Speedo? Uh, I dont have a Speedo. Im gonna go pack my regular long bathing suit. (Goes into the bedroom.)\nRachel: (entering) Oh good youre still here!\nMonica: Hey!\nRachel: I want to tell you to have a good honeymoon! (Hugs Monica.)\nMonica: Thank you.\nRachel: And I also wanted you guys to know that I am telling the father today. (They all look at her expectantly) What? What? What?\n(Pause.)\nJoey: We know its Ross!\nRachel: How?! How do you know?\nPhoebe: It was his sweater, butOh my God!\nRachel: Oh, I so wanted Ross to know first, but Im so relieved you guys know.\nMonica: This is so great! And Im gonna be your babys aunt!\nRachel: I know! (They hug.)\nPhoebe: Me too! (Joins the hug.)\nJoey: Im gonna be an uncle! Come here! (He joins the hug.)\nRachel: (breaking the hug) Youre all gonna be aunts and uncles.\nMonica: Yeah, but Im the only one related by blood.\nRachel: Okay. Great! So now that you guys all know you can help me. Give me some advice on how Im gonna tell Ross!\nMonica: Well, what were you gonna say?\nRachel: Well I was gonna tell him that Im-Im gonna have the baby and he can be as involved as he wants.\nJoey: Well that, that sounds good.\nRachel: Yeah but how do I start? I mean, whats-whats the first thing that I say? (They all pause to think.) Okay great! Thanks. (She starts to leave.)\nMonica: Hey! Good luck!\nPhoebe: Yeah, bye.\nJoey: Bye.\n(Rachel exits.)\nChandler: (entering) Hey, what was that all about?\nMonica: Well I guess there is no harm in telling you now, Rachel and Ross are gonna have a baby.\nChandler: (in a high pitched voice) What?! I didnt even know thatWhy didnt you tell me?! (Pause) Why am I talking like this?!\nMonica: I didnt think you could keep it a secret.\nChandler: (in the high pitched voice) What?! (Normal voice) I am an excellent secret keeper. I have kept all of our secrets.\nJoey: What secrets?\nChandler: Oh no-no Joey, I am not going to tell you because I am an excellent secret keeper.\n(The girls walk away.)\nJoey: (whispering to Chandler) Youll tell me later?\nChandler: You already know.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 2, "scene_id": "S08E03_002", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler are getting ready to go on their honeymoon. Monica is entering from the bedroom.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S08E03/scenes/S08E03_002"}}
{"id": "S08E03_003", "text": "[Scene: Joey and Rachel's, Joey and Phoebe are entering.]\nPhoebe: Oh, it's so romantic to send people off on their honeymoon.\nJoey: Yknow, Monica and Chandler are married. Ross and Rachel are having a baby. Maybe you and I should do something.\nPhoebe: All in good time my love. All in good time. Oh shoot! I left my guitar in their apartment. Well you can let me in later.\nJoey: I dont have a key, they took mine to give to you.\nPhoebe: What?! They took mine to give to you!\nJoey: Why would they take away our keys?\nPhoebe: Maybe they dont trust us.\nJoey: No thats not it. They let me keep my key the last time they were out of town. \nPhoebe: You mean the time you broke the ketchup bottle and cleaned it up with Monicas guest towels?\nJoey: Hey, I washed those!\nPhoebe: No you didnt.\nJoey: Yeah that didnt sound like me.\nPhoebe: Well, what am I gonna do? I really need my guitar!\nJoey: Yeah, I have stuff in there too.\nPhoebe: What stuff?\nJoey: Monicas chicken parm! Ill take care of it. (He picks up the phone) Hey Mr. Treeger, its Joey Tribbiani. Listen, I need to get into Monica and Chandlers apartment. Its an emergency. (Listens) Uhh, gas leak! Yeah oh, and bring garlic bread. (Hangs up.)\nRoss: (entering) Hey!\nPhoebe: Did Rachel find you?\nRoss: No why?\nPhoebe: Oh she was looking for you.\nRoss: Oh well, I guess Ill catch up with her later.\nPhoebe: Well, she really wanted to talk to you now.\nJoey: Yeah, it seemed pretty important.\nRoss: Oh no.\nPhoebe: What?\nRoss: I think I might know what this is about.\n(Phoebe and Joey trade looks)\nJoey: Really?\nRoss: Yeah. Uh, uh we promised we werent gonna tell anybody this but uh, about a month ago Rachel and I slept together.\nPhoebe: (deadpan) And?\nRoss: Wow! I thought you would be a little more shocked.\nPhoebe: Oh sorry. (Shocked) And?!\nRoss: Well, we-we said wed just do it that one time but, but now I think she may wanna start things up again.\nJoey: Yeah, I dont think thats what it is.\nRoss: Why? What-what else could it be?\nJoey: Oh wow, I dont feel well.\nRoss: Im telling you. Im telling you. Thats what it is. No wonder she was looking at me all funny during the wedding. She didnt say anything to you?\nPhoebe: (To Joey) Maybe its something you ate?\nJoey: Please, just-just, just go and talk to Rachel.\nRoss: Yeah, I guess I should. (Starts to leave.) Man, yknow what I have to realize? Maybe Im just not the type of guy women can have just one night with. Yknow, they-they always seem to want a little bit more. I should remember that. (He pauses and then exits.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 3, "scene_id": "S08E03_003", "location": "Joey and Rachel's", "scene_description": "Joey and Phoebe are entering.", "characters": ["Joey", "Phoebe", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_003"}}
{"id": "S08E03_004", "text": "[Scene: The Airport Ticket Counter, Monica and Chandler are standing in line behind another couple kissing who are next in line to be served.]\nTicket Agent: Next?\n(The kissing couple doesnt move.)\nMonica: Theyre kissing lets just go around them.\nChandler: Oh honey, leave them alone, theyre in love.\nMonica: Im in love too! But in an orderly fashion.\nTicket Agent: Next?\nMonica: (to the couple) Hi! Can you do that and walk? Cause she said, \"Next.\"\n(The couple moves up to the counter.)\nWoman: Sorry. We didnt hear you; were on our honeymoon.\nTicket Agent: Oh, let me see what I can do. (Checks the computer) There are some first class seats available.\nMonica: (To Chandler) Did you hear that?! They bumped them up to first class because they are on their honeymoon! Come on! Lets act like were on our honeymoon.\nChandler: We are on our honeymoon.\nMonica: Grab my ass!\nTicket Agent: Next?\n(They go up to the counter.)\nMonica: Hi, sorry. I almost didnt hear you, because yknow Im just so in love with my new husband. Were on our honeymoon.\nTicket Agent: Congratulations. Okay, Mr. Bing youll be in 25J and Mrs. Bing youll be in 25K.\nMonica: Oh no, you see were on our honeymoon. So umm, can you do your little thing and bump us up to first class?\nTicket Agent: Im sorry, all our first class seats are taken. That couple got the last two.\nMonica: You see, if wed gone around them like I said, weShe wouldve given us those tickets. Damnit!\nChandler: 25J and K, any chance those arent together?", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 4, "scene_id": "S08E03_004", "location": "The Airport Ticket Counter", "scene_description": "Monica and Chandler are standing in line behind another couple kissing who are next in line to be served.", "characters": ["Chandler", "Monica", "Ticket Agent", "Woman"], "firestore_path": "/episodes/S08E03/scenes/S08E03_004"}}
{"id": "S08E03_005", "text": "[Scene: Joey and Rachel's, Phoebe and Joey are playing Rock em, Sock em Robots.]\nJoey: I still cant believe they took away my key. You trust me with yours.\nPhoebe: Of course I do! And Im gonna give it back to you as soon as theyre done with it at the key shining place.\n(They hear a knocking sound coming from the hallway and go to investigate.)\nJoey: What the hell is that?\n(They go into the hallway and see Mr. Treeger watching one of New Yorks bravest breakdown Monica and Chandlers door with an ax.]\nJoey: Whoa! Whoa! Whoa! Treeger, what are you doing?\nMr. Treeger: You said there was a gas leak in here.\nPhoebe: Well why dont you use your key?\nMr. Treeger: Because by the time I find it on this thing (Holds up a huge key ring with a thousand keys on it), the whole place might have exploded. If that happens at another building that I manage, people are gonna start asking questions. (To the fireman) Come on! Hurry up.\n(With a final swing the door gives way.)\nPhoebe: Oh! We could have done that.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 5, "scene_id": "S08E03_005", "location": "Joey and Rachel's", "scene_description": "Phoebe and Joey are playing Rock em, Sock em Robots.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S08E03/scenes/S08E03_005"}}
{"id": "S08E03_006", "text": "[Scene: The Airport, Chandler and Monica are following the previous couple through a tiny hallway that proves this is a set on a sound stage and not an actual airport, and see them enter the first class lounge.]\nMonica: Look at that! Look at that! Theyre going into the first class lounge! Do you know what they have in there?\nChandler: No.\nMonica: Me neither! We have to get in! (She runs through the door with Chandler in tow.)\nChandler: Just act like you belong.\nMonica: Oh my God! Oranges!\nChandler: Shh! (To the guy behind the counter) Nice to see you again. (They tries to walk past him.)\nAirline Employee: Uh sir, may I see your tickets please?\nChandler: Yes, of course. (Shows him the tickets.)\nAirline Employee: Im sorry, would you move your thumb? I cant see the seat number.\nChandler: Oh thats all right, I have it memorized. Its 1A.\nAirline Employee: (grabbing the ticket from him) Sir, this is not a first class ticket. Im sorry.\nChandler: Apology accepted. Excuse us. (They try to enter again.)\nAirline Employee: Sir! Im afraid Im gonna have to ask you to leave.\nMonica: Fine. (Starts to walk away then she runs over and grabs an orange before she exits.) Go! Go! Go!", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 6, "scene_id": "S08E03_006", "location": "The Airport", "scene_description": "Chandler and Monica are following the previous couple through a tiny hallway that proves this is a set on a sound stage and not an actual airport, and see them enter the first class lounge.", "characters": ["Airline Employee", "Chandler", "Monica"], "firestore_path": "/episodes/S08E03/scenes/S08E03_006"}}
{"id": "S08E03_007", "text": "[Scene: The Hallway Outside Rosss Apartment, Ross is walking towards his apartment and sees Rachel sitting in front of the door.]\nRachel: (seeing him) Hi!\nRoss: Hi.\nRachel: Hi. (He helps her up.) Umm, I think theres something that we really need to talk about.\nRoss: (quietly confident) I think we do. Why dont we go inside? (They go inside.) Look uh, I know why youre here.\nRachel: You do?\nRoss: Yeah, and to save you from any embarrassment umm, I think maybe I should talk first.\nRachel: (warily) Okay.\nRoss: Okay. (He sits her down in a chair.) Uh, Ross and Rachel. Rachel and Ross. Thats been one heck of a see-saw hasnt it?\nRachel: (confused) What?\nRoss: I mean look, that-that one night we had was fun andand certainly passionate, but dont you think its better if we just stayed friends?\nRachel: Seriously. What?!\nRoss: Okay. Okay. Yknow what? If you want to, we can do it one more time. I mean Id-Id be okay with that. In fact, I have some time right now.\nRachel: Okay, yknow what? Can I, can I talk now?\nRoss: Oh sure. (He sits on the apothecary table and touches her hand.)\nRachel: (touches his knee) Im pregnant. (Ross stops.) Ross? (Ross is staring off into space.) Ross? (Ross is still frozen) Okay, whenever youre ready. (Sits back and opens her magazine.) And youre the father by the waybut you got that\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 7, "scene_id": "S08E03_007", "location": "The Hallway Outside Rosss Apartment", "scene_description": "Ross is walking towards his apartment and sees Rachel sitting in front of the door.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_007"}}
{"id": "S08E03_008", "text": "[Scene: Ross's Apartment, continued from earlier.]\nRachel: (closes her magazine) Can I get you some water?\nRoss: Im good. Im good.\nRachel: Ross, there is no pressure on you. Okay? I mean you can as involved as you want. (Ross nods.)\nRoss: Yeah, I need uh Im justI dont knowI dont understand, umm, how this happened? We-we used a condom.\nRachel: I know. I know, but yknow condoms only work like 97% of the time.\nRoss: What? What? What?!! Well they should put that on the box!!!\nRachel: They do!\nRoss: No they dont!!! (He runs to the bedroom to check and returns with his box of condoms.) Well they should put it in huge black letters!!!!\nRachel: Okay Ross come on lets just forget about the condoms.\nRoss: Oh well I may as well have!\nRachel: Listen, yknow what? I was really freaked out too when I found out\nRoss: Freaked out? Hey no, Im not freaked out! Im indignant! As a consumer!\nRachel: Yknow what? Lets, lets talk later.\nRoss: No! No! I want to talk now! Okay? IIn fact, (picks up the phone) I am going to talk to the president of the condom company!\nRachel: Okay, yknow maybe I should come back (Starts to leave.)\nRoss: (grabs her) Shh! Shh! Shh!\nRachel: (stops) Okay.\nRoss: (on phone) Yeah Ill press 1! (Presses one which allows Rachel to escape.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 8, "scene_id": "S08E03_008", "location": "Ross's Apartment", "scene_description": "continued from earlier.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_008"}}
{"id": "S08E03_009", "text": "[Scene: Monica and Chandler's, Mr. Treeger has finished inspecting Monica and Chandlers apartment.]\nMr. Treeger: Ive looked everywhere. Theres no gas leak.\nJoey: (eating) Huh. So then I can heat this up? (Goes and does so.)\nMr. Treeger: Anyway uh, Ill get moving on that new door.\nPhoebe: Oh great! And listen, could you do us a favor and not tell Chandler and Monica about this? Cause yknow umm, they dont-they dont have any kids of their own and-and this door was like a child to them.\nMr. Treeger: Well Im gonna have to put on a new lock, theyll find out anyway.\nPhoebe: Oh no.\nMr. Treeger: (measures the top of the doorframe) Whoa! This looks like an all day job, Ill have to cancel my yoga class. (Ross walks up.) Hey Ross!\nRoss: Hi.\nMr. Treeger: Could you tell Jasmine that I won't make it to yoga class today?\nRoss: Sure.\nMr. Treeger: Namaste. (Bows.)\nRoss: Namaste. (Bows.)\n(Treeger leaves and Ross notices the door.)\nRoss: Oh my God! What happened to the door?!\nJoey: So its noticeable huh?\nRoss: Look, is Rachel here? I really need to talk to her.\nPhoebe: Didnt you two already talk?\nRoss: Yeah but uh Okay, okay look you guys know that Rachel and I slept together, but theres something else. (Pause) Rachels pregnant.\nJoey: (simultaneously) Oh my God!!! I cant believe that!!\nPhoebe: (simultaneously) Holy mother of God!!!\nRoss: With my child.\nPhoebe: That is brand new information!!\nRoss: You already know dont you?\nPhoebe: A little bit.\nJoey: How are you doing?\nRoss: Okay. Okay. I mean Ill be okay. Its just I dont think I handled it very well.\nJoey: Well, what did you say to her?\nRoss: Nothing. But the complaint department at the condom company got an earful. And then when I turned around she was gone.\nPhoebe: Oh Ross.\nRoss: But hey, in my defense I-I just found out condoms are like only 97% effective.\nJoey: (shocked) What?\nRoss: I gotta go find her.\nJoey: Whoa! Hey! Whoa!! Hold up! Are you serious?! So like 3% of the time they dont even work?! Huh? They should put that on the box!\nRoss: Evidently they do.\nJoey: What?! (Grabs his condoms from his pocket and looks.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 9, "scene_id": "S08E03_009", "location": "Monica and Chandler's", "scene_description": "Mr. Treeger has finished inspecting Monica and Chandlers apartment.", "characters": ["Joey", "Phoebe", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_009"}}
{"id": "S08E03_010", "text": "[Scene: The Atlantis Resort, Chandler and Monica are arriving to check in, but are behind the couple from before again.]\nMonica: I cant believe were here.\nChandler: Oh youve got to be kidding me.\nMonica: What? (Monica sees the first couple and gasps.)\nFront Desk Clerk: As a wedding gift to you, the hotel would like to give you the honeymoon suite.\nMonica: No!! You have been screwing us all day!\nMan: Who are you?\nChandler: Were you just ten seconds later!\nMonica: Yeah! You already got the first class tickets; you got the lounge! I mean we should get free stuff too! I mean youre not the only ones on your honeymoon!\nWoman: Well you can have the suite if you want. We dont care about where we stay. Were here to celebrate our love together. We dont have to get free stuff. We just want to be together.\nChandler: (looks at Monica then at them) We need the stuff.", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 10, "scene_id": "S08E03_010", "location": "The Atlantis Resort", "scene_description": "Chandler and Monica are arriving to check in, but are behind the couple from before again.", "characters": ["Chandler", "Front Desk Clerk", "Man", "Monica", "Woman"], "firestore_path": "/episodes/S08E03/scenes/S08E03_010"}}
{"id": "S08E03_011", "text": "[Scene: Monica and Chandler's, Joey is on the phone and Phoebe is watching him.]\nJoey: Hey Monica its Joey. Listen uh, Phoebe and I smell gas comin from your apartment.\nMonica: What? Are you serious?! (To Chandler) Joey smells gas!\nChandler: What else is new?\nJoey: Yeah and wed go check it out, but you took away our keys.\nMonica: Well do something! Get in there!\nJoey: How? I guess I could break down your door.\nMonica: Yeah! Do that!\nJoey: And-and you wont blame us for any damage? (Gives Phoebe a thumbs up.)\nMonica: No! (Pause) Are you doing it?! I dont hear anything! Come on!\nJoey: Uh, okay Ill-Ill-Ill break it down. (He hands the phone to Phoebe, gets up, picks up a chair, and starts banging it on the floor.)\nPhoebe: Oh hey hi, hes doing it. Hes breaking down the door. (The chair breaks in half.) Okay, were in. (She hangs up the phone.)", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 11, "scene_id": "S08E03_011", "location": "Monica and Chandler's", "scene_description": "Joey is on the phone and Phoebe is watching him.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S08E03/scenes/S08E03_011"}}
{"id": "S08E03_012", "text": "[Scene: A doctors office, Rachel is on an examining table with her legs in the stirrups.]\nNurse: Okay Rachel, are you comfortable?\nRachel: (sighs) If I said I was, would you judge me?\nNurse: The doctor will be here in a minute to do your sonogram.\nRachel: Okay. (The nurse exits.) Oh man, I swear if they sold these at Pottery Barn\n(Theres a knock on the door and Ross enters.)\nRoss: Hi!\nRachel: (shocked) Hi!\nRoss: Uh we-we need to talk.\nRachel: Uh-uh-uh, right now? Because Ive kinda got an el fresco situation going on over here.\nRoss: Please, please I want to apologize for the way I acted earlier today.\nRachel: Okay Ross thats fine, but can you please stand near my head?\nRoss: What? Oh yeah. (He moves next to her head.) Im sorry. I mean I-I think I went a little crazy. I mean I was thinking about myself when I (Wanders towards Rachels feet) reallyI should have been thinking about you Rach\nRachel: Okay. Head Ross! Head Ross! Head Ross!\nRoss: Right! Right! I justI want you to know that Im going to be there through this whole thing, okay? Okay? The doctors appointments, the uh, the Lamaze classes, uh baby-proofing the apartmentAlthough we could probably worry about that til after we get married.\nRachel: What married?\nRoss: Well yeah, I think we should get married.\nRachel: What, because thats your answer to everything?\nRoss: No, because thats the right thing to do.\nRachel: Yeah, maybe if youre in love. But Ross, we are not in love, are we?\nRoss: No butbut still you cant possibly do this alone.\nRachel: Excuse me?\nRoss: Come on Rach, you cant even eat alone in a restaurant.\nRachel: What?!\nRoss: Im just saying if you cant eat by yourself, how do you expect to have a baby by yourself?\nRachel: I can too eat by myself!\nRoss: When have you ever?\nRachel: When certain people leave the table and I am not finished!\nRoss: Well certain other people take two hours to eat a bowl of soup!\nRachel: Oh please, you inhale your food!\nRoss: I grew up with Monica! If you didnt eat fast you didnt eat!!\nDr. Long: (entering) Am I interrupting?\nRachel: Oh no Dr. Long, please come in. This is Ross, he is the father.\nRoss: But not the husband, because evidently she can do this alone.\nDr. Long: Huh. Nice to meet you. Ill get started on this.\nRoss: (To Rachel, standing by her feet) I dont know why you cant admit that you need me.\nRachel: I do need you! I need you to stand near my head!\nDr. Long: Okay, everything looks good. Here it is on the screen. (We see Ross and Rachel looking at the screen.) Here is your uterus. And right here is your baby.\nRoss: Oh my God.\nRachel: Wow. There it is, I see it.\nDr. Long: Congratulations. Ill give you two a minute.\nRachel: Okay.\nRoss: Thank you.\n(Dr. Long exits and Rachel starts to cry.)\nRoss: Pretty amazing huh?\nRachel: I dont see it!\nRoss: What? What?!\nRachel: I cant see it!\nRoss: You-you just said that you did!\nRachel: I know, I lied! I didnt want her to think I was a terrible mother! I cant even see my own baby!\nRoss: Oh sure, come here! (Sits her up) Sure you can! Uh, look come here look, (rolls the machine closer) its-its-its, its right there (Points).\nRachel: Oh. Oh, its beautiful. I see it now.\nRoss: Do you really?\nRachel: No, I dont see it!\nRoss: Come on! Come on! Here, okay-okay, you see this? (Points) This tiny thing that looks like a peanut?\nRachel: Yeah.\nRoss: Sweetie thats it.\nRachel: Thats it? Well I saw that! Ohh-ohh-oh, thank you.\nRoss: Youre welcome.\nRachel: Wow! I cant believe thats our baby.\nRoss: Yeah, thats our baby.\nClosing Credits", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 12, "scene_id": "S08E03_012", "location": "A doctors office", "scene_description": "Rachel is on an examining table with her legs in the stirrups.", "characters": ["Nurse", "Rachel", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_012"}}
{"id": "S08E03_013", "text": "[Scene: Joey and Rachel's, Joey and Phoebe are there as Rachel and Ross return from the doctors appointment.]\nRachel: Hi.\nJoey: Hey!\nPhoebe: Hey! So how was the doctor?\nRachel: Oh, everything went great.\nPhoebe: Good.\nRoss: Oh hey, show them the picture of your uterus.\n(She does so.)\nPhoebe: Oh.\nJoey: I dont see the baby. Where is it?\nRachel: Oh no, I know I couldnt see it either at first, but its right umm (Starts to cry) Ross, I lost it again.\nRoss: Oh. (He takes the picture and hugs her.\nEnd", "metadata": {"chunk_type": "scene", "season": 8, "episode_number": 3, "episode_id": "S08E03", "episode_title": "THE ONE WHERE RACHEL TELLS...", "scene_number": 13, "scene_id": "S08E03_013", "location": "Joey and Rachel's", "scene_description": "Joey and Phoebe are there as Rachel and Ross return from the doctors appointment.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E03/scenes/S08E03_013"}}
