{"id": "S09E10_001", "text": "The One with Christmas in Tulsa\n\n[Scene: Monica and Chandlers apartment.]\nMonica: Hey Hon, could you help me get the plates down?\nChandler: Yeah. Hey, here's an idea, why don't we use our   wedding china today?\nMonica: No, I think we should save our china for something   really special. Like if the Queen of England comes over.\nChandler: Honey, she keeps canceling on us, take the hint. \nMonica: What if something gets broken, they're so expensive. \nChandler: What is the point of having them if we never use   them?\nMonica: Ok, but if something gets broken, and then the Queen   comes over..\nChandler: I will explain it to her.\nMonica: <laughs> Oh yeah, like I'm going to let you   talk to the queen. \nJoey: wow, the parade is really good this year. Man those   horses can crap. \nTV announcer: Next up is a marching band from Muskogee, OK.\nChandler: Muskogee! That's like four hours from Tulsa. Woo   hoo!   TV announcer: And heres the float with the stars of the popular daytime soap   Days of Our Lives .\n<Joey's eyes become large and he stands up>\nJoey: Oh my God!\nChandler: Aren't you one of the stars of the popular daytime   soap Days of Our Lives? \nJoey: Yeah! I totally forgot I'm supposed to be there. I   can't believe I forgot. I usually write stuff like this on my arm. \n<Chandler grabs Joey's left arm and pushes the sleeve up>\n<Joey looks>   Oh! Stupid long sleeves. \nChandler: What are you going to do?\nJoey: I guess I'm going to have to come up with a really   good reason why I wasn't there. The producers are going to be so mad at me.   They sat us all down yesterday and said \"Everyone has to be there at 6:00   AM sharp, that means you Tribbiani.\" Like.. like I was some kind of idiot. \nChandler: Well you proved them wrong.\nJoey nods: Yeah.\n<Chandler nods and his eyes get big like he's saying 'what the hell'>\nOpening Credits\nRoss and Rachels Apartment\n<Ross and Rachel are putting baby stuff together like they're going to   be going somewhere.>\nRachel to Emma: Oh Emma. This is going to be your first Thanksgiving. What   are you thankful for? Mommy's bobbies. \nRoss: A lot of people are thankful for those. < knock on door> \nWoman at door: Hello? Rachel? \nRachel: Who is it? \nWoman at door: It's your favorite sister.\nRoss and Rachel while looking at each other surprised and shocked: Jill?\nWoman at door in a sing song voice: Amy.\nRachel: Hide my rings.\n<Ross goes into Rachel's room>\nRachel: Oh. <opens door preparing herself and then happily   says> Amy! Happy Thanksgiving.\nAmy: Do you have a hair straightener? \nRachel: Um... hi.\nAmy: oh... hi.. <goes to Rachel with open arms>\nRachel: Aw. \n<Amy grabs her arms>\nAmy: Hair Straightener?\nRachel: I haven't seen you in like.. a year.\nAmy: Oh, I know, I know. I've just been crazed.\nRachel: Oh well yeah me too. Um.. I had a baby. \nAmy: I decorated Dad's office. \nRachel: Oh.. yeah? Well unless you pushed a desk out of your   vagina, <shakes head no> not the same thing.\nAmy: Listen, um about the hair straightener, honey.. I really   need one. I'm going to have dinner at my boyfriend's house. \n<Amy bending over fiddling with her purse when Emma cries and she hears   Emma>\nAmy: Oh my God!\nRachel: mh hmm.. \nAmy: Is this Emmett? <pointing to EMMA>\nRachel: Uh.... its Emma.\nAmy: Its a girl?\n<Ross comes out of the bedrooms>\nRoss: Hey Amy. \nRachel: Oh Amy, you remember Ross.\nAmy: Not really. But you are much cuter then that geeky guy   she used to date.\nRoss: That was me.\nAmy: No, he was this creepy guy from high school who had   this huge crush on her since like the ninth grade. \nRoss with a look of wondering how long this is going to go on on his face:   Still me.\nAmy: No, I'm not talking about you. <to Rachel> It   was your fat friends brother with that bad afro, do you remember?\nRoss starts talking over her 'do you remember' line: Amy. I'm going to save   you some time, ok. <spins finger around in circle> All me. \nMonica and Chandler's Apartment.\n<Joey is walking around looking worried. >\nMonica: Careful. <hands Chandler a china plate> Careful.   CAREFUL! \n<Chandler is startled and nearly drops the plates.> Sorry.\nChandler: I'll tell you what, for the rest of our lives,   I'll be careful until told otherwise. <looks at china> hey wait a minute   this isn't the china we picked out.. \nMonica: I know, after you left the store, I chose different   ones.\nChandler: Why?\nMonica: well no offense honey, but your taste is a little   feminine for me.\nChandler: Oh suddenly, flowers are feminine? < Phoebe comes in>\nPhoebe: Hey, everybody. Happy Thanksgiving!\nJoey: Hey happy Thanksgiving.. Pheebs! <motions her to   come over> \nPhoebe: Hey, what's going on Joe? \nJoey: I.. I.. I need a good lie.\nPhoebe: Oh okay. How about the whole \"man walking on   the moon\" thing. You know? You. you could. You could see the strings people! \nJoey: No, no, no I need a good lie to explain why I wasn't   at a work thing today.\nPhoebe: Ooh, honey. You stink at lying. \nJoey: I do not.\nPhoebe: Oh really. Okay. let me ask you something. Yesterday   at the coffee house, I went to the bathroom and when I came back, my muffin   was gone-who took it?\nJoey: Somebody opened the door to the coffee house and a   raccoon came running in, went straight for your muffin and I said \"Hey   don't eat that-that's Phoebe's\" and he said.. <pause> He said.. \"Joey   you stink at lying.\" What am I going to do? \nPhoebe: Don't worry, don't worry. We'll come up with a good   lie. I'll help you practice it.\nJoey: Oh great, that'd be great. Thank you. \nPhoebe: Sure, what.. what was the work thing? \nJoey: Uh.. <forgetting what the work thing was, rolls   up his sleeve on his right arm and shows Phoebe, she looks>\nPhoebe: \"Pick up grandma at the airport\"?\nJoey: Oh.. man..\nRoss and Rachel's Apartment. \nAmy with straight hair: Oh she's precious. Do you ever worry she's going to   get your real nose? \nRachel: Amy! <pause> Yes I do.. I really do. <grabs   Ross' hand for support>\n<Amy's cell phone rings> \nAmy: Hello? Yeah, um. Hang on one sec. <to Ross and Rachel> Can   I take this upstairs? \nRoss: Sure, we don't live there but...\nAmy: Seriously? Its.. its just these rooms? <moves hands   around motioning 'just these rooms'> <To Ross> I thought you were   a doctor. \nRachel: Yeah, no. Ross has a PhD.\nAmy: Ew. <walks into Rachel's room, I'm guessing>\nRachel: God she is unbelievable.\nRoss: I know, I mean a PhD is just as good as an MD.\nRachel: Oh sure Ross, yeah. If I have a heart attack in a   restaurant, I want you there with your fossil brush. \nAmy storms out: Stupid Thanksgiving.\nRachel: What? What happened? \nAmy: My boyfriend canceled on me. I mean.. I I finally find   a real relationship. I mean, someone that I can spend this day with and then   his wife comes back into town. I swear, its almost not worth dating married   guys. \nRoss: Don't say that.\nAmy: Oh. I was so looking forward to this. It was going to   be such a beautiful Thanksgiving. We were going to have sushi. \nRachel: Oh Amy, don't cry Amy. Um.. Ross, could I talk   to you in private?\nRoss: Sure, you want to go upstairs?\n<Ross and Rachel go in the kitchen>\nRachel: Um look I was thinking.. If its ok with Monica I   would like to invite Amy to Thanksgiving.\nRoss: You know, I think thats a great idea. It'll be like   the pilgrims bringing the Indians syphilis.\nRachel: Look I know she's a little tough to take. She has   no where else to go, and she's my sister. Alright, she's Emma's aunt. And I   would like them to bond. \nRoss: Ok, fine, but I don't want them bonding to much. I   don't want her telling Emma she needs a nose job. \nRachel: Ross, you know what? She may need one..We're just   going to have to make our peace with that! \n<Rachel grabs Ross' hand for support and starts to cry a little>\nMonica and Chandler's apartment\nRachel opens their door: Hi.\nEveryone there says: Hi, hey.\nRachel: Hey you guys, this is my sister Amy. This is   Chandler, Joey, Phoebe and you know Mon. \nEveryone: Hi.\nAmy: Oh my god. You're on Days of Our Lives. \nJoey laughs: Yeah.\nAmy: wow. They must put a lot of makeup on you. \nJoey looks rejected: Hap.. Hap.. Happy Thanksgiving.\n<Joey turns away and Chandler reassuringly pats him on the back>\nRoss to Monica: Hi.\nMonica to Ross: Hi.\n<they hug and kiss on check> \nMonica to Emma: Hey you.\nMonica to Amy: So. Welcome. Is this your first time you're   seeing Emma? \nAmy with confused look on face: Yeah I.. I think so. <sticks her hand out   to shake hands with Phoebe and says to her> It's nice to meet you Emma. \nPhoebe shakes her hand and says: Phoe-Be.\nAmy: Oh. That's a funny noise. \n<Monica and Amy turn away and walk into the living room towards the secret   closet>\nJoey: Pheebs, I still need some help here\nPhoebe: Oh right, ok um. Ok so its not just the lie you tell.   but its the way you tell it. . For example if you look down at the ground when   you're talking, people know you're lying. \nJoey: Oh.. I don't know why this is so hard for me. you know..   I mean lying is basically just acting and I am a terrfic actor. \nPhoebe looks down: You are a terrific actor. \n<Joey realizes what she's doing>\nAmy coming out of the bathroom: Hey. Hey where's the baby?\nRachel: Oh we just put her down for a nap.\nAmy: Oh I was just thinking. You know what would be incredible?   If you guys died. \nRoss first has a look of 'huh' then changes it to sarcastic happy: Thank you   Amy. \nAmy: no, no, then I would get the baby. I mean you know it   would be just like a movie. Like at first I wouldn't know what to do with her,   then I would rise to the occasion and and then I would get a makeover and then   I'd get married. \nPhoebe: Thats a great movie. <she claps>\n<Joey nods in agreement>\nAmy: Now listen, not that you guys could stop me or anything   cause you know you'd be dead. I was thinking about changing her name. I'm just   not really a big fan of Emily. [Transcriber note: I'm surprised that Rachel   and Ross didn't say they weren't either here]\nRoss: Emma. \nAmy turns around to Phoebe: Emma, Ross wants you. \nPhoebe: PHOE-BE.\nAmy turns to Ross and Rachel: Why does she keep making that   noise? \nRachel: Honey, I don't know how to tell you this, but um,   if something were to happen to Ross or to myself <Ross and Rachel knock   on wood> um you wouldn't get the baby. \nAmy: Well who would?\nRoss: Well we haven't offically asked them yet, but we would   want Monica and Chandler. \nChandler: I can't believe you'd want us to raise Emma. \nMonica: yeah oh my god, I'm so moved. \nAmy: I don't believe this, hold on a second. You guys die   and I don't get your baby? \nRachel: See look Amy, we're a lot closer to Monica and Chandler.   We see them every day. And truthfully honey, you don't seem very connected   to the baby.\nAmy: Connected? I mean.. to what? She's.. she's a lump. \nChandler: You know, guys I got to say. This means so much   to me. That you would trust me with your child. I mean, we all know that Monica   and I have been trying to have a baby of our own. You know I've had my doubts   about my skills as a father, but that you two.. that you two.... <starts   to cry>\nAmy: <points to Chandler> This guy? Seriously? \nLater in the day.\nMonica: Okay! It's time for dinner. Everyone we're using   our fancy china.. um and its very expensive so please be careful.\nRoss starts playing with a plate: Woah. Woah... <nearly really drops the   plate and more seriously> Woah. \nMonica: Okay, just to be clear comedy with the plates will   not be well recieved. <pinches Ross' arm>\nRoss makes some sort of sound to let us know it hurt.\nJoey: Hey! How come my plate's less fancy then everyone else's?   Do you not trust me with a fancy plate? \nMonica: No, honey, its. thats a special plate. See   its a game, whoever gets that plate wins. \nJoey: I can't believe I won.\nAmy: Its such a slap in the face. I'm your sister and you   would give your baby to these strangers over me.\nRachel: Monica is Ross' sister. \nAmy: No, Ross' sister was really fat. \nMonica: That was me. \nAmy: No, she was this really dorky girl in high school that   used to follow Rachel around like a puppy dog. \nRachel: Hey. Amy. You've got to stop doing that.\n<Amy gets pissed and starts cutting food on the fancy plate very harshly,   you can hear the silveware scraping the fancy plate> \nMonica about to have a heart attack: Okay, listen I know you're having a little   bit of a family crisis, but you don't have to take it out on the plates. I   mean, I mean in fact I think that everyone should cut their food like this. \n<Monica holds a turkey leg up in the air over the plate trying to cut meat   off with a knife>\nMonica: Now see, this way you protect the plate.. and lets   face it you have fun. \nAmy: Okay, how about this, you guys die and the crazy plate   lady dies, then do I get the baby?\nChandler: No, if crazy plate lad.. <sees Monica frustrated   at this comment> If Monica dies then I would get Emma, Right?\n<Ross and Rachel pause and ponder this> \nRachel: Well actually...\nChandler: Actually what? \nRoss: well.. its just. its just in that case, then um. Emma   would go to my parents. \nChandler: What?\nAmy: Hurts, doesn't it? \n<Chandler gives a look that says \"Yeah!\">\nJoey raises his hand: Uh.. who has to die for me to get her? \n<Everyone is looking around and at Joey with looks of 'what?' on their   faces>\nCommercial Break.\nChandler: So if Monica's not around, then I'm not good enough   to raise Emma? \nRoss looks down: No, that that is not what we're saying.\nJoey: Yeah he's lying. He looked down. \n<Joey looks to Phoebe and she nods in agreement>\nChandler: Well what is wrong with me? Am I .. am I incomptent?   Because I managed to survive whatever it is that killed the three of you! \nRachel: Honey, you're taking this the wrong way. We think   you're going to be a wonderful parent. It's just.. you're more the fun parent. \nRoss: Yeah and we'd want to make sure Emma has someone like   Monica who is more uh. uh discliplinarin.. someone who can be firm and strict. \nMonica: Thats not how you see me, is it? \nPhoebe while cutting a sweet potatoe in the air: No you're all about the fun. \nChandler: Look, I may not know a lot about babies, but do   you really think I'm not capable? \nRoss: No, you both are equally capable. Its just.. you're   strongest when.. when you're together. \nChandler: Ok. So if we both had Emma and I die <knocks   on table> she'd have to give her up. \nRoss: Sure, Monica would have to give her up. \nJoey: I lie better then that, right?\nChandler: So.. let me get this straight. So my two friends   die, I get Emma. Then my wife dies, then Emma the one tiny ray of hope left   in my life gets taken away from me?\nPhoebe: There's your movie! <claps> \nLater on.\nMonica opens her front door. Chandler is sitting in the hallway. \nMonica: Hey. There you are. You disappeared after dinner. \nChandler: Oh? Did somebody miss me? Is there a child to raise   poorly? \nMonica: Ross and Rachel don't know what they're talking about.   I mean its not like their so responsible. Emma is a product of a bottle of   Merlot and a five year old condom. \nChandler: Yeah but they're right. I mean, I'm not a strong   father figure and I never will be. \nMonica: No you learn these things. You grow into it.\nChandler: Yeah, but its not who I am. Everything they said   was exaclty why I was worried about having a kid. And its true. And look everybody   knows it. \nMonica: I don't know it! I want to have a kid with you because   I think you're going to be an amazing dad... at the fun parts and the hard   parts. \nChandler: Oh yeah, well can you picture me saying \"Go   to your room! You're grounded\"? \nMonica: Can you hear me say \"You're grounded\"?\nChandler: You said that to me last week. \nMonica: How hard is it? No shoes on the furniture. \nBack to Monica and Chandler's apartment.\nAmy is sitting on a chair by the bay window looking mad.\nJoey groans and gets off the phone: The producer from Days left a message   on my machine asking why I wasn't at the parade. They said everybody's pissed   off at me.. <whiny voice> And they all got to meet Santa! \nPhoebe: It's ok. I thought of the perfect lie for you. It's   easy to remember and doesn't invite a lot of questions. You weren't at the   parade because you had a family emergency. \nJoey: Oh, I like that, yeah. Wasn't at the parade because   I had a family emergency.\nPhoebe: Ooh, what happened? \nJoey all nervous and looking down and fiddling with his ear: Oh.. My sister's   raccoon.\nPhoebe: No! Nothing with a raccoon. \nJoey: Arg... Alright, I'll take care of it. <throws hands   out in the air>\nMonica and Chandler come through the front door.\nMonica: Oh wait.. What are you doing? \nJoey: Setting the table. \nPhoebe: Yeah we thought it would be nice to use the fancy   china for dessert too. \nMonica: Oh how nice. Maybe later we can all go blow our noses   on my wedding dress. \nRoss comes out of the guest bedroom with the diaper bag and the car seat carrying   thingy.. yeah.. thats the techinal term.. He goes to Chandler.\nRoss: Hey dude, you okay? Sorry about before.\nChandler: Oh no thats okay, you're totally right. I don't   know anything about disciplining a child. But it did hurt my feelings and I   want you to know that when I die, you don't get Joey. \nRoss walks away with a face of yeah ok.\nAmy walks over to the couch and sits down next to Rachel: Ucch. <pauses> Uchh <louder   this time> In case you hadn't noticed, I'm not talking to you. \nRachel: UCHH! <much louder and longer then Amy's>\nAmy: You know.. this.. this is classic Rachel.\nRachel: Yeah.. yeah right.. Remember in high school when   I died and didn't give you my baby?\nAmy: This might be my one chance to have a baby Rachel. I   mean, you know that I have been so busy focusing on my carrer. \nRachel: What? What carrer? \nAmy: Um.. I'm a decorator. \nRachel: Ok. You decorate dad's office and so now you're a   decorator. Okay! I went to the zoo yesterday and now I'm a koala bear. \nAmy: Why can't you ever be supportive? \nRachel: Sup.. You want to talk supportive? You didn't even   come and visit me when I was in the hospital having the baby. \nAmy: Oh. Yeah. Well.. You didn't come see me when I was in   the hospital when I was getting my lips done. \nRachel: I did the first time! Oh. Oh.. <gets up and walks   into the kitchen> And you know what. You want to know why I'm not giving   Emily to you.\nRoss: Emma. \nRachel turns to Ross: Oh whose side are you on? <back   to Amy> I'm not giving you Emma because there is no way you could handle   the responibility of a child. \nAmy: How hard could it be? You do it. \nJoey: ooh oooh.. \nAmy: Do you want to know why you don't want me to have   the baby? \nRachel: uh huh.\nAmy: Because you don't want me to be happy. You.. you have   always been jealous of me. \nRachel: Jealous of what? Of your lack of responsiblity? You,   your immaturity? Your total disregard of other people's feelings? \nAmy: Uh.. To name a few. You know.. You know.. You've   just always been like this. You just have to have everything. And I couldn't   have anything. Like in junior high, when you stole Timmy from me. I mean, do   you even realize how much that hurt me? \nRachel: Timmy was my boyfriend and you made out with him!\nAmy: Oh come on, that was 20 years ago. Get over it.\nRachel: I cannot, I cannot believe that I invited you here   today.\nAmy: Yeah, well you know what I cannot believe. That my so-called   sister, gets a 30% discount from Ralph Lauren and I still have to pay retail.\nRachel: ah ha ha. ah ha ha. <evil meancing laughter> It's   forty five. \nAmy: You bitch. You just think you're so perfect. With your   new baby and your, your small apartment. <directs this to Ross who in turns   throws the towel in his hand down on the table> Well let me tell you something.   Your baby isn't even that cute. \n<everyone sucks their breath in, in shock>\nRoss walks over: Too far, Amy. Too far. \nRachel: You take that back.\nAmy: No. \nRachel: Take it back!\nAmy: No! What are you going to do? Make me?\nRachel: Heey man, I work out. \n<Ross nods his head and points at her, in a yes manner> \nAmy: So do I.\nRachel: I do pilates. \nAmy: I do yoga.\nRachel: Bring it on! \n<Amy pushes Rachel and Monica goes berserk and runs around the table> \nMonica: Put the plates in the boxes!! Put the plates in the   boxes! \nRachel: Did you just push me?\nAmy: Uh, yeah I think I did. \nRachel: Alright. Thats it! <Pushes Amy back> \nMonica screaming at Ross: Forget the bubblewrap! There isn't   time! \n<Rachel and Amy 'fighting'.. They're really just trying to slap each other   and just keep slapping their hands> \nRachel starts messing up Amy's hair: Frizzy frizzy frizzy frizzy!! \n<They go back to fighting and then it really gets on>\nPhoebe: Oh my god! Shouldn't we stop this?\nJoey: What? Are you out of your mind? Lets throw some jello   on them. \n<Amy starts spitting on Rachel's hand and Rachel is saying ew and pushes   her away> \nRachel: Ew! Gross. \n<Amy runs towards Rachel and Rachel puts her arm out, hand on Amy's head   and Amy starts trying to hit her but is missing, Rachel is moving backwards   towards the table when her hand swipes the one plate left on the table on to   the floor>\n<Everyone is shocked and Monica faints and Ross catches her> \nChandler: Alright! That is it. This is our apartment and   you can not behave this way. Now if you can't act your age then you shouldn't   be here at all. Now those plates may not be as nice as the pretty pink ones   I picked out, but they're very important to Monica. I want you to apologize   to her right now. \nAmy: I'm sorry.\nRachel: Mon, I'm so sorry. \nChandler: Okay. Thats better. Now I want you to both apologize   to each other and mean it. \nAmy and Rachel at same time: Sorry.\nChandler: By the way, that fight was totally arousing. \nRoss: Dude. Well done. You know what? If I die, and Rachel   dies and Monica dies then you can totally take care of Emma. \nChandler: Oh yeah? Well thanks. \nRoss: So, so now do I get Joey?\nChandler: Okay, but you should know he eats five times a   day and shoves pennies up his nose. \n<Ross ponders that and walks away>\nRachel: Are you okay Mon? \nMonica: uh huh.. I mean these things happen. Its' just a   plate. Its not like somebody died. \nPhoebe: It's all right. You can mourn. \nMonica starts crying: Thank you. It was so beautiful. <gets up and walks   towards the front door> I'm going to go to Joeys and get the pies. \nJoey: Actually its not pies, its just pie. \nMonica: I don't care. <pauses and realizes...> Oh my   god. I've lost the will to scold. \nRachel: Look Amy, it got a little of control..Um.. and I'm   sorry. You're my sister and uh.. if it really means that much to you.. \nAmy: So you're going to give me the baby?\nRachel: Uh. No.. I was going to let you use my Ralph Lauren   discount. \nAmy starting to cry: You are not going to regret this. \n<they hug and Rachel has this disgusted look on her face and then Emma   starts crying> \nRachel: She needs changing.\nChandler: Oh no no no.. I'll get her. I'm super-compentent   and totally responsibile and fourth in line to raise Emma. I'll be right there   Emma. Just let me get my trusty diaper bag here. <knocks over the box of   china> Well.. what do you know? I guess, I'll be the one who dies first.\nCOMMERCIAL BREAK", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 1, "scene_id": "S09E10_001", "location": "", "scene_description": "", "characters": ["Amy", "Amy and Rachel at same time", "Amy coming out of the bathroom", "Amy starting to cry", "Amy storms out", "Amy turns around to Phoebe", "Amy turns to Ross and Rachel", "Amy walks over to the couch and sits down next to Rachel", "Amy with confused look on face", "Amy with straight hair", "Chandler", "Everyone", "Everyone there says", "Joey", "Joey all nervous and looking down and fiddling with his ear", "Joey groans and gets off the phone", "Joey laughs", "Joey looks rejected", "Joey nods", "Joey raises his hand", "Monica", "Monica about to have a heart attack", "Monica screaming at Ross", "Monica starts crying", "Monica to Amy", "Monica to Emma", "Monica to Ross", "Phoebe", "Phoebe looks down", "Phoebe shakes her hand and says", "Phoebe while cutting a sweet potatoe in the air", "Rachel", "Rachel opens their door", "Rachel to Emma", "Rachel turns to Ross", "Ross", "Ross and Rachel while looking at each other surprised and shocked", "Ross looks down", "Ross starts playing with a plate", "Ross to Monica", "Ross walks over", "Ross with a look of wondering how long this is going to go on on his face", "TV announcer", "Woman at door", "Woman at door in a sing song voice"], "firestore_path": "/episodes/S09E10/scenes/S09E10_001"}}
{"id": "S09E10_002", "text": "[Scene: Chandler is packing the broken china in its box. He's taping up the   top of box so thoroughly, there isn't an inch of cardboard which isn't covered   in tape. He is struggling with the tape dispenser.]\nPhoebe: Hey, does Monica know about her broken plates yet?\nChandler: Nope...\nPhoebe: Broke them all, huh?\nChandler: Yep...\nPhoebe: You gonna tell her?\nChandler: Nope... (Monica walks in) Hey... so I'm gonna...   put the plates back. You know, I think you were right, I don't think we should   use these plates again for a looong time.\nMonica: Like only if the queen comes?\nChandler: Maybe not even then. (Joey walks in)\nJoey: Hey! I did it. I called my producer. I told him I had   a family emergency, he totally bought it. Thanks for teaching me how to lie   Pheebs.\nPhoebe: No problem! Next week: stealing... (Chandler walks   away to store the box of broken china.)\nMonica: Bye plates!\nJoey: Oh, you told her you broke all the plates, huh? (Chandler   walks back, looking angrily at Joey)\nMonica: What? Something happened with the plates?\nJoey: Uhm... (looks down) Yeah... this uhm... raccoon came   in...\n \nFRIENDS\nDirected by: Ben Weiss   Written by: Mark Kunerth   Transcript by: David Buehrle\n[Scene: Chandler's office in Tulsa. His assistant is showing him photographs.]\nJO LYNN: This kitty is Mittens and this one is Fitzhugh, and this little guy in the cat condo is Jinkies.\nCHANDLER: Yep. That's a lot of cats Jo Lynn. Single are ya?\n(Phone rings. Chandler answers using the speaker phone.)\nCHANDLER: Chandler Bing.\nJOEY: Hey. How come you're answering your own phone? Where's your crazy assistant?\n(She frowns. Chandler picks up the hand set.)\nCHANDLER: What's up Joe?\nJOEY: Okay, what have we always wanted to do together?\nCHANDLER: Braid each other's hair and ride horseback on the beach?\nJOEY: No, no, no. When you get home tomorrow night, you and I are going to be at the Wizzards-Knicks game . . . courtside!\nCHANDLER: Courtside? Oh my God.\nJOEY: Yeah. Maybe Michael Jordon will dive for the ball and break my jaw with his knee.\nCHANDLER: That's so cool. I'll let Monica know.\n(Chandler hangs up and calls Monica who is reading a book on their sofa as the phone rings.)\nMONICA: Hello?\nCHANDLER: Joey just called. He's got courtside Knicks tickets for him and me tomorrow night.\nMONICA: Really? But tomorrow night is the only night I get off from the restaurant. If you go to the game, we won't have a night together for another week.\nCHANDLER: But hey, it's courtside. The cheerleaders are going to be right in fr. . . (Pause) That's not the way to convince you. \nMONICA: Chandler look, I don't want to be one of those wives who says, \"You can't go to the game. You have to spend time with me.\" So, if you could just realize it on your own . . . \nCHANDLER: I know. You're right. I want to see you too. I've just got to figure out a way to tell Joey, you know? He's really looking forward to this.\nMONICA: Tell him that you haven't seen your wife in a long time. Tell him that having a long-distance relationship is really difficult. Tell him that what little time we have is precious.\nCHANDLER: Yeah, ah, ah . . . I'll think of something.\n[ OPENING CREDITS ]\n[Scene: Ross and Rachel's apartment. Ross is in the living room covering Emma. Rachel enters wearing a sexy dress.]\nROSS: Wow! (pause) Wow, You look . . . uh . . . It's just, ah . . . That dress . . . uh . . . \nRACHEL: Well, I hope the ends of these sentences are good.\nROSS: Well, well, they're good. It's been a while since I've seen you like this. You, you clean up good.\nRACHEL: Oh well, well thank you. (She laughs. He stares for a moment.) Okay, stop. Stop looking at me like that. The last time that happened, (points to Ross) that happened. (points to Emma.)\nROSS: Oh right, right. (They pause and exchange a glance. Then, Ross looks away.) So, are you . . . ah . . . you excited about your, your first night away from Emma?\nRACHEL: Yeah, yeah. Phoebe and I are going to have so much fun. And thank you for watching the baby, by the way.\nROSS: Oh, it's fine. Actually, I, I invited Mike over.\nRACHEL: Phoebe's Mike?\nROSS: Yeah.\nRACHEL: I didn't know you guys hung out.\nROSS: We don't. But I thought it would be nice to get to know him. You know, maybe have a little dinner, drinks, conversation.\nRACHEL: Oh that's so cute: Ross and Mike's first date. Is that going to be awkward? I mean, what are you guys going to talk about?\nROSS: I don't know. But, you know, we, we have a lot in common, you know. He plays piano; I played keyboards in college. He's been divorced; I have some experience in that area.\n(Rachel nods. There is a knock on the door.)\nRACHEL: Yeah.\n(Phoebe and Mike enter.)\nPHOEBE: Hi\nRACHEL: Hey.\nPHOEBE: (spotting Rachel's dress) Oooh. Girl's night out indeed.\nRACHEL: (to Ross) Ok. So now, I think Emma is probably down for the night, but if you need anything Ross . . . \nROSS: Rach, Rach, we'll be fine, all right? You go have fun.\nRACHEL: Okay. You too. And I hope you score. (to Mike) Bye.\nMIKE: Bye.\nROSS: So . . . Welcome.\nMIKE: (Holds up a six pack of Foster's Lager) I got beer.\nROSS: I got bottled breast milk.\nMIKE: Eh, why don't we start with the beer?\nROSS: Okay. (They sit.) So, um, Phoebe tells me you, ah, you play piano.\nMIKE: Yeah.\nROSS: You know, I, I used to, ah, play keyboards in college.\nMIKE: Ah? (pause) Do you have one here?\nROSS: No.\nMIKE: Okay. (pause)\n(They clink beer bottles, and drink. Then, they stare uncomfortably at their bottles.)\nROSS: Um . . . ah . . . you know, I'm divorced. Um, Phoebe, ah . . . Phoebe said you . . . You've been divorced?\nMIKE: Yeah. (pause) Yeah, I'm sorry. I don't . . . I don't really like to talk about it.\nROSS: (pause) That's okay. We'll talk about (pause) something else. (They pause. They drink.)\nMIKE: So, you're a paleontologist, right?\nROSS: Yeah.\nMIKE: My cousin's a paleontologist.\nROSS: Ah? (Mike nods. Another pause.) Well, he and I would probably have a lot to talk about.\n[Scene: Monica and Chandler's apartment. Monica is wearing a sexy negligee. She pours two glasses of wine as Chandler enters with a carry-on suitcase. He sets the case by the door.) \nMONICA: Hi.\nCHANDLER: Hey.\nMONICA: Welcome home.\nCHANDLER: (Hangs his jacket over the suitcase, locks the door, then turns to Monica.) Oh well, look at you.\nMONICA: Yeah. What do you think?\nCHANDLER: Well, it looks great. It's just that . . . well, I'm wearing the same thing underneath. So . . .\nMONICA: Oh.\nCHANDLER: See what I mean . . . (They kiss.)\n(There is a loud thud at the door.)\nJOEY: Hey! How come the door's locked?\nMONICA: Just a second.\nCHANDLER: (hushed) No, no, no, no, no. Joey can't know that I'm here.\nMONICA: Why not?\nCHANDLER: Because I didn't know how to tell him that I couldn't go to the Knicks game. So, I just told him that I had to stay in Tulsa.\nMONICA: So, you lied to him?\nCHANDLER: Achhh. It's always better to lie than to have the complicated discussion. (pause) Except with you.\nJOEY: Hey! Open the door. What's going on? (He knocks.)\n(Monica goes to the door. Chandler slides behind it as she opens it slightly.)\nJOEY: What are you . .. (He sees her in her negligee.) Why are you dressed like that?\nMONICA: Oh, because, um . . . well, Chandler's going to be home in a couple of days. So, I thought I would, you know, practice the art of seduction.\nJOEY: Oh, I thought I heard a man's voice before.\nMONICA: Oh I was just doing Chandler's side of the conversation. You know, like, \"Hi, How do I look?\" (As Chandler) \"Really sexy. Could I BE any more turned on?\"\nJOEY: Okay. (pause. He looks over her shoulder at the table with the wine.) Whoa, whoa. Why are there two glasses of wine out?\nMONICA: Because. . . one of them is for you.\n(Monica turns to get the wine. Chandler peeps through the peephole. Joey, seeing something, peeps back. Chandler ducks. Monica returns with two glasses of wine. She gives one to Joey.)\nMONICA: Cheers. (She clinks his glass and pulls back.) Okay, buh-bye. (She closes the door.)\nCHANDLER: You know, it's funny. I've been, ah, practicing the art of seduction myself. (He raises his hands in front of himself, sticks out his behind, and wiggles it.) Hi ya.\nMONICA: You might want to keep practicing.\nCHANDLER: Yah.\n(Chandler's cell phone rings. He looks at it.)\nCHANDLER: It's Joey. (He answers it, holding it out so that Monica can hear too.) Hey Joe.\nJOEY: Dude, come home!\nCHANDLER: What? Why?\nJOEY: COME . . . HOME.\nCHANDLER: Look I, I can't. What's going on?\nJOEY: I don't know how to tell you this but, uh . . . I think Monica's cheatin' on ya. I told you shouldn't have married someone so much hotter than you.\n(Chandler and Monica look at each other. Chandler nods.)\nJOEY: All right look. (He walks to the hallway.) If you can't come home and deal with this, then I'm gonna.\nCHANDLER: NO!\nJOEY: (outside the apartment door) I just heard him!\nCHANDLER: (softly) Can you . . . hear him . . . now?\nJOEY: (listens at the door.) No. (pause) All right, I'm going in.\nCHANDLER: No! Wait!\nJOEY: I heard him again!\nCHANDLER: (writhes as if in agony) All right, look. Just stay there. I'm coming home.\nJOEY: Okay. Great. I'll see you when you get here. I'm gonna wait out in the hall in case the dude comes out.\nCHANDLER: Is that really necessary?\nJOEY: Absolutely. You'd do it for me. Not that you ever have to because I know how to keep my women satisfied.\n[Scene: Ross and Rachel's apartment. Mike is blowing a note from his beer bottle. Ross stares off to the side.)\nROSS: Shouldn't the pizza be here by now? I mean, they said thirty minutes or less. Well, how long has it been?\nMIKE: (looking at his watch) Eleven minutes. (long pause) And now twelve. So, do you like the beer?\nROSS: I do. I do. Although, it's actually a lager.\nMIKE: huh. (pause) What's the difference between beer and lager?\nROSS: I don't know. We could look it up.\nMIKE: (nods) Things are about to get wild.\n[Scene: A bar. Rachel and Phoebe are bringing their drinks from the bar to a sofa.]\nPHOEBE: Oh God. Remember the girls' nights we used to have sitting around talking about you and Ross?\nRACHEL: Oh God. It seems like forever ago.\nPHOEBE: I know. (sighs) So, what's going on with you and Ross?\nRACHEL: Well, um . . . I don't know. I mean, for a long time nothing. But you know, actually right before you picked me up, Ross and I had a . . . ah . . . little thing.\nPHOEBE: Oh my God! I love things. What happened?\nRACHEL: Well, um, first he told me he liked how I looked. And, ah, then we had a little . . . um . . . eye-contact.\nPHOEBE: Eye-contact?\nRACHEL: Mm-hmm.\nPHOEBE: I hope you were using protection.\nWAITER: (with tray and two drinks) Excuse me. Um, these are from the two gentlemen at the end of the bar.\nRACHEL: Oh. (to Phoebe) Should we send them something back?\nPHOEBE: Oooh. Let's do. Let's send them mashed potatoes.\nRACHEL: No! Wait! No, no. Don't do that! That's going to make them think they can come over here.\nPHOEBE: So? What if they do?\nRACHEL: Well, we're not here to meet guys. You have a boyfriend, I have a b. . . baby and a Ross.\nPHOEBE: Yeah, but, ah, ah, nothing has to happen. We're just having fun. You know, not everything had to go as far as \"eye-contact.\"\n[Scene: Monica and Chandler's apartment. Chandler is seated in the chair and Monica stands behind the sofa.]\nMONICA: Chandler, you have to tell Joey that you're not in Tulsa.\nCHANDLER: Don't you think it's better for him to think that you're cheating on me, than for him to think that I'm cheating on him? (Monica tips her head slightly as if asking \"Did you hear yourself?\") I heard it.\nMONICA: I don't want him to think that I'm having an affair.\nCHANDLER: All right. I've got a plan. I'll go down the fire escape.\nMONICA: Yes, because all good plans start with, \"I'll go down the fire escape.\"\nCHANDLER: Hear me out woman. I'll go down the fire escape. Then, I'll wait for a while. Then, when I come up the stairs, it'll be just like I just got back from Tulsa. Then, Joey and I will come in and see that there's no guy in here.\nMONICA: Aren't you afraid that Joey's going to figure all of this out? (pause) I heard it.\n(Chandler runs to the window, opens it, starts out, but returns, casually walking back to his chair.)\nCHANDLER: I'm just going to wait for a little while.\nMONICA: Scary pigeon's back?\nCHANDLER: It's huge.", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 2, "scene_id": "S09E10_002", "location": "Chandler is packing the broken china in its box. He's taping up the   top of box so thoroughly", "scene_description": "there isn't an inch of cardboard which isn't covered   in tape. He is struggling with the tape dispenser.", "characters": ["CHANDLER", "Chandler", "Directed by", "JO LYNN", "JOEY", "Joey", "MIKE", "MONICA", "Monica", "PHOEBE", "Phoebe", "RACHEL", "ROSS", "WAITER"], "firestore_path": "/episodes/S09E10/scenes/S09E10_002"}}
{"id": "S09E10_003", "text": "[Scene: Ross and Rachel's apartment. Three pizza crusts, two bottle caps and the plastic tripod are left in the otherwise empty pizza box. Mike is making hollow popping noises with his mouth. He begins to speak, but stops and pops his lips a few more times and takes a drink. Ross smiles as if he has thought of something to say, but then he stops and sinks back in a slump on the sofa.]\n[Scene: The bar. Two men are chatting with Rachel and Phoebe.]\nRACHEL: Oh my God. I can't believe you live in that building. My grandmother lives in that building. Ida Green? No sense of personal space? Kind of smells like chicken? Looks like a potato.\nBILL: \"Spuds\" is your grandmother?\nRACHEL: That's my bubby!\nKEVIN: So, we're on our way to a couple of parties. Um. . . maybe we can get your numbers and give you guys a call if we find something fun.\nPHOEBE: Yeah. . . I'm sorry. We weren't really looking for anything to happen with you guys. I, I have a boyfriend.\n   KEVIN: All right. It's no big deal. BILL: So, she has a boyfriend. What is your situation? RACHEL: Oh, well, it's complicated. I don't actually have a boyfriend. But um. . . BILL: Then, can I have your number? RACHEL: (pause) I'm sorry, no. BILL: Okay. (They start to walk away.) RACHEL: Oh sure. (She pulls a business card from her purse and writes on it.) PHOEBE: (Reading the card.) Oh my God, you're giving your real number. BILL: Okay, thanks. I'll give you a call later tonight. RACHEL: Great. BILL: Bye PHOEBE: Bye. (The guys leave.) Wow. So, that's great. You, Bill, Ross, and Emma are going to be so happy together. What were you thinking?\nRACHEL: I don't know. He was cute, and he liked me. It was an impulse.\nPHOEBE: What about Ross? What about your moment? Don't you want to talk to Ross about it?\nRACHEL: No. No, because I know exactly how the conversation's gonna go. \"Hey Ross, you know, I think we had a moment before.\"\nRACHEL: (lowers voice to imitate Ross) \"Yeah.\" (Clears throat.) \"Me too.\"\nRACHEL: (as herself) \"Well, but I'm not sure I really want to do anything about it.\"\nRACHEL: (as Ross) \"Yeah.\" (Clears throat twice.) \"Me neither.\" (Clears throat again.)\nRACHEL: (as herself) \"Well, should we just continue to live together and not really tell each other how we're really feeling?\"\nRACHEL: (as Ross) \"Yeah. That works for me.\" (Clears throat twice more.)\nPHOEBE: Yeah, I see what you mean. By the way, nice Ross imitation.\nRACHEL: Oh, thanks.\nPHOEBE: But, your Rachel wasn't whiny enough.\nRACHEL: (whining) Wha. . . hey!\nPHOEBE: (pointing) Better!\nRACHEL: Well, the point is, maybe I should just stop waiting around for moments with Ross, you know? I should just . . . move on with my life.\nPHOEBE: Really? You're moving on from Ross?\nRACHEL: I don't know. Do I have to decide right now?\nPHOEBE: Well, you kind of just did. That guy is going to call you tonight. Ross is going to pick up the phone and that's a pretty clear message.\nRACHEL: Oh God, Ross. Ross is going to pick up the phone. Oh, I have to get my number back. (She turns to find Bill, but they have gone.) Oh my God. He's gone.\nPHOEBE: (imitating Rachel) \"Oh, I have to get my number back. Oh my God. He's gone.\" (smiles) Dead on.\n[Scene: Ross and Rachel's apartment. Ross and Mike are sitting on the sofa. Ross is fidgeting with the cuff of his sweater while Mike blows his cheeks out. Ross blows a piece of fuzz from his finger.)\nMIKE: (releases a whoosh of air) Ya know, I'm going to take off.\nROSS: So soon?\nMIKE: Well, yeah.\nROSS: Okay. Well, thanks, ah, thanks for the beer.\nMIKE: Ah, you mean lager.\nROSS: Ah yeah. Good times.\n(Mike leaves. Ross closes the door behind him.)\nMIKE: (In the hall, relieved) Oh.\n(Ross, inside the door, releases a sign of relief. Back in the hall, Mike's cell phone rings.)\nMIKE: Hello?\nPHOEBE: (calling from the bar on her cell phone.) Hey, Mike, it's me. Listen, is um, is Ross near you?\nMIKE: Uh, no. I just left.\nPHOEBE: Well, you have to go back in.\nMIKE: Wha . . .? Go back? To the \"land where time stands still\"?\nPHOEBE: I'm so sorry honey, but, okay, Rachel gave this guy her number and, um, she doesn't want Ross to answer the phone. So, you have to intercept all his calls.\nMIKE: I can't do that!\nPHOEBE: (to Rachel) He says he can't do that.\nRACHEL: Oh give me , , , (Phoebe gives Rachel the phone.) Hi, Mike? Hi. Listen. I know this is a lot to ask, but you know what? If you do this I . . . Phoebe will . . . do anything you want. Seriously, I'm talking dirty stuff.\nPHOEBE: All right. (She takes the phone from Rachel.) Hello? Hi. I'm sorry about her, but she wasn't wrong about the dirty stuff.\nMIKE: All right. I'll do it. (Phoebe gives the thumbs-up sign to Rachel.) But really, how much dirtier can it get?\nPHOEBE: (knowingly chuckles) Oh, Mike. Bye.\n(Mike knocks on Ross's door. Ross opens it.)\nMIKE: Hey buddy.\nROSS: Uh, hi.\nMIKE: Um, can I come back in?\nROSS: (putting his arm up with his hand on the door frame.) Why? (He starts to lower his arm.)\nMIKE: (Entering the apartment) I, I was just thinking about how much more we have to talk about.\nROSS: (whining) But you left.\n[Scene: The hallway and stairs outside Chandler and Monica's apartment. Chandler enters from the stairs. Joey is sitting with a baseball bat.]\nJOEY: Wow! That didn't take long. I thought you said Tulsa was, like a three hour flight.\nCHANDLER: (pause) Well, you're forgetting about the time difference.\n(Joey thinks a moment. Then, he nods. Joey follows Chandler into the apartment.)\nMONICA: (gasp) Chandler! You're home!\nCHANDLER: That's right. You're husband's home. So, now the sex can stop.\n(Joey gives him and odd look. Monica gives a similar look.)\nMONICA: What are you saying?\nCHANDLER: Joey said that you're in here with another man.\nMONICA: There's no man in here. How dare you accuse me of that. (She slaps Chandler.)\nJOEY: All right. All right. Then, maybe you won't mind if me and my friend take a look around, huh? (He checks the bathroom shaking the bat. Then he proceeds to their bedroom.) Bwa-ah-ah!\n(Thudding sounds can be heard from the bedroom.)\nCHANDLER: (To Monica) What is he doing?\nMONICA: (smiling) I arranged some pillows on the bed to look like a guy.\nJOEY: (emerging) Bedroom is clear, although you might need some new pillows.\nCHANDLER: All right. Well, I'll check the guest room.\nJOEY: (sniffing the air and then Monica.) Why do I smell men's cologne?\nMONICA: (sniffing Joey) I think that's you.\nJOEY: (sniffs his shirt.) Oh yeah. I rubbed a magazine on myself earlier.\nCHANDLER: There's nobody here Joe.\nJOEY: I guess not.\nMONICA: I can't believe you thought I was cheating. (pointing at Joey) You own me an apology.\nJOEY: Yeah, right Monica. I'm so sorry.\nMONICA: (suddenly starts issuing him out) Ah, it's an honest mistake. It could happen to anyone. All right, see ya.\nJOEY: (spots the suitcase just inside the door where Chandler left it) Whoa, whoa. Wait a minute. Wait a minute. If you just got back from Tulsa, how did your suitcase beat you here?\nCHANDLER: (thinks, then turns to Monica) I climb down the fire escape and you can't put that in the closet?\n[Scene: Ross and Rachel's apartment. Mike is reading from a book.]\nMIKE: So, except for the fermentation process, beer and ale are basically the same thing. Fascinating isn't it.\nROSS: Maybe you should look up \"fascinating.\"\n(Phone rings.)\nMIKE: I'll get it. (He lunges across Ross's lap on the sofa to reach the phone. Ross stares at him with wide eyes.) Hello? Ross's place. Mike speaking. (pause. Hands phone to Ross) It's for you.\nROSS: (takes the phone, but speaks to Mike) I don't understand what just happened here.\n[Scene: Monica and Chandler's apartment \" continuing action.]\nJOEY: What's going on?\nCHANDLER: I'm sorry. I, I told you I was in Tulsa because I wanted to spend the night with Monica and I, I didn't know . . . I didn't think you'd understand.\nJOEY: What? You think I'm too dumb to understand that a husband needs to be with his wife? Huh? Do you think I'm like, \"Duh.\" (He strikes himself in the head with the bat. He stands dazed for a moment.)\nMONICA: Joey?\nJOEY: Yeah? (His eyes bug out.)\nMONICA: I don't know what to say. We shouldn't have lied to you.\nCHANDLER: Yeah. I feel so bad. Is there anything I can do to make it up to you?\nJOEY: (pause) Yeah, you could go to the game with me, ah, even though I know you said you couldn't. But then you lied to me and tricked me and gave me a bump on the head.\nCHANDLER: I'm sorry. That's the one thing I can't do. I promised I'd be with Monica.\nJOEY: All right.\nMONICA: (taps chandler on the arm) You can go.\nCHANDLER: What?\nMONICA: You should go to the game. It's okay. I want you to.\nCHANDLER: Really? You're gonna be okay?\nMONICA: Yeah, I'll be fine. You know, maybe I'll stay here and practice the art of seduction.\nCHANDLER: You're gonna put on sweats and clean, aren't you?\nMONICA: It's gonna be so hot! (She kisses him.)\nCHANDLER: Okay, bye.\nMONICA: Have fun.\nJOEY: Thanks. (Joey and Chandler exit to the hall. Joey pulls out the tickets and hands one to Chandler.) Here's your ticket.\nCHANDLER: Hey, listen. I'm never going to lie to you again, okay? And I want you to know that nobody thinks you're stupid.\nJOEY: Thanks man.\n(Chandler heads toward the stairs, but makes a turn back to his apartment while looking at the ticket.)\nJOEY: Where are you going?\nCHANDLER: Game's tomorrow night Joe.\n(Chandler goes into the apartment, while Joey checks his ticket and is embarrassed by his stupid mistake.)\n[Scene: Ross and Rachel's apartment. Rachel and Phoebe enter.)\nRACHEL: Hi.\n(Everyone exchanges greetings.)\nROSS: Oh God. (He hugs Rachel)\nRACHEL: Oh . . . \nMIKE: I'm so glad you're back. (He hugs Phoebe.)\nPHOEBE: Oh.\nRACHEL: Wow. So, what did you guys do?\nROSS: Oh, you know . . . we just drank some beer and Mike played with the boundaries of normal social conduct.\nMIKE: It's true. I did.\nPHOEBE: (pause) Well, good bye.\n(Okays, and good byes are exchanged all around.)\nRACHEL: That was fun Pheebs.\nPHOEBE: I know. That was fun. (She and Mike exit.)\nRACHEL: See you guys. (She closes the door.)\nROSS: Rachel, lock the door. Lock the door, seriously.\nRACHEL: Oh shoot. I forgot to pay Phoebe for the drinks. (She exits to the hallway and closes the door behind her.) Wait, wait. Sorry. Did he call? Did that guy call?\nMIKE: No. Just his mom.\nRACHEL: Oh, around 8:30?\nMIKE: Yeah.\nRACHEL: Then, again at 9:00?\nMIKE: (nods) uh-huh.\nRACHEL: Yeah.\n(Inside the apartment the phone rings. Ross answers it.)\nROSS: Hello. (listens) Ah, no, she's not here right now. Can I take a message? (grabs a pad and pen) Bill from the bar? (writes) Okay, \"Bill from the bar.\" I'll make sure she gets your number.\n(He hangs up the phone and tears the note off the pad. Then, he stops and re-reads it. Rachel enters.)\nRACHEL: Aaah. (She goes to tend Emma.)\nROSS: So, ah . . . So, how was it? Uh, did you guys. . . Did you guys have a good time?\nRACHEL: Oh, it was so much fun. It felt so good to be out.\nROSS: (holds up the message) Uh, Rach.\nRACHEL: (still looking at Emma) Yeah?\nROSS: (pauses, then crunches up the note and stuffs it in his pocket.) Never mind.\n[END]\n[Tag Scene: Central Perk. Phoebe and Mike are on the sofa. Ross enters.]\nROSS: Hey you guys. (He sits.)\nMIKE: Hey.\nPHOEBE: Hey. I'll be right back. I've got to go to the bathroom. (She rises and exits.)\n(Ross and Mike glance at each other then both suddenly turn to Phoebe who is gone. They sheepishly exchange glances.)\nMIKE: (finally) Stout. That's a kind of beer.\n(Ross smiles slightly. Then he gives a single nod that lifts him to his feet. He exits the coffee shop.\n[END TAG]\nFRIENDS 910 - THE ONE WITH CHRISTMAS IN TULSA\n Aired: 12/12/2002 Written by: Doty Abrams Directed by: Kevin S. Bright Transcribed by: Stephan Hoffmeister", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 3, "scene_id": "S09E10_003", "location": "Ross and Rachel's apartment. Three pizza crusts", "scene_description": "two bottle caps and the plastic tripod are left in the otherwise empty pizza box. Mike is making hollow popping noises with his mouth. He begins to speak, but stops and pops his lips a few more times and takes a drink. Ross smiles as if he has thought of something to say, but then he stops and sinks back in a slump on the sofa.", "characters": ["BILL", "CHANDLER", "JOEY", "KEVIN", "MIKE", "MONICA", "PHOEBE", "RACHEL", "ROSS"], "firestore_path": "/episodes/S09E10/scenes/S09E10_003"}}
{"id": "S09E10_004", "text": "[Scene: Monica and Chandler's Apartment, everyone's there; Phoebe recites the last verse of a poem to Joey. This poem is known as \"The Night Before Christmas\" by Clement Clarke Moore, but it seems that it's rather \"Account of a visit from St. Nicholas\" by Henry Livingston.]\nPhoebe: ...sprang to his sleigh, to his team gave a whistle;and away they all flew like the down of a thistle; but I heard him exclaim, ere he drove out of sight, \"Merry Christmas to all, and to all a goodnight!\"\nJoey: (impressed) Wow, that was great! You really wrote that?\nPhoebe: (smiling) Uh-huh.\nChandler: (coming from the bedroom) Say goodbye elves, I'm off to Tulsa.\nMonica: I can't believe you're not gonna be here for Christmas.\nRoss: You're really not coming back?\nChandler: Yeah, we have all this paperwork that needs to be filed by the end of the year. If I don't get it done, I'll be fired.\nMonica: It's so unfair, you don't even like your job!\nChandler: So, who does?\nPhoebe: Oh, I like my job.\nJoey: I *love* my job.\nRachel: Yeah, I can't *wait* to go back to work.\nRoss: I can't get *enough* dinosaurs!\nChandler: I'm sorry, I won't be here.\nMonica: It's just... It's hard enough not seeing you during the week, but for Christmas... alright, if this is what you have to do, I understand.\nChandler: Thanks. (they kiss) I'll see you New Year's Day.\nMonica: (shocked) You're not gonna be here New Year's Eve??\nChandler: Did I not mention that?\nMonica: No!\nChandler: (thinks for a second, then waves his arms, exclaiming:) AND TO ALL A GOOD NIGHT! (and runs out of the apartment)\n*Opening Credits*", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 4, "scene_id": "S09E10_004", "location": "Monica and Chandler's Apartment", "scene_description": "everyone's there; Phoebe recites the last verse of a poem to Joey. This poem is known as \"The Night Before Christmas\" by Clement Clarke Moore, but it seems that it's rather \"Account of a visit from St. Nicholas\" by Henry Livingston.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_004"}}
{"id": "S09E10_005", "text": "[Scene: Chandler's Office in Tulsa, in the conference room. Chandler's staff/co-workers are sitting round the table; Chandler is walking around, when he notices a piece of paper attached to the back of his chair.]\nChandler: All right everybody, I know that it's Christmas Eve and you'd rather be with your families, but there's *no* call (he takes it off) for writing \"Screw you, Mr. Bing!\" on the back of my chair! (he looks at it) -- By the way, you can all call me Chandler.\n(Wendy enters the conference room, carrying a cardboard box.)\nWendy: Hey!\nOthers: Hey.\nChandler: Hey. Where've you been?\nWendy: I was, uh, checking out that insurance company's Christmas party on three, oh, it was really beautiful, they have all these decorations and this huge tree and I just, uh... to hell with them, we have to work. -- So I stole ther ham. (She turns the cardboard box upside down over the conference table, a big piece of ham falls out.)\nChandler: (to the others) You hear that? You may not be with your families, but at least it's gonna smell like ham in here.\nClaudia: My kid's in a play right now.\nChandler: Y'know what, I know what will cheer you guys up! (he starts spreading envelopes among them) I had a little talk with the boys in New York, told 'em about all the hard work you've been doing and that a little Christmas bonus may be in order.\nKen: (reading off his card) \"A donation has been made in your name to the New York City Ballet\".\nChandler: Well, that's like money in your pocket! - Alright look, you want me to say it? This sucks. Being here sucks! This work sucks!\nWendy: *Now* it feels like Christmas.\nChandler: I'm sorry. Hey, at least you guys get to go home and be with your families tonight. I have to go back to an empty hotel room and lay down on a very questionable bedspread. And then tomorrow morning, you get to have Christmas morning in your own houses, wich, by the way, none of you have invited me to.\nKen: You can come to my house!\nChandler: Haha, no thanks!\nWendy: That was a nice pep-talk.\nChandler: Oh, thanks! I'm... actually thinking about becoming a motivational speaker.\nWendy: So, if you were home right now, what would you be doing?\nChandler: Typical Christmas-y stuff, you know? Our holidays are pretty traditional...\n[Flashback to 410 - TOW The Girl From Poughkeepsie] [Scene: Central Perk, Phoebe is singing her holiday song.]\nPhoebe: So here is a, a very special holiday song that I wrote for some very important people to me. (singing:)\n\"Went to the store, sat on Santa's lap. Asked him to bring my friends all kinds of crap. Said all you need is to write them a song. Now, you haven't heard it yet, so don't try to sing along. No, don't sing along.\nMonica, Moncia, have a happy Hanukkah. Saw Santa Claus, he said hello to Ross. And please tell Joey, Christmas will be snowy! And Rachel and Chandler, have err-umm-glander!!\"\nHappy holidays, everybody!\n[Flashback to 610 - TOW The Routine] [Scene: Monica and Chandler's apartment, Chandler is there. Phoebe and Rachel enter.]\nRachel: Okay, Pheebs, you look in the kitchen, I will look in the back closet.\nChandler: I can save you time ladies, I'm right here.\nPhoebe: Yeah, Chandler why don't you take a walk? This doesn't concern you.\nRachel: We are looking for our Christmas presents from Monica.\nChandler: What? That's terrible!\nPhoebe: No-no, we do it every year!\nChandler: Oh well, that, that makes it not terrible.\nPhoebe: No, yeah, we never find them! She's always best at us, that wily... minx.\nRachel: Don't worry, we're just gonna search here for an hour, and then we're gonna go over to Joey's and search, OK?\nChandler: No not okay, you can't look for Monica's presents!\nPhoebe: Oh no, we have to!\nChandler: No, you don't have to, and you can't because I, I live here too.\nPhoebe: Well then, you should look with us.\nChandler: Why?\nRachel: Chandler, aren't you worried about what to get Monica for Christmas?\nChandler: No, I have a great idea for a present for her.\nPhoebe: Oh, that's it? (Mimics Chandler) A great idea! Oh yeah.\nRachel: Chandler, that's not enough. I mean what if she gets you a great present, two medium presents, and a bunch of little presents? And you've just gotten her one great present? I mean that's just gonna make her feel bad. Why would you do that to her Chandler? Why? Why?\nChandler: If I help, we can find 'em faster!\nRachel: That's right!\n(Phoebe looks under the couch)\nPhoebe: Ooh ooh, we have a live one!\nRachel: Oh, it's a Macy's bag!\n(Phoebe tips it upside down, and a shoe falls out)\nRachel: Oh.\nPhoebe: Ooh, who's it for?\nRachel: (Reading from a tag that's attached to the shoe) \"Dear losers, do you really think I'd hide presents under the couch? P.S.: Chandler, I knew they'd break you.\"\n[Flashback to 209 - TOW Phoebe's Dad] [Scene: Monica and Rachel's apartment. Joey and Chandler are giving out their Christmas presents out of a cardboard box from a case of motor oil.]\nJoey: Rach, these are for you.\nRachel: Wiper blades. I don't even have a car.\nJoey: No, but with this new car smell, you'll think you do.\nChandler: OK, Pheebs, your turn.\nPhoebe: Ahh, toilet seat covers! Is that what you were doing while I was getting gas?\nJoey: Uh-huh.\nPhoebe: You guuuyys.\nJoey: And for Ross, Mr. Sweet-tooth.\nRoss: You got me a cola drink?\nChandler: And, a lemon lime.\nRoss: Well this, this is too much, I feel like I should get you another sweater.\nChandler: And last but not least.\n(Chandler and Joey give Monica a pack of condoms.)\nJoey: They're ribbed for *your* pleasure.\n[Flashback to 710 - TOW The Holiday Armadillo] [Scene: Monica, Chandler and Phoebe's, Ross is costumed as an Armadillo.]\nRoss: Ooh, hey Ben, what if the Holiday Armadillo told you all about the Festival of Lights?\nBen: Cool!\nRoss: Yeah!\nMonica: Come on Ben.\n(Monica and Ben sit down on the couch.)\nRoss: Years and years ago there were these people called the Maccabees...\nChandler: (entering in a Santa costume) Ho, ho, ho! Merry Christmas!\nBen: Santa! (Runs to Chandler and hugs him)\nChandler: Hey! (Grunts as Ben hits him at full speed.)\nRoss: What are you doing here, Santa?\nChandler: Well, I'm here to see my old buddy Ben. What are you doing here, weird...turtle-man?\nRoss: I'm the Holiday Armadillo, your part-Jewish friend. You sent me here to give Ben some presents. Remember?\nChandler: What?\nMonica: Okay Ben, why don't you come open some more presents, and Santa, the Armadillo and I have a little talk in the kitchen? There's a sentence I'd never thought I'd say.\n(They walk to the kitchen; everyone is lowering their voices)\nRoss: (to Chandler) What are you doing?\nChandler: You called everyone and said you were having trouble finding a Santa costume, so I borrowed one from a guy at work!\nRoss: Thank you, but, but you, you gotta leave.\nChandler: Why?\nRoss: Because, I'm finally getting him excited about Hanukkah, and, and you're-you're wrecking it.\nChandler: But I didn't get to shake my belly like a bowl full of jelly.\nRoss: I'm sorry Chandler, but this, this is really important to me.\nChandler: Fine, I'll give the suit back.\n(Ross turns around and walks back to Ben.)\nMonica: (to Chandler) Hey, you think, you can keep it another night? (She has a really teasing look on her face and keeps twirling Chandler's beard.)\nChandler: Santa? Really?\nMonica: Yeah, is that okay?\nChandler: Did your Dad ever dress up like Santa?\nMonica: No.\nChandler: Then it's okaaay! (They kiss.)\n[Scene: Back in the conference room in Tulsa.]\nChandler: You know what, everybody? Go home. You should be with your families. It's bad enough that we're working New Year's Eve.\n(All others are looking up, surprised)\nChandler: Did I not tell *anyone* about New Year's Eve? -- Alright, look, go! Go home, okay? Merry Christmas! Go.\n(All are leaving, wishing each other a Merry Christmas, peace on earth, etc. Only Wendy stays.)\nChandler: Good, God's speed, good people! (he starts to close the door, turns around and sees Wendy) You're not gonna go?\nWendy: Naah... I couldn't leave you alone.\nChandler: Ah. Thanks.\nWendy: Besides, I can't leave until their Christmas party downstairs clears out; there are some *pissed off* insurance people looking for that ham.\nChandler: Ah. (The phone rings; he answers it) Chandler Bing.\n[Scene change back an forth: Monica and Chandler's Apartment, Monica's on the other end of the line. The phone's speaker is turned on, so the rest of the gang, sitting around the phone, can hear Chandler.]\nMonica: Hi Honey! We're all here; we just want to wish you a Merry Christmas.\nOthers: (simultaneously) Merry Christmas! (except for Phoebe...)\nPhoebe: (simultaneous to the others) Ble-blah-blar Blargh!\n(All the others look at her, stunned/incredulous)\nChandler: Ahh, Merry Christmas; I miss you guys!\nMonica: So is it horrible? Is everybody working really hard?\nChandler: Ah, well no, it's just uh, me and Wendy.\nMonica: Wendy? -- That sounds like a girl's name.\nChandler: It is. Did I... not tell you about her?\nMonica: Umhmm, umhmm, about the time you told me about New Year's Eve. Where is everybody else?\nChandler: I sent them home.\nMonica: Ohh, you are such a good boss! Is she pretty?\nChandler: Uhh, uh...\nRoss: (in a low voice) Answer faster, answer faster!\nChandler: I don't know!\nRoss: (in the same low voice) Answer better, answer better!\nChandler: I don't think of her that way, you know, she's a, she's a colleague.\nMonica: What does she do there?\nChandler: Oh, she's regional Vice President; She's... just below me.\nMonica: She did WHAT?\nChandler: BE-LOW me!\nJoey: Ahh, wait, is Wendy the runner-up Miss Oklahoma?\nMonica: *What*??\nChandler: Well, she... she didn't win...\nMonica: Alright, well, maybe I should let you and the second prettiest girl in Oklahoma get back to work.\nChandler: Well, second prettiest that year; I mean, of *all* the girls in Oklahoma, she's probably...\nRachel: (interrupting him) Oh Chandler, stop talking!\nChandler: Honey, there's really nothing to worry about.\nMonica: Okay.\nChandler: I'm serious!\nMonica: Okay!\nChandler: Merry Christmas.\nMonica: Merry Christmas.\nChandler: Merry Christmas, you guys!\nOthers: (simultaneously) Yeah, Merry... Christmas. (again, Phoebe...)\nPhoebe: (simultaneous to the others) Blah blargah, blar-blab.\n(Again the others just look at her, silent, puzzled.)\n[Scene: back in the conference room in Tulsa]\nChandler: (hanging up the phone) The wife says \"Hi!\".\nWendy: Ah. Fun conversation?\nChandler: Ah well, she's got this weird idea, that, uh, y'know, just because you and I are alone, that something is gonna happen.\nWendy: Huh? Really? -- Hm, that'd be so terrible? (She gets hold of Chandler's tie, slowly moving her hands upwards on the tie, getting closer and closer to him, seductive.)\nChandler: This is probably the wrong thing to be worrying about, but... you're getting ham on my only tie.\n(She's getting closer to him, the scene fades to black.)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 5, "scene_id": "S09E10_005", "location": "Chandler's Office in Tulsa", "scene_description": "in the conference room. Chandler's staff/co-workers are sitting round the table; Chandler is walking around, when he notices a piece of paper attached to the back of his chair.", "characters": ["Ben", "Chandler", "Claudia", "Joey", "Ken", "Monica", "Others", "Phoebe", "Rachel", "Ross", "Wendy"], "firestore_path": "/episodes/S09E10/scenes/S09E10_005"}}
{"id": "S09E10_006", "text": "[Scene: The conference room in Tulsa again, Chandler is trying to evade Wendy]\nChandler: Whoa-ho, back off, Missy! (He takes a step back, but she still keeps her grip on his tie.)\nWendy: (laughs) ...Missy?\nChandler: I don't know; I'm not used to girls making passes at me! ... (She lets go of his tie) Wait a minute... am I sexy in Oklahoma?\nWendy: You are to me... (She gets closer again, putting her arms around his torso.)\nChandler: (flattered) No,... no... (realizing) NO! (He quickly gets several steps away from her.) Look, I'm, I'm married!\nWendy: So? I'm married. (Showing him the ring on her finger.)\nChandler: I'm *happily* married.\nWendy: Oh. - What's *that* like?\nChandler: Right. So, I'm sorry...\nWendy: Seriously? Happily married. So that phone call before, that was ... happy?\nChandler: Well look, it's not easy to spend this much time apart, you know. She's entitled to be a little paranoid... or, in this case: right on money! ... You know, she's amazing, and beautiful, and smart, and if she were here right now, ...she'd kick your ass. Look, you're a really nice person... ham stealing and adultery aside. But, what I have with my wife is pretty great, so nothing is ever gonna happen between us.\nWendy: Okay, let me ask you something: if what you and your wife have is so great, then why are you spending Christmas with me?\n(Chandler starts to think about it...)\n[Flashback to 716 - TOW The Truth About London] [Scene: London, Chandler's hotel room. He was getting ready for bed when Monica pays him a visit and they started talking]\nChandler: I mean, you were the most beautiful woman in the room tonight!\nMonica: Really?\nChandler: You kidding? You're the most beautiful woman in most rooms... (She jumps up and kisses him.) (Breaking the kiss.) Whoa! Whoa! Whoa! What's going on? You and I just made out! You and I are making out?\nMonica: Well, not anymore.\nChandler: But we don't do that.\nMonica: I know, I just thought it would be fun.\nChandler: How drunk are you?\nMonica: Drunk enough that I know I wanna do this. Not so drunk that you should feel guilty about taking advantage.\nChandler: (thinks) That's the perfect amount!\nMonica: Okay!\n(They run to the bed, sit down, and start making out again.)\nMonica: (breaking the kiss) Y'know what's weird?\nChandler: What?\nMonica: This doesn't feel weird!\nChandler: I know.\nMonica: You're a really good kisser.\nChandler: Well, I have kissed over four women. (They kiss again.) Do you wanna get under the covers?\nMonica: Hm-hmm!\nChandler: Okay!\n(They do so and they take off their clothes.)\nMonica: Wow! You are really fast!\nChandler: It bodes well for me that speed impresses you.\nMonica: We're gonna see each other naked.\nChandler: Yep!\nMonica: Do you wanna do it at the same time?\nChandler: Count of three?\nMonica: One!\nChandler: Two!\nMonica: Two!\nBoth: Three! (They lift up the covers and check each other out, then come back up with silly grins on their faces.)\nChandler: Well I think it's safe to say that our friendship is effectively ruined.\nMonica: Eh, we weren't that close anyway!\nChandler: Eh! (They start making out again)\n[Flashback to 503 - TOW The Triplets] [Scene: A hallway in the hospital, Monica and Chandler are talking.]\nChandler: So, are you really gonna go out with that nurse man?\nMonica: Well uh, you and I are just goofing around, I thought, why not just goof around with him.\nChandler: Y'know, I don't know if you've ever looked up the term goofing around in the dictionary... Well, I have, and the technical definition is, two friends who care a lot about each other and have amazing sex and just wanna spend more time together. But if you have this new fangled dictionary that gets you made at me, then we have to, y'know, get you my original dictionary. I am *so* bad at this.\nMonica: I think you're better than you think you are.\nChandler: Really? Okay, so...\nMonica: (interrupting) Know when to stop.\nChandler: Y'know, I sensed that I should stop. So we're okay?\nMonica: Yeah. (They kiss and as she starts to leave, Chandler starts to dance. Without turning around:) Don't do the dance.\nChandler: Right!\n[Flashback to 524 - TOI Vegas, Part II] [Scene: The Gift Shop, Monica and Chandler are entering.]\nMonica: I can't get married until I get something old, something new, something borrowed, and something blue.\nChandler: Okay, all right, all right, all right! Okay! (Picks up a blue sweater.) Okay, here's something, here's something blue and new.\nMonica: You're so efficient. I love you!\nChandler: Let's go! (Starts to leave.)\nMonica: No-no-no, wait! We need something old!\nChandler: Oh, okay, I have condom in my wallet that I've had since I was twelve.\nMonica: That'll work!\nChandler: I don't think so.\nMonica: Okay, now we just need something borrowed!\nChandler: (looks around) Here just...take this. (Hands her the sweater.)\nMonica: That's stealing!\nChandler: No, we'll-we'll bring it back! Just put it under your dress.\n(She does so and it makes her look pregnant.)\nMonica: Ohh. (Rubs her fake stomach.)\nChandler: Okay, one thing at a time. (They run out to get married.)\n[Flashback to 702 - TOW Rachel's Book] [Scene: Monica, Chandler, and Phoebe's, Chandler is looking at the wedding book as Monica enters.]\nMonica: Listen umm, I've been thinking, it's not fair for me to ask you to spend all of your money on our wedding. I mean, you work, you work really hard for that.\nChandler: Ehh.\nMonica: Eh, you work for that.\nChandler: Look, I thought about it too, and I'm sorry. I think we should spend all of the money on the wedding.\nMonica: You do?!\nChandler: Yeah, I'm putting my foot down. Yeah look, when I proposed I told you that I would do anything to make you happy, and if having the perfect wedding makes you happy, then, then that's what we're gonna do.\nMonica: Oh, you're so sweet. (They hug and kiss.) Oh, but wait, what about our, what about the future and stuff?\nChandler: Eh, forget about the future and stuff! So we only have two kids, y'know? We'll pick our favorite and that one will get to go to college.\nMonica: You thought about that?\nChandler: Yeah.\nMonica: How many kids were we gonna have?\nChandler: Uh, four, a boy, twin girls and another boy.\nMonica: What else did you think about?\nChandler: Well, stuff like where we'd live, y'know? Like a small place outside the city, where our kids could learn to ride their bikes and stuff. Y'know, we could have a cat that had a bell on its collar and we could hear it every time it ran through the little kitty door. Of course, we'd have an apartment over the garage where Joey could grow old.\nMonica: (laughs) Y'know what? I-I don't want a big, fancy wedding.\nChandler: Sure you do.\nMonica: No, I want everything that you just said. I want a marriage.\nChandler: You sure?\nMonica: Uh-hmm.\nChandler: I love you so much.\nMonica: I love you. (They kiss.)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 6, "scene_id": "S09E10_006", "location": "The conference room in Tulsa again", "scene_description": "Chandler is trying to evade Wendy", "characters": ["Both", "Chandler", "Monica", "Wendy"], "firestore_path": "/episodes/S09E10/scenes/S09E10_006"}}
{"id": "S09E10_007", "text": "[Scene: Monica and Chandler's Apartment, everyone except Chandler is there; they're opening their presents]\nRachel: (opens her present from Ross; it's a dark-red scarf) Oohh, I love it!\nRoss: Really? You're not gonna return it?\nRachel: Well, not this second!\nPhoebe: (at the window) Hey look, you guys, it's snowing!\n(The others all get up and go to the window.)\nRachel: Oh wow, it's so beautiful...\nRoss: Wow, it really is!\n(They all stand a moment in silence, staring out of the window.)\nMonica: \"Wendy\" is a fat girl name.\nPhoebe: Aren't we done with that?\nMonica: Okay, fine. Let's talk about snow. -- Do you think it's snowing in Tulsa, where my husband is having sex on a copying machine?\n(Shortly after that, Chandler enters.)\nChandler: Hey!\n(Surprised, uttering Ahhs and Ohhs, the others are coming over to him.)\nRoss: Oh my god...\nJoey: Hey-heeyyy - Look at that, it's a Christmas miracle!\nMonica: What are you doing here?\nChandler: I wanted to be with you. I missed you so much.\nJoey: Hey, hey, uh, who did you miss the most?\nChandler: Monica.\nJoey: Got ya. (blinks an eye)\nChandler: I never want to leave you again!\nMonica: But I thought if you left, you get fired.\nChandler: Turns out they can't fire me. Because I quit.\nMonica: What?\nRoss: What, you, you really quit your job?\nChandler: Yeah! It's a stupid job, and I could not stand leaving you. And why should I be the only one who doesn't get to do what he *really* wants to do?\nRachel: What do you really want to do?\nChandler: (realizing) I have *not* thought this through!\nMonica: Oh my god!\nChandler: I know, I, I should have talked to you first about it.\nMonica: No, I think that this is what you wanna do, I think it's great!\nChandler: Thanks!\nPhoebe: Chandler, your being here is the best Christmas present I could have ever imagined.\nChandler: (flattered) Ahh...\nPhoebe: Now give me my real gift.\n(Chandler hands Phoebe an envelope, and some more to Monica)\nPhoebe: (to Chandler) Thank you.\nChandler: (to Monica) Here, pass these, will ya.. (points to the others)\n(Monica passes the Envelopes on to Ross, Joey and Rachel.)\nRoss: Oh, hey...\n(They all open their envelopes.)\nRoss: (reading off his card) \"A donation has been made in your name to the New York City Ballet.\" -- How did you know?\nRachel: Wha... are you kidding? I can't return this.\nChandler: I... thought it was a timely start to thinking about other people. Besides, this gift still says I love you guys.\nJoey: Mine's is to Lilian Myers.\nChandler: I don't have a *job*!\n*Closing Credits*", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 7, "scene_id": "S09E10_007", "location": "Monica and Chandler's Apartment", "scene_description": "everyone except Chandler is there; they're opening their presents", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_007"}}
{"id": "S09E10_008", "text": "[Scene: Monica and Chandler's Apartment, Monica is cleaning up, Chandler is sitting on the couch, checking the Job offers in a Newspaper.]\nChandler: Actuary... no. Book-keeper... no. Topless dancer... (he looks down on himself, checking, then nods satisfied and marks the offer with a pen) (to Monica:) Hey, d'you know what I just realized? You are the sole wage earner. *You* are the head of the household. I don't do anything - I'm a kept man!\nMonica: You are! (she picks up a bill from the table, handing it to Chandler) Hey, here's twenty bucks. -- Why don't you go buy yourself something pretty while I'm at work tomorrow?\n(Chandler looks at the bill, thinking... then looks at the offer in the Newspaper and makes some dancing moves to see if he's up for the job...)\nEnd\nFRIENDS - THE ONE WHERE RACHEL GOES BACK TO WORK\n[Scene: Chandler and Monica's]\nChandler: Hey!\nMonica: Good morning, Tiger! I'm making you a nice big breakfast so you can keep up your strength for tonight. You're gonna get me good and pregnant.\nChandler: I've got nowhere to go this morning. I'm unemployed! I don't know what I'm gonna do with my life.\nMonica: Well, I just lost my erection.\nChandler: I mean, what am I supposed to do with myself? \nMonica: You're supposed to find your passion in life. You can be whatever you wanna be now. It's exciting.\nChandler: But it's all so overwhelming. I don't know where to start. \nMonica: Hey, wait a second. I can help you with this. You just need to be organized. We can make a list of your qualifications, and categorize jobs by industry. There could be folders and files! \nChandler: Hey! This is where your hyper-organized-pain-in-the-ass stuff pays off!\nMonica: I know!!! My erection is back!\n[Scene: Central Perk]\nJoey: (To Gunther who comes over with coffee and a muffin) Thank you!\nPhoebe: Joey, can I have a sip of your coffee and a bite of your muffin?\nJoey: Okay.\nPhoebe Thank you. (Pours his coffee in a thermos and puts his muffin in her purse.) Thank you! \nJoey:: Pheebs, have you ever been bitten by a hungry Italian?\nPhoebe: I'm sorry, it's just, I'm a little short on cash. \nJoey: If you want I could loan you some money?\nPhoebe: Oh no, no, no. I learned never to borrow money from friends. No, that's why Richard Dreyfuss and I don't speak anymore.\nJoey: Oh, hey, how about this? Wanna be an extra on my show?\nPhoebe: You could do that?\nJoey: Yeah, yeah. The pay is pretty good and you could do it for as long as you need. \nPhoebe: Oh my god, I'm gonna be on TV!\nJoey: Okay, now. I gotta tell you, being on TV isn't as glamorous and exciting as you think.\nPhoebe: Oh, really?\nJoey: No it is awesome!\nRoss: Hi guys.\nAll: (Adlib hellos)\nPhoebe: Wow! Hey, why are you all dressed up?\nRoss: Rachel and I are bringing Emma to Ralph Lauren today to introduce her to everyone. Doesn't she look cute?\nJoey: She sure does. Why does she have a pink bow taped to her head?\nRachel: Well, because if one more person says \"what a cute little boy\" I'm gonna whip them with a car antenna!\nRoss: I think she's gonna be the hit of the office, huh? She's gonna be hotter than peasant blouses and A-line skirts. Can I get a blue bow?\n[Scene: Chandler and Monica's]\nMonica: (Flipping through bunch of folders as Chandler enters from bathroom) Okay, I have looked through a bunch of career guides, photocopied and highlighted key passages and put them into alphabetical folders so you can make an informed decision.\nChandler: How long was I in there?\nMonica: Okay. Let us start with the A's. Advertising.\nChandler: Wait. Advertising! That's a great idea!\nMonica: Don't you want to look through the rest?\nChandler: I don't think I have to hear the rest. Advertising makes perfect sense. Sorry you had to waste all this time, though.\nMonica: You call eight hours alone with my label maker wasted time? Ooh, now I get to use my shredder!\nChandler: I mean, I can write slogans. I mean, how hard can it be, right? \"Cheese. It's milk that you chew.\" \"Crackers. Because your cheese needs a buddy.\" \"A grape. Because who can get a water melon in your mouth?\"\nMonica: I got one. \"Socks. Because your family's feet deserve the best.\"\nChandler: Honey? Leave it to the pros.\nMonica: I actually know someone in advertising. I grew up with this guy who is a vice president at a big agency. Maybe I can get him to meet you? Give me the phone.\nChandler: \"The phone. Bringing you closer to people...who have phones.\"\nMonica: \"Marriage. It's not for everybody.\"\n[Scene: Ralph Lauren]\nRachel: That went well. Almost everybody knew that she was a girl. \nRoss: Yeah, after you punched that one guy who got it wrong, word spread. \nRachel: I'm just gonna go in my office and pick up some stuff . (To the guy behind her desk) Who the hell are you!?\nGuy: Who the hell are you?\nRachel: I'm the hell person whose office this is!\nRoss: Good one, Rach.\nGuy: I'm Gavin Mitchell, the person who's taken over your job.\nRachel: Excuse me?\nGavin: Oh, your baby's so cute. Why did you put a pink bow on a boy?\n[Scene: DOOL set]\nPhoebe: Joey, look at me! I'm a nurse!\nJoey: Yes you are. I think it may be time for my sponge bath. Sorry, I'm just so used to hitting on the extras. So, are you excited about your scene?\nPhoebe: Yeah! But I'm a little shaky and nervous. \nJoey: Oh, relax. Don't be. You'll be fine, you'll be fine. They'll probably just make you stand in the back.\nDirector: Okay, okay, okay! (To Phoebe) You. Here, come here, here. You're gonna take this tray, you're gonna stay on this yellow mark. You're gonna move on \"action!\" You're gonna walk over to the operating table. You're gonna stop on that blue mark, you're gonna put the tray down. Don't walk too fast! But don't doddle.\nPhoebe: Okay, now. What?\nDirector: And...Action!!\nDirector: Cut! Cut!\nPhoebe: I'm sorry, I'm sorry, I'm sorry. I'm just a little nervous.\nDirector: Well, don't be.\nPhoebe: Okay, that helps.\nDirector: And...Action!\nDirector: Cut!\nJoey: Hey, you know what? Don't worry, Pheebs! It usually takes me three takes too! (Off the director's look) Alright, eight.\nDirector: And...Action!\n[Scene: Central Perk]\nInterviewer: So, do you have any other question about advertising?\nChandler: No, no. But let me show you what I can do. \"Bagels and donuts. Round food for every mood.\"\nInterviewer: Monica warned me you might do that. I actually think we might have something for you at the agency. \nChandler: Really? That's great!\nInterviewer: It's an unpaid internship.\nChandler: It's funny. When you said \"unpaid\" it sounded like you said \"unpaid.\"\nInterviewer: Come on now. Monica has a good job. And it's not like you have a family to support.\nChandler: Actually, we're trying, and I don't think Monica's gonna wanna postpone it. We're supposed to have sex tonight. Actually, she's probably at home naked right now. I tend to keep talking until somebody stops me. I can just picture her on the bed right now.\nInterviewer: Stop!\nInterviewer: Okay.\n[Scene: Ralph Lauren]\nRachel: Wait a minute! What do you mean, you're taking over my job?\nGavin: Well, while you were on your baby vacation I was doing your job.\nRachel: A vacation? My idea of a vacation does not involve something sucking on my nipples until they are raw.\nGavin: Clearly you've never been to Sandles Paradise Island.\nRachel: Alright! Don't get too comfortable there, because I'm back in two weeks! And I want everything back to the way it was. I can't say that I care too much for the way you've rearranged my office. \nGavin: I can't say I care too much for that smell you've brought in with you.\nRachel: Excuse me?\nRoss: Rach we have a code brown situation.\nRachel: Can you please, please take care of it for me?\nRoss: Alright, but you have to do one sometime.\nRachel: Let me just get this straight! So I go have a baby and they send some guy in to do my job?\nGavin: Well, there was talk of shutting down Ralph Lauren all together.\nRachel: That's right. You're very cheeky for a temp. \nGavin: I'm not a temp. I was transferred here from another department.\nRachel: Oh yeah, what department was that? The Jerk department?\nGavin: Oh, they didn't tell me about your quick wit.\nRachel: Did they mention that I'm rubber and you're glue?\nMr. Zelner: (Enters) Gavin, Ralph loved your ideas.\nRachel: Oh, hi Mr. Zelner.\nMr. Zelner: Rachel, I see you've met Gavin. I must say, when you left us we weren't sure what we were gonna do. But then, Gavin to the rescue. Super Gavin!\nRachel: That's great. So now, Super Gavin, when I come back where are you planning on flying off to?\nGavin: Well, that's up to Mr. Zelner. I'm sure he will make the right decision.\nRachel: (To herself) Oh, wow. Super ass-kissing power.\nMr. Zelner: Incidentally, when are you coming back?\nRachel: Today.\nGavin: You said two weeks.\nRachel: No, I said today! See, for a superhero, not so much with the listening.\n[Scene: DOOL set]\nJoey: Hey.\nPhoebe: Hey. So, what did he say?\nJoey: Well, he can be a little rough around the edges, so I'm gonna replace a word he used a lot, with the word \"puppy.\" Okay, so he said: \"If your puppy friend doesn't get her puppy act together, I'm gonna fire her mother-puppy ass.\"\nPhoebe: I'm sorry, I can't do this. I'm not an actor.\nJoey: That's right, you're not. You're a nurse. You're Nurse With Tray. \nPhoebe: Joey.\nJoey: No, no. Nurse With Tray doesn't know Joey, she doesn't have time for friends. She gets in that operating room and she carries that tray to the doctor, because if she doesn't, people die!\nPhoebe: Who dies?\nJoey: (Points to man on operating table) Man With Eye Patch! You get in there and you do your job.\nPhoebe: Yes, doctor.\nJoey: Okay.\nDirector: Okay, let's try this one more time. \nPhoebe: Hang in there, Man With Eye Patch, your tray is coming!\nDirector: And...Action!\nPhoebe: (Does the scene) Yes, I did it!!! I nailed it!!! Yay! What's next?\nDirector: The rest of the scene.\nPhoebe: Okay, from the top, people!\nScene: Ralph Lauren]\nRachel: Listen. Sudden change of plans. My maternity leave just ended. They told me that if I didn't come back today, they were gonna fire me.\nRoss: What? No, that's illegal. I'm gonna have the labor department down her so fast they won't even...\nRachel: Alright, alright. Calm down Norma Rae. They didn't actually say that. I'm just afraid if I don't come back right now this guy's gonna try to squeeze me out. \nRoss: What about Emma? We don't have a nanny.\nRachel: I know. You know, we're just gonna have to figure out a plan tonight. Can you please just take care of her for today?\nRoss: Absolutely. Just give me your breast and we'll be on our way.\nRachel: Come on, I don't know what else to do.\nRoss: Fine, fine. (To Emma) We'll have fun, won't we? Yes, we will, yes we will. (Gives her a kiss, and the pink bow tapes itself to his head.)\nRachel: Ross?\nRoss: Huh?\nRachel: You're pretty.\n[Scene: Chandler and Monica's] \nChandler: Whatever I decide to do, I'm gonna be starting a career from scratch. It's gonna be a while before I make a living at it. Maybe now is not the right time to be starting a family.\nRoss: So you have to tell Monica you don't want to have a baby right now?\nChandler: Yeah. \nRoss: (Hugs Chandler) Good-bye.\nMonica: (Enters) Okay, it's baby time. Pants off Bing. (Sees Ross) Didn't see you there Geller. \nChandler: Yeah, Ross is here so...\nRoss: Yeah, and I was really hoping that I could hang out. What do you feel like doing?\nMonica: We're gonna have sex.\nRoss: I don't feel like having sex. Maybe we can watch a movie or something.\nMonica: Let me put it this way. We're having sex whether you're here or not.\nRoss: Pants off Bing!\n[Scene: Ralph Lauren]\nRachel: Alright. Now that I'm back, why don't you just fill me in on what you've been up to?\nGavin: Well, I've changed your screensaver from that picture of *Nsync.\nRachel: Hey, they were popular when I left!\nGavin: Also, I've just been working on this big presentation for tomorrow.\nRachel: Well, I should be involved in that, so why don't you get me up to speed?\nGavin: That's gonna take weeks. Why don't just let me take care of the presentation?\nRachel: Oh, no no no no. I see what you're doing here, alright, listen, this is my job buddy. Okay, I've had it for five years, and I know how it works, so why don't you just catch me up!\nGavin: Fine. \nRachel: (Sits down in her chair) Oh god. You've totally messed with the back support of my chair. How do you fix this?\nGavin: Hey, you've been here five years, you figure it out.\nRachel: Fine, I will. (Pushes that button thing on the chair that makes it \"collapse\") Alright, fill me in! \n[Scene: Chandler and Monica's]\nRoss: Hey.\nChandler: Hey.\nRoss: You have a blue tie that would go with this? Emma spit up on mine.\nChandler: Oh, yeah. But you have to give it back if I get a job. Of course, by that time in the future ties will be obsolete and we'll all be wearing silver jump suits.\nMonica: (Enters from the bedroom) Hi, good morning lover. I gotta say after last night, I'm a little weak in the knees.\nRoss: Here's an idea. You walk into a room...take a quick scan!\nMonica: (To Ross) Sorry. (To Chandler) But I kind of have this feeling that we may have made a baby last night.\nChandler: Oh god, I have to tell you something. You're not pregnant. \nMonica: What are you talking about?\nChandler: That thing that I have to do to make a baby. I faked it.\nMonica: What!? You faked it?\nRoss: You know what? I don't need a tie. I mean, it's better, open collar. You know, it's more casual (He leaves.)\n[Scene: DOOL set]\nPhoebe: Joey, listen. I can't do this, it doesn't make any sense. Yesterday I was a nurse, and today I'm a waitress at a cafe?\nJoey: Oh, sometimes we use the same extras for different parts. It's okay. \nPhoebe: Well, it's not okay, because I gave a very memorable performance as the nurse. And now suddenly I'm the waitress? That's gonna confuse my fans. \nJoey: Maybe you are a nurse, but you moonlight as a waitress.\nPhoebe: Uhuh. Because I'm a single mother, supporting my two children.\nJoey: Nice.\nPhoebe: Wait a minute. Dr. Drake Ramoray and I work at the same hospital. Wouldn't I come over to say hi to him?\nJoey: No, no. See, you and Drake are having a fight. \nPhoebe: About what?\nJoey: He slept with you and then never called you.\nPhoebe: And I just wanted a new daddy for Davy and Becky.\nDirector: Okay, okay, from the top. And...Action!\nMan: So, I'm surprised you agreed to have lunch with me.\nJoey/Drake: I'm surprised to, but yet here I am.\nDirector: Cut, cut! What are you doing!?\nPhoebe: Yeah, well, I'm very angry at him, because he slept with me and never called me back.\nExtra: Me too!\nAnother extra: Me too!\nJoey: Oh, calm down! She means on the show! We need some new extras around here!\n[Scene: Chandler and Monica's]\nGavin: (Enters) Wow, you're here already.\nRachel: Yes. Emma and I came in a little early to do research on the presentation. I actually made a few changes, but I think I'm caught up on everything. So ask me anything!\nGav\nin: How do you fix the chair?\nRachel: Except that! (Mr. Zelner enters) Oh, hello, Mr. Zelner. We're all ready for our presentation this afternoon.\nMr. Zelner: Good, because it's in ten minutes.\nRachel: What? I can't do that! I have the baby, and Ross is not gonna pick her up for another hour.\nMr. Zelner: Well, then Gavin can give the presentation, okay, we have to do it now. Ralph needs to leave early today. He's going helicopter shopping.\nRachel: Well, there you go. You win, you win. You get to do the presentation, you'll knock 'em dead, no one will ever remember that I worked here, and then Ralph will buy his helicopter, and Super Gavin will just fly right along side of him!\nGavin: You can do the presentation.\nRachel: No, I can't, I have a baby.\nGavin: I'll watch her.\nRachel: Why would you do that?\nGavin: Because you've worked really hard, and it's your job, and you're a little crazy.\nRachel: That's really nice.\nGavin: I should tell you that crying women make me very uncomfortable.\nRachel: Then you're not gonna like what's coming. (Starts crying) I'm sorry, I'm sorry, I'm sorry. Thank you, thank you.\nGavin: I'm really fine, don't worry, I'm great with children. (To Emma) Gavin Mitchell. Pleased to meet you. \n[Scene: DOOL set]\nJoey: Please don't fire my friend. Just let me talk to her.\nDirector: Okay, okay. But this is her last chance. \nJoey: Thank you, thank you. How about I do something for you? Tomorrow, I'll bring you a hat, cover up the bald?\nJoey: Hey, listen Pheebs. I was just talking to the director, and he was thinking, maybe this time you don't hit Drake, you just wait on the tables?\nPhoebe: I can't do that. I'm an actor. I have a process.\nJoey: You're a masseuse. You have a table with a hole in it.\nPhoebe: Wait a minute, I see what's happening here. You're threatened. \nJoey: What?\nPhoebe: Yeah, I'm so good in this scene that I'm stealing focus from you. Well, rise to the challenge Tribianni 'cause I just raised the bar. Come join me up here!\nJoey: (To the director) Yeah, you can fire her, but I would call security, she won't go easy.\n[Scene: Chandler and Monica's]\nMonica: You faked it? You couldn't have faked it!\nChandler: Oh yes you can. You just make the faces and the noises. \nMonica: Guys can fake it? Unbelievable. The one thing that's ours! Besides, why would you fake it when we're trying to have a baby?\nChandler: That's actually why. Look, I'm starting a whole new career now, and I'm not saying that I don't want to have a baby, I'm just saying maybe we could wait a little while.\nMonica: Like a month?\nChandler: Or a year?\nMonica: Really, you want to wait a year?\nChandler: It could be less than a year. I mean, you've heard my stuff. \"Pants. Like shorts, but longer.\" (Pause) It'll probably be more than a year. \nMonica: I really wanna have a baby.\nChandler: Yeah, me too. Look, I'll just get my old job back. \nMonica: No, I want you to have a job that you love. Not statistical analysis and data reconfiguration.\nChandler: I quit and you learn what I do?\nMonica: It's just, I think, there's never gonna be a right time to have a baby. I mean, now you're unemployed and in a little while you'll find a new job that'll keep you really busy. There's always gonna be a reason not to do this, but I think once the baby comes, forget about all those reasons. \nChandler: I guess. It's always gonna be scary when we have a baby. \nMonica: It's gonna be really scary. I mean, god. When we have a baby, there's gonna be so much that we're not able to control. I mean, the apartment's gonna be a mess, I won't have time to clean it. What if the baby gets into the ribbon drawer? Messes up all the ribbons?! What if there's no room for a ribbon drawer, because the baby's stuff takes up all the space!? Where will all the ribbons go!?!\nChandler: Should we go make a baby right now before you change your mind?\nMonica: Yes, please!\nChandler: Oh, and I promise, I will not fake it this time.\nMonica: I wish I could say the same. I'm a little shook up!\n[Scene: DOOL set]\nJoey/Drake: I know you botched that operation on purpose. I can't prove it yet, but when I do, you'll be going to jail for murder. I don't care if you are my brother.\nMan: I'm not your brother.\nPhoebe/Waitress: What about my children Drake?! Huh!? (She starts running around on the set with a security guy chasing her) No!! No!! No! God!\nEND\nUNTITLED DOCUMENT\n912 - TOW Phoebe's Rats\nAired: 16/1/2003   Teleplay by: Brian Buckner and Sebastian Jones   Directed by: Ben Weiss   Transcribed by: Roni Raab", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 8, "scene_id": "S09E10_008", "location": "Monica and Chandler's Apartment", "scene_description": "Monica is cleaning up, Chandler is sitting on the couch, checking the Job offers in a Newspaper.", "characters": ["Aired", "All", "Another extra", "Chandler", "Director", "Extra", "Gavin", "Guy", "Interviewer", "Joey", "Man", "Monica", "Phoebe", "Rachel", "Ross", "Scene", "in"], "firestore_path": "/episodes/S09E10/scenes/S09E10_008"}}
{"id": "S09E10_009", "text": "[Scene: Coffee place, Joey is there, Chandler is entering]\nChandler: Hey\nJoey: Hey. So where's Mon?\nChandler: Oh, she's at home, putting up decorations for Rachel's birthday party tonight.\nJoey: And you're not helping?\nChandler: I tried, but apparantly singing \"I will survive\" in a helium voice - not helping.\n(Ross and Rachel enter with Emma in Rachel's hands)\nRoss: Hey you guys!\nJoey and Chandler: (start to sing) Hey! Happy birthday ...\nRachel: Shhh don't say that loud, Gunther's gonna want to hug me.\nRoss: Uh, good news everyone, we finally found a nanny. This is Molly (points to Molly). Molly, Chandler, Joey.\nJoey and Chandler: Hi.\nMolly: Hi.\n(Emma starts to cry)\nRoss: Ooh, somebody's getting a little fussy.\nJoey: You damn right I am, I've been waiting for a cookie for 7 minutes.\nRachel: Ok, you know what, I'm just gonna take her outside.\nMolly: No, you stay, I'll do it (takes Emma from Rachel). \nRachel: OK, thank you.\nMolly: Nice to meet you guys (to Chandler and Joey).\nJoey: Yeah, you too.\n(Molly leaves)\nRachel: Oh, wow, Molly is just great!\nRoss: Yeah.\nChandler: Yes, Bravo on the hot nanny.\nRachel: What? You really think she's hot?\nChandler: Are you kidding? If I wasn't married she'd be rejecting me right now.\nRachel: And Joey?\nJoey: How do you think she's doing?\nRachel: Am I the only one who doesn't think that she's hot? Ross?\nRoss: Eh, I mean, I mena she's not unattractive but hot? I ....\nRachel: Thank you! (goes to get coffee)\nChandler: Now that Rachel's gone?\nRachel: So hot I cried myself to sleep last night. (Joey and Chandler clap their hands)\nOPENING CREDITS", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 9, "scene_id": "S09E10_009", "location": "Coffee place", "scene_description": "Joey is there, Chandler is entering", "characters": ["Chandler", "Joey", "Joey and Chandler", "Molly", "Rachel", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_009"}}
{"id": "S09E10_010", "text": "[Scene: Mike and Phoebe in Phoebe's place, Phoebe is doing a crossword puzzle]\nPhoebe: Hey Mike, what's the capital of Peru?\nMike: Lima.\nPhoebe: No. It starts with a \"v\" and ends with an \"x\". Helpfully with a \"to\" in the middle.\nMike: You know, kinda think of it, the capital of Peru IS \"vtox\". (opens the kitchen cabinet) Oh god! Oh!\nPhoebe: What?\nMike: OK, I don't want to freak you out or anything, but I think I just saw a rat in your cupboard.\nPhoebe: (relived) Oh, whew, no, that's Bob.\nMike: What, is he your pet rat?\nPhoebe: Well not so much a pet as, you know, an occasional visitor who I put food out for, you know. Kinda like Santa. Except Santa doesn't poop on the plate of cookies.\nMike: You can't keep a rat in your appartment! They're extremely unsanitary, and they transmit leptospirosis and hantavirus.\nPhoebe: What are those?\nMike: I don't know but they don't sound like spa treatments. You have to get rid of it!\nPhoebe: OK, fine, if it means that much to you I'll get rid of Bob.\nMike: Thank you.\nPhoebe: So weird, you think he's so gross and you're willing to eat his crackers. (Mike throws out everything in his mouth)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 10, "scene_id": "S09E10_010", "location": "Mike and Phoebe in Phoebe's place", "scene_description": "Phoebe is doing a crossword puzzle", "characters": ["Mike", "Phoebe"], "firestore_path": "/episodes/S09E10/scenes/S09E10_010"}}
{"id": "S09E10_011", "text": "[Scene: Rachel's office, Rachel comes in and Gavin is there]\nRachel: Hello.\nGavin: Hello\nRachel: Gavin, I just wanted to say thank you again for watching Emma yesterday during the presentation. I really owe you an appology.\nGavin: For what?\nRachel: Well, when we first met, you know, I thought you were pompous and arrogant and obnoxious ...\nGavin: Is this your first appology?\nRachel: No, I just mean that, you know, first impressions don't mean anything. And I-I think you're a really good guy and I'm sorry that I misjudged you.\n(Heather walks in)\nHeather: Good morning! \nRachel: Hello. (to Gavin) But you know what, hey, new day, new leaf, I am just really really happy ... (sees Gavin staring at Heather) I'm sorry, obviously Heather's ass has something more important to say so I'll just wait 'till it's finished.\nGavin: What?\nRachel: I was giving you an appology and you were totally checking her out!\nGavin: I wasn't checking her out. I'm in fashion, I was looking at her skirt. Or was it pants? I didn't really see what happened below the ass area.\nRachel: Oh wow, you are really, you're really a creep.\nGavin: Why do you even care if I was looking at her? Are you jealous?\nRachel: Oh yeah, I'm jealous. \"Oh Gavin, please, please look at my ass\". (Gavin starts looking) Stop looking at my ass! I mean, I just think you are totally inappropriate, ok? This is a work environment, she's your subordinate.\nGavin: I thought it was ok when you slept with your old assistant Tag.\nRachel: That is totally different for two reasons. One - I didn't know that you knew that. And two, I wasn't some creep staring at his ass, we had a deap meaningful relationship.\nGavin: Huh. What's Tag's last name?\nRachel: It was ... (can't remember) oh my god. He didn't have a last name. It was just \"Tag\". You know, like Cher, or, you know, Moses.\nGavin: But it was a deap meaningful relationship.\nRachel: Oh, you know what - my first impression of you was absolutely right. You are arrogant, you are pompous ... Morgan! Morgan! Tag's last name was Morgan! Huh!\nGavin: It was Jones.\nRachel: Yeah well what are you, his boyfriend?", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 11, "scene_id": "S09E10_011", "location": "Rachel's office", "scene_description": "Rachel comes in and Gavin is there", "characters": ["Gavin", "Heather", "Rachel"], "firestore_path": "/episodes/S09E10/scenes/S09E10_011"}}
{"id": "S09E10_012", "text": "[Scene: Coffee place, Molly holding Emma and talking to Joey]\nJoey: Man, I wish I had a nanny like you.\nMolly: You mean, when you were a baby.\nJoey: Sure.\n(Chandler is staring at Molly)\nMonica: Would you stop staring at her?\nChandler: I wasn't staring. I was leering.\nMonica: What's the big deal with her? Maybe she's attractive in an obvious kind of way.\nRoss: Yeah, obvious beauty's the worst. You know, when it's right there in your face. Me, I like to have to work to find someone attractive. Makes me feel like I earned it.\nChandler: Looks like Joey is doing allright with her.\nMonica: Yeah. Hey, that was nice of you guys to back off and let Joey get the girl for once.\nMolly: (to Ross) I'm gonna take her back to the appartment.\nRoss: Ok, I'll be home right after work. Ok, by Emma-Wemma-Demma, I love you - wovyou dovyou ...\nMolly: Bye\nMonica: They've elected me to talk to you about the baby talk - it's not so good.\nMolly: I think it's sweet. (goes to leave)\nRoss, Joey and Chandler: Bye, Emma-Wemma-Demma.\nRachel: (to Joey) Hey, listen, Joey, about Molly, I really prefer if you didn't go after her.\nJoey: Why not?\nRachel: Because it took us months to find a good nanny and I wouldn't want anything to, you know, drive her away.\nJoey: So, what, you think I'm just gonna sleep with her and never call her again and things are gonna get uncomfortable? (thinks about it) Yeah, sounds about right.\nRoss: Come on, there are plenty of other women out thereok? Just - just forget about her, ok? Just, she's off limits.\nJoey: Oh, man, why did have to go and say that for? Now that you told me I can't have it makes me want her even more!\nRoss: What are you, a child?\nJoey: Yes!\nRoss: Joey, come on now, for me! Please, just-just try to focus your sexual energy on someone else.\nJoey: Fine. (looks around, then focuses on Monica)\nMonica: (to Chandler) Take me home! (they quickly leave)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 12, "scene_id": "S09E10_012", "location": "Coffee place", "scene_description": "Molly holding Emma and talking to Joey", "characters": ["Chandler", "Joey", "Molly", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_012"}}
{"id": "S09E10_013", "text": "[Scene: Phoebe's place, Phoebe and Mike are there]\nPhoebe: Hey Mikey\nMike: Hey P\nPhoebe: What are you doing?\nMike: Setting rat traps.\nPhoebe: To kill Bob??\nMike: No, no, to test his neck strength.\nPhoebe: No, Mike, I don't want to kill him! I thought we were just gonna capture him and, and you know, set him free in the country side where he can maybe meet a friendly possom and a wisecracking owl.\nMike: Ok, ok, I'll throw away the traps.\nPhoebe: I'll find Bob, I'll get him. Bob? (starts looking) Bob! Robert! (looks at cabinet under sink) Oh wait, I think I hear him. Oh - Oh my god! Bob had babies! Bob's a mom!\nMike: Better think of a new name for him.\nPhoebe: I don't know, I kinda like Bob for a girl.\nMike: I don't know, I mean I'm not sure (they hear cracking voice from somewhere else in the kitchen, probably a rat caught in a trap) ...\nPhoebe: Oh my god, we killed Bob!\nMike: Maybe it wasn't Bob, maybe it was a mouse.\nPhoebe: Suzie? (Runs over there to check)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 13, "scene_id": "S09E10_013", "location": "Phoebe's place", "scene_description": "Phoebe and Mike are there", "characters": ["Mike", "Phoebe"], "firestore_path": "/episodes/S09E10/scenes/S09E10_013"}}
{"id": "S09E10_014", "text": "[Scene: Mon and Chan's, Ross enters]\nRoss: Whazzup??\nChandler: Seriously dude, 3 years ago.\nRoss: Listen, can you do me a favor? I'm gonna be out today. Can you just keep an eye on Joey, make sure nothing happens between him and Molly?\nChandler: You don't trust him?\nRoss: Wh - No. Some woman who sounded a lot like Joey called earlier and asked for her daughter, the \"hot nanny\".\nChandler: Is this really your long term plan, for me to run interference? Because I could get a job any day now.\nRoss: You do appear right on the cusp of something. Come on man, I'm sure he'll lose interest in a week or two, but for now can you please just do this for me?\nChandler: Allright, fine, but don't blame me if it doesn't work. Because you know as well as I do that once Joey sets his mind on something, more often than not, he's going to have sex with it.\nRoss: Well we gotta do something, ok? Nannies like her don't grow on trees. (pause)  \nChandler: Picturing that tree?\nRoss: I am, yes.", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 14, "scene_id": "S09E10_014", "location": "Mon and Chan's", "scene_description": "Ross enters", "characters": ["Chandler", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_014"}}
{"id": "S09E10_015", "text": "[Scene: Hallway, Joey get out of his appartment and Chandler jumps out of his]\nChandler: Where you going, Joe?\n(Joey falls on floor and gets up)\nJoey: For a walk.\nChandler: Oh. You mind if I join you?\nJoey: Actually, that will be long. You know, I really need to organize my thoughts.\nChandler: Your thoughts? Plural?\nJoey: Allright, fine, I only have one thought! It's about the hot nanny, I gotta see her!\nChandler: I'm afraid I can't let you do that, Joe.\nJoey: Now YOU'RE telling me I can't see her?? You guys are killing me! She's forbidden fruit! It's like ... like she's the princess and I'm the stable boy ... Why are you doing this, huh? Did Ross tell you not to let me go over there?\nChandler: Yes, as a matter of fact he did, so I can't let you go.\nJoey: Huh. Interesting. Now there are obstacles. Hot nanny and me against the world. This is the kind of stuff great novels are made of.\nChandler: Great novels? \nJoey: Fine ... mediocre porn", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 15, "scene_id": "S09E10_015", "location": "Hallway", "scene_description": "Joey get out of his appartment and Chandler jumps out of his", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S09E10/scenes/S09E10_015"}}
{"id": "S09E10_016", "text": "[Scene: Rachel's office, Rachel and Gavin there, phone rings, Gavin picks it up]\nGavin: Gavin Mitchelle's office.\nRachel: Rachel Green's office!! Give me that phone! (takes the phone) Hello, this is Rachel Green, how can I help you? Uh huh ... ok then ... I'll pass you back to your son (gives phone to Gavin)\nGavin: Hey Mom! No, that's just my secretary. (Rachel is upset)\nRachel: Um, excuse me Gavin, I have a question I need to ask you.\nGavin: Mom, I'll call you later. Yeah. (hangs up) (to Rachel) Yes?\nRachel: If you like looking at butts so much why don't you just go look at a mirror?\nGavin: Thank god you finally said that, I saw you make a note on your pad three hours ago. (Rachel throws away that paper) Man, I really bug you, don't I?\nRachel: Oh, please, I don't care about you enough to bug me. In fact, from now on, I'm going take the high road. And I'm going be very very nice to you, you \"momma's boy\", starting right now.\n(door knock, Monica enters)\nMonica: Hey Rach!\nRachel: Hi!\nMonica: Ready for your birthday lunch?\nRachel: Yeah I am, I am! Oh, but first of all, Monica, I would like to introduce you to my very talented colleage and more importantly my wonderful friend Gavin Mitchelle. \nGavin: Pleased to meet you.\nMonica: Pleased to meet you. So you're coming to Rachel's party tonight?\nRachel: Oh no no no no no, Gavin can't, he already has plans, most likely with his mother. \nGavin: Well I don't mind, I'll cancel. I would never miss my secretary's birthday. (leaves)\nRachel: Why did you invite him?? I can't stand that guy!\nMonica: You were just being so nice to him!\nRachel: I was faking it! Can't you tell when I'm being fake?\n(A man walks by)\nRachel: Hey, Mr Philips, nice suit!\nMonica: Right there! That was so fake!\nRachel: Shh!\n[Scene: Rachel's birthday party]\nRachel: (to Monica) I still can't believe you invited Gavin. Allright, he is the last person I want to see.\nMonica: Oh, you're welcome for the party. I'm glad you're having a good time.\nRachel: God, I hope he doesn't show up. Of course he's not gonna show up, the guy hates me.\nMonica: Does he?\nRachel: What?\nMonica: Maybe he's bothering you so much because he likes you. It's like in first grade when Skippy Langwild always pushed me on the playground because he secretly had a crush on me?\nRachel: Oh, Monica, you think Skippy liked you? Honey, all those buys had a bet to see if he can knock you over.\nMolly: (with Emma in a basinet) She's out, I'm gonna take her home.\nRachel: Oh, ok, thank you. (Molly leaves) (to Monica) Do you see what all the guys see in her?\nMonica: Wouldn't kick her out of bed. No more Vodka for me! (put her glass down)\n(Joey comes over)\nJoey: Hey Rach, so can I sing happy birthday to you now?\nRachel: Yeah, sure!\nJoey: Oh ... (Starts to sing) Happy birth ... (sees Molly leaving) oh, see you later (runs after Molly)\nMonica: Hey Rach, somebody got you shoes!\nRachel: Oh, give me! (opens the box happily, then gets freaked and throws away the box, she and Mon jump up the sofa)\nPhoebe: Be careful, be careful! These are my rat babies!\nMike: Yeah. We have rat babies now.\nRachel: Ahhhh , you brought rats to my birthday party?\nMonica: So this is what a stroke feels like.\nPhoebe: I had to bring them! We killed their mother, they're our responsibility now. You know, they require constant care. You should know that, Rachel, you're a mother.\nRachel: Are you comparing my daughter to a rat?\nPhoebe: No! Seven rats! I think we should take them home, we need feed them.\nRachel: whhh wait, you're gonna leave my party to take care of a box of rats?\nPhoebe: Well I'm sorry Rachel, but I'm not like you, ok? Not everyone can afford help. (she and Mike leave)\n(Ross gets out of the bathroom, sees Chandler)\nRoss: Where the hell are Joey and Molly? I asked you to watch them.\nChandler: (In a helium voice, holding a balloon) I'm sorry, I got a little occupied.\nRoss: We have to stop them before something happens!\nChandler: (still helium voice) Right behind you, big guy! (they both head for the door)", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 16, "scene_id": "S09E10_016", "location": "Rachel's office", "scene_description": "Rachel and Gavin there, phone rings, Gavin picks it up", "characters": ["Chandler", "Gavin", "Joey", "Mike", "Molly", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S09E10/scenes/S09E10_016"}}
{"id": "S09E10_017", "text": "[Scene: Ross's place, Molly and Joey are talking on the couch]\nJoey: So you see, Molly, what people don't understand is that acting is a discipline. It takes a lot of hard work.\nMolly: So where did you study?\nJoey: Oh, I didn't go to college.\nMolly: No, where did you study acting?\nJoey: Molly ... people don't study acting ...\n(Ross and Chandler walk in, Joey looks disappointed)\nRoss: Molly, ah, do you mind giving us just a minute?\nMolly: Sure, I'll go check on Emma.\nRoss: Thanx.\n(Molly gets up and walks away)\nJoey: (upset) Will the stable boy never get the princess??\nRoss: What do you think you're gonna do, have sex with her right here on my couch?\nJoey: No ... the leather sticks to my ass. You know, this isn't fair. What makes you think that I'm just gonna sleep with her and then blow her off? Huh? Can't you guys open your minds to the possibility that I actally like her, and might want something real? (pause) Look, the truth is, I haven't felt this way about anyone since Rachel, ok? I didn't think I could ever love again.\n(pause)\nRoss and Chandler: Come on! Joe!\nJoey: Ok (admits)\n(knock on door, Ross opens, it's a woman)\nWoman: Hi, is Molly here?\nRoss: Yeah, come on in. Molly?\nMolly: (goes out of the room) Hey! Guys, this is Tabatha (they kiss on the lips in a romantic way). (to Ross) I'll see you tomorrow.\nRoss: Ok ... (they leave the room, long pause) Well, uh, Joey, I guess we have no problem.\nJoey: It's like my favorite fairy tale come true! (Chandler looks at him) The princess, the stable boy and the lesbian!", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 17, "scene_id": "S09E10_017", "location": "Ross's place", "scene_description": "Molly and Joey are talking on the couch", "characters": ["Joey", "Molly", "Ross", "Ross and Chandler", "Woman"], "firestore_path": "/episodes/S09E10/scenes/S09E10_017"}}
{"id": "S09E10_018", "text": "[Scene: Phoebe's place, Phoebe and Mike enter]\nPhoebe: Ok, ok, you start preparing the formula and I start changing the box and then we gotta put them straight to bed.\nMike: Hey, when did we become one of those couples whose lives revolve around their rats?\nPhoebe: Well, you know what, they're our responsibility now.\nMike: Ok, fine, these rats are our responsibility. What happens when they mate and there are hundreds of them?\nPhoebe: Mate? They're all brothers and sisters.\nMike: Yeah - not such a problem with rats. No, they're more of a \"love the one you're with\" kind of animals.\nPhoebe: No. (opens the box) wh - get off your sister! Oh my god, what are we gonna do? We have 7 rats. So what if each of them has 7 rats? And then each of those have 7 rats? That's like ... (starts counting with her fingers) That's math I can't even do! What are we gonna do?\nMike: Well, I know this is gonna sound crazy, but, we could not let the box of rats ruin our lives.\nPhoebe: Yeah, ok. I guess you're right. Allright, so we should just give them away. But to nice families, with children, and reduced fat wheat thins. They're Bob's favorites. \nMike: It's gonna be ok.\nPhoebe: You must think I'm crazy.\nMike: No, I think you're sweet.\nPhoebe: Good. It's just so hard, it's hard for me to ... let them go. I guess it just brings back memories, you know, from ... when I gave birth to my brother's triplets and I had to give them up. (Mike is shocked) I haven't told you about that yet, have I?", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 18, "scene_id": "S09E10_018", "location": "Phoebe's place", "scene_description": "Phoebe and Mike enter", "characters": ["Mike", "Phoebe"], "firestore_path": "/episodes/S09E10/scenes/S09E10_018"}}
{"id": "S09E10_019", "text": "[Scene: Rachel's party, Rachel is on the balcony, Monica goes there also]\nMonica: Hey!\nRachel: Hi. Thanks for the party, honey. Should I help you clean up?\nMonica: No way! You had your party, now I have mine! Is everything alright?\nRachel: Yeah, I just get a little bummed when my birthday's over.\nMonica: Well, at least you have one thing to be happy about. That jerk Gavin from your office didn't show up (Gavin shows up at the balcony windows).\nRachel: Mmm hmm.\nGavin: Yeah, hey. (comes in to the balcony)\nMonica: Oh, we weren't talking about you. No, no way to recover.\nRachel: No.\n(Monica goes back inside)\nGavin: Nice party.\nRachel: Well, it was, and you would have seen it if you didn't showed up at (looks at his watch) ... 9:30?? God! Oh, this party was lame ...\nMonica: (from inside) Again, you're welcome.\nGavin: Look, I'll just give you this and go.\nRachel: Oh, you bought me a present! Why?\nGavin: Well, let me explain how birthday parties usually work. There are presents, and a cake, perhaps a fourth or fifth person. Ok, I ... got you the present to make up for being such a jerk to you earlier.\nRachel: Aww. Well, ok, well that's very nice. And you wrote a card (opens the card). \"From Gavin\"\nGavin: I really mean it.\nRachel: (opens the present, it's a green scarf) Awww, awww, it's beautiful.\nGavin: You don't mind? (puts it around her neck) Well, what do you know, it fits!\nRachel: See, Gavin, you're capable of being a nice guy. Why did you give me such a hard time?\nGavin: I'm not sure.\nRachel: Well Monica seems to think it's because you have feelings for me.\nGavin: I do have feelings for you.\nRachel: You do?\nGavin: Yes, I feel that you are a little annoying.\nRachel: See? Why, Gavin, why? Right when I'm about to change my opinion of you, you go and you ... (he kisses her) and you do that ... (they kiss again)\n[cut to Ross from his appartment, holding baby toys and is shocked to see them kissing]\nENDING CREDITS\nChandler: (sings in a helium voice) First I was afraid, I was petrified (very happy)\nPhoebe: (walks in) Hey\nChandler: (normal voice) Hi\nPhoebe: Listen, I think I've left something here.\nChandler: Oh, well someone left this (shows a green jacket). This is yours?\nPhoebe: (likes the jacket) No, but I like it. I think I left one of my rat babies.\nChandler: Oh, uh, well, I haven't seem it but if I do I'll let you know.\nMonica: Ohmygod! Rat baby! Rat baby! Rat baby! (screams from another room)\nPhoebe: (realizes) Ooh, maybe that's him!", "metadata": {"chunk_type": "scene", "season": 9, "episode_number": 10, "episode_id": "S09E10", "episode_title": null, "scene_number": 19, "scene_id": "S09E10_019", "location": "Rachel's party", "scene_description": "Rachel is on the balcony, Monica goes there also", "characters": ["Chandler", "Gavin", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S09E10/scenes/S09E10_019"}}
