{"id": "S10E16_001", "text": "The One with Rachel's Going Away Party\nWritten by: Perry Rein & Gigi McCreery Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 1, "scene_id": "S10E16_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S10E16/scenes/S10E16_001"}}
{"id": "S10E16_002", "text": "[Scene: Monica and Rachel's, the gang is there except for Rachel and Ross, who both come storming in. Rachel is still going off about Rosss secret marriage.]\nRachel: I cannot believe that you didnt tell me that we are still married!!\nRoss: Look I was going to tell you!\nRachel: When?! After the birth of our first secret child?! (To All) Ross didnt get the annulment; we are still married.\nChandler: What?\nMonica: Youre kidding!\nPhoebe: (overdoing it) Oh my God!!\nMonica: Ross!\nRoss: Okay, maybe it wasnt my best decision. But I just couldnt face another failed marriage.\nChandler: Okay, let me just jump in and ask, at what point did you think this was a successful marriage?\nRoss: Rach, come on, if you think about it, its actually kinda funny. (He laughs, and he laughs alone.) Okay, maybe its best not to think about it.\nPhoebe: Okay, this is inexcusable. I am shocked to my very core!\nRoss: Phoebe, I told her you already knew.\nPhoebe: Another lie. You have a sickness!\nChandler: Ross, just for my own piece of mind, youre not married to anymore of us are ya?\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 2, "scene_id": "S10E16_002", "location": "Monica and Rachel's", "scene_description": "the gang is there except for Rachel and Ross, who both come storming in. Rachel is still going off about Rosss secret marriage.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E16/scenes/S10E16_002"}}
{"id": "S10E16_003", "text": "[Scene: Central Perk, Joey and Monica are at the counter getting some more coffee.]\nJoey: Oh! Hey, somebody left their keys. (Looks at them) Ooohh, to a Porsche! {Transcribers note: Oh come on! Who would leave the keys to their Porsche behind? If I had a Porsche, Id have the keys surgically attached to my hand!} Hey Gunther, these yours?\nGunther: Yeah, thats what I drive. I make four bucks an hour, I saved up for 350 years!\nJoey: Na-uh! (To everyone there) Hey did anybody lose their keys?\nMonica: Joey, why dont you put them in the lost and found?\nJoey: Theres a lost and found? (Gunther sets the box up on the table.) My shoe! (Grabs it out of the box.)\nChandler: You left a shoe here?!\nJoey: Well, I didnt realize until I got home. I wasnt gonna walk all the way back down here with one shoe! Yknow what? Im gonna go find that guys car and leave a note on the windshield. (Goes to do so.)\nChandler: Oh good, when he comes back for his keys, Ill be sure to give him your shoe.\nJoey: Great! Thanks. (Exits.)\nPhoebe: (coming in from the bathroom) Oh, good, good, you guys are here! Listen, how would like to spend tomorrow taking care of three incredibly cute little puppies?!\nMonica: Oh my God, what a fun day! That sounds great!\nChandler: (not enthused) Yeah, all right.\nPhoebe: Okay, well Ill bring them by tomorrow morning. Okay, and uh, by the way, theyre not actually puppies, theyre Frank and Alices triplets. Okay, see ya! (Exits.)\nChandler: Whoa-whoa-whoa! What?\nPhoebe: (stops) Please! Please! Please! Please! Oh please! Please! Please! Frank and Alice asked me to baby sit the triplets and Im nervous cause Ive never done that before by myself!\nMonica: Dont worry about it Phoebe, well absolutely do it.\nChandler: Yeah, Im gonna pass. Cause I was kinda iffy when it was puppies.\nMonica: Come on Chandler, come on! Itll give us great practice for when(realizes what shes about to say and changes)people with babies come to visit.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 3, "scene_id": "S10E16_003", "location": "Central Perk", "scene_description": "Joey and Monica are at the counter getting some more coffee.", "characters": ["Chandler", "Gunther", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S10E16/scenes/S10E16_003"}}
{"id": "S10E16_004", "text": "[Scene: The street down the block from Central Perk, Joey has found the Porsche and is writing the note.]\nGuy #1: Nice car!\nJoey: Yeah, its not mine.\nWoman: (walking up) I love your car.\nJoey: Yeah, its (looks up and sees the woman) mine.\nWoman: I bet its fast.\nJoey: Me too! Yeah. And comfortable. Do uh, do you like leather seats?\nWoman: Yeah!\nJoey: (checks in the window to make sure it has them) Its got em!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 4, "scene_id": "S10E16_004", "location": "The street down the block from Central Perk", "scene_description": "Joey has found the Porsche and is writing the note.", "characters": ["Joey", "Woman"], "firestore_path": "/episodes/S10E16/scenes/S10E16_004"}}
{"id": "S10E16_005", "text": "[Scene: Monica and Rachel's, Phoebe and Rachel are having tea.]\nRachel: So, I still have boxes here. I still have boxes at Rosss, and I have nowhere to live! Wow. I could so easily freak out right now.\nPhoebe: What about me? I just found out that Denise is leaving town for a while, I dont have a roommate.\nRachel: Well, maybe-maybe I could be your roommate Pheebs.\nPhoebe: Maybe you could be my roommate!\nRachel: Well theres an idea!!\nPhoebe: Yeah!\nRachel: That would be great! Wait, how long is Denise gone for?\nPhoebe: Umm, she said shed be back December 26th. \nRachel: December 26th, huh maybe shes Santa Clause.\n(Phoebe laughs, then stops to think about it. Ross enters.)\nRachel: (deadpan) Oh look who it is, my husband. The apple of my eye.\nRoss: Okay, I got us a court date for tomorrow at 2:00 and I picked up all the forms. Ill take care of everything.\nRachel: Well sure, if you say youre gonna take care of everything I have no reason to doubt you. Give me those forms! (Grabs them from him.) All right, now Im gonna do this my way and I dont want to hear a peep out of you!\nRoss: Okay Rach, but\nRachel: Op! Youre peeping!\n(Ross grunts something and hands her the pen he was trying to hand her.)\nRachel: Ross! Yknow what, I just gotwhy? Why did you do this?!\nRoss: Look I told you\nRachel: I dont wanna hear \"Three failed marriages!\"\nRoss: Look, if youd had two failed marriages, youd understand!\nRachel: Well, yknow what? Thanks to you Im half way there! Ugh! Oh! I am so mad! Ross, I dont think I have ever been this angry!\nRoss: What about the time I said we were on a break?\nRachel: Ugh! (Stares at him.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 5, "scene_id": "S10E16_005", "location": "Monica and Rachel's", "scene_description": "Phoebe and Rachel are having tea.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E16/scenes/S10E16_005"}}
{"id": "S10E16_006", "text": "[Scene: Monica and Rachel's, the next day, Chandler, Monica, and Phoebe are baby-sitting the triplets. They each have one baby.]\nMonica: Pheebs, hows it going?\nPhoebe: (rapidly) Im doing okay. I think its going well. Do you think theyre having fun? Am I talking to fast?\nMonica: Nope, sound like me. Pheebs, its going great. Look at Chandler with little baby girl Chandler.\nChandler: Little baby girl Chandler, where I have heard that before? Oh right, Coach Ruben. (Tries to get her to drink a little more from the bottle when he suddenly smells something. Its times like these Im glad Smell-O-Vision hasnt been invented.) Do you know what Pheebs? When youre done over there, we kinda have a situation over here too. (Phoebe is changing hers.)\nPhoebe: Na-uh, no, we are all responsible for our own babies.\nChandler: See thats where I think that youre wrong. Weve been playing these babies man for man; we should really be playing a zone defense.\nMonica: What do you mean?\nChandler: I just think that things would go a lot smoother if we each have our own zone. Phoebe, you can be in charge of wiping. And yknow Mon, you can be in charge of diapering and I can be in charge of looking how cute they are when they put their hands around (He degrades into baby talk, but he means when they grab his finger.)\nPhoebe: That sounds really great, but maybe you should be in charge of wiping.\nChandler: Okay, Im a rookie. I should not be in the end zone.\n[Time lapse, they have set up a little assembly line for diaper changes. Phoebe wipes, Chandler adds the powder, begrudgingly, and Monica puts the diaper on.]\nMonica: This is so great! This is exactly how we set the plates at the restaurant.\nPhoebe: Yeah? (Checking the final diaper) Well this is not what I ordered.\nJoey: (entering) Hey guys!\nChandler: Hey!\nPhoebe: Hey!\nJoey: Hey babies! Oh, Im having the best morning. That uh, that Porsche Ive got the keys too, still there!\nChandler: Shocking! Since you still have the keys.\nJoey: You should see the treatment I get when Im with that car! People are friendly; they-they wanna talk, and not just about the car! One guy gave me advice about my equity investments.\nChandler: What equity investments?\nJoey: The ones that got me the Porsche! Will you keep up! (Chandler wipes his forehead with a baby wipe, that might have been used. He drops it disgustedly.) But I figured, if-if people keep seeing me just standing there, theyre gonna start to think that I dont own it. So I figured Ill wash it. Right? Monica, you got a bucket and some soap I can borrow?\nMonica: Oh yeah, I got soap and sponges and rags and Carnuba wax and polishing compound.\nChandler: You dont even have a car!\nMonica: I know. But umm, one time there was this really dirty car in front of the building, so I washed it.\nChandler: And?\nMonica: And six others.\nChandler: There you are.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 6, "scene_id": "S10E16_006", "location": "Monica and Rachel's", "scene_description": "the next day, Chandler, Monica, and Phoebe are baby-sitting the triplets. They each have one baby.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S10E16/scenes/S10E16_006"}}
{"id": "S10E16_007", "text": "[Scene: The Porsche, Joey is finishing up washing the car and is talking to a guy about the car.]\nJoey: Yeah, she tops out at 130.\nGuy #2: Wow!\nJoey: And thats just in the city. I get her up to 160 when I take her upstate.\nGuy #2: Really! You got a place upstate?\nJoey: Sure!\nGuy #2: Well, Ill see you later.\nJoey: Okay, take it easy.\nThe Porsche Owner: Hey! Thats my car.\nJoey: Really? Oh uh, oh just give me five more minutes with it.\nThe Porsche Owner: What-what are you doing?\nJoey: Oh I-I uh, found the keys and now Im just polishing her up.\nThe Porsche Owner: But its my car!\nJoey: Yeah, but its my wax.\nThe Porsche Owner: Listen, I-I-I dont come to this city much so I dont know if youre crazy or this is some kind of street theater, but could I have my keys.\nJoey: Sure. Here. (He hands them over.) Ill uh, save your parking spot.\nThe Porsche Owner: Im not coming back.\nJoey: Why not?\nThe Porsche Owner: I live upstate.\nJoey: Yeah, so did I.\n(The guy gets in and drives off.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 7, "scene_id": "S10E16_007", "location": "The Porsche", "scene_description": "Joey is finishing up washing the car and is talking to a guy about the car.", "characters": ["Joey", "The Porsche Owner"], "firestore_path": "/episodes/S10E16/scenes/S10E16_007"}}
{"id": "S10E16_008", "text": "[Scene: Monica and Rachel's, the triplets are all in their crib as Monica and Phoebe watch them.]\nPhoebe: I dont know why I was so nervous about this. And I dont know why Frank and Alice are always complaining. This is so easy.\nMonica: Yeah, two hours, a lifetime thats the same.\nChandler: (entering) Check it out! Check it out! When the babies wake up, they can meet Krog! (He holds up this Xena-like warrior action figure.)\nMonica: Chandler, what are you doing? That thing can put someones eye out!\nChandler: He can do more than that! He can destroy the universe!\nPhoebe: No Chandler, they can swallow one of those little parts! And also, look at his smooth area, thats just gonna mess them up.\nChandler: Theyre not gonna swallow anything, you guys are being way over protective. When I was a kid, my mom used to just throw me into a pile of broken glass!\nPhoebe: What?!\nChandler: Glass, sand, whatever. (Walks out as Monica and Phoebe turn to check on the babies again.)\nPhoebe: Oh, look at little Leslie stretching in her sleep.\nMonica: Oh its so cute. I wonder what age it is when you stop being able to put both legs over your head.\nPhoebe: Oh, I can still do that.\nMonica: How are you still single?!\nChandler: (entering) All right. (Clears throat) I thought about it and maybe youre right. Maybe Krog is not a safe toy.\nMonica: Good. What made you change your mind?\nChandler: I swallowed the sonic blaster gun.\nPhoebe: How did that happen?!!\nChandler: Well, I was trying to prove that I was right. Yknow? And it turns out I was wrong. And now its lodged in my throat. (Mimics a cat trying to cough up a hairball.) (He does it again.)\nMonica: Damnit! Yknow this whole time we were concentrating on watching the babies and, and no one was watching Chandler! (He does it again.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 8, "scene_id": "S10E16_008", "location": "Monica and Rachel's", "scene_description": "the triplets are all in their crib as Monica and Phoebe watch them.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S10E16/scenes/S10E16_008"}}
{"id": "S10E16_009", "text": "[Scene: A judges chambers, Rachel and Ross are filing their annulment papers.]\nJudge: Okay you two are asking the court for an annulment?\nRachel: Yes your honor, and here are, are forms, all filled out.\nJudge: So based on your petition you are seeking an annulment on the grounds that Mr. Geller is mentally unstable.\nRoss: Fine, Im mentally unstable.\nJudge: And based on the fact that Mr. Geller is intravenous drug user.\nRoss: What?!\nRachel: Uh yes, heroin and crack.\nRoss: Crack isnt even an intravenous drug!\nRachel: Well, you would know.\nJudge: Now it also says here that you lied about your sexual preference before marriage?\nRoss: Oh, come on!\nRachel: (starts to cry) Ross, please, I found the magazines!\nJudge: And finally that you were unable to consummate the marriage. Well, that makes sense since youre gay and addicted to heroin.\nRoss: Okay, Im sorry, this is insane! I-I-Im not addicted to heroin, Im not gay, and there is no problem with my ability to consummate anything! Look, Ill consummate this marriage right here, right now!\nJudge: That wont be necessary.\nRoss: And when we were dating we consummated like bunnies!\nRachel: Ugh!\nJudge: Now if you were two involved in a serious relationship, that really creates a problem.\nRachel: Ross! Your honor, rest assured relationship ended like two years ago! (To the stenographer) And could you strike \"Consummated like bunnies\" from the record?\nJudge: Is there, anything in this record that is actually true?\nRachel: Well, yes, we got married in Vegas and uh, and the names I think.\nJudge: Well, based on what I heard, you two certainly dont qualify for an annulment. If you two dont want to be together youll have to file for divorce.\nRoss: (stands up) Thats great! Are you happy now? Look what you did with your funny, funny form!\nRachel: (stands up as well) What?! Me?! What about you and your consummated like bunnies nonsense!\nRoss: And what(notices the stenographer is still typing)What are you typing that for? Did you hear what she said? We dont get the annulment. Dont type that! What?! Stop typing! (He goes over to where the stenographer is typing and in the process pushes Rachel out of his way.) Hey! Stop typing! (Hes still typing.) Stop typing! Stop typing!!\nRachel: (to the judge) Okay, do you see, do you see what youre keeping me married too?!\nJudge: You need to get out of my chambers.\nRachel: All right look lady here is the deal, I came here for an annulment and I am not leaving here until I get one!\nRoss: Yeah!\nJudge: Would you like to spend the night in jail?\nRachel: And thank you for your time. (They both beat a hasty retreat.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 9, "scene_id": "S10E16_009", "location": "A judges chambers", "scene_description": "Rachel and Ross are filing their annulment papers.", "characters": ["Judge", "Rachel", "Ross"], "firestore_path": "/episodes/S10E16/scenes/S10E16_009"}}
{"id": "S10E16_010", "text": "[Scene: Monica and Rachel's, Chandler is still doing the hairball thing as Monica and Phoebe are watching the babies. I cant describe it, youll have to see it when it comes on in your area.]\nJoey: (entering wearing nothing but Porsche clothes) So the Porsche guy took his car back.\nChandler: But you found the keys to his clothes?\nJoey: No. No, I just uh, I just loved the way it feels when everybody thinks I own a Porsche.\nMonica: And people will think you own a Porsche because youre wearing the clothes?\nJoey: Of course! Only an idiot would wear this stuff if you didnt have the car! Right?\nChandler: That is true.\nPhoebe: Yeah, but only a genius would swallow a sonic blaster gun.\nJoey: Oh, Ive been there. Yeah, I am gonna go drive my Porsche. (Starts to leave.)\nMonica: Joey, you know you dont actually have one.\nJoey: Come on! What are you doing?! Im in character! Would you talk to her! (Storms out.)\nChandler: Ahh, I think it just moved. Its really poking me.\nMonica: All right, thats it, were going to the emergency room.\nPhoebe: What?! No, you cant, you cant leave me here with them! Were baby-sitting! \nMonica: The babies are asleep, Im sure youll be okay on your own for a while!\nPhoebe: But you-you cant leave me with them! We-were a team! Were playing a zone! Theyre gonna triple team me!\nMonica: Hes got something plastic lodged in his throat, weve got to go to the hospital.\nPhoebe: But no, because a doctor wont be able to help him, its just gonna yknow naturally pass through his system in like seven years.\nChandler: I think thats gum.\nPhoebe: Im pretty sure its gun.\nChandler: Okay, listen this really hurts. Lets go.\nPhoebe: A real man wouldnt just run to the hospital! (They dont stop.) No! What would, what would Krog do? (They ignore her and Phoebe is left alone.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 10, "scene_id": "S10E16_010", "location": "Monica and Rachel's", "scene_description": "Chandler is still doing the hairball thing as Monica and Phoebe are watching the babies. I cant describe it, youll have to see it when it comes on in your area.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S10E16/scenes/S10E16_010"}}
{"id": "S10E16_011", "text": "[Scene: The street, Joey is hanging out wearing his Porsche grab.]\nJoey: Why isnt that valet back with my Porsche?\nPasserby: Maybe because youve got the keys?\nJoey: (to women passing him) Porsche.\n(Ross and Rachel approach, theyre still yelling at each other.)\nRachel: This is totally your fault!\nRoss: My fault?! You threatened the judge!\nRachel: Well, you ripped the paper out of the court reporters machine!!\nRoss: That was the only way I could get him to stop typing!\nJoey: Hi! How are the Gellers? \nRachel: Dont call us that! (Storms away)\nRoss: The judge wouldnt let us get an annulment! Now we gotta get a divorce!! Did a Porsch throw up on you? (Walks on.)\nJoey: Hey! Its Porsche!! (Hes right yknow.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 11, "scene_id": "S10E16_011", "location": "The street", "scene_description": "Joey is hanging out wearing his Porsche grab.", "characters": ["Joey", "Passerby", "Rachel", "Ross"], "firestore_path": "/episodes/S10E16/scenes/S10E16_011"}}
{"id": "S10E16_012", "text": "[Scene: Monica and Rachel's, Phoebe is being triple teamed.]\nPhoebe: Me taking care of you is no problem, huh? You guys feel safe. Right? Okay, Im gonna take that spit bubble as, \"Yeah, I do!\" Okay, after I get rid of this dirty diaper Leslie, Ill set you up with a clean one. (She throws it at the garbage without looking, misses, and knocks over a vase and flowers, which fall to the floor and break.) Okay, Im sorry. I didnt mean to scare you. I just have to clean that up. Okay? Cause lets face it, were at Monicas. (She crawls over, disposes of the diaper, picks up the flowers, and the vase.) I broke it. All right. Well, thats just the way that goes. (She throws out both the flowers and the vase.) Okay, good. (She turns around and only counts two babies.) Why are there only two of you? Where is Leslie? Well, you cant answer. (She starts looking for her) Leslie? Where are you Leslie? Leslie, now would be a good time for your first words! (She turns around and finds that Leslie has managed to crawl into the bottom drawer of the TV cabinet.) Well, look at you! Hey! You are a little bit mischievous! My gosh! (She picks her up and notices a surprise is waiting in the drawer.) Oh, youre a lot mischievous! Well, itll dry. (Closes the drawer with her foot.) (To Leslie) Okay, you sit with your brother and sister nowwho arent there! (They both have disappeared as well.)\n[Time Lapse, the babies are finally asleep. Good for Phoebe! The only problem is, Monicas apartment looks like a tornado, a hurricane, a swarm of locusts, fire, brimstone, hail, and giant man-eating, radioactive ants have torn the place apart. Needless to say, its messy enough to cause Monica to die of shock right away. Parents with small children know what Im talking about.]\nChandler: (entering) Hey!\nPhoebe: (exhausted) How do you feel?\nChandler: Well, lets just say that Krog will be fully equipped to destroy the universe again in twelve to fourteen hours.\nPhoebe: Okay, so I totally took care of the babies all by myself! I fed em, bathed em, and put em to bed.\nChandler: And protected them from a tornado?\n(Monica enters and her jaw drops in horror.)\nMonica: Oh my God.\nPhoebe: I know, the babies are asleep.\nMonica: Phoebe, what, what happened here?!\nPhoebe: I did it! I took care of the babies all by myself!\nMonica: But my apartment!\nChandler: Was the setting of Phoebes triumph.\nMonica: But the mess!\nChandler: Is not as important as the fact that Phoebe took care of the babies all by herself.\nMonica: Youre right, youre right I shouldnt freak out. Cause this is what will happen when you and I have babies! When will that be?!\nChandler: (pause) Phoebe, would you take a look at this mess!!!!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 12, "scene_id": "S10E16_012", "location": "Monica and Rachel's", "scene_description": "Phoebe is being triple teamed.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S10E16/scenes/S10E16_012"}}
{"id": "S10E16_013", "text": "[Scene: Rosss apartment, Rachel is packing what she still has over there as Ross enters.]\nRachel: (deadpan) Oh honey thank God youre home, I was getting worried.\nRoss: I picked up the divorce papers. Uh, Ive already signed everything and I put little Xs where you need to sign.\nRachel: Oh, little Xs! Great! That makes up for everything!\nRoss: Yknow, I-Iyouve done a lot of stupid stuff too! Okay?\nRachel: Oh, name one stupid thing that is as stupid as this one!\nRoss: Okay, how about you flew to London to stop my wedding! Ah, how about you told me you loved me after I was already married!\nRachel: Hey! Wait a minute! That was different! I did those things because I was in love with you!\nRoss: Yeah! Right!\n(Pause.)\nRoss: Youre right. Thats very different. So lets, lets just sign the papers. All right? (Sits down and Rachel keeps standing there.) What?\nRachel: Nothing. (Sits down.)\nRoss: Okay, can we just sign please?\nRachel: Uh-hmm. (Just as Rachel finishes signing her name, Ross yanks each page out of the way.)\nRoss: Congratulations. (Gets up to leave.)\nRachel: Okay Ross, werewait a minute. Umm, I uh, I kinda have a little confession.\nRoss: What?\nRachel: Well, yknow this whole marriage thing, kinda my idea.\nRoss: Excuse me?\nRachel: Well, remember how we were too drunk to remember anything the night we were married?\nRoss: Yeah?\nRachel: And uh, yeah, I didnt really, I didnt want to say anything, but it kinda it just, it kinda kept coming back to me, and umm, remember we were in the casino and for some reason thought it would be funny to eat a lot of grapes. And uh, and I thought it would be funnier if we got married. So as a, as a compromise we decided first to get married, and then (Ross joins in) to eat a lot of grapes. So umm, sorry I got us into this mess.\nRoss: So then if-ifI mean if you think about it, this is all (Pause.) your fault.\nRachel: Yeah, dont push it though.\nRoss: Ive got to say; I know I divorce a lot of women, never thought I would be divorcing you.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 16, "episode_id": "S10E16", "episode_title": null, "scene_number": 13, "scene_id": "S10E16_013", "location": "Rosss apartment", "scene_description": "Rachel is packing what she still has over there as Ross enters.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E16/scenes/S10E16_013"}}
