{"id": "S10E18_001", "text": "Phoebe: Hurry!\nJoey: Good luck, good luck!\n(Phoebe and Ross leave.)\n\n[Scene: The street right in front of Central Perk. Phoebe's cab is   there. Ross and Phoebe run over and jump in.]\nRoss: There's no seatbelt!\nPhoebe: That's okay. If - if we hit anything, the engine will explode, so you know, it's better if you're thrown from the car.\n(Ross looks terrified.)\nRoss: Alright, alright, let's do this!\nPhoebe: Okay!\n(A guy comes up and gets into the backseat of the cab.)\nRoss: Hey!\nMan: 18th and East End.\nPhoebe: I - I don't take passengers.\nMan: Hey! The law says you have to accept any fare.\nRoss: No, you don't understand. This isn't a real cab.\nMan: Alright, I gotta report you. What's your medallion number?\nPhoebe: My medallion number is, \"Get out of the cab!\"\nMan: What?\nRoss: (screaming) Get out of the cab!\nPhoebe: Get out of the cab!\n(The man jumps out, obviously a little scared. Phoebe drives off.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 1, "scene_id": "S10E18_001", "location": "", "scene_description": "", "characters": ["Joey", "Man", "Phoebe", "Ross"], "firestore_path": "/episodes/S10E18/scenes/S10E18_001"}}
{"id": "S10E18_002", "text": "[Scene: Monica and Chandler's apartment. Monica, Chandler and Joey are   there, packing the last boxes.]\nJoey: Oh, hey, hey, can I give you guys your house-warming present now?\nMonica: Now, that you can do.\nJoey: Alright!\n(Cut to Joey's apartment. Joey looks inside the cardboard box that   used to be the home of Chick Jr. and Duck Jr., but they have   disappeared.)\nJoey: Ah... Chick Jr.? Duck Jr.? Don't hide from mama!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 2, "scene_id": "S10E18_002", "location": "Monica and Chandler's apartment. Monica", "scene_description": "Chandler and Joey are   there, packing the last boxes.", "characters": ["Joey", "Monica"], "firestore_path": "/episodes/S10E18/scenes/S10E18_002"}}
{"id": "S10E18_003", "text": "[Scene: Phoebe's cab. Phoebe is driving very fast, and a terrified   Ross has closed his eyes.]\nPhoebe: You can open your eyes now.\nRoss: Are we off the bridge?\nPhoebe: Yes.\nRoss: Is the old woman on the bicycle still alive?\nPhoebe: Yes, she jumped right back up.\n(Ross opens his eyes.)\nRoss: Oh my God, Phoebe, slow down!\nPhoebe: Do you wanna get to Rachel in time?\nRoss: Yes, but I don't wanna die in your cab!\nPhoebe: You should have thought of that before you got in!\n(They drive up to a toll-booth.)\nPhoebe: Toll-booth.\nRoss: What?\nPhoebe: (screaming) Toll-booth! Four bucks. There are quarters in the glove compartment.\n(Ross tries to open a plastic bag filled with quarters, but he's quite   slow.)\nPhoebe: Hurry!\nRoss: Okay!\nPhoebe: Okay.\n(Phoebe tries to throw some quarters out the window, but she has   forgotten to open the window, and she and Ross scream.)\nPhoebe: Damn, that window is clean.\n\n[Scene: Joey's apartment. Joey is still looking for the birds.]\nJoey: Quack, quack, tweet, tweet, quack, quack, tweet, tweet, quack,   quack, tweet, tweet, quack, quack, tweet, tweet, quack, tweet, quack...\n(Monica and Chandler enter.)\nChandler: We were wondering what was taking so long with the gift, but   now we understand you were doing this.\nJoey: Okay, I wanted to surprise you, but for your house-warming gift,   I got you a baby-chick and a baby-duck!\n(Chandler grins, while Monica is less enthusiastic.)\nChandler: Really? You got us a chick and a duck?\nMonica: Oh, great! Just what you want for a new house with infants.   Bird feces.\nJoey: Yeah, yeah, they must have jumped off the table, 'cause now   they're gone!\nChandler: Oh, don't worry, we'll find them.\nMonica: Actually, I'm gonna go check on the twins.\nChandler: Alright.\n(Monica turns around and is about to leave when she steps on   something.)\nMonica: Oh God! What did I just step on?\nJoey: Oh!\nChandler: It's okay, it's just an egg roll.\nMonica: Oh..\nJoey: You stepped on my egg roll?\nMonica: I'm sorry, I didn't know to look for Chinese food on the floor.\nJoey: Just put it on a plate and leave.\n(She does so.)\nChandler: Okay, let's find these birds.\nJoey: Alright.\n(Suddenly, they hear the birds.)\nJoey: Wait, wait. Do you hear that?\n(They realise that the birds are in the foosball table.)\nJoey: Oh! They're in the table!\nChandler: Well, that can't be good!\nJoey: We gotta get them out of there!\nChandler: How?\nJoey: Oh, oh! Maybe we can lure them out. You know any birdcalls?\nChandler: Oh, tons, I'm quite the woodsman.\nJoey: Well, maybe we can just tip the table a little.\nChandler: Joey, wait! The ball!\nJoey: Oh!\n(The ball rolls into one of the goals, and Chandler and Joey listen in horror as the ball makes its way inside the table. Finally, they can hear the birds again.)\nJoey: Oh God! So what do we do?\nChandler: I don't know. Maybe we can open this up somehow.\nJoey: Okay.\nChandler: No... It's all glued together.\nJoey: Does that mean we have to bust it open?\nChandler: I don't know. Maybe.\nJoey: Oh my God!\nChandler: I know! It's.. It's the foosball table.\nJoey: All right, you know what? We don't have a choice. It's like I would have said in that sci-fi movie if I'd gotten the part. \"Those are our men in there, we have to get them out! Even if I have to sacrifice the most important thing in my life; my time-machine.\"\nChandler: Did that movie ever get made?\nJoey: It did not.\n\n[Scene: The airport. Ross and Phoebe run in.]\nPhoebe: Ross, where are you going?\nRoss: To talk to Rachel, isn't that why we took a ride in the death-cab?\nPhoebe: What? What are you just gonna walk up to her at the gate? Have you never chased anyone through the airport before?\nRoss: Not since my cop-show got cancelled.\nPhoebe: You have to get a ticket to get past security.\nRoss: What? We're never gonna make it!\nPhoebe: Not with that attitude! Now, haul ass!\n(They run to the ticket counter, but they get stuck behind a group of old people who are walking very slowly.)\nRoss: Okay, if you could all walk slower, that'd be great. \n \n[Scene: The gate. Rachel walks up to the man at the gate and gives him  her passport.]\nGate attendant #1: (with a French accent) Madame, your passport please?\nRachel: Oh my God! I was so afraid I wasn't gonna remember any of my high-school French, but I understood every word you just said!\nGate attendant #1: Your boarding pass, please.\nRachel: Oh.\n(She starts looking through her purse, but she can't find it.)\nRachel: Oh, shoot. I had it. Oh, I can't believe this.\nGate attendant #1: Madame, if you don't have your boarding pass...\nRachel: I have it, I have it, I have it. Oh, okay, I can't find it, but I remember that I was in seat 32C, because that's my bra-size.\nGate attendant #1: Madame, you must have your boarding pass..\nRachel: Okay, fine! But you know what? If I was in 36D, we would not  be having this problem. \n \n[Scene: The ticket-counter. Ross and Phoebe come running.]\nRoss: Hey, I need a ticket.\nPhoebe: Just one? I drive you all the way down here, and I don't get to see how it works out?\nRoss: Fine, two tickets, I need two tickets.\nPhoebe: We're on our honeymoon.\nTicket agent: And the destination?\nRoss: I don't care. Whatever is the cheapest.\nPhoebe: I'm so lucky I married you.\n\n[Scene: The gate. Rachel is still searching for her boarding pass.]\nRachel: Oh! Shoot! Damn it! Where is it? Oh! Oh! I found it! I found it!\n(She runs up to the gate and the gate attendant standing there.)\nRachel: Hah! I found it! I told you I would find it! In your face!  You're a different person. \n \n[Scene: The ticket-counter. Ross and Phoebe have their tickets and start looking at the screens in order to find the gate.]\nRoss: Okay, flight 421 to Paris. I don't see it, do you see it?\nPhoebe: No, did we miss it?\nRoss: No, no, no. That's impossible. It doesn't leave for another 20 minutes.\nPhoebe: Maybe we have the flight-number wrong. God.\n(Phoebe picks up her cell-phone and calls Monica. Monica is still packing in her apartment.)\nMonica: Hello.\nPhoebe: Hey, it's me. Here's Ross.\nRoss: What? Hey, hey, listen..\n(Monica is standing by the crib, and she's looking at her babies.)\nMonica: Oh my God! Ross, you wouldn't believe the cute little noises the twins are making. Listen.\n(She holds the phone down to the twins.)\nRoss: Monica? Monica, Monica, Monica, Monica..?\nMonica: Oh, I'm sorry. Shoot, they were doing it before.\nRoss: That's alright. Listen, listen.\nMonica: Oh, wait, wait, wait! Here they go again.\n(She holds down the phone to the twins again.)\nRoss: Monica? Monica, Monica, Monica, Monica..?\nMonica: Isn't that cute?\nRoss: That is precious! Listen! I need Rachel's flight information.\nMonica: Oh, okay. Alright, it's flight 421. Leaves at 8:40.\nRoss: Yes, that's what I have. It's not on the board.\nMonica: That's what it says here. Flight 421, leaves at 8:40, Newark airport.\nRoss: What?\nMonica: Newark airport. Why, where are you?\nRoss: JFK.\n(Ross sadly hangs up the phone, while Phoebe looks at him. Cut to Rachel at the gate. She gives her boarding pass to the gate attendant, and she goes onboard. The gate attendant closes the door  and locks it.) \n\n[Scene: Joey's apartment. Joey and Chandler are still trying to get the birds out of the foosball-table.]\nJoey: (yelling) Don't worry, you guys, we're gonna get you out of there.\nChandler: And we're also gonna buy you tiny, bird hearing-aids.\n(Joey picks up a hammer and a crowbar and gets ready to destroy the table.)\nJoey: Okay. Here goes.\nChandler: What's the matter?\nJoey: I need to say goodbye to the table first.\nChandler: I understand.\nJoey: Okay. Table, you have given us so many great times. And you guys, Jordan, Victor, Joel... All of you guys. What can I say? You guys make us look good. You wanna say anything?\nChandler: I don't know. Except that, for one last time... (he touches the players as he says the following) Good game, good game, good game, good game, good game, good game, good game.\nJoey: Okay, here we go. I can't do it.\nChandler: Well, I can't do it either.\n(Monica enters.)\nMonica: Hey! Did you find them?\nJoey: Yeah, they're stuck inside the table!\nChandler: We have to bust it open, but neither of us can do it!\nMonica: Oh, well sure. This gotta be so hard. I'll do it. Gimme!\n(Monica grabs the hammer and the crowbar and gets ready to bust it  open.) \n \n[Scene: Phoebe's cab. She's driving faster than ever before.]\nRoss: Phoebe! Wow! No, no, no!\n(Phoebe screams.)\nPhoebe: Well, I've never gone this fast before.\nRoss: Phoebe, forget it, okay? Newark is - is like an hour away. There's no way we're gonna make it in time.\nPhoebe: She's got her cell, you could call her.\nRoss: I am not doing this over the phone.\nPhoebe: You don't have any other choice!\n(She lets go of the steering wheel to get her cell-phone from her purse. Ross screams and reaches over in order to hold onto the wheel. Cut to the plane. Rachel is sitting in her seat when her cell-phone rings.)\nRachel: Hello?\nPhoebe: Rachel? Oh, good. Hey, by the way, did you just get on the plane?\nRachel: Yeah.\nPhoebe: (To Ross) For what it's worth, we would have caught her if we were at the right airport.\nRoss: Yay.\nPhoebe: Uh, Rach, hang on.\n(Phoebe tries to give her phone to Ross, but he won't take it. He mouths \"no.\")\nRachel: Phoebe? Is everything okay?\nPhoebe: Uhm, actually no. No, you've... You have to get off the plane.\nRachel: What? Why?\nPhoebe: I have this feeling that something's wrong with it. Something is wrong with the left Philange.\nRachel: Oh, honey, I'm sure there's nothing wrong with the plane.\n(The passenger in the seat next to Rachel looks at her and seems a little nervous.)\nRachel: Alright, look, I have to go. I love you, and I will call you the minute I get to Paris.\n(Rachel hangs up.)\nPassenger #1: Uhm, what was that?\nRachel: Oh, that was just my crazy friend. She told me I should get off the plane, because she had a feeling that there was something wrong with the left Philange.\nPassenger #1: Okay, that doesn't sound good.\nRachel: I wouldn't worry about it. She's always coming up with stuff like this, and you know what? She's almost never right.\nPassenger #1: But she is sometimes.\nRachel: Well...\n(The passenger stands up and gets his suitcase from the overhead compartment.)\nRachel: Wait, what are you doing?\nPassenger #1: Well, I can't take this plane now.\nAir stewardess: Excuse me, sir, where are you going?\nPassenger #1: I have to get off this plane, okay? Her friend has a feeling something's wrong with the left Philange.\nRachel: Could I get some peanuts?\nPassenger #2: What's wrong with the plane?\nAir stewardess: There's nothing wrong with the plane.\nPassenger #1: Yeah! The left Philange!\nAir stewardess: There is no Philange!\nPassenger #1: Oh my God. This plane doesn't even have a Philange!\nPassenger #2: I'm not flying on it!\nAir stewardess: Ma'am, please sit down!\nPassenger #3: What's going on?\nPassenger #1: We're all getting off. There is no Philange!\n(Everybody walks out of the plane.)\nRachel: This is ridiculous! I...\n(She notices that everybody is leaving.)\nRachel: Yeah, okay.\n(Rachel leaves as well.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 3, "scene_id": "S10E18_003", "location": "Phoebe's cab. Phoebe is driving very fast", "scene_description": "and a terrified   Ross has closed his eyes.", "characters": ["Air stewardess", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Ticket agent"], "firestore_path": "/episodes/S10E18/scenes/S10E18_003"}}
{"id": "S10E18_004", "text": "[Scene: Joey's apartment. Monica has completely destroyed the foosball-table, and Chandler and Joey are holding the birds.]\nMonica: Alright. My job here is done.\nChandler: That was... Impressive.\nJoey: Yeah, you didn't even use the tools for most of it!\nMonica: Yeah, they were just slowing me down. Alright, I have to get back to the babies. I'll see you girls later.\n(Monica leaves.)\nChandler: Sorry about the table, man.\nJoey: Yeah.\nChandler: You gonna buy a new one?\nJoey: Probably not. Nah. I don't know how much I'm gonna wanna play after you go.\nChandler: Well, at least we got these little guys out.\nJoey: Yeah.\nChandler: Aww, we were worried about you! Hm. I guess I better get used to things crapping in my hand, huh?\nJoey: I'm gonna miss these little guys. It was nice having birds around again.\nChandler: Hey, you know what? Maybe we should keep them here with you.\nJoey: What?\nChandler: Yeah, I mean we've got a lot going on right now. And, plus, here they'd have their own room.\nJoey: I could get a goose!\nChandler: You know, I - I think you're set with the poultry.\nJoey: Thanks man. Did you hear that, you guys? You're gonna get to stay here! And, and it's good, you know, 'cause, 'cause now you have a reason to come visit.\nChandler: I think there may be another reason. So, awkward hug or lame cool guy handshake?\nJoey: Uh, lame cool guy handshake, yeah.\n(They do the lame cool guy handshake. They look at each other, and  then they hug.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 4, "scene_id": "S10E18_004", "location": "Joey's apartment. Monica has completely destroyed the foosball-table", "scene_description": "and Chandler and Joey are holding the birds.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S10E18/scenes/S10E18_004"}}
{"id": "S10E18_005", "text": "[Scene: The gate at the airport. The passengers are standing in line, and they're about to board the plane again.]\nGate attendant #2: Ma'am, I assure you, the plane is fine.\nPassenger #2: And you fixed the Philange?\nGate attendant #2: Yes, the Philange is fixed. As a matter of fact, we put a whole lot of extra Philanges onboard, just in case.\n(Rachel walks up to the gate. Cut to Ross and Phoebe who come running up to the gate.)\nRoss: Where is she?\nPhoebe: I don't see her.\nRoss: Rachel! Rachel Green!\nPhoebe: There she is!\nRoss: Rachel! Rachel!\nGate attendant #2: Wow, excuse me, sir, do you have a boarding pass?\nRoss: No, no, I just have to talk to someone.\nGate attendant #2: I'm sorry, you cannot go any further without a boarding pass.\nRoss: No, no, no, but...\nPhoebe: (screaming) RACHEL!!\n(Rachel comes back to the gate.)\nRachel: Oh my God... What.. What are you guys doing here?\nPhoebe: Okay, you're on.\nRachel: What? What? Ross, you're scaring me. What's going on?\nRoss: Okay, the thing is..\nRachel: Yeah?\nRoss: Don't go.\nRachel: What?\nRoss: Please, please stay with me. I am so in love with you. Please, don't go.\nRachel: Oh my God.\nRoss: I know, I know. I shouldn't have waited 'till now to say it, but I'm.. That was stupid, okay? I'm sorry, but I'm telling you now. I love you. Do not get on this plane.\nGate attendant #2: Miss? Are you boarding the plane?\nRoss: Hey, hey. I know you love me. I know you do.\nGate attendant #2: Miss?\nRachel: I - I have to get on the plane.\nRoss: No, you don't.\nRachel: Yes, I do.\nRoss: No, you don't.\nRachel: They're waiting for me, Ross. I can't do this right now, I'm sorry. I'm sorry.\nRoss: Rachel?\nRachel: I'm so sorry.\n(She boards the plane.)\nRoss: I really thought she'd stay.\nPhoebe: I'm sorry.\n(Phoebe hugs Ross.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 5, "scene_id": "S10E18_005", "location": "The gate at the airport. The passengers are standing in line", "scene_description": "and they're about to board the plane again.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E18/scenes/S10E18_005"}}
{"id": "S10E18_006", "text": "[Scene: Monica and Chandler's apartment. Joey, Chandler, Monica and the twins are there. Everything has been put into boxes.]\nMonica: Well, that's it. Everything's packed.\nChandler: Wow, this is weird.\nMonica: I know.\nJoey: Yeah. Uh, does this mean there's nothing to eat?\nMonica: I put three lasagnas in your freezer.\nJoey: I love you!\n(He hugs her. Phoebe enters.)\nJoey: Hey!\nPhoebe: Hey.\nJoey: So did you guys make it in time?\nPhoebe: Yeah, yeah, he talked to her, but she got on the plane anyway.\nChandler: Where's Ross?\nPhoebe: He went home. He didn't want to see anybody.\n\n[Scene: Ross's apartment. Ross enters and checks his messages.]\nRachel: (on the answering machine) Ross, hi. It's me. I just got back on the plane. And I just feel awful. That is so not how I wanted things to end with us. It's just that I wasn't expecting to see you, and all of a sudden you're there and saying these things... And... And now I'm just sitting here and thinking of all the stuff I should have said, and I didn't. I mean, I didn't even get to tell you that I love you too. Because of course I do. I love you. I love you. I love you. What am I doing? I love you! Oh, I've gotta see you. I've gotta get off this plane.\nRoss: Oh my God!\nRachel: (on the answering machine) Excuse me?\nAir stewardess: (on the answering machine) Miss? Please, sit down!\nRachel: (on the answering machine) I'm sorry. I'm really sorry, but I need to get off the plane, okay? I need to tell someone that I love love them.\nAir stewardess: (on the answering machine) Miss, I can't let you off the plane.\nRoss: Let her off the plane!\nAir stewardess: (on the answering machine) I am afraid you are gonna have to take a seat.\nRachel: (on the answering machine) Oh, please, miss, you don't understand!\nRoss: Try to understand!\nRachel: (on the answering machine) Oh, come on, miss, isn't there any way that you can just let me off...\n(The message is finished. Ross jumps over to the answering machine.)\nRoss: No! No! Oh my God. Did she get off the plane? Did she get off the plane?\nRachel: I got off the plane.\nRoss: You got off the plane.\n(He walks over and kisses her.)\nRachel: I do love you.\nRoss: I love you too, and I'm never letting you go again.\nRachel: Okay. 'Cause this is where I wanna be, okay? No more messing around. I don't wanna mess this up again.\nRoss: Me neither, okay? We are - we're done being stupid.\nRachel: Okay. You and me, alright? This is it.\nRoss: This is it. Unless we're on a break.\n(Rachel gives him a look.)\nRoss: Don't make jokes now.\n(They kiss again.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 6, "scene_id": "S10E18_006", "location": "Monica and Chandler's apartment. Joey", "scene_description": "Chandler, Monica and the twins are there. Everything has been put into boxes.", "characters": ["Air stewardess", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E18/scenes/S10E18_006"}}
{"id": "S10E18_007", "text": "[Scene: Monica and Chandler's apartment. Chandler and Monica are holding the twins. Joey and Phoebe are sitting by the window, while Ross and Rachel are standing together. The apartment is completely empty. Two men are carrying a large dresser.]\nMonica: Okay, please be careful with that. It was my grandmother's. Be careful.\n(Two other men are rolling the big white dog out of the apartment.)\nMonica: If that falls off the truck, it wouldn't be the worst thing.\n(She slips them some money.)\nRoss: Wow.\nRachel: I know. It seems smaller somehow.\nJoey: Has it always been purple?\nChandler: (to his children) Look around, you guys. This was your first home. And it was a happy place, filled with love and laughter. But more important, because of rent control, it was a friggin' steal!\n(Monica and Chandler put Jack and Erica in their stroller.)\nPhoebe: Hey, do you realise that at one time or another we all lived in this apartment?\nMonica: Oh, yeah, that's true.\nRoss: Uh, I haven't.\nMonica: Wait a minute. What about that summer during college that you lived with grandma, and you tried to make it as a dancer?\nRoss: Do you realise we almost made it ten years without that coming up?\nMonica: Oh, honey, I forgot. I promised Treeger that we'd leave our keys.\nChandler: Oh, okay.\n(Chandler and Monica walk over to the kitchen-counter and leave their keys. Then the other four pick out their keys and leave them as well.)\nPhoebe: So, I guess this is it.\nJoey: Yeah. I guess so.\nMonica: (crying) This is harder than I thought it would be.\nChandler: Oh, it's gonna be okay.\n(Chandler hugs her. Monica hugs Ross and Rachel as Chandler gets the stroller with the twins.)\nRachel: (crying) Do you guys have to go to the new house right away, or do you have some time?\nMonica: We got some time.\nRachel: Okay, should we get some coffee?\nChandler: Sure. Where?\n(They all leave the apartment. Joey helps Chandler with the stroller in the hallway, while Monica and Rachel have their arms around each other. Everybody walks downstairs to Central Perk. The camera goes inside the apartment again, and it pans around. We see the keys on the counter, and the final shot is of the frame around the peephole. The screen fades to black.)\nTHE END", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 18, "episode_id": "S10E18", "episode_title": null, "scene_number": 7, "scene_id": "S10E18_007", "location": "Monica and Chandler's apartment. Chandler and Monica are holding the twins. Joey and Phoebe are sitting by the window", "scene_description": "while Ross and Rachel are standing together. The apartment is completely empty. Two men are carrying a large dresser.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E18/scenes/S10E18_007"}}
