{"id": "S10E13_001", "text": "The One Where Joey Speaks French\nMonica: That was some hot love you gave me! I'm gonna go get ready.\nChandler: Hey, why don't you wear those earrings I gave you?\nMonica: That's a great idea! I was saving them for something special.\nChandler: Okay.\nMonica: (runs over to Phoebe) You have got to go home!\nPhoebe: But I like it here!\nMonica: You gotta go home and get the earrings that you borrowed from me okay? Chandler wants me to wear them tonight.\nPhoebe: Okay, well I think that they're in my purse. Why don't you go get dressed and I'll look for them.\nMonica: Great!\nPhoebe: Okay! (Walks over to Rachel) Rach, hi, I need those earrings you borrowed.\nRachel: Oh, umm, okay, yeah, I'll be, yeah I'll be right back. (Goes to her room.)\n(Phoebe then gets possessed 'cause she starts speaking in tongues. She speaks Italian to Joey's grandmother. She is quickly exorcised and returns to speaking in English. Of course, too most people English is a strange language as well. But none of them are probably reading this and if they were they wouldn't understand it. So why am I talking about them? I have absolutely no clue. Moving on) \nJoey: Wow Pheebs, you speak Italian?\nPhoebe: I guess so. (See, the brief possession didn't affect her at all, like we could really tell.)\nRachel: (She enters and hands Phoebe the earring) Here you go. Thank you!\nPhoebe: Wait, Rach! Where's the other one?\nRachel: Oh what, you-you want both of them?\nPhoebe: Rachel Karen Green, where's the other earring?!\nRachel: Okay, okay, okay, look, just don't freak out, but I kinda lost it. I know it's in the apartment, but I definitely lost it.\nPhoebe: Well, what am I going to tell Monica? She wants to wear them tonight!\nRachel: Tell her to wear her own earrings.\nPhoebe: These are her earrings.\nRachel: Nooo! Nooooo! You lent me Monica's earrings?! I'm not allowed to borrow her stuff!\nPhoebe: Why not?\nRachel: Because I lose her stuff!\n[Time Lapse, the gang is now watching Law & Order. By the way, the entire rest of the episode takes place in Monica and Rachel's apartment. Why are they called apartments when they're all stuck together? Something to think about.]\nJoey: Okay, see that blind guy right there? I'm gonna bash his head in later.\n(His grandmother asks him something.)\nJoey: Oh umm, my big scene is coming up. Big scene coming up.\nChandler: If you said, \"Big lima bean, bubbling up.\" Would she understand the difference?\nMonica: (noticing Rachel crawling behind the couch) Rach? What are you doing?\nRachel: Oh boy, I just can't watch. It's too scary!\nMonica: It's a diaper commercial.\nRachel: Oh yeah well, you know me, babies, responsibilities, ahhh!!!\n(There's a knock on the door.)\nCaitlin: Pizza delivery!\nRoss: I'll get it! I will get that! (Runs over and opens the door.)\nCaitlin: Hi!\nRoss: Hi!\nCaitlin: One uh, vegetarian pizza. That's $12.15.\nRoss: Oh. Uh, by the way, if it makes you feel any better. I happen to like 8-year-old boys.\nCaitlin: What?!\nRoss: (I can't make it out.) The uh, your hair, before, your hair, you said you thought your looks like an 8-year-old's, and I'm just saying I like it. The hair.\nCaitlin: Oh. Thanks.\nRoss: You understand I don't actually like 8-year-old boys.\nCaitlin: Y'know, all I'm looking for is the money.\nChandler: Here you go. (Hands her the money.) Now stop bringing us pizzas you.\nCaitlin: I'm gonna try. (Walks away and Ross closes the door.)\nChandler: You're welcome.\nRoss: You couldn't let me have her, could ya?!\nChandler: What?\nRoss: This is a girl that I really like and had too swoop in there!\nMonica: What's goin' on?\nRoss: Chandler was totally flirting with the hot delivery girl!\nChandler: Thank you for that! (To Monica) I was not flirting.\nMonica: It's okay. I don't care. It's uh, it's fine.\nRoss: Really?!\nChandler: Really?!\nMonica: It's no big deal, I do it all the time.\nChandler: (starts to laugh, but then gets serious) So umm, you-you flirt with guys all the time?\nMonica: Sure! It doesn't mean anything! Just like I know it doesn't mean anything with you!\nChandler: Okay, but there is a big difference. You are a lot hotter than I am.\nJoey: (walking past) True story! (Goes and sits down.)\nMonica: Chandler, this actually bothers you?\nChandler: Yes, it does bother me! And I think it would bother a lot of people. Rachel, when you were going out with Ross, did it bother you when he flirted with other women?\nRachel: Uhh, no, no, it bothered me when he slept with other women.\nRoss: And thank you, for that.\nRachel: But y'know, I never really had anything to worry about. Ross was never very good at the flirting thing.\nRoss: What? (Mumbles) What-what, what are talking about? It-it worked with you.\nRachel: Oh! Y'know what? You're right! We meet, you flirted and then bamn nine years later you had me!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 13, "episode_id": "S10E13", "episode_title": null, "scene_number": 1, "scene_id": "S10E13_001", "location": "", "scene_description": "", "characters": ["Caitlin", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E13/scenes/S10E13_001"}}
