{"id": "S10E14_001", "text": "The One with Princess Consuela\nRachel: I know. I always thought if you and I got married, it would be the one that stuck. And it wouldnt be a secret, and we wouldnt have our wedding dinner at Pizza Hut. (They both laugh.)\nRoss: Did I, did I even treat?\nRachel: No, it was on the house, it was, it was a newlywed special.\nRoss: That may be the most depressing thing Ive heard in my life. I should probably get these to my lawyers office.\nRachel: Hey, thanks Ross, for taking care of all of this.\nRoss: Eh, no problem.\n(They hug.)\nRachel: Im gonna need a copy of those.\nRoss: Totally. (Exits.)\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 14, "episode_id": "S10E14", "episode_title": null, "scene_number": 1, "scene_id": "S10E14_001", "location": "", "scene_description": "", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E14/scenes/S10E14_001"}}
{"id": "S10E14_002", "text": "[Scene: The street, Joey is messing with a car cover and still wearing the Porsche stuff. This guy playing street football catches a pass next to the car cover Joey is fooling around with.]\nJoey: Hey! Hey! Be careful around my Porsche! \nWoman: (the same one from before approaches) Hi Joey.\nJoey: Hey! How you doin?\nWoman: (to her friend) He has the most amazing Porsche under there!\nJoey: Id love to show ya, but I just tucked her in. Shes sleeping. (The women both laugh) Hey uh, would you two girls like to go for a drink? (Just then the same guy with the football dives to make a catch, lands on the car cover, and collapses it. It turns out that Joey set up a bunch of boxes to make it look like a Porsche.)\nEnd", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 14, "episode_id": "S10E14", "episode_title": null, "scene_number": 2, "scene_id": "S10E14_002", "location": "The street", "scene_description": "Joey is messing with a car cover and still wearing the Porsche stuff. This guy playing street football catches a pass next to the car cover Joey is fooling around with.", "characters": ["Joey", "Woman"], "firestore_path": "/episodes/S10E14/scenes/S10E14_002"}}
