{"id": "S10E06_001", "text": "The One with Ross's Grant\nWritten by: Adam Chase Transcribed by: Eric Aasen", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 1, "scene_id": "S10E06_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S10E06/scenes/S10E06_001"}}
{"id": "S10E06_002", "text": "[Scene: The Wedding Chapel, continued from last season. Chandler and Monica are about to get married.]\nChandler: Okay! (Stands up) This is it! (Claps his hands) We're gonna get married!\nMonica: Are you sure you wanna do this?\n(Suddenly the doors burst open, and ROSS AND RACHEL COME OUT ARM-IN-ARM!!!!! And Rachel's carrying a bouquet!!! THEY GOT MARRIED!!!!)\nRoss: Well, hello, Mrs. Ross! (Throws some rice.)\nRachel: Well, hello, Mr. Rachel! (Throws some more rice.)\n(They storm out into the street.)\nRachel: Wait! (Gets her bearings) Okay!\n(She goes one way; he goes the other. The camera pans back to Chandler and Monica, and needless to say, they're standing there dumbstruck.)\nMonica: Whoa!\nChandler: Oh my God!\nJoey: (entering with Phoebe) Come on Pheebs! Hurry! Hurry! Hurry! Hurry!\nPhoebe: Okay! Okay! Okay! (They run into the chapel.)\n(Chandler and Monica are stunned again.)\nChandler: Oh my God!! Is everybody getting married?!!\n(Phoebe and Joey run back out and head towards the street.)\nAttendant: (scolding them) N-No running in the chapel!\nPhoebe: (to her) Hey! Dont you give me any of yourHey! (Sees Chandler and Monica standing there.)\nChandler: Hey!\nJoey: Hey!\nMonica: What are you guys doing here?\nJoey: Ross and Rachel left us a message saying they were getting married! Isnt that why you guys are here?\nChandler: Yes! Well that-yes.\nMonica: Why else would we be here?\nJoey: Well! What happened?! Did we miss it?\nChandler: We actually missed it.\nPhoebe: Well, maybe you wouldnt have had you (turns to the attendant) run in the chapel!\nMonica: This is insane!\nPhoebe: Whats the big deal, yknow? Its not like its a real marriage.\nChandler: What?!\nPhoebe: Yeah, if you get married in Vegas, youre only married in Vegas.\nMonica: What are you talking about? If you get married in Vegas youre married everywhere.\nPhoebe: (shocked) Really?! \nMonica: Yeah!\nPhoebe: Oh my God!Eh! Well\nOpening Credits\n{Transcibers note: In case you havent heard, Courteney Cox got married to David Arquette during hiatus and changed her name to Courteney Cox Arquette. But David was a busy boy during the off season for not only did he marry but everyone else as well. For theyre all listed as Jennifer Aniston Arquette, Lisa Kudrow Arquette, in an interesting twist Matt LeBlanc Arquette, Matthew Perry Arquette, David Schwimmer Arquette, and even the creators of the show are now David Crane Arquette and Marta Kauffman Arquette. I just wonder what the new sleeping arrangements are}", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 2, "scene_id": "S10E06_002", "location": "The Wedding Chapel", "scene_description": "continued from last season. Chandler and Monica are about to get married.", "characters": ["Attendant", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E06/scenes/S10E06_002"}}
{"id": "S10E06_003", "text": "[Scene: Rachels hotel room, shes waking up with a horrendous hangover.]\nRachel: Ohhh! (Looks in the mirror and sees that she still has her mustache and groans.)\n(Suddenly, theres movement beside her, startling her. Its Ross! He wakes up and they both start screaming in terror. Then they both grab their heads having aggravated their hangovers.)\nRoss: Why are we in bed together?\nRachel: I dont know. Do-do you have any clothes on?\nRoss: (checks) Yeah.\nRachel: Really?!\nRoss: No! But we-we didnt havesex-uh, did we? I mean, I dont remember much about last night, it was such a blur.\nRachel: Oh! I remember laughing! I laughed a lot.\nRoss: And we didnt have sex. \n(Rachel agrees with him and starts to get out of bed.)\nRachel: Ohh, I mean, we were really drunk. Im just glad we didnt do anything stupid.\nRoss: (getting up) Tell me about it. (He sits up on the edge of the bed and has \"Just Married\" written on his back.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 3, "scene_id": "S10E06_003", "location": "Rachels hotel room", "scene_description": "shes waking up with a horrendous hangover.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E06/scenes/S10E06_003"}}
{"id": "S10E06_004", "text": "[Scene: The breakfast buffet, Phoebe is already sitting at the table as Joey enters.]\nJoey: Mornin Pheebs. (Sits down.) Well, my movie has officially been canceled.\nPhoebe: Oh Joey, Im so sorry. You want some of my breakfast?\nJoey: Nah, Im too depressed to eat. Ill probably eat in like 5 minutes. So I guess Ill just fly home with you guys, what times your flight?\nPhoebe: What about my cab?\nJoey: I dont need that anymore.\nPhoebe: No, Joey! You borrowed my cab; you have to drive it back.\nJoey: I dont want to drive all the way back by myself, I get so lonely. (Gets an idea.) Ohooh! How about you come with me?\nPhoebe: I dont know, its such a long trip.\nJoey: Itll be great! We-we could talk, and play games! Huh? This could be our chance to like renew our friendship.\nPhoebe: Are you asking me to have a frenaissance?\nJoey: Sure?\nPhoebe: All right. Although I dont think we need one, I never stopped loving you.\n(Chandler and Monica enter.)\nChandler: Hi!\nJoey: Hey.\nMonica: Hey.\nChandler: So, has anyone talked to Dr. and Mrs. Geller yet?\nPhoebe: Um-hmm, yeah. They left me a message; they should be here any minute.\nJoey: Where is the waitress?! Im starving!\nChandler: Its a buffet man.\nJoey: Oh, heres where I win all my money back! (Gets up and heads for the buffet table with Chandler in tow.)\nChandler: Listen, I gotta talk to you.\nJoey: Sure! Whats up? (He grabs a plate and proceeds to load it with a huge pile of scrambled eggs. Chandler just stares at him and Joey reluctantly gives him a spoonful.)\nChandler: Monica and I almost got married last night.\nJoey: Oh my God! Thats huge! (Hugs him.) Wait a minute, why come I wasnt invited? And who was going to be your best man? Dont say, \"Ross.\" Do not say, \"Ross.\"\nChandler: Look, I just dont think Monica and I are ready to get married yet! Yknow? I mean, I love her and everything but seeing Ross and Rachel coming out of that chapel was like a, like a wake-up call that Monica and I are moving so fast. Yknow? And, how do I tell her without crushing her?\nJoey: Oh! Tell her shes not marriage material.\nChandler: What?!\nJoey: Girls say it to me all the time! And believe me, if shes anything like me, shes just gonna be relieved.\n[Pan to Monica and Phoebe having the same conversation.]\nMonica: How do I tell Chandler that its too soon. Its gonna break his heart, hes not gonna think that I dont love him anymore.\nPhoebe: Well you dont.\nMonica: Yes I do!\nPhoebe: Good! Good! I was just testing you.\nChandler: (returning with Joey) Hi.\nMonica: Oh hi! Hi! Yknow, we were just talking about bacon.\nPhoebe: No, we were talking about tennis. Tennis is more believable. \n(Ross and Rachel enter.)\nRoss: Hey!\nThe Girls: Hey!\nChandler: Hey!\n(They both sit down and Rachel pours them both some coffee. Theyre acting like nothings happened and everyone is just staring at them.)\nRoss: What?\nChandler: Are we gonna talk about what you guys did last night? Or\nRachel: (To Ross) I dont know. (To the gang.) What do you mean last night? Nothing, nothing uh, happened last night.\nRoss: Yeah!\nPhoebe: Uh-huh! Ross invited us all to watch.\n(Rachel turns to Ross stunned.)\nMonica: Rach! We werent gonna miss our friends getting married!\nRachel: (gasps) Who got married?! (Ross is as surprised to hear this as she is.)\nChandler: (not quite sure) You did.\nRoss: What?! Hello! We didnt get married.\nRachel: No, we didnt get married! Thats ridiculous!\n(They turn to look at each other and suddenly remember that they did in fact get married.)\nRoss: We-we-weI remember being in a chapel.\nRachel: Oh my God.\nRoss: IThey would not let us get married when we were that drunk!\nRachel: No!\nJoey: They let you get married when youre drunk! Most people who get married in Vegas are drunk!\nPhoebe: Hell, Im drunk right now! (They all turn and look at her.) What? I cant have a mimosa with breakfast?! Im on vacation!\nMonica: What are you guys gonna do?\nRachel: Well, I guess we just find a divorce lawyer? (Looks at Ross.)\nChandler: Well, I think, I think, Ross already has one. Now, this ones free, right? Because you paid for the first two, so the third ones free.\nRoss: Laugh it up, but the jokes on you. Because we dont need to get divorced, okay? We were just gonna get an annulment. \nJoey: An annulment? Ross! I dont think surgerys the answer here.\nPhoebe: Oh-oh, thats your thing.\nRoss: What?\nPhoebe: Youre thing. Youre thing. Yknow? Youre the guy who gets divorced.\nAll: Oh yeah!\nRoss: No-no, thats-thats not my thing! I do not love getting divorced!\nPhoebe: Yes you do! This is your third divorce! You love divorce so much youre probably gonna marry it! Then it wont work out and youre gonna have to divorce it, divorcing guy. (Pause) Im so drunk.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 4, "scene_id": "S10E06_004", "location": "The breakfast buffet", "scene_description": "Phoebe is already sitting at the table as Joey enters.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "The Girls"], "firestore_path": "/episodes/S10E06/scenes/S10E06_004"}}
{"id": "S10E06_005", "text": "[Scene: The casino floor, Chandler and Monica are walking through it.]\nMonica: So, what do you think we should do?\nChandler: I dont know. But I-I-I know I love you!\nMonica: I know I love you! (They hug.)\nChandler: So where are we on the whole going back to the place where they have all the marriages thing? I love you.\nMonica: Thats a good question. Look umm, last night we let the dice decide. Maybe we should leave it up to fate again. I love you!\nChandler: Yes, we dont get married unless theres a sign! Okay, so say uh, say you roll another eight (motions to the craps table) then theres a definite sign that we should get married.\nMonica: All right, eight we get married, but 2, 3, 4, 5, 6, 7, 9, 10, 11, 12 we dont get married.\nChandler: Sounds great.\nMonica: Okay. (They approach the craps table.)\nCroupler: Coming in, we got a shooter! Money please.\nMonica: Ready?\nChandler: Ready!\nMonica: (sarcastic) Come on eight.\nChandler: (deadpan) Yes, yes eight.\n(Monica rolls the dice.)\nCroupler: Eight! Easy eight. (She rolls a 3 and a 5 and theyre stunned.)\nMonica: Wow! I cant believe I actually rolled an eight.\nChandler: That was so unlikely. Well, lets get married! I guess.\nMonica: Wait a minute. That wasnt a hard eight! Last night I rolled a hard eight.\nChandler: Thats right! It was the wrong kind of eight, no wedding! Damnit!\nMonica: I wanted it so bad! (Pause) Wanna go pack?\nChandler: Yeah. (They go pack.) Were doing the right thing, right?\nMonica: Ohh, of course we are! (They walk up to the elevators.) We left it up to fate. (Pushes the elevator button.) If we were supposed to get married there would be a clear-cut sign. (The elevator door opens to a priest reading from a bible with Chandler and Monica standing side-by-side holding each others hands.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 5, "scene_id": "S10E06_005", "location": "The casino floor", "scene_description": "Chandler and Monica are walking through it.", "characters": ["Chandler", "Croupler", "Monica"], "firestore_path": "/episodes/S10E06/scenes/S10E06_005"}}
{"id": "S10E06_006", "text": "[Scene: Phoebes cab, Phoebe and Joey are driving back. Phoebe is driving while Joey is sleeping.]\nPhoebe: Okay, you have 19 questions left. Use them wisely. (Joey groans.) Come on Joey! You cant win if you dont ask any (sees that hes asleep) QUESTIONS!!!\nJoey: (wakes up) What?!\nPhoebe: Well, you promised me a fun road trip! Weve been on the road six hours and youve been asleep for five and a half! We are switching at the next rest stop and you are going to drive all the way back! That will be your punishment, you greedy sleeper!\nJoey: All right. All right.\nPhoebe: Yeah! And until then you are going to sing to me because the radios broken and you are selfish but have a nice voice.\nJoey: Really? I dont\nPhoebe: Sing!!\nJoey: (starts singing) I wanna rock and roll all night! (Falls asleep.)\n[Time lapse, Phoebe is asleep, Joeys driving and having a hard time staying awake.]\nJoey: (to himself) Man, this is a long drive! Are my eyes open? No! (He opens his eyes and sees a hitchhiker.)\n[Time lapse, Phoebe is still asleep only Joey is now passed out next to her and the cars still moving. She wakes up, sees Joey, and screams.]\nHitchhiker: (driving) Morning! (Phoebe screams again.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 6, "scene_id": "S10E06_006", "location": "Phoebes cab", "scene_description": "Phoebe and Joey are driving back. Phoebe is driving while Joey is sleeping.", "characters": ["Hitchhiker", "Joey", "Phoebe"], "firestore_path": "/episodes/S10E06/scenes/S10E06_006"}}
{"id": "S10E06_007", "text": "[Scene: Central Perk, Rachel is on the couch as Ross enters.]\nRoss: Hey!\nRachel: Hey, hubby!\nRoss: Yeah. Yeah, actually um, I wanted to talk to you about that whole annulment thing?\nRachel: Uh-huh.\nRoss: Im not going to do that. (Rachel glares at him.)\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 7, "scene_id": "S10E06_007", "location": "Central Perk", "scene_description": "Rachel is on the couch as Ross enters.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E06/scenes/S10E06_007"}}
{"id": "S10E06_008", "text": "[Scene: Central Perk, continued from earlier. Rachel starts laughing.]\nRachel: Okay! So, well just stay married.\nRoss: Yes, exactly!\nRachel: And I will make everyone call me Mrs. Geller!\nRoss: Wow! This is so amazing. I uh, I really thought Id have to talk you into this more.\nRachel: Okay, see now Im scared because I dont actually think youre kidding.\nRoss: Im-Im not kidding. Look I-I, I cant have three failed marriages. I cant. Okay? I-I am not gonna be that guy!\nRachel: What-wh-what so well just stay married forever?!\nRoss: Okay, look, how is this gonna affect you? Really? I mean you fill some form out once and a while and instead of checking the box that says Ms you check the box that says Mrs.! Its right next to it!\nRachel: Ohh, okay, Im sorry. Youre right. Yknow what? We absolutely can stay married, because I was under the impression that the boxes were far away from each other. All right, look, just please, take a moment here and think about what youre asking of me.\nRoss: Im asking you to do me a favor. \n{Note: Does anyone else want to smack Ross right about now? Raise your hands. Okay, put them down before you stink out the person next to you.}\nRachel: You are asking me to be your wife!\nRoss: And as my wife I think you should grant me this favor.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 8, "scene_id": "S10E06_008", "location": "Central Perk", "scene_description": "continued from earlier. Rachel starts laughing.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E06/scenes/S10E06_008"}}
{"id": "S10E06_009", "text": "[Scene: The hallway, Chandler is helping Monica to the door.]\nMonica: That kid really kicked me hard on the plane.\nChandler: Well you did pull his hair.\nMonica: He took my snack!\nChandler: Im not getting into this again!\nMonica: Okay! Oh God, yknow what? Its really bad.\nChandler: Well, I told you not to walk. Here. (Picks her up.) There. Okay. (He opens the door, carries her across the threshold, stops, backs out, and lets go of Monica who is only holding on by his neck.)\nMonica: This doesnt mean anything, does it?\nChandler: No!\nMonica: Okay.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 9, "scene_id": "S10E06_009", "location": "The hallway", "scene_description": "Chandler is helping Monica to the door.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S10E06/scenes/S10E06_009"}}
{"id": "S10E06_010", "text": "[Scene: Phoebes cab, shes driving, Joeys in the back seat, and the hitchhiker is riding up front with Phoebe.]\nPhoebe: (To Joey) How could you pick up a hitchhiker?! He could be a rape(She holds her hand in front of the hitchhikers face), a rapist or a killer or something!\nJoey: Dont you think I asked him that before he got in?!\nPhoebe: Yknow what? Im not talking to you! You go back to sleep! (To the hitchhiker) And you, are you a rapist?!\nHitchhiker: No!\nPhoebe: Do you like car games?\nHitchhiker: Yeah, yknow the license plate game?\nPhoebe: I love the license plate game!\nJoey: Ooh, Ill play! Ill play!\nPhoebe: No-No! You need your sleep. Night-night! Shh! (She closes the partition.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 10, "scene_id": "S10E06_010", "location": "Phoebes cab", "scene_description": "shes driving, Joeys in the back seat, and the hitchhiker is riding up front with Phoebe.", "characters": ["Hitchhiker", "Joey", "Phoebe"], "firestore_path": "/episodes/S10E06/scenes/S10E06_010"}}
{"id": "S10E06_011", "text": "[Scene: Monica and Rachel's, Ross is entering.]\nRoss: Hey!\nRachel: Hey!\nRoss: Listen, I know you wanted to talk to me, but I have an idea that may make you want to stay married. (Rachel shakes her head.) We register, and you get to keep all the presents!\nRachel: (thinks about it for a second) No! Ross, come on! No! Listen, look I thought a lot about how to tell you this and the bottom line, Ross, is we can not stay married.\nRoss: I dont know if its true.\nRachel: Oh b-b-but it is!\nRoss: Oh, okay, yknow what this is? This is a difference of opinion. And when that happens in a marriage...\nRachel: Oh Ross, come on! This is not, this is not a marriage!! This is the worlds worst hangover! Ross, listen, if you do not get this annulment, I will!\nRoss: All right. All right, Ill do it.\nRachel: Thank you. (He goes to leave.) Hey-hey umm, uh, is there, is there any such thing as an annulment shower?\n(Ross turns and leaves.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 11, "scene_id": "S10E06_011", "location": "Monica and Rachel's", "scene_description": "Ross is entering.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S10E06/scenes/S10E06_011"}}
{"id": "S10E06_012", "text": "[Scene: Phoebes cab, its the same arrangement as before.]\nHitchhiker: Wait! Wait! There is the train station!\nPhoebe: Oh, okay.\nHitchhiker: This is where I get off. Well, I have your address and phone number.\nPhoebe: And I have your name and the fact that youre a drifter, so the balls pretty much in your court.\nHitchhiker: All right, see ya Pheebs. (Gets out and Phoebe drives away.)\nJoey: Come on Pheebs! I cant take this anymore! Let-let me make it up to you. Huh? (Starts singing.) Ground control to Major Tom. Commencing countdown, engines on. Take your protein pills and put your helmet on!\nPhoebe: Stop it! Stop it no! Thats not fair! Yknow I cant resist that beautiful voice!\nJoey: Pheebs, I am so sorry! I know I promised you a fun road trip with your friend and I didnt deliver. But-but-but now I know that you think being awake is an important part of friendship! So, so, so I will strive to-to stay awake for as long as I know you.\nPhoebe: You can still sleep at night and stuff.\nJoey: Well, thank you. So, can we play 20 Questions now? Ive got a really good one! Ive been thinking about it since Kansas.\nPhoebe: Okay. Is it a kind of hot sandwich?\nJoey: Yes.\nPhoebe: Is it a meatball sub?\nJoey: That is incredible! You are the master!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 6, "episode_id": "S10E06", "episode_title": null, "scene_number": 12, "scene_id": "S10E06_012", "location": "Phoebes cab", "scene_description": "its the same arrangement as before.", "characters": ["Hitchhiker", "Joey", "Phoebe"], "firestore_path": "/episodes/S10E06/scenes/S10E06_012"}}
