{"id": "S10E05_001", "text": "The One Where Rachel's Sister Babysits\nRachel: What?!\nRoss: (in an Australian accent) You complete me kitchen, matey!\nPhoebe: Ross, I know what youre thinking.\nRoss: What?\nPhoebe: That shes gonna move in with you and maybe then shell fall in love with you and then when she finds out youre already married, shell just be happy. Yknow? Youre just, youre very sad.\nRoss: OhmyGod! I-I see what this is! You are in love with Rachel!\nPhoebe: What?!!\nRoss: Of course! It all adds up! I mean you youre obsessed with her. Its always, \"Ross, what are you gonna do about Rachel?\" \"Ross, why-why are you moving in with Rachel?\" \"When are you gonna confess your secret marriage to Rachel?\" You want her!\nPhoebe: No! (Rosss phone rings.)\nRoss: (answering it) Uh-oh, saved by the bell. (On phone) Hello?\n[Cut to the living room where Monica is helping pack a box.]\nMonica: Hey Rach, arent these candlesticks (holds up a pair) mine?\nRachel: No-no, I bought those.\nMonica: Ohh! Yeah, I forgot.\nRachel: Yeah. (Rachel walks away.)\nMonica: (under her breath) That youre a liar. (Hides the candlesticks in a drawer.)\nRoss: (on phone) No-no-no, thats great! Ill be there Monday. And thank you again! (Listens) Okay. (Hangs up) (To All) Umm, that was the head of the Paleontology department at N uh, Y, uh U!\nMonica: Wow! Uh what, did he uh, say?\nRoss: Well remember that paper I had published last year on sediment flow rate, huh? They loved it. \nRachel: Well, who wouldnt?!\nRoss: I know! Anyway, they asked me to be a guest lecturer! I mean its temporary, but uh, if they like me it could lead to a full time job. How great would that look great on a mailbox, huh? \"Professor Geller.\"\nPhoebe: Yeah, Professor and Mrs.\nRachel: And Mrs.?!\nPhoebe: Oh! Yeah, yknow you and Ross are still married.\nRachel: What?!!\nPhoebe: Just kidding!\nRachel: Ohh! Oh God! (Laughs her way into the living room.) \nPhoebe: (To Ross) Saved your ass.\nOpening Credits", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 1, "scene_id": "S10E05_001", "location": "", "scene_description": "", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_001"}}
{"id": "S10E05_002", "text": "[Scene: Central Perk, Joey, Monica, Rachel, and Chandler are all there as Phoebe enters dejectedly.]\nChandler: Hey!\nPhoebe: Hi.\nMonica: Hey!\nChandler: Oh, whats the matter?\nPhoebe: Well, you know that psychic I see?\nChandler: Yeah?\nPhoebe: Well, she told me that Im gonna die this week, so Im kinda bummed about that.\nChandler: What?!\nPhoebe: Yeah, and I know you guys dont know a lot about psychic readings, but that one is pretty much the worse one you can get.\nMonica: Phoebe thats crazy!\nJoey: I cant believe she would say that too you.\nRachel: Yeah honey you dont believe her do you?\nPhoebe: I dontshe said yknow that Id have triplets! But she also said one of them would be black.\nChandler: Just out of curiosity did she tell you how youre gonna go?\nPhoebe: No, cause she didnt tell me I was gonna die until the very end of the session, and I was not gonna waste a whole another hour there! I mean Ive only got a week left, yknow? Ive really gotta start living now! (So she picks up the latest copy of Car and Driver (a U.S. auto magazine), leans back, and starts reading.)\nRoss: (entering) Hey everyone!\nChandler: Oh hi!\nRoss: Hey uh, well, todays my first lecture and I kinda wanted to try it out on you guys, do you, do you mind?\n(They pause to think about it.)\nAll: Oh thatd be great. Sure!\nRoss: (he starts reading directly from his cards word for word very quietly) \"There are three primary theories concerning sediment flow rate. Each of these theories can be further subcategorized into two distinct\"\nPhoebe: Oh, this is it. This whats gonna kill me.\nRoss: (continuing) \"subcategories. The first of these subcategories is\"\nJoey: (interrupting him) Uh Ross! Are there uh, are there naked chicks on that piece of paper?\nRoss: No! Why?\nJoey: Well, Ive just never seen a guy stare so hard at a piece of paper that didnt have naked chicks on it.\nRoss: Ohh! Okay! Okay. (Resumes reading word for word from the card) \"There are three (pauses and looks at Joey) primary theories concerning sediment flow rate. (Pauses and darts his eyes between Chandler and Rachel.) (Rachel starts laughing) Each of these theories (glances at Phoebe) can be further subcategorized (glances at Chandler) into\"\nChandler: Why dont you open with a joke?\nRoss: Open with a joke? Its a university, not a comedy club!\nChandler: Wait a minute, hold the phone! Youre not talking about Chuckles University?!\nRoss: (gets up) Okay!\nAll: Ohh! Were kidding! Oh, were kidding!\nRachel: Ross, hey you know what might make it less boring?\nRoss: Thank you!\nRachel: Some uh, some visual aides.\nJoey: Oh-ooh-ooh! Yknow whats a good visual aide?\nRoss: Please dont say naked chicks.\nJoey: Why not?!\nRoss: I-I-I dont even know why I bother to talk to you guys about it. Yknow what? Im just gonna do it on my own with no naked chicks.\nChandler: Thats the way I did it til I was 19.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 2, "scene_id": "S10E05_002", "location": "Central Perk", "scene_description": "Joey, Monica, Rachel, and Chandler are all there as Phoebe enters dejectedly.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_002"}}
{"id": "S10E05_003", "text": "[Scene: Chandler and Joey's, Joey is playing that string game with the two hands and the weird crossing patterns as Chandler enters with the mail.]\nChandler: Hey.\nJoey: Hey! Any good mail?\nChandler: Yes, you got something from the Screen Actors Guild.\nJoey: Ooh, its probably a residual check, hey can you open it for me, Im kinda.\nChandler: (opens and reads it) \"Benefits lapsed.\"\nJoey: Hmm thats weird. I dont remember being in a move called benefits lapsed.\nChandler: Okay, its not a check. Theyre saying your health insurance expired because, you didnt work enough last year.\nJoey: Let me see that!\nChandler: All right.\nJoey: (reads it) Oh, I cant believe this! This sucks! When I had insurance I could get hit by a bus or catch on fire, yknow? And it wouldnt matter. Now I gotta be careful?!\nChandler: Im sorry man, theres never a good time to (pauses) stop catching on fire.\nJoey: All right well, I guess I gotta go get a job. Im gonna go see my agent.\nChandler: Okay, make sure you look both ways before you cross the street.\nJoey: (mocks him, in a whiney voice) look both ways before you cross the street. (Turns and walks headlong into the closed door.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 3, "scene_id": "S10E05_003", "location": "Chandler and Joey's", "scene_description": "Joey is playing that string game with the two hands and the weird crossing patterns as Chandler enters with the mail.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_003"}}
{"id": "S10E05_004", "text": "[Scene: Monica and Rachel's, Phoebe enters to find Rachel still packing.]\nPhoebe: Hey!\nRachel: Hey Pheebs, youre still alive! How are you doing?\nPhoebe: Ugh, its so exhausting waiting for death. Ohh, by the way, do you think you could(Groans, hacks, and then freezes with her eyes open and her tongue hanging out.)\nRachel: Pheebs, what-what are you doing?\nPhoebe: I was preparing you for mydidnt you think I was dead? Did that not come off?\nRachel: Oh yeah, scared the hell out of me. I thought wed lost you forever. Pheebs, you lie down?\nPhoebe: Yeah, thanks. And listen, can you do me a favor? Could you just umm, wake me up in a couple hours, yknow if you can.\n(Phoebe goes and lies down as Rachel opens the drawer Monica hid the candlesticks in and as Monica walks out of her room.)\nRachel: Monica!\nMonica: Hmm? (Rachel holds up the candlesticks.)\nRachel: Did-did you take these back?\nMonica: No-no, I-I just, I liked them so much that I went out and bought some for myself.\nRachel: Oh yeah, theyre really great! Arent they?\nMonica: I loved them!\nRachel: Yeah. (Monica walks away) Nice try! (Rachel puts them in a box.)\nRoss: (entering) Hello!\nMonica: Hey!\nRachel: Hey!\nMonica: Howd the lecture go?\nRoss: It went great! And I didnt need any jokes or naked chicks either!\nRachel: Wow, thats great Ross, Im sorry we werent more supportive before.\nRoss: I knew all I had to do was let the material speak for itself. Everyones all, \"Ross you have to be funny and sexy.\" Well, I proved them wrong! And now, Im gonna pass the news onto Joey and Chandler.\nMonica: That youre not funny or sexy?\nRoss: Thats right!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 4, "scene_id": "S10E05_004", "location": "Monica and Rachel's", "scene_description": "Phoebe enters to find Rachel still packing.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_004"}}
{"id": "S10E05_005", "text": "[Scene: Estelle Leonard Theatrical Agency, Joey is there to see his agent.]\nJoey: (entering) Hey Estelle, listen\nEstelle: Well! Well! Well! Joey Tribbiani! So you came back huh? They think they can do better but they all come crawling back to Estelle!\nJoey: What are you talkin about? I never left you! Youve always been my agent!\nEstelle: Really?!\nJoey: Yeah!\nEstelle: Oh well, no harm, no foul.\nJoey: Estelle, you gotta get me some work. I-I lost my health insurance.\nEstelle: All right, first thing we gotta do, damage control.\nJoey: Why?\nEstelle: Well, I think uhh, someone out there may have been bad mouthing you all over town.\nJoey: Bastard!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 5, "scene_id": "S10E05_005", "location": "Estelle Leonard Theatrical Agency", "scene_description": "Joey is there to see his agent.", "characters": ["Estelle", "Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_005"}}
{"id": "S10E05_006", "text": "[Scene: Chandler and Joey's, Chandler enters to find Joey lying in the fetus position on the floor.]\nChandler: Hey!\nJoey: (in obvious pain) Hey! So Estelle lined up a bunch of auditions for me tomorrow and Ill have my health insurance back in no time.\nChandler: Thats great, but shouldnt you be on the toilet right now?\nJoey: What?!\nChandler: Whats wrong with you?\nJoey: Nothing! Well, I-I got this blinding pain in my stomach when I was lifting weights before, then I uh passed out and uh, havent been able to stand up since. But um, I dont think its anything serious.\nChandler: This sounds like a hernia. You have toyou-you go to the doctor!\nJoey: No way! Kay look, if I have to go to the doctor for anything its gonna be for this thing sticking out of my stomach! (Rolls over and shows Chandler.)\nChandler: Thats a hernia.\nJoey: Why did I have to start working out again? (Looks at the weights he was using.) Damn you 15s!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 6, "scene_id": "S10E05_006", "location": "Chandler and Joey's", "scene_description": "Chandler enters to find Joey lying in the fetus position on the floor.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_006"}}
{"id": "S10E05_007", "text": "[Scene: a NYU lecture hall, Rachel and Monica are arriving to talk to Ross after the lecture, but are there early.]\nRachel: Well, were a little early, the lecture doesnt end for 15 minutes.\nMonica: Yeah, but yknow we could sneak in and watch.\nRachel: Yeah, we could. Oh hey look! Theres some Kappa Kappa Deltas! I was a Kappa. (to them) Hey sisters! (They ignore her.) (To Monica) Wow, we really are bitches.\n(They enter the lecture hall to find Ross speaking in an English accent for some unknown reason.)\nRoss: (to the class) Right! So when Rigby got his samples back from the laboratory he made a startling discovery! What he believed to be igneous, was in fact sedimentary. Imagine his consternation when(sees Monica and Rachel.) Oh bloody hell.\nCommercial Break", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 7, "scene_id": "S10E05_007", "location": "a NYU lecture hall", "scene_description": "Rachel and Monica are arriving to talk to Ross after the lecture, but are there early.", "characters": ["Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_007"}}
{"id": "S10E05_008", "text": "[Scene: a NYU lecture hall, the scene is continued from earlier, only Ross has dismissed the class and is now talking to Monica and Rachel.]\nMonica: What the hell are you doing?!\nRoss: Look, I was nervous! You guys had me all worried I was going to be boring! I got up there and they were all like staring at me. I opened my mouth and this British accent just came out.\nRachel: Yeah, and not a very good one.\nRoss: Will you-will you please?\n(Another professor walks down from the back of the lecture hall.)\nThe Professor: Dr. Geller, Kurt Rathman, Im a professor in the paleontology department here.\nRoss: Oh.\nThe Professor: Do you have a moment to talk about your lecture?\nRoss: (in his British accent) Im sorry, Ive got plans with my sister.\nMonica: (in an Irish accent) Monica Gellerrr. (She rolls her R)\nRoss: (in accent) Right, will you excuse us for one moment? (Takes Monica aside.) (In his normal voice.) What are you doing?\nMonica: (normal voice) Oh, you can have an accent and I cant?! (To an exiting student in accent.) Top O the morning to ya laddies!\nRoss: Just please stop!\n(They turn back to Rachel and Professor Rathman.)\nRachel: (in an Indian accent) Yes, yes, Bombay is bery, bery nice time of year.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 8, "scene_id": "S10E05_008", "location": "a NYU lecture hall", "scene_description": "the scene is continued from earlier, only Ross has dismissed the class and is now talking to Monica and Rachel.", "characters": ["Monica", "Rachel", "Ross", "The Professor"], "firestore_path": "/episodes/S10E05/scenes/S10E05_008"}}
{"id": "S10E05_009", "text": "[Scene: Central Perk, Chandler is reading on the couch while Joey, still suffering from his hernia, is returning with coffee for them both. After a series of grunts and groans he manages to painfully walk back from the counter, sit down, and slide Chandler his coffee.]\nChandler: Hey, will you grab me a cruller? (Joey starts to groan and get up.) Sit down! Will you go to the hospital?!\nJoey: Dude! Hernia operations cost like, a lot probably. Besides its getting darker and more painful, that means its healing.\nChandler: I will loan you the money. Just go to the hospital and lets just get that thingpushed back in.\nJoey: Thank you, but it would take me forever to pay you that money back and I dont want that hanging over my head. Okay? Besides, as soon as my insurance kicks in I can get all the free operations I want! Yeah, Im thinking Ill probably start with that laser eye surgery too.\n(Phoebe enters.)\nPhoebe: Hey!\nChandler: Hey.\nJoey: Hey!\nPhoebe: Whats going on?\nChandler: Oh Joeys got a really bad hernia, but thats nothing a little laser eye surgery wont fix!\nJoey: Look, Im telling you if I put my hand on my stomach right here (He puts his hand down his pants, like Al Bundy on MarriedWith Children always used to do.) it doesnt hurt that bad.\nPhoebe: Hey! Maybe youll die!\nJoey: Sure, now Im scared.\nPhoebe: No, we can go together! Just dont wait too long though, okay? Cause Im outta here sometime before Friday.\nJoey: Yeah, but I dont wanna die!\nPhoebe: No-no, itll be fun! We can come back and we can haunt these guys!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 9, "scene_id": "S10E05_009", "location": "Central Perk", "scene_description": "Chandler is reading on the couch while Joey, still suffering from his hernia, is returning with coffee for them both. After a series of grunts and groans he manages to painfully walk back from the counter, sit down, and slide Chandler his coffee.", "characters": ["Chandler", "Joey", "Phoebe"], "firestore_path": "/episodes/S10E05/scenes/S10E05_009"}}
{"id": "S10E05_010", "text": "[Scene: Monica and Rachel's, Monica and Rachel are having a tug-of-war over the disputed candlesticks.]\nMonica: Gimme em!\nRachel: No! They are mine!\nMonica: You stole them from me!\nRachel: You stole them from me!!\nMonica: Gimme them!\n(With one last mighty tug the combatants lose their grip and split, each holding one candlestick.)\nMonica: You just wanna each take one?\nRachel: Yeah that seems fair. We never use them.\nRoss: (entering) Look, I really need some help, okay? Why? Why did I have to speak in a British accent?! What do I do?\nRachel: Well\nMonica: Why dont you phase it out? Yeah, fade the accent out and people will think youre, yknow, that youre adjusting to life in America.\nRachel: Yeah, I mean, come on Ross, no one will even notice. I mean theyre probably not even listening!\nRoss: Theyre not listening too me?\nRachel: Of course theyre listening to you! Everybody listens to you.\nRoss: Monica you really think I should try this phasing out thing?\nMonica: I think you look fine.", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 10, "scene_id": "S10E05_010", "location": "Monica and Rachel's", "scene_description": "Monica and Rachel are having a tug-of-war over the disputed candlesticks.", "characters": ["Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_010"}}
{"id": "S10E05_011", "text": "[Scene: Casting Director #1s office, Joey is on his first audition. His partner is an 8-year-old boy.]\nCasting Director #1: Whenever youre ready.\nJoey: (in a gravely, painful voice) Okay. \"Hey, Timmy, Ive got a surprise for you.\"\nCasting Director #1: Hold it. Im sorry, the surprise is a new swing set, if you could play it a little lessintense?\nJoey: Oh yeah, sure, no problem, Ill justhold on one second. (He turns around and puts his hand in his pants and groans in relief.) (In a relaxed voice.) \"Hey Timmy, Ive got a surprise for you!\"\nCasting Director #1: Oh my God!!\n(Joey pulls his hand out and reverts back to intense pain.)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 11, "scene_id": "S10E05_011", "location": "Casting Director #1s office", "scene_description": "Joey is on his first audition. His partner is an 8-year-old boy.", "characters": ["Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_011"}}
{"id": "S10E05_012", "text": "[Scene: Casting Director #2s office, Joey is on his second audition. This one is for Purina One Dog Chow, an actual item. Please note the gratuitous product placement.]\nJoey: So thats why I feed my dog Purina One! Pick up a bag today! (He turns, looks at the bag and realizes he wont be able to pick it up.)\nCasting Director #2: Thats where you pick up the bag.\nJoey: Exactly.\nCasting Director #2: No, the line is pick a bag, so you need to pick up the bag.\nJoey: Or, I could just point to it! Huh? Blah, blah, blah, Purina One, point to a bag today. (She just looks at him.) I didnt get it, did I?\nCasting Director #2: No.\nJoey: Yeah, okay. (Leaves)", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 12, "scene_id": "S10E05_012", "location": "Casting Director #2s office", "scene_description": "Joey is on his second audition. This one is for Purina One Dog Chow, an actual item. Please note the gratuitous product placement.", "characters": ["Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_012"}}
{"id": "S10E05_013", "text": "[Scene: Casting Director #3s office, Joey is entering.]\nJoey: Hi. Im Joey Tribbiani; Im here to audition for (Groans) man.\nCasting Director #3: You mean dying man?\nJoey: Yes!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 13, "scene_id": "S10E05_013", "location": "Casting Director #3s office", "scene_description": "Joey is entering.", "characters": ["Joey"], "firestore_path": "/episodes/S10E05/scenes/S10E05_013"}}
{"id": "S10E05_014", "text": "[Scene: Monica and Rachel's, Monica and Rachel are playing phone pranks on Ross.]\nMonica: Okay, come on, do it one more time!\nRachel: Really? Really?!\nMonica: Yes!\nRachel: Okay! (Picks up the phone and starts dialing.) (In an Irish accent) \"Hello Ross, this is Dr. McNeeley from the Fake Accent University, wed like you to come on board with us full time! (Hangs up.)\nPhoebe: (entering) Hey!\nRachel: Hey!\nPhoebe: Listen to this! My reading was wrong, Im not going die!\nRachel: Really?! How do you know?\nPhoebe: Because my psychic is dead! She mustve read the cards wrong!\nRachel: Oh, Im sorry.\nPhoebe: Eh, better her than me! Hey, lets bake cookies!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 14, "scene_id": "S10E05_014", "location": "Monica and Rachel's", "scene_description": "Monica and Rachel are playing phone pranks on Ross.", "characters": ["Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S10E05/scenes/S10E05_014"}}
{"id": "S10E05_015", "text": "[Scene: Silvercup Studios, Joey has won the part of dying man and is now able to play the role he was injured for. Chandler is helping to carry him in.]\nChandler: Listen, Im really glad you got the part.\nJoey: (barely audible through the pain) Thank you.\nChandler: But are you sure you can do this?\nJoey: Yeah! And hey, thanks for coming with me. And thanks again for helping me take a shower.\n(Chandler steps away quickly.)\nChandler: Now, is that never talking about it again?!\nJoey: (to the director) Hiya!\nThe Director: Hey Joey, were ready for ya! (Joey stumbles over) Joey, this is Alex hes going to be playing your son.\nJoey: Hi Alex! (to the director) And uh, as you can see my hands are not in my pants. (Holds them both up.)\nThe Director: Okay. (to Alex) All right uh, Alex now when Joey says his line, \"Take good care of your Momma son,\" thats your cue to cry. Got it? (Alex nods yes.) All right, lets do this.\n(Joey lies down on the gurney.)\nA Crew Member: (with that board thingy) Scene 5, take 1.\nThe Director: And Action!\nJoey: \"Take could care of your Momma son.\" (Alex just looks at him and the director motions for him to continue so he tries it again.) \"Take could care of your Momma son.\" (Alex does nothing.) \"Come on son! Your Mommas good people!\"\nThe Director: Cut! Alex, remember youre supposed to cry. Can you cry for us this time?\nAlex: Okay.\nThe Director: All right, from the top.\nA Crew Member: Scene 5, take 2.\n[Time lapse.]\nA Crew Member: Take 36 is up!\nThe Director: All right! Lets try this again! You ready Joe?\nJoey: Ah, just one thing umm, is it all right with you if I, if I scream right up until you say action?\nThe Director: Uh sure.\nJoey: Okay. (Starts screaming.)\nThe Director: Action!\nJoey: (he stops screaming at action) \"Take good care of your Momma son.\" (Again Alex does nothing.)\nThe Director: Cut!!!!!!!!!! (Joey starts screaming again.)\n(Chandler decides to help out.)\nChandler: Im sorry! Hey-hey Joe, why dont you uh, lift up your shirt? (He does.) Take a look at this kiddo. (Alex finally starts crying.) We have a crying child! Roll the damn cameras!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 15, "scene_id": "S10E05_015", "location": "Silvercup Studios", "scene_description": "Joey has won the part of dying man and is now able to play the role he was injured for. Chandler is helping to carry him in.", "characters": ["A Crew Member", "Alex", "Chandler", "Joey", "The Director"], "firestore_path": "/episodes/S10E05/scenes/S10E05_015"}}
{"id": "S10E05_016", "text": "[Scene: Ross and Rachels apartment, Rachel is unpacking as the phone rings.]\nRachel: (answering it) Hello? \nRussell: (Rosss divorce lawyer.) Hello, is Ross there?\nRachel: Uh no, hes not. Can I take a message?\nRussell: Yes, this Russell, Rosss divorce lawyer, just tell him that since I havent heard from him, I assume hes decided to give the marriage a try.\nRachel: Ross got married againNooooooo!!!!!!!!!", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 16, "scene_id": "S10E05_016", "location": "Ross and Rachels apartment", "scene_description": "Rachel is unpacking as the phone rings.", "characters": ["Rachel", "Russell"], "firestore_path": "/episodes/S10E05/scenes/S10E05_016"}}
{"id": "S10E05_017", "text": "[Scene: a NYU lecture hall, Ross is trying to phase out his accent.]\nRoss: (in his head) All right, keep going. We are phasing the accent out, phasing it out. So without out re-testing the results in the laboratory (pronounced the British way) the team would never have identified (British) the initial errors in their carbon dating analysis (British). Were there any questions at this point? (One student raises his hand.) Yes. (Points to him.)\nA Student: Whats happening to your accent?\nRoss: (British) Come again? Whats-whats this nonsense? (Giggles.) (American.) All right, Im-Im not English. Im from Long Island. I was really nervous and the accent just uh, just came out. Im sorry. So, if we could just get back to the lecture. Umm, were there any questions? (Everyone raises their hands) About paleontology. (They all put their hands down.) All right, look I was just trying to make a good first impression. Obviously, I screwed up. But what you guys think of me is really important because Im-Im hoping to get a permanent job here. So if you just give me another chance to make a good impression\n(At this moment Rachel bursts through the door. Needless to say, shes not in the best of moods having just found out Rosss dirty little secret.)\nRachel: Ross!! Are you crazy?! I am still your wife!! What, were you just never gonna tell me?!! What the hell is wrong with you?!!!! Ugh, I could just kill you!!!!\nRoss: (in the accent again) Well, hello Rachel!\nEnding Credits", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 17, "scene_id": "S10E05_017", "location": "a NYU lecture hall", "scene_description": "Ross is trying to phase out his accent.", "characters": ["A Student", "Rachel", "Ross"], "firestore_path": "/episodes/S10E05/scenes/S10E05_017"}}
{"id": "S10E05_018", "text": "[Scene: Chandler and Joey's, Joey is holding a football helmet; and apparently, in a rather disgusting scene, Joey wants Phoebe to beat him senseless. (Luckily it isnt a long trip.) Because hes made a miraculous recovery from his hernia and wants to take advantage of all those free surgeries he can get now since hes re-established his health insurance.]\nPhoebe: Have you really done this before?\nJoey: Yeah! Yeah! Yeah! You just take a big, big swing. Now, dont hold back. (He dons his protective helmet (Why, I have no clue.) and Phoebe picks up a wooden baseball bat and starts to swing as Chandler and Monica enter.)\nPhoebe: Hey!\nJoey: Hey-hey-hey!\nChandler: What are you doing?\nPhoebe: Were just celebrating that Joey got his health insurance back.\nChandler: Oh, all right.\n(Decided that they are less than human as well, Chandler picks up a golf club and Monica a frying pan, to join in on the fun of beating their good friend to within an inch of his life!)\nEnd", "metadata": {"chunk_type": "scene", "season": 10, "episode_number": 5, "episode_id": "S10E05", "episode_title": null, "scene_number": 18, "scene_id": "S10E05_018", "location": "Chandler and Joey's", "scene_description": "Joey is holding a football helmet; and apparently, in a rather disgusting scene, Joey wants Phoebe to beat him senseless. (Luckily it isnt a long trip.) Because hes made a miraculous recovery from his hernia and wants to take advantage of all those free surgeries he can get now since hes re-established his health insurance.", "characters": ["Chandler", "Joey", "Phoebe"], "firestore_path": "/episodes/S10E05/scenes/S10E05_018"}}
