{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 1, "scene_id": "S03E08_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E08/scenes/S03E08_001", "raw_text": "THE ONE WITH THE GIANT POKING DEVICE\nWritten by: Adam Chase Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE GIANT POKING DEVICE"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Adam Chase Transcribed by: Eric Aasen "}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 2, "scene_id": "S03E08_002", "location": "Monica and Rachel's", "scene_description": "Phoebe, Chandler, and Ross are there, Rachel is serving brownies.", "characters": ["Chandler", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_002", "raw_text": "[Scene: Monica and Rachel's, Phoebe, Chandler, and Ross are there, Rachel is serving brownies.]\nRachel: Here you go Pheebs. Who else wants one of my special homemade brownies? \nChandler: I will have one. (Ross and him both take one.)\n(Phoebe takes a bite and spits it out and screams.)\nChandler: Okay, Im not gonna have one.\nRoss: Neither will I. (they both put back the brownies.)\nPhoebe: No, no, its just my tooth.\nChandler: All right Ill have one. (he and Ross take another brownie,)\nRoss: So whats a matter, you need a dentist? Ive got a good one.\nPhoebe: No thanks, I have a good one too. I just, I, I cant see him.\nChandler: See that is the problem with invisible dentists.\nRoss: Why? Why cant you go to him?\nPhoebe: Because, every time I go to the dentist, somebody dies.\nChandler: That is so weird, because every time I go to the dentist, I look down the hygienists blouse.\nRachel: Phoebe, what? Umm...what?!\nPhoebe: Yeah, yeah, first there was my aunt Mary, and then there was umm, John, my mailman, and then my, my cowboy friend Albino Bob.\nRachel: And all these people actually died?\nPhoebe: Yes, while I was in the chair! Thats why I take such good care of my teeth now, y'know, its not about oral hygiene, I floss to save lives!\nRoss: Pheebs, come on, you didnt kill anybody, these people just happened to die when you went to the dentist. Its, its, its just ah, a coincidence.\nPhoebe: Well tell that to them. Oh! You cant, their dead.\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Phoebe, Chandler, and Ross are there, Rachel is serving brownies.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Here you go Pheebs. Who else wants one of my special homemade brownies? "}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "I will have one. (Ross and him both take one.)"}, {"line_number": 4, "type": "action", "text": "(Phoebe takes a bite and spits it out and screams.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Okay, Im not gonna have one."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Neither will I. (they both put back the brownies.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "No, no, its just my tooth."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "All right Ill have one. (he and Ross take another brownie,)"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "So whats a matter, you need a dentist? Ive got a good one."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "No thanks, I have a good one too. I just, I, I cant see him."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "See that is the problem with invisible dentists."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Why? Why cant you go to him?"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Because, every time I go to the dentist, somebody dies."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "That is so weird, because every time I go to the dentist, I look down the hygienists blouse."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe, what? Umm...what?!"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, yeah, first there was my aunt Mary, and then there was umm, John, my mailman, and then my, my cowboy friend Albino Bob."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "And all these people actually died?"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, while I was in the chair! Thats why I take such good care of my teeth now, y'know, its not about oral hygiene, I floss to save lives!"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Pheebs, come on, you didnt kill anybody, these people just happened to die when you went to the dentist. Its, its, its just ah, a coincidence."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Well tell that to them. Oh! You cant, their dead."}, {"line_number": 21, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 3, "scene_id": "S03E08_003", "location": "Central Perk", "scene_description": "Ross, Rachel, and Phoebe are there.", "characters": ["Gunther", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_003", "raw_text": "[Scene: Central Perk, Ross, Rachel, and Phoebe are there.]\nRoss: Thanks, Gunther. (takes the plate Gunther serves him and Rachel comes up and kisses him) (to Rachel) Hey! (to Gunther) Umm, can I get a napkin too?\nGunther: Oh, like you dont already have everything.\nPhoebe: (trying to bite into an apple) Ow! Ow! (drops the apple in disgust.)\nRachel: Phoebe, your in pain, would you just go to the dentist, just go.\nPhoebe: All right, fine, fine, but if youre my next victim, dont come back as a poltergeist and like suck me into the TV set.\nRachel: I promise.\nPhoebe: Although, dont feel like you cant visit.\nJoey: (entering with Monica) Hey, is, is, is Chandler here?\nRoss: (patting his clothes like he is looking for his wallet) No, no hes not.\nMonica: You guys, Joey just saw Janice kissing her ex-husband.\nRoss: What? (to Joey) So what are you going to do? I mean how, how are you going to tell Chandler?\nJoey: Well, I was thinking about that and I, I think the best way would be, to not.\nRachel: Joey, you cant keep this to yourself, if you know about this, you have to tell him.\nJoey: Itll kill him. I mean itll, itll just kill him.\nPhoebe: Well, you could wait til I go to the dentist, maybe Ill kill him.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross, Rachel, and Phoebe are there.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Thanks, Gunther. (takes the plate Gunther serves him and Rachel comes up and kisses him) (to Rachel) Hey! (to Gunther) Umm, can I get a napkin too?"}, {"line_number": 3, "type": "dialogue", "speaker": "Gunther", "text": "Oh, like you dont already have everything."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "(trying to bite into an apple) Ow! Ow! (drops the apple in disgust.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe, your in pain, would you just go to the dentist, just go."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "All right, fine, fine, but if youre my next victim, dont come back as a poltergeist and like suck me into the TV set."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "I promise."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Although, dont feel like you cant visit."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "(entering with Monica) Hey, is, is, is Chandler here?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "(patting his clothes like he is looking for his wallet) No, no hes not."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "You guys, Joey just saw Janice kissing her ex-husband."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "What? (to Joey) So what are you going to do? I mean how, how are you going to tell Chandler?"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Well, I was thinking about that and I, I think the best way would be, to not."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Joey, you cant keep this to yourself, if you know about this, you have to tell him."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Itll kill him. I mean itll, itll just kill him."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Well, you could wait til I go to the dentist, maybe Ill kill him."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 4, "scene_id": "S03E08_004", "location": "Monica and Rachel's", "scene_description": "All are there except for Chandler.", "characters": ["Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_004", "raw_text": "[Scene: Monica and Rachel's, All are there except for Chandler.]\nJoey: (looking out the window) Ewww! Ugly Naked Guy is using his new hammock. Its like a Play-Doo Fat Factory. \nPhoebe: Well, Im going to the dentist, so listen, okay, just be on the look out for anything that, that, that you can fall into, or, or that can fall on you, or... All right, just look out! Okay, And um, I also just wanna, I just wanna tell you all that um...... (starts to cry and runs out)\nRoss: Okay, I have a problem I have to go into work for a few hours, some kids messed up the Homo Sapien display.\nJoey: What did they do?\nRoss: Well, they painted over the word Sapien for one thing, then they rearranged the figures, lets just leave it at that.\nMonica: So, do you want me to watch Ben for you?\nRoss: Yes, thats what I was going to ask, thank you.\nRachel: Whoa! Wait! Hello! What about me?\nRoss: You? You! Want to watch Ben? (in the background Monica mouths Dont worry, Ill be here the whole time. to Ross.) Yes! Thatd be great, no, I just wanted to ask Monica, because I know how empty her life is. (Monica sarcastically mouths Yeah! and holds up her thumb.)\nJoey: Hey-hey, Ross?\nRoss: Yeah.\nJoey: Ive got a science question.\nRoss: Hmm?\nJoey: If the Homo Sapiens, were in fact Homo-sapien, is that why there extinct?\nRoss: Joey, Homo Sapiens are people.\nJoey: Hey-hey, Im not judging.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, All are there except for Chandler.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(looking out the window) Ewww! Ugly Naked Guy is using his new hammock. Its like a Play-Doo Fat Factory. "}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Well, Im going to the dentist, so listen, okay, just be on the look out for anything that, that, that you can fall into, or, or that can fall on you, or... All right, just look out! Okay, And um, I also just wanna, I just wanna tell you all that um...... (starts to cry and runs out)"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Okay, I have a problem I have to go into work for a few hours, some kids messed up the Homo Sapien display."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "What did they do?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Well, they painted over the word Sapien for one thing, then they rearranged the figures, lets just leave it at that."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "So, do you want me to watch Ben for you?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Yes, thats what I was going to ask, thank you."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Whoa! Wait! Hello! What about me?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "You? You! Want to watch Ben? (in the background Monica mouths Dont worry, Ill be here the whole time. to Ross.) Yes! Thatd be great, no, I just wanted to ask Monica, because I know how empty her life is. (Monica sarcastically mouths Yeah! and holds up her thumb.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Hey-hey, Ross?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Ive got a science question."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Hmm?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "If the Homo Sapiens, were in fact Homo-sapien, is that why there extinct?"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Joey, Homo Sapiens are people."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Hey-hey, Im not judging."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 5, "scene_id": "S03E08_005", "location": "Monica and Rachel's", "scene_description": "Monica and Rachel are babysitting Ben.", "characters": ["Monica", "Monica and Rachel", "Rachel"], "firestore_path": "/episodes/S03E08/scenes/S03E08_005", "raw_text": "[Scene: Monica and Rachel's, Monica and Rachel are babysitting Ben.]\nRachel: (holding Ben) Look Benny, spoon. (moves it back and forth) Spoon. Come on! All right, y'know what I think hes bored.\nMonica: Here. Ben, do you wanna play the airplane game, do you wanna show Rachel? Come here. (takes Ben) Were gonna do something fun. Okay. (throws Ben up in the air a little bit and catches him) Weee!! (moves into the living room and does it again) Weee!! (starts to walk back into the kitchen as she does it again, and hits Bens head on that wooden beam across the ceiling.)\n[cut to later]\nMonica: (to Ben) Whos so brave, youre so brave, yes you are, youre so brave.\nRachel: Okay. Okay honey, hes fine, hes fine, lets just put him down. Come here, Ben. (sets him on the couch) See thats a good boy. (to Monica) How could you do that to him!! Ross trusted me, what is he going to say?!\nMonica: Hes not gonna say anything, because were not gonna tell him.\nRachel: Were not?!\nMonica: No were not.\nRachel: All right, I like that. \nMonica: Okay.\nRachel: So were okay, were okay, were okay, (starts to exam Ben) arent we? No, were not okay, were not okay, theres a bump, theres a bump.\nMonica: Oh my God! Well push it in! Push it in!\nRachel: I cannot push it in!\nMonica: Okay, were gonna need a distraction.\nRachel: Okay, okay, okay.\nMonica: I got it!\nRachel: Okay.\nMonica: The second that Ross walks in that door, I want you take him back to your bedroom and do whatever it is that you do that makes him go, (high pitched) rweee!!\nRachel: Or. We could put a hat on his head.\nMonica: A hat! Yes! We need a hat.\nRachel: We need a hat..\nMonica: Where are we gonna find a tiny little hat?\nRachel: Oh, oh, oh, Ill get Rainy Day Bear!! (runs to get him)\nMonica: Because hell know what to do? (Rachel comes out of her room with a bear thats dressed in a rain suit.) Oh my God, youre a genius!\nRachel: Oh God, oh God, its sowed on though.\nMonica: Give it. Give it.\nRachel: Okay.\n(Monica takes the bear, grabs his hat, and rips off his head.)\nMonica and Rachel: Oh!!\nRachel: Oh, its just like a bloodbath in here today.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Monica and Rachel are babysitting Ben.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(holding Ben) Look Benny, spoon. (moves it back and forth) Spoon. Come on! All right, y'know what I think hes bored."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Here. Ben, do you wanna play the airplane game, do you wanna show Rachel? Come here. (takes Ben) Were gonna do something fun. Okay. (throws Ben up in the air a little bit and catches him) Weee!! (moves into the living room and does it again) Weee!! (starts to walk back into the kitchen as she does it again, and hits Bens head on that wooden beam across the ceiling.)"}, {"line_number": 4, "type": "narration", "text": "[cut to later]"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(to Ben) Whos so brave, youre so brave, yes you are, youre so brave."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Okay. Okay honey, hes fine, hes fine, lets just put him down. Come here, Ben. (sets him on the couch) See thats a good boy. (to Monica) How could you do that to him!! Ross trusted me, what is he going to say?!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Hes not gonna say anything, because were not gonna tell him."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Were not?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "No were not."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "All right, I like that. "}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "So were okay, were okay, were okay, (starts to exam Ben) arent we? No, were not okay, were not okay, theres a bump, theres a bump."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! Well push it in! Push it in!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "I cannot push it in!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Okay, were gonna need a distraction."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Okay, okay, okay."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "I got it!"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "The second that Ross walks in that door, I want you take him back to your bedroom and do whatever it is that you do that makes him go, (high pitched) rweee!!"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Or. We could put a hat on his head."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "A hat! Yes! We need a hat."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "We need a hat.."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Where are we gonna find a tiny little hat?"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Oh, oh, oh, Ill get Rainy Day Bear!! (runs to get him)"}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Because hell know what to do? (Rachel comes out of her room with a bear thats dressed in a rain suit.) Oh my God, youre a genius!"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Oh God, oh God, its sowed on though."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Give it. Give it."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 29, "type": "action", "text": "(Monica takes the bear, grabs his hat, and rips off his head.)"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica and Rachel", "text": "Oh!!"}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Oh, its just like a bloodbath in here today."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 6, "scene_id": "S03E08_006", "location": "The street", "scene_description": "Chandler and Joey are walking past a jewelery store.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E08/scenes/S03E08_006", "raw_text": "[Scene: The street, Chandler and Joey are walking past a jewelery store.]\nChandler: Hey! Hold on a minute, hold on a second. Do you think these pearls are nice?\nJoey: Id really prefer a mountain bike.\nChandler: Janices birthday is coming up, I want to get her something speacial. Come in here with me.\nJoey: Whoa, whoa, whoa, wait, whoa. Do you ah, want to get her something speacial, get her flowers, get her candy, get her gum, girls love gum.\nChandler: Thats a good idea, Dear Janice have a Hubba-Bubba birthday. I would like to get her something serious.\nJoey: Oh, you want something serious. Y'know what you should do, you should get her one of those um, barium enemas. Those are dead serious.\nChandler: All right. Look, Im gonna go in here, and you dont buy me anything ever. (starts to go into the store)\nJoey: (stopping him) No, no, you cant, you cant, okay, you cant, you cant buy her pearls, you just cant, you cant, you cant.\nChandler: Why not?!\nJoey: Oh God. Uh, okay, heres the thing, this is the thing, okay, the thing is...\nChandler: What is the thing?\nJoey: Okay. I went down to the Mattress King showroom and, and I saw Janice, kissing her ex-husband.\nChandler: (shocked) What?\nJoey: They were in his office.\nChandler: Well she, she wouldnt do that, shes with, shes with me.\nJoey: Im telling you man, I saw it.\nChandler: Yeah, well, youre wrong! Okay, youre wrong.\nJoey: Im not wrong! I wish I was. Im sorry. Bet that barium enema doesnt sound so bad now, huh?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The street, Chandler and Joey are walking past a jewelery store.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Hold on a minute, hold on a second. Do you think these pearls are nice?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Id really prefer a mountain bike."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Janices birthday is coming up, I want to get her something speacial. Come in here with me."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Whoa, whoa, whoa, wait, whoa. Do you ah, want to get her something speacial, get her flowers, get her candy, get her gum, girls love gum."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Thats a good idea, Dear Janice have a Hubba-Bubba birthday. I would like to get her something serious."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Oh, you want something serious. Y'know what you should do, you should get her one of those um, barium enemas. Those are dead serious."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "All right. Look, Im gonna go in here, and you dont buy me anything ever. (starts to go into the store)"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "(stopping him) No, no, you cant, you cant, okay, you cant, you cant buy her pearls, you just cant, you cant, you cant."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Why not?!"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Oh God. Uh, okay, heres the thing, this is the thing, okay, the thing is..."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "What is the thing?"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Okay. I went down to the Mattress King showroom and, and I saw Janice, kissing her ex-husband."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "(shocked) What?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "They were in his office."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Well she, she wouldnt do that, shes with, shes with me."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Im telling you man, I saw it."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, well, youre wrong! Okay, youre wrong."}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Im not wrong! I wish I was. Im sorry. Bet that barium enema doesnt sound so bad now, huh?"}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 7, "scene_id": "S03E08_007", "location": "Monica and Rachel's", "scene_description": "Monica and Rachel are dressing up Ben in the entire rain suit from Rainy Day Bear.", "characters": ["Ben", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E08/scenes/S03E08_007", "raw_text": "[Scene: Monica and Rachel's, Monica and Rachel are dressing up Ben in the entire rain suit from Rainy Day Bear.]\nMonica: It just makes more sense as an ensemble.\nRachel: Right.\nMonica: Besides, it takes the focus off the hat.\nPhoebe: (running through the door) No! Oh! Youre alive! Youre alive!\nRachel: See Pheebs, I promised you no one would die, didnt I?\nPhoebe: Yeah, well, well see about that. Can I use your phone? I just wanna call everyone I know.\nMonica: Sure, we have no money, go ahead.\nPhoebe: (on phone) Hey! Youre not dead! Okay, see ya!\nBen: Monica.\nMonica: Oh my God! He just said my name! Did you hear that?\nBen: Monica bang!\nRachel: Okay, I heard that.\nMonica: Did he just say Monica bang?\nRachel: Uh-huh.\nMonica: Oh my God! Hes gonna rat me out!\nBen: Monica bang!\nMonica: Oh-ho-ho, sweetie, sweetie, you gotta stop saying that, now. Its no big deal, its not even worth mentioning, you see we all do it all the time. See watch this, Ben, Ben, Ben. (goes over and starts hitting her head on the post) Ow, Monica bang! (does it again) Everybody bang. (repeats) Ben bang. (repeats) Rachel bang. (repeats) Bang, Rachel bang! Oh, isnt that fun?\nRachel: (goes over and hits her head on the post) Look at that! (repeats) Look at that! (repeats) We all do it. (repeats) Okay, Im stopping now.\nMonica: You okay?\nRachel: Oh yeah! Y'know, if its not a headboard, its just not worth it.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Monica and Rachel are dressing up Ben in the entire rain suit from Rainy Day Bear.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "It just makes more sense as an ensemble."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Right."}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Besides, it takes the focus off the hat."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "(running through the door) No! Oh! Youre alive! Youre alive!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "See Pheebs, I promised you no one would die, didnt I?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, well, well see about that. Can I use your phone? I just wanna call everyone I know."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Sure, we have no money, go ahead."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "(on phone) Hey! Youre not dead! Okay, see ya!"}, {"line_number": 10, "type": "dialogue", "speaker": "Ben", "text": "Monica."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! He just said my name! Did you hear that?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ben", "text": "Monica bang!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Okay, I heard that."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Did he just say Monica bang?"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Uh-huh."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! Hes gonna rat me out!"}, {"line_number": 17, "type": "dialogue", "speaker": "Ben", "text": "Monica bang!"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Oh-ho-ho, sweetie, sweetie, you gotta stop saying that, now. Its no big deal, its not even worth mentioning, you see we all do it all the time. See watch this, Ben, Ben, Ben. (goes over and starts hitting her head on the post) Ow, Monica bang! (does it again) Everybody bang. (repeats) Ben bang. (repeats) Rachel bang. (repeats) Bang, Rachel bang! Oh, isnt that fun?"}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "(goes over and hits her head on the post) Look at that! (repeats) Look at that! (repeats) We all do it. (repeats) Okay, Im stopping now."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "You okay?"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah! Y'know, if its not a headboard, its just not worth it."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 8, "scene_id": "S03E08_008", "location": "Chandler and Joey's", "scene_description": "Chandler is waiting for Janice to arrive, and is angrily fllipping through a magazine.", "characters": ["Chandler", "Janice", "Phoebe"], "firestore_path": "/episodes/S03E08/scenes/S03E08_008", "raw_text": "[Scene: Chandler and Joey's, Chandler is waiting for Janice to arrive, and is angrily fllipping through a magazine.]\nJanice: (entering) Hows my Bing-a-ling?\nChandler: Ah, I dont know, you tell me. Anything you ah, wanna tell me, because, if you ah, you should, if you, you would, tell me.\nJanice: Why are your eyes so white?\nChandler: You tell me! Maybe, its because I was just fooling with my ex! Oh no-no-no-no, no-no-no-no, that was you!!\nJanice: Oh my God!!\nChandler: All right!\nJanice: How did you know?\nChandler: Joey told me, he saw you two kissing.\nJanice: In the park?\nChandler: No! In his office! How many kisses were there?\nJanice: Just those two!\nChandler: Wh-wh-why, wh-why, why, why was there kissing!? There should be no kissing!!\nJanice: Oh, Im sorry honey, Im so, so, (nasally) haaaaa! Im so, so sorry, I just (nasally) haaaaaa! But I, oh what happened was, I-I-I cant breathe. Can you get me a bag, or something?\nChandler: (giving her a bag) Here.\n(Janice starts to breath into it and sucks in the reciept, and then spits it out.)\nJanice: The receipt.\nChandler: Ill take it! All right look, I gotta know. Are you finished with me? (Janice shakes her head no) Are you finished with him? (Janice shakes her head no) Do you still love him? (Janice shakes her head yes) Do you still love me? (Janice shakes her head yes) All right look, (grabs the bag) Im gonna need an actual answer here okay, so which is it, him or me? (his phone starts to ring)\nJanice: I dont know.\nPhoebe: (rushing in) Okay. If youre alive you answer your phone!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Chandler is waiting for Janice to arrive, and is angrily fllipping through a magazine.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Janice", "text": "(entering) Hows my Bing-a-ling?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Ah, I dont know, you tell me. Anything you ah, wanna tell me, because, if you ah, you should, if you, you would, tell me."}, {"line_number": 4, "type": "dialogue", "speaker": "Janice", "text": "Why are your eyes so white?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "You tell me! Maybe, its because I was just fooling with my ex! Oh no-no-no-no, no-no-no-no, that was you!!"}, {"line_number": 6, "type": "dialogue", "speaker": "Janice", "text": "Oh my God!!"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "All right!"}, {"line_number": 8, "type": "dialogue", "speaker": "Janice", "text": "How did you know?"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Joey told me, he saw you two kissing."}, {"line_number": 10, "type": "dialogue", "speaker": "Janice", "text": "In the park?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "No! In his office! How many kisses were there?"}, {"line_number": 12, "type": "dialogue", "speaker": "Janice", "text": "Just those two!"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Wh-wh-why, wh-why, why, why was there kissing!? There should be no kissing!!"}, {"line_number": 14, "type": "dialogue", "speaker": "Janice", "text": "Oh, Im sorry honey, Im so, so, (nasally) haaaaa! Im so, so sorry, I just (nasally) haaaaaa! But I, oh what happened was, I-I-I cant breathe. Can you get me a bag, or something?"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "(giving her a bag) Here."}, {"line_number": 16, "type": "action", "text": "(Janice starts to breath into it and sucks in the reciept, and then spits it out.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Janice", "text": "The receipt."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Ill take it! All right look, I gotta know. Are you finished with me? (Janice shakes her head no) Are you finished with him? (Janice shakes her head no) Do you still love him? (Janice shakes her head yes) Do you still love me? (Janice shakes her head yes) All right look, (grabs the bag) Im gonna need an actual answer here okay, so which is it, him or me? (his phone starts to ring)"}, {"line_number": 19, "type": "dialogue", "speaker": "Janice", "text": "I dont know."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "(rushing in) Okay. If youre alive you answer your phone!"}, {"line_number": 21, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 9, "scene_id": "S03E08_009", "location": "Monica and Rachel's", "scene_description": "Monica, Rachel, Phoebe, and Joey are there.", "characters": ["Ben", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_009", "raw_text": "[Scene: Monica and Rachel's, Monica, Rachel, Phoebe, and Joey are there.]\nMonica: Okay, Ben, I wont tell your daddy that you had ice cream for dinner, if you dont tell about our little bonking incident.\nRachel: Monica, number one, I dont think Ben understands the concept of bribery, and number two, I... (Joey starts laughing in the background) (to Joey) What?!\nJoey: You said number two.\nRachel: I also said number one.\nJoey: I know. (giggles harder)\nRoss: (entering) Hey! Everyone.\nRachel: Hi!\nRoss: Hows my little boy?\nRachel: Hes perfect, hes never been better.\nRoss: (noticing the outfit he is wearing) Whatd you do, take him whaling?\nBen: Monica.\nRoss: Oh my God, he just said your name, thats great! Good job Ben.\nBen: Monica bang!\nMonica: Oh thats right, thats what Id sound like if I exploded.\nPhoebe: Woo-Hoo! The curse is broken! I called everybody I know, and everyone is alive.\nJoey: Uh.\nPhoebe: What?\nJoey: Ugly Naked Guy looks awfully still. (Phoebe runs to the window and gasps.)\n[Cut to later, all except Chandler are staring out the window at Ugly Naked Guy.]\nPhoebe: Oh my God! I killed him! I killed another one! And this curse is getting stronger too, to bring down something that big.\nRachel: Well maybe hes just taking a nap.\nJoey: Im tellin ya, he hasnt moved since this morning.\nMonica: All right, we should call somebody.\nRoss: And tell them what? The naked guy we stare at all the time isnt moving.\nRachel: Well, we have gotta find out if hes alive.\nMonica: How are we gonna do that? Theres no way.\nJoey: Well, there is one way. His windows open, I say, we poke him.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Monica, Rachel, Phoebe, and Joey are there.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Okay, Ben, I wont tell your daddy that you had ice cream for dinner, if you dont tell about our little bonking incident."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Monica, number one, I dont think Ben understands the concept of bribery, and number two, I... (Joey starts laughing in the background) (to Joey) What?!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "You said number two."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "I also said number one."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "I know. (giggles harder)"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey! Everyone."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Hows my little boy?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Hes perfect, hes never been better."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "(noticing the outfit he is wearing) Whatd you do, take him whaling?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ben", "text": "Monica."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Oh my God, he just said your name, thats great! Good job Ben."}, {"line_number": 14, "type": "dialogue", "speaker": "Ben", "text": "Monica bang!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Oh thats right, thats what Id sound like if I exploded."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Woo-Hoo! The curse is broken! I called everybody I know, and everyone is alive."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Uh."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Ugly Naked Guy looks awfully still. (Phoebe runs to the window and gasps.)"}, {"line_number": 20, "type": "narration", "text": "[Cut to later, all except Chandler are staring out the window at Ugly Naked Guy.]"}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God! I killed him! I killed another one! And this curse is getting stronger too, to bring down something that big."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Well maybe hes just taking a nap."}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Im tellin ya, he hasnt moved since this morning."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "All right, we should call somebody."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "And tell them what? The naked guy we stare at all the time isnt moving."}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Well, we have gotta find out if hes alive."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "How are we gonna do that? Theres no way."}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "Well, there is one way. His windows open, I say, we poke him."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 10, "scene_id": "S03E08_010", "location": "Chandler and Joey's", "scene_description": "Chandler is throwing darts, as Joey enters.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E08/scenes/S03E08_010", "raw_text": "[Scene: Chandler and Joey's, Chandler is throwing darts, as Joey enters.]\nJoey: Hey! Y'know how we ah, save all those chopsticks for no reason we get when we get Chinese food?\nChandler: Yeah.\nJoey: Well, now we got a reason.\nChandler: What?\nJoey: Well, were fashioning a very long poking device.\nChandler: All right.\nJoey: Hey uh, whats a matter?\nChandler: I talked to Janice.\nJoey: Oh my God, is she going back to him?\nChandler: She doesnt know. Says she loves us both. Y'know I woke up this morning and I was in love, well I was happy. Y'know it serves me right for buying that twelve pack of condoms. And now I cant even return them, because she choked on the reciept!\nJoey: What are you ah, what are you gonna do?\nChandler: I dont know, y'know. What, what, would you do?\nJoey: Well, it doesnt matter what I would do.\nChandler: Come on, tell me.\nJoey: All right, youre probably not gonna want to hear this but ah, if it was me, and this is just me, (Chandler gets ready to throw another dart) I would ah, I would bow out.\nChandler: What? (turns around quickly still ready to throw the dart and Joey quickly ducks and hides behind the chair) What are you, what are you talking about?\nJoey: They have a kid together, y'know. Theyre like, theyre like a family, and if, I dont know, theres chance they could make that work, I know I wouldnt want to be the guy who stood in the way of that. Are you okay? Do you wanna ah, come poke a nude guy?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Chandler is throwing darts, as Joey enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey! Y'know how we ah, save all those chopsticks for no reason we get when we get Chinese food?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Yeah."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Well, now we got a reason."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Well, were fashioning a very long poking device."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "All right."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Hey uh, whats a matter?"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "I talked to Janice."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Oh my God, is she going back to him?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "She doesnt know. Says she loves us both. Y'know I woke up this morning and I was in love, well I was happy. Y'know it serves me right for buying that twelve pack of condoms. And now I cant even return them, because she choked on the reciept!"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "What are you ah, what are you gonna do?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "I dont know, y'know. What, what, would you do?"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Well, it doesnt matter what I would do."}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Come on, tell me."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "All right, youre probably not gonna want to hear this but ah, if it was me, and this is just me, (Chandler gets ready to throw another dart) I would ah, I would bow out."}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "What? (turns around quickly still ready to throw the dart and Joey quickly ducks and hides behind the chair) What are you, what are you talking about?"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "They have a kid together, y'know. Theyre like, theyre like a family, and if, I dont know, theres chance they could make that work, I know I wouldnt want to be the guy who stood in the way of that. Are you okay? Do you wanna ah, come poke a nude guy?"}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 11, "scene_id": "S03E08_011", "location": "Monica and Rachel's", "scene_description": "Ross has just finished putting Ben to sleep, and is entering from Rachels room.", "characters": ["Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_011", "raw_text": "[Scene: Monica and Rachel's, Ross has just finished putting Ben to sleep, and is entering from Rachels room.]\nRoss: Well, hes finally alseep. About that ah, bump on his head?\nRachel: Are you, are you, are you sure its ah, a new bump? I mean, no offense, Ive always thought of Ben as a fairly bumpy headed child.\nRoss: Its okay if he bumps his head, kids bump their heads all the time, y'know, it was your first time babysitting, I figured you did the best you could.\nRachel: (confidently) I did!\nRoss: I know! Im saying you have to watch them all the time.\nRachel: I did!! I watched! I watched! I watched Monica bang his head against that thing!\nRoss: Monica did it?\n(Monica runs into the kitchen from the terrace.)\nRoss: Monica?\nMonica: Yeah.\nRoss: Umm, did you notice anything wierd about Ben today?\nMonica: No. Why?\nRoss: Well, I was just playing with him, and y'know we were doing the alphabet song, which he used to be really good at, but suddenly hes leaving out e and f. Its like they just ah, I dont know, fell out of his head.\nMonica: Really?!\nRoss: Oh, and also, hes, hes walkin kind of funny, his left leg is moving a lot faster than his right leg, and hes in there just sort of y'know... (walks around in a circle) \nMonica: Oh my God, I wrecked your baby!! (runs into the bedroom)\nRachel: I hope its still funny when youre in hell.\nMonica: (coming out of the bedroom) You jerk! You know how much I love that kid! (starts to chase Ross around the living room)\nRoss: Monica bang! Monica bang! (runs into one of the posts) Ow!\nRachel: Ill get the hat.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Ross has just finished putting Ben to sleep, and is entering from Rachels room.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Well, hes finally alseep. About that ah, bump on his head?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Are you, are you, are you sure its ah, a new bump? I mean, no offense, Ive always thought of Ben as a fairly bumpy headed child."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Its okay if he bumps his head, kids bump their heads all the time, y'know, it was your first time babysitting, I figured you did the best you could."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "(confidently) I did!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "I know! Im saying you have to watch them all the time."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "I did!! I watched! I watched! I watched Monica bang his head against that thing!"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Monica did it?"}, {"line_number": 9, "type": "action", "text": "(Monica runs into the kitchen from the terrace.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Monica?"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Yeah."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Umm, did you notice anything wierd about Ben today?"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "No. Why?"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Well, I was just playing with him, and y'know we were doing the alphabet song, which he used to be really good at, but suddenly hes leaving out e and f. Its like they just ah, I dont know, fell out of his head."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Really?!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Oh, and also, hes, hes walkin kind of funny, his left leg is moving a lot faster than his right leg, and hes in there just sort of y'know... (walks around in a circle) "}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Oh my God, I wrecked your baby!! (runs into the bedroom)"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "I hope its still funny when youre in hell."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "(coming out of the bedroom) You jerk! You know how much I love that kid! (starts to chase Ross around the living room)"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Monica bang! Monica bang! (runs into one of the posts) Ow!"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Ill get the hat."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 12, "scene_id": "S03E08_012", "location": "Central Perk", "scene_description": "Chandler and Janice are there.", "characters": ["Chandler", "Gunther", "Janice"], "firestore_path": "/episodes/S03E08/scenes/S03E08_012", "raw_text": "[Scene: Central Perk, Chandler and Janice are there.]\nChandler: Janice, I have something I need to tell you, and I want you to let me get through it, because its, its, its not gonna be easy.\nJanice: Okay.\nChandler: I think you should go back with Gary. I dont wanna be the guy that breaks up a family, y'know when my parents split up, it was because of that guy. Whenever I would see him I was always think y'know Youre the reason, you are the reason why their not together. and I hated that guy. And it didnt matter how nice he was, or how happy he made my Dad.\nJanice: Wow!\nChandler: Yeah, well. Its the right thing to do.\nJanice: Oh! Youre right. Oh God. But, before I can say good-bye, theres something I really need you to know, Chandler. The way I feel about you, its like, I finally understand what Lionel Richies been singing about. Y'know, I mean what we have, its like movie love, youre my soulmate, and I cant believe were not going to be spending the rest of our lives together.\nChandler: Then dont leave me!\nJanice: What?\nChandler: Forget what I said, I was babbling! Pick me!\nJanice: No, you were right, you were right. I mean, I-I-Ive got to give my marriage another chance.\nChandler: No you dont! No, no, no, I say you have to give your divorce another chance.\nJanice: (standing up) Im sorry. (hugs him)\nChandler: Ohhh. Dont go.\nJanice: No, I-I-I gotta go. (she starts to walk away, but Chandler doesnt let her go.)\nChandler: No. No! No! No!\nJanice: Honey, honey, people are looking.\nChandler: I dont care! (turns around and to the people watching them) I dont care!!\nJanice: Yeah, um, Im, Im leaving now. (tries to get her leg out of Chandlers grasp, she finally does, but Chandler takes off her shoe.)\nChandler: You cant leave! I have your shoe!\nJanice: Good-bye Chandler Bing. (walks out with one shoe)\nGunther: Rachel has those in burgendy.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler and Janice are there.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Janice, I have something I need to tell you, and I want you to let me get through it, because its, its, its not gonna be easy."}, {"line_number": 3, "type": "dialogue", "speaker": "Janice", "text": "Okay."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "I think you should go back with Gary. I dont wanna be the guy that breaks up a family, y'know when my parents split up, it was because of that guy. Whenever I would see him I was always think y'know Youre the reason, you are the reason why their not together. and I hated that guy. And it didnt matter how nice he was, or how happy he made my Dad."}, {"line_number": 5, "type": "dialogue", "speaker": "Janice", "text": "Wow!"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, well. Its the right thing to do."}, {"line_number": 7, "type": "dialogue", "speaker": "Janice", "text": "Oh! Youre right. Oh God. But, before I can say good-bye, theres something I really need you to know, Chandler. The way I feel about you, its like, I finally understand what Lionel Richies been singing about. Y'know, I mean what we have, its like movie love, youre my soulmate, and I cant believe were not going to be spending the rest of our lives together."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Then dont leave me!"}, {"line_number": 9, "type": "dialogue", "speaker": "Janice", "text": "What?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Forget what I said, I was babbling! Pick me!"}, {"line_number": 11, "type": "dialogue", "speaker": "Janice", "text": "No, you were right, you were right. I mean, I-I-Ive got to give my marriage another chance."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "No you dont! No, no, no, I say you have to give your divorce another chance."}, {"line_number": 13, "type": "dialogue", "speaker": "Janice", "text": "(standing up) Im sorry. (hugs him)"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Ohhh. Dont go."}, {"line_number": 15, "type": "dialogue", "speaker": "Janice", "text": "No, I-I-I gotta go. (she starts to walk away, but Chandler doesnt let her go.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "No. No! No! No!"}, {"line_number": 17, "type": "dialogue", "speaker": "Janice", "text": "Honey, honey, people are looking."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "I dont care! (turns around and to the people watching them) I dont care!!"}, {"line_number": 19, "type": "dialogue", "speaker": "Janice", "text": "Yeah, um, Im, Im leaving now. (tries to get her leg out of Chandlers grasp, she finally does, but Chandler takes off her shoe.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "You cant leave! I have your shoe!"}, {"line_number": 21, "type": "dialogue", "speaker": "Janice", "text": "Good-bye Chandler Bing. (walks out with one shoe)"}, {"line_number": 22, "type": "dialogue", "speaker": "Gunther", "text": "Rachel has those in burgendy."}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 13, "scene_id": "S03E08_013", "location": "Monica and Rachel's", "scene_description": "Joey, Rachel, Monica, Phoebe, and Ross are holding the giant poking device.", "characters": ["Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E08/scenes/S03E08_013", "raw_text": "[Scene: Monica and Rachel's, Joey, Rachel, Monica, Phoebe, and Ross are holding the giant poking device.]\nJoey: All right now remember, something this big and long is going to be difficult to manuver, fortunately I have a lot of experience in that area.\nRoss: Can we please focus here, a naked mans life hangs in the balance!\nPhoebe: Im telling you hes dead. What we are about to have here is a dead fat guy on a stick.\nJoey: All right, ladies and gentlemen, lets poke. (they start to advance the giant poking device) Steady. Steady. Okay, a little higher. Careful of the angle. Okay, okay, were approaching the window (as he says this the camera cuts to their view of Ugly Naked Guy, so that we actually see him!) Thread the needle. Thread the needle. \n(They thread the needle and start poking him, he then stirs.)\nPhoebe: Hes alive! Hes a-live!!!\nMonica: And yet, were still poking him.\nJoey: Okay, retract the device, retract the device.\nRoss: He does not look happy.\nRachel: Hey-hey, now hes showing us his poking device.\nJoey: Hey, thats never gonna make it all the way over here, buddy!\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Joey, Rachel, Monica, Phoebe, and Ross are holding the giant poking device.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "All right now remember, something this big and long is going to be difficult to manuver, fortunately I have a lot of experience in that area."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Can we please focus here, a naked mans life hangs in the balance!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Im telling you hes dead. What we are about to have here is a dead fat guy on a stick."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "All right, ladies and gentlemen, lets poke. (they start to advance the giant poking device) Steady. Steady. Okay, a little higher. Careful of the angle. Okay, okay, were approaching the window (as he says this the camera cuts to their view of Ugly Naked Guy, so that we actually see him!) Thread the needle. Thread the needle. "}, {"line_number": 6, "type": "action", "text": "(They thread the needle and start poking him, he then stirs.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Hes alive! Hes a-live!!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "And yet, were still poking him."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Okay, retract the device, retract the device."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "He does not look happy."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Hey-hey, now hes showing us his poking device."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Hey, thats never gonna make it all the way over here, buddy!"}, {"line_number": 13, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S03E08", "season": 3, "episode_number": 8, "episode_title": "THE ONE WITH THE GIANT POKING DEVICE", "scene_number": 14, "scene_id": "S03E08_014", "location": "Chandler and Joey's", "scene_description": "Chandler is listening to a Lionel Richie album", "characters": ["Chandler", "Chandler and Phoebe", "Phoebe"], "firestore_path": "/episodes/S03E08/scenes/S03E08_014", "raw_text": "[Scene: Chandler and Joey's, Chandler is listening to a Lionel Richie album]\nChandler: (singing) Ill hold you close in my arms. (Phoebe enters) I cant resist your charms. And love....\nPhoebe: (joining him) Love....\nChandler and Phoebe: Ill be a fool for you. Im sure, you know I dont mind.\nChandler: (high pitched) No you know I dont mind.\nChandler and Phoebe: Yes! You mean the world the world to me. Oh...\nChandler: I know.\nPhoebe: I know.\nChandler: Ive found.\nPhoebe: Ive found....\nChandler and Phoebe: ...in you, my endless (Phoebe goes high pitched, Chandler goes low pitched) love. (they both look at each other.) My endless love. (once again they dont match tones, and they just look at each other)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Chandler is listening to a Lionel Richie album]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(singing) Ill hold you close in my arms. (Phoebe enters) I cant resist your charms. And love...."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "(joining him) Love...."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler and Phoebe", "text": "Ill be a fool for you. Im sure, you know I dont mind."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(high pitched) No you know I dont mind."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler and Phoebe", "text": "Yes! You mean the world the world to me. Oh..."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "I know."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "I know."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Ive found."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Ive found...."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler and Phoebe", "text": "...in you, my endless (Phoebe goes high pitched, Chandler goes low pitched) love. (they both look at each other.) My endless love. (once again they dont match tones, and they just look at each other)"}, {"line_number": 12, "type": "narration", "text": "End"}]}
