{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 1, "scene_id": "S03E09_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E09/scenes/S03E09_001", "raw_text": "THE ONE WITH THE FOOTBALL\nWritten by: Ira Ungerleider Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE FOOTBALL"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Ira Ungerleider Transcribed by: Eric Aasen "}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 2, "scene_id": "S03E09_002", "location": "Monica and Rachel's", "scene_description": "the whole gang is there, the guys are watching football, the girls are cooking Thanksgiving dinner.", "characters": ["Monica", "Phoebe", "Rachel", "The Guys"], "firestore_path": "/episodes/S03E09/scenes/S03E09_002", "raw_text": "[Scene: Monica and Rachel's, the whole gang is there, the guys are watching football, the girls are cooking Thanksgiving dinner.]\nThe Guys: (reacting to a play) Yes! Yes! Yes! Yes! Awww!\nPhoebe: Hey, its your Thanksgiving too, y'know, instead of watching football, you could help.\nThe Guys: We will. (they dont move)\nMonica: Okay, Rachel, you wanna put the marshmellows in concentric circles.\nRachel: No Mon, you want to put them in concentric circles. I want to do this. \n(Rachel sticks a marshmellow into Monicas nose. Monica takes it out of her nose by closing one nostril, and blowing.)\nMonica: Every year.\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, the whole gang is there, the guys are watching football, the girls are cooking Thanksgiving dinner.]"}, {"line_number": 2, "type": "dialogue", "speaker": "The Guys", "text": "(reacting to a play) Yes! Yes! Yes! Yes! Awww!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey, its your Thanksgiving too, y'know, instead of watching football, you could help."}, {"line_number": 4, "type": "dialogue", "speaker": "The Guys", "text": "We will. (they dont move)"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Okay, Rachel, you wanna put the marshmellows in concentric circles."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "No Mon, you want to put them in concentric circles. I want to do this. "}, {"line_number": 7, "type": "action", "text": "(Rachel sticks a marshmellow into Monicas nose. Monica takes it out of her nose by closing one nostril, and blowing.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Every year."}, {"line_number": 9, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 3, "scene_id": "S03E09_003", "location": "Monica and Rachel's", "scene_description": "continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Monica and Ross", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E09/scenes/S03E09_003", "raw_text": "[Scene: Monica and Rachel's, continued from earlier.]\nPhoebe: Y'know, for once, I am going to sit down and try to watch one of these things. (just as she sits down).\nRoss: Halftime.\nJoey: Hey, who wants to ah, throw the ball around a little, maybe get a little three on three going?\nRachel: Oh! That would be sooo much fun!\nPhoebe: Oh, can I play too? Ive never played football, like ever. \nJoey: Great, you can cover Chandler.\nChandler: No, no, no, I dont, I dont really wanna play.\nJoey: Come on man! You never want to do anything since you and Janice broke up.\nChandler: Thats not true! I wanted to wear my bathrobe and eat peanut clusters all day. I wanted to start drinking in the morning. Dont say that I dont have goals!\nJoey: Chandler, you have to start getting over her. All right, if you play, you get some fresh air, maybe itll take your mind off Janice, and if you dont play, everyone will be mad at you cause the teams wont be even. Come on.\nChandler: Yeah, all right, Ill play.\nPhoebe: Yay!!\nRachel: Lets do it! Ross?\nRoss: What?\nRachel: Do you wanna play football?\nRoss: Um, Monica and I arent supposed to play football.\nJoey: Says who? Your mom?\nMonica and Ross: Yeah.\nMonica: Well, every, every Thanksgiving um, we used to have a touch football game called the Geller Bowl.\nChandler: No, no, no, you say that proudly.\nMonica: Anyway, Ross and I were always captains, and um, it got kindve competitive and one year, Geller Bowl VI, I accidentally broke Rosss nose.\nRoss: It was soo not an accident. She saw I was about to tag her, so she threw her big fat grandma arm elbow right into my face. And just keep running.\nMonica: To score the winning touchdown, by the way.\nRoss: Whoa, whoa, whoa, ho, ho, ho, you did not win the game, the touchdown didnt count, because of the spectacularly illegal, oh and by the way savage nose breaking.\nMonica: (to Chandler and Joey) I won the game.\nRoss: Oh yeah! Then how come you didnt get the Geller Cup?\nRachel: Um, there was a Geller Cup?\nRoss: Yes, it was the trophy you got if you won the game. But our Dad said, nobody won that game,  and he was sick of our fighting, so he took the trophy and.... (pauses to collect himself, as he is on the verge of tears saying this) threw it in the lake.\nChandler: And was the curse lifted?\nRoss: Anyway. Thats when our Mom said we were not to play football ever again.\nMonica: Y'know what, I think we should play a game. I mean come on, its been twelve years.\nRoss: Can I see you for a second?\n(they walk over to the sink and discuss it for a moment)\nMonica: (shouting) Once!!\nRoss: All right, were gonna play.\nChandler: But wait a minute though, how are we gonna get there, though, because my Mom wont let me cross the street.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, continued from earlier.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Y'know, for once, I am going to sit down and try to watch one of these things. (just as she sits down)."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Halftime."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Hey, who wants to ah, throw the ball around a little, maybe get a little three on three going?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh! That would be sooo much fun!"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, can I play too? Ive never played football, like ever. "}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Great, you can cover Chandler."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "No, no, no, I dont, I dont really wanna play."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Come on man! You never want to do anything since you and Janice broke up."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Thats not true! I wanted to wear my bathrobe and eat peanut clusters all day. I wanted to start drinking in the morning. Dont say that I dont have goals!"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Chandler, you have to start getting over her. All right, if you play, you get some fresh air, maybe itll take your mind off Janice, and if you dont play, everyone will be mad at you cause the teams wont be even. Come on."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, all right, Ill play."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yay!!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Lets do it! Ross?"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Do you wanna play football?"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "Um, Monica and I arent supposed to play football."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Says who? Your mom?"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica and Ross", "text": "Yeah."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Well, every, every Thanksgiving um, we used to have a touch football game called the Geller Bowl."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "No, no, no, you say that proudly."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Anyway, Ross and I were always captains, and um, it got kindve competitive and one year, Geller Bowl VI, I accidentally broke Rosss nose."}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "It was soo not an accident. She saw I was about to tag her, so she threw her big fat grandma arm elbow right into my face. And just keep running."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "To score the winning touchdown, by the way."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Whoa, whoa, whoa, ho, ho, ho, you did not win the game, the touchdown didnt count, because of the spectacularly illegal, oh and by the way savage nose breaking."}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "(to Chandler and Joey) I won the game."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Oh yeah! Then how come you didnt get the Geller Cup?"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Um, there was a Geller Cup?"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Yes, it was the trophy you got if you won the game. But our Dad said, nobody won that game,  and he was sick of our fighting, so he took the trophy and.... (pauses to collect himself, as he is on the verge of tears saying this) threw it in the lake."}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "And was the curse lifted?"}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "Anyway. Thats when our Mom said we were not to play football ever again."}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "Y'know what, I think we should play a game. I mean come on, its been twelve years."}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "Can I see you for a second?"}, {"line_number": 34, "type": "action", "text": "(they walk over to the sink and discuss it for a moment)"}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "(shouting) Once!!"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "All right, were gonna play."}, {"line_number": 37, "type": "dialogue", "speaker": "Chandler", "text": "But wait a minute though, how are we gonna get there, though, because my Mom wont let me cross the street."}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 4, "scene_id": "S03E09_004", "location": "The Park", "scene_description": "the gang is warming up for their football game.", "characters": ["All", "Chandler", "Chandler and Joey", "Joey", "Margha", "Monica", "Monica and Joey", "Monica and Ross", "Phoebe", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S03E09/scenes/S03E09_004", "raw_text": "[Scene: The Park, the gang is warming up for their football game.]\nMonica: Okay. Lets bring it in.\nRachel: Wait no, honey, honey throw it to me, throw it to me.\nRoss: Here you go. (throws her the ball)\nRachel: (knocking it down instead of catching it) That almost hit me in the face.\nJoey: All right, we have to pick captains.\nChandler: And then Tineals.\nPhoebe: Okay, so how do we decide that?\nMonica: Well, why dont we just bunny up.\nRachel, Chandler, and Joey: What?\nMonica and Ross: (holding both of their hands above their heads making rabbit ears with their fingers.) Bunny!\nMonica: Okay, looks like Ross and I are captains. Okay, so um, I bunnied first so that means I get to pick first. Joey.\nJoey: Thank you.\nRachel: Monica, Im your best friend.\nRoss: Sweetie, dont worry youll get picked. Chandler.\nRachel: Ross!\nMonica: Phoebe.\n(Phoebe kisses Rachel on the cheek, then joins her team.)\nRoss: Sweetie, now I pick you.\nRachel: You dont pick me! Youre stuck with me!\nRoss: Okay. All right. So lets see, lets play from the trash can, to the lightpost. Right. Two hand touch, well kick off.\nMonica: All right people listen, Ive got exactly twenty-eight minutes before I have to baste again.\nChandler: Wow! Just like in the pros.\nMonica: Huddle up.\nJoey: (to his team) All right, huddle up, right over here.\nPhoebe: Wait for me! Wait for me! Wait for me! Oh cool, this is my first huddle.\nMonica: Okay.\nPhoebe: Okay, so what do you guys really think of Chandler?\nMonica: Okay, Phoebe you know what youre doing right?\nPhoebe: Yeah.\nMonica: Okay, Joeys gonna catch it, and you and I are gonna block.\nPhoebe: Whats block?\nMonica: Phoebe, I thought you said you know what youre doing?\nPhoebe: I thought you meant in life.\nMonica: Break.\n(Chandler is getting ready to kick off, Ross is holding the ball between his foot and finger.)\nChandler: The ball is Janice. The ball is Janice. (goes to kick the ball but kicks Rosss foot instead.)\nRoss: Oww!! Son of a...!! Ow! Come on!\nChandler: Sorry. Im sorry. Y'know what, were just gonna throw it.\n(Chandler throws the ball to kick-off.)\nJoey: I got it. (catches the ball)\nPhoebe: Go! Go! Go!\n(Joey runs up field and fakes out Ross and scores a touchdown. His team all celebrates the touchdown.)\nMonica: Score!! 7 to nothing!\nRachel: (coming over to Ross, who is just getting up) Are you okay?\nRoss: Come on, lets go!\nMonica: Losers walk!\nRoss: Yeah, losers talk!\nChandler: No, no, no, actually losers rhyme.\n[cut to later, Rosss team has the ball.]\nChandler: (coming up under center, just like a real quarterback does, and puts his hands between Rosss legs.) Twenty-three!! Seventy-four!! (Ross stands up and looks at him) You wanna go shotgun?\nRoss: Yeah!\nChandler: (from the shotgun) Hike!\nMonica and Joey: One-Mississippi. Two-Mississippi. Three-Mississippi.\n(Rachel runs a quick slant.)\nRachel: Over here!\n(Chandler throws her the ball, which she drops.)\nRachel: (proud of her self) I almost caught that one!\nChandler: Great! Now, the score is 7 to almost 7.\nRoss: Okay, (to Chandler) this play, I want you to do a down and out to the right. Okay. Break!\nRachel: Wait, what am I gonna do?\nRoss: You, you go long.\nRachel: Wait, how long?\nRoss: Until we start to look very small.\nRachel: Okay.\nRoss: Break!!\n[cut to later, Monicas team has the ball.]\nJoey: Set....hike!\nRoss: One-Mississippi, two-Mississippi, switch! Switch! Switch!!\nChandler: No, no, no, no, no!\n(Monica throws the ball over Joeys head, its stopped from rolling away by a very beautiful woman.)\nJoey: Haaaaa! Hey-hey, thanks for stopping our ball.\nWoman: (in a foreign accent) You are playing American football?\nJoey: Yeah! Wow, your like from a whole other country.\nWoman: Im Dutch.\nJoey: Hi-hi, Im Joey.\nWoman: Im Margha.\nJoey: Im sorry Dutch, I didnt get that last little bit.\nChandler: (running up) Hey Joey, do you wanna play football or you wanna.. (sees Marhan) Hi, Im Chandler.\nMargha: Hello, Chandler.\nJoey: Her name is Dutch, and also Marklan.\nMargha: Margha.\nJoey: Mar-klan.\nMargha: Mar-gha.\nChandler: Mar-haaaan.\n[cut to Ross and Monica.]\nMonica: Come on guys! Lets go! Come on, its second down.\nRoss: Uh, hello, its third down.\nMonica: No its not, its second.\nRoss: Wow!\nMonica: Wow, what?\nRoss: It just amazes me that your still pulling stuff like this.\nMonica: Pulling what? Its second down.\nRoss: Okay, its second down. (turns away) Take all the second downs you need.\nMonica: I heard that!\nRoss: Well, I said it loud.\n[cut to Chandler, Joey, and Margha.]\nMargha: It is okay, if I stay and watch?\nChandler and Joey: Yeah! Why dont you stick around. You can sit right there.\n(she goes and sits down)\nChandler: Well, that went well.\nJoey: I think so.\nChandler: Y'know, I was thinking about ah, asking her for her number.\nJoey: Thanks man, but I think it makes a stronger statement if I ask for it myself, y'know.\nChandler: Whoa-ho, whoa! No, I was thinking about y'know for me, as a part of that whole getting over Janice thing you were talking about.\nJoey: Oh, yeah, that. All right, means that much to ya, Ill let you have her.\nChandler: Thanks. What, let me have her?! What do mean? Like if you didnt I wouldnt have a shot?\nJoey: Well I dont like to say it out loud, but, yeah! Dont feel bad man, we all have our strengths. Youre better with numbers and stuff.\nChandler: Math!! Youre giving me math! All right, look y'know what, forget about it, you go for the girl, well see who gets her.\n[cut to later, in Rosss huddle.]\nRoss: Chandler, I want you to run a post pattern to the left, okay. And sweetie..\nRachel: Yeah, I know, go long. Y'know, its like all Im doing is running back and forth from the huddle.\nRoss: Well ah, you wanna just stay out there?\nRachel: Can I see that for second.\nRoss: Yeah.\n(Rachel takes the ball from his hands and bounces it off of Rosss forehead and Chandler catches the rebound.)\nRoss: Okay. Hut! Hike!\n(Chandler runs around behind Ross, who pitches him the ball. Chandler runs upfield, and Joey knocks the ball out of his hands.)\nJoey: Fumble!\n(Joey starts to return the fumble and Chandler grabs Joeys shirt and rips it off of his back.)\nJoey: What the hells the matter with you?! This is my favourite jersey.\nChandler: Well now you have two. Hey, I am good at math.\nJoey: All right, thats it. Y'know I was still gonna let you have her. But now, forget about it. Prepare to feel very bad about yourself.\nChandler: Hey! Well, Ive been preparing for that my entire life! Or something about you thats mean!\nMonica: All right, come on guys, lets go! Tie score, and were runnin out of time. Forty-two!! Thirty-eight!! Hike! (the timer sounds as Monica throws the ball to Phoebe.)\nPhoebe: Oh I got it!! (catches the ball) Oh! Ew! Broken boob! Ow!\nJoey: Pheebs, run!\nMonica: Run, Phoebe, run!\n(Phoebe runs and scores a touchdown.)\nPhoebe: Touchdown!! Touchdown!!\nRoss: Uh, hello, the buzzer buzzed. It doesnt count.\nMonica: After the snap!\nRoss: Before the snap!\nJoey: After!!\nChandler: Before!!\nRachel: Now, does it really matter?\nAll: Yes!!\nPhoebe: Well, okay, I made a touchdown. It was my first touchdown. So?\nRoss: Oh Pheebs, thats great. It doesnt count.\nMonica: Does so count!\nRoss: Cheater, cheater, compulsive eater.\nPhoebe: Oh my God!\nMonica: Y'know what, thats fine, maybe you havent grown up, but I have.\nRoss: Oh-ho, okay.\nMonica: Dead leg!! (kicks him in the thigh.)\nRoss: Ow! Ow! Okay, okay, fine, fine! All right, you wanna win by cheating, go ahead, all right. Phoebe the touchdown does count, you win.\nPhoebe: Woo-yay!!\nMonica: No! Listen, Im not gonna go through this with you again, okay. Just once I wanna beat when you cant blame it on the broken nose, the buzzer, or the fact that you thought you were getting mono. Lets just call this, tie score and its halftime.\nRoss: Okay, first of all, I dont play with cheaters, and second of all, you know I had swollen glands!!\nMonica: Y'know what? Ill think youll play.\nRoss: Oh really! Why is that?\n[cut to Monica and Rachels.]\nMonica: Because the winner gets this!\nRoss: The Geller Cup.\nChandler: Is everybody else seeing a troll doll nailed to a two by four?\nAll: Yeah.\nChandler: Okay, good.\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Park, the gang is warming up for their football game.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Okay. Lets bring it in."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Wait no, honey, honey throw it to me, throw it to me."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Here you go. (throws her the ball)"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "(knocking it down instead of catching it) That almost hit me in the face."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "All right, we have to pick captains."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "And then Tineals."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, so how do we decide that?"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Well, why dont we just bunny up."}, {"line_number": 10, "type": "narration", "text": "Rachel, Chandler, and Joey: What?"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica and Ross", "text": "(holding both of their hands above their heads making rabbit ears with their fingers.) Bunny!"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Okay, looks like Ross and I are captains. Okay, so um, I bunnied first so that means I get to pick first. Joey."}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Thank you."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Monica, Im your best friend."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Sweetie, dont worry youll get picked. Chandler."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Ross!"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Phoebe."}, {"line_number": 18, "type": "action", "text": "(Phoebe kisses Rachel on the cheek, then joins her team.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Sweetie, now I pick you."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "You dont pick me! Youre stuck with me!"}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Okay. All right. So lets see, lets play from the trash can, to the lightpost. Right. Two hand touch, well kick off."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "All right people listen, Ive got exactly twenty-eight minutes before I have to baste again."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Wow! Just like in the pros."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "Huddle up."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "(to his team) All right, huddle up, right over here."}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Wait for me! Wait for me! Wait for me! Oh cool, this is my first huddle."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, so what do you guys really think of Chandler?"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Okay, Phoebe you know what youre doing right?"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Okay, Joeys gonna catch it, and you and I are gonna block."}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "Whats block?"}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, I thought you said you know what youre doing?"}, {"line_number": 34, "type": "dialogue", "speaker": "Phoebe", "text": "I thought you meant in life."}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Break."}, {"line_number": 36, "type": "action", "text": "(Chandler is getting ready to kick off, Ross is holding the ball between his foot and finger.)"}, {"line_number": 37, "type": "dialogue", "speaker": "Chandler", "text": "The ball is Janice. The ball is Janice. (goes to kick the ball but kicks Rosss foot instead.)"}, {"line_number": 38, "type": "dialogue", "speaker": "Ross", "text": "Oww!! Son of a...!! Ow! Come on!"}, {"line_number": 39, "type": "dialogue", "speaker": "Chandler", "text": "Sorry. Im sorry. Y'know what, were just gonna throw it."}, {"line_number": 40, "type": "action", "text": "(Chandler throws the ball to kick-off.)"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "I got it. (catches the ball)"}, {"line_number": 42, "type": "dialogue", "speaker": "Phoebe", "text": "Go! Go! Go!"}, {"line_number": 43, "type": "action", "text": "(Joey runs up field and fakes out Ross and scores a touchdown. His team all celebrates the touchdown.)"}, {"line_number": 44, "type": "dialogue", "speaker": "Monica", "text": "Score!! 7 to nothing!"}, {"line_number": 45, "type": "dialogue", "speaker": "Rachel", "text": "(coming over to Ross, who is just getting up) Are you okay?"}, {"line_number": 46, "type": "dialogue", "speaker": "Ross", "text": "Come on, lets go!"}, {"line_number": 47, "type": "dialogue", "speaker": "Monica", "text": "Losers walk!"}, {"line_number": 48, "type": "dialogue", "speaker": "Ross", "text": "Yeah, losers talk!"}, {"line_number": 49, "type": "dialogue", "speaker": "Chandler", "text": "No, no, no, actually losers rhyme."}, {"line_number": 50, "type": "narration", "text": "[cut to later, Rosss team has the ball.]"}, {"line_number": 51, "type": "dialogue", "speaker": "Chandler", "text": "(coming up under center, just like a real quarterback does, and puts his hands between Rosss legs.) Twenty-three!! Seventy-four!! (Ross stands up and looks at him) You wanna go shotgun?"}, {"line_number": 52, "type": "dialogue", "speaker": "Ross", "text": "Yeah!"}, {"line_number": 53, "type": "dialogue", "speaker": "Chandler", "text": "(from the shotgun) Hike!"}, {"line_number": 54, "type": "dialogue", "speaker": "Monica and Joey", "text": "One-Mississippi. Two-Mississippi. Three-Mississippi."}, {"line_number": 55, "type": "action", "text": "(Rachel runs a quick slant.)"}, {"line_number": 56, "type": "dialogue", "speaker": "Rachel", "text": "Over here!"}, {"line_number": 57, "type": "action", "text": "(Chandler throws her the ball, which she drops.)"}, {"line_number": 58, "type": "dialogue", "speaker": "Rachel", "text": "(proud of her self) I almost caught that one!"}, {"line_number": 59, "type": "dialogue", "speaker": "Chandler", "text": "Great! Now, the score is 7 to almost 7."}, {"line_number": 60, "type": "dialogue", "speaker": "Ross", "text": "Okay, (to Chandler) this play, I want you to do a down and out to the right. Okay. Break!"}, {"line_number": 61, "type": "dialogue", "speaker": "Rachel", "text": "Wait, what am I gonna do?"}, {"line_number": 62, "type": "dialogue", "speaker": "Ross", "text": "You, you go long."}, {"line_number": 63, "type": "dialogue", "speaker": "Rachel", "text": "Wait, how long?"}, {"line_number": 64, "type": "dialogue", "speaker": "Ross", "text": "Until we start to look very small."}, {"line_number": 65, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 66, "type": "dialogue", "speaker": "Ross", "text": "Break!!"}, {"line_number": 67, "type": "narration", "text": "[cut to later, Monicas team has the ball.]"}, {"line_number": 68, "type": "dialogue", "speaker": "Joey", "text": "Set....hike!"}, {"line_number": 69, "type": "dialogue", "speaker": "Ross", "text": "One-Mississippi, two-Mississippi, switch! Switch! Switch!!"}, {"line_number": 70, "type": "dialogue", "speaker": "Chandler", "text": "No, no, no, no, no!"}, {"line_number": 71, "type": "action", "text": "(Monica throws the ball over Joeys head, its stopped from rolling away by a very beautiful woman.)"}, {"line_number": 72, "type": "dialogue", "speaker": "Joey", "text": "Haaaaa! Hey-hey, thanks for stopping our ball."}, {"line_number": 73, "type": "dialogue", "speaker": "Woman", "text": "(in a foreign accent) You are playing American football?"}, {"line_number": 74, "type": "dialogue", "speaker": "Joey", "text": "Yeah! Wow, your like from a whole other country."}, {"line_number": 75, "type": "dialogue", "speaker": "Woman", "text": "Im Dutch."}, {"line_number": 76, "type": "dialogue", "speaker": "Joey", "text": "Hi-hi, Im Joey."}, {"line_number": 77, "type": "dialogue", "speaker": "Woman", "text": "Im Margha."}, {"line_number": 78, "type": "dialogue", "speaker": "Joey", "text": "Im sorry Dutch, I didnt get that last little bit."}, {"line_number": 79, "type": "dialogue", "speaker": "Chandler", "text": "(running up) Hey Joey, do you wanna play football or you wanna.. (sees Marhan) Hi, Im Chandler."}, {"line_number": 80, "type": "dialogue", "speaker": "Margha", "text": "Hello, Chandler."}, {"line_number": 81, "type": "dialogue", "speaker": "Joey", "text": "Her name is Dutch, and also Marklan."}, {"line_number": 82, "type": "dialogue", "speaker": "Margha", "text": "Margha."}, {"line_number": 83, "type": "dialogue", "speaker": "Joey", "text": "Mar-klan."}, {"line_number": 84, "type": "dialogue", "speaker": "Margha", "text": "Mar-gha."}, {"line_number": 85, "type": "dialogue", "speaker": "Chandler", "text": "Mar-haaaan."}, {"line_number": 86, "type": "narration", "text": "[cut to Ross and Monica.]"}, {"line_number": 87, "type": "dialogue", "speaker": "Monica", "text": "Come on guys! Lets go! Come on, its second down."}, {"line_number": 88, "type": "dialogue", "speaker": "Ross", "text": "Uh, hello, its third down."}, {"line_number": 89, "type": "dialogue", "speaker": "Monica", "text": "No its not, its second."}, {"line_number": 90, "type": "dialogue", "speaker": "Ross", "text": "Wow!"}, {"line_number": 91, "type": "dialogue", "speaker": "Monica", "text": "Wow, what?"}, {"line_number": 92, "type": "dialogue", "speaker": "Ross", "text": "It just amazes me that your still pulling stuff like this."}, {"line_number": 93, "type": "dialogue", "speaker": "Monica", "text": "Pulling what? Its second down."}, {"line_number": 94, "type": "dialogue", "speaker": "Ross", "text": "Okay, its second down. (turns away) Take all the second downs you need."}, {"line_number": 95, "type": "dialogue", "speaker": "Monica", "text": "I heard that!"}, {"line_number": 96, "type": "dialogue", "speaker": "Ross", "text": "Well, I said it loud."}, {"line_number": 97, "type": "narration", "text": "[cut to Chandler, Joey, and Margha.]"}, {"line_number": 98, "type": "dialogue", "speaker": "Margha", "text": "It is okay, if I stay and watch?"}, {"line_number": 99, "type": "dialogue", "speaker": "Chandler and Joey", "text": "Yeah! Why dont you stick around. You can sit right there."}, {"line_number": 100, "type": "action", "text": "(she goes and sits down)"}, {"line_number": 101, "type": "dialogue", "speaker": "Chandler", "text": "Well, that went well."}, {"line_number": 102, "type": "dialogue", "speaker": "Joey", "text": "I think so."}, {"line_number": 103, "type": "dialogue", "speaker": "Chandler", "text": "Y'know, I was thinking about ah, asking her for her number."}, {"line_number": 104, "type": "dialogue", "speaker": "Joey", "text": "Thanks man, but I think it makes a stronger statement if I ask for it myself, y'know."}, {"line_number": 105, "type": "dialogue", "speaker": "Chandler", "text": "Whoa-ho, whoa! No, I was thinking about y'know for me, as a part of that whole getting over Janice thing you were talking about."}, {"line_number": 106, "type": "dialogue", "speaker": "Joey", "text": "Oh, yeah, that. All right, means that much to ya, Ill let you have her."}, {"line_number": 107, "type": "dialogue", "speaker": "Chandler", "text": "Thanks. What, let me have her?! What do mean? Like if you didnt I wouldnt have a shot?"}, {"line_number": 108, "type": "dialogue", "speaker": "Joey", "text": "Well I dont like to say it out loud, but, yeah! Dont feel bad man, we all have our strengths. Youre better with numbers and stuff."}, {"line_number": 109, "type": "dialogue", "speaker": "Chandler", "text": "Math!! Youre giving me math! All right, look y'know what, forget about it, you go for the girl, well see who gets her."}, {"line_number": 110, "type": "narration", "text": "[cut to later, in Rosss huddle.]"}, {"line_number": 111, "type": "dialogue", "speaker": "Ross", "text": "Chandler, I want you to run a post pattern to the left, okay. And sweetie.."}, {"line_number": 112, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I know, go long. Y'know, its like all Im doing is running back and forth from the huddle."}, {"line_number": 113, "type": "dialogue", "speaker": "Ross", "text": "Well ah, you wanna just stay out there?"}, {"line_number": 114, "type": "dialogue", "speaker": "Rachel", "text": "Can I see that for second."}, {"line_number": 115, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 116, "type": "action", "text": "(Rachel takes the ball from his hands and bounces it off of Rosss forehead and Chandler catches the rebound.)"}, {"line_number": 117, "type": "dialogue", "speaker": "Ross", "text": "Okay. Hut! Hike!"}, {"line_number": 118, "type": "action", "text": "(Chandler runs around behind Ross, who pitches him the ball. Chandler runs upfield, and Joey knocks the ball out of his hands.)"}, {"line_number": 119, "type": "dialogue", "speaker": "Joey", "text": "Fumble!"}, {"line_number": 120, "type": "action", "text": "(Joey starts to return the fumble and Chandler grabs Joeys shirt and rips it off of his back.)"}, {"line_number": 121, "type": "dialogue", "speaker": "Joey", "text": "What the hells the matter with you?! This is my favourite jersey."}, {"line_number": 122, "type": "dialogue", "speaker": "Chandler", "text": "Well now you have two. Hey, I am good at math."}, {"line_number": 123, "type": "dialogue", "speaker": "Joey", "text": "All right, thats it. Y'know I was still gonna let you have her. But now, forget about it. Prepare to feel very bad about yourself."}, {"line_number": 124, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Well, Ive been preparing for that my entire life! Or something about you thats mean!"}, {"line_number": 125, "type": "dialogue", "speaker": "Monica", "text": "All right, come on guys, lets go! Tie score, and were runnin out of time. Forty-two!! Thirty-eight!! Hike! (the timer sounds as Monica throws the ball to Phoebe.)"}, {"line_number": 126, "type": "dialogue", "speaker": "Phoebe", "text": "Oh I got it!! (catches the ball) Oh! Ew! Broken boob! Ow!"}, {"line_number": 127, "type": "dialogue", "speaker": "Joey", "text": "Pheebs, run!"}, {"line_number": 128, "type": "dialogue", "speaker": "Monica", "text": "Run, Phoebe, run!"}, {"line_number": 129, "type": "action", "text": "(Phoebe runs and scores a touchdown.)"}, {"line_number": 130, "type": "dialogue", "speaker": "Phoebe", "text": "Touchdown!! Touchdown!!"}, {"line_number": 131, "type": "dialogue", "speaker": "Ross", "text": "Uh, hello, the buzzer buzzed. It doesnt count."}, {"line_number": 132, "type": "dialogue", "speaker": "Monica", "text": "After the snap!"}, {"line_number": 133, "type": "dialogue", "speaker": "Ross", "text": "Before the snap!"}, {"line_number": 134, "type": "dialogue", "speaker": "Joey", "text": "After!!"}, {"line_number": 135, "type": "dialogue", "speaker": "Chandler", "text": "Before!!"}, {"line_number": 136, "type": "dialogue", "speaker": "Rachel", "text": "Now, does it really matter?"}, {"line_number": 137, "type": "dialogue", "speaker": "All", "text": "Yes!!"}, {"line_number": 138, "type": "dialogue", "speaker": "Phoebe", "text": "Well, okay, I made a touchdown. It was my first touchdown. So?"}, {"line_number": 139, "type": "dialogue", "speaker": "Ross", "text": "Oh Pheebs, thats great. It doesnt count."}, {"line_number": 140, "type": "dialogue", "speaker": "Monica", "text": "Does so count!"}, {"line_number": 141, "type": "dialogue", "speaker": "Ross", "text": "Cheater, cheater, compulsive eater."}, {"line_number": 142, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God!"}, {"line_number": 143, "type": "dialogue", "speaker": "Monica", "text": "Y'know what, thats fine, maybe you havent grown up, but I have."}, {"line_number": 144, "type": "dialogue", "speaker": "Ross", "text": "Oh-ho, okay."}, {"line_number": 145, "type": "dialogue", "speaker": "Monica", "text": "Dead leg!! (kicks him in the thigh.)"}, {"line_number": 146, "type": "dialogue", "speaker": "Ross", "text": "Ow! Ow! Okay, okay, fine, fine! All right, you wanna win by cheating, go ahead, all right. Phoebe the touchdown does count, you win."}, {"line_number": 147, "type": "dialogue", "speaker": "Phoebe", "text": "Woo-yay!!"}, {"line_number": 148, "type": "dialogue", "speaker": "Monica", "text": "No! Listen, Im not gonna go through this with you again, okay. Just once I wanna beat when you cant blame it on the broken nose, the buzzer, or the fact that you thought you were getting mono. Lets just call this, tie score and its halftime."}, {"line_number": 149, "type": "dialogue", "speaker": "Ross", "text": "Okay, first of all, I dont play with cheaters, and second of all, you know I had swollen glands!!"}, {"line_number": 150, "type": "dialogue", "speaker": "Monica", "text": "Y'know what? Ill think youll play."}, {"line_number": 151, "type": "dialogue", "speaker": "Ross", "text": "Oh really! Why is that?"}, {"line_number": 152, "type": "narration", "text": "[cut to Monica and Rachels.]"}, {"line_number": 153, "type": "dialogue", "speaker": "Monica", "text": "Because the winner gets this!"}, {"line_number": 154, "type": "dialogue", "speaker": "Ross", "text": "The Geller Cup."}, {"line_number": 155, "type": "dialogue", "speaker": "Chandler", "text": "Is everybody else seeing a troll doll nailed to a two by four?"}, {"line_number": 156, "type": "dialogue", "speaker": "All", "text": "Yeah."}, {"line_number": 157, "type": "dialogue", "speaker": "Chandler", "text": "Okay, good."}, {"line_number": 158, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 5, "scene_id": "S03E09_005", "location": "The park", "scene_description": "the gang is returning to play the second half of the game.", "characters": ["Chandler", "Chandler and Joey", "Joey", "Margha", "Monica", "Phoebe", "Rachel", "Ross", "The Guys"], "firestore_path": "/episodes/S03E09/scenes/S03E09_005", "raw_text": "[Scene: The park, the gang is returning to play the second half of the game.]\nRoss: Okay, where in the hell did you get that?!\nMonica: When Mom and Dad drove you to the hospital to get your nose fixed, I swam into the lake and fished it out.\nRoss: That cup is mine!\nMonica: No its not! You want it, youre gonna have to win it!\nRachel: All right, so are we not having dinner at all?\nMonica: Come on Phoebe, lets go! Come on, its time to get serious, huddle up. Joey, keep your head in the game.\nJoey: Its hard, y'know, his huddle is closer to Dutch girl.\nMonica: All right look, if I take Chandler out of the running will you be able to focus?\nJoey: What are you gonna do?\nMonica: All right, you just make sure that Chandler catches the ball, Ill take care of the rest.\nJoey: Okay.\nMonica: Break!\nJoey: Here you go!\n(Joey throws the ball to Chandler)\nRoss: Chandler! Chandler!\n(Chandler catches the ball and starts to run upfield.)\nChandler: (to Margha) Hi.\n(just as he gets in front of Margha, Monica comes up and tackles him)\nMonica: Whoa! Whoa!! Tackled by a girl! Bet ya dont see that everyday, do ya?\nRoss: Whoa! Whoa! Whoa! Whats with the tackling?\nMonica: What?! I just touched him and he went over.\nRoss: Okay, you wanna play rough, we can play rough.\n(They both stare each other down as we hear Lets get ready to r-r-r-rum-ble!!!)\n(A long football sequence follows.)\n[Sequence 1: Monica throws the ball over Chandlers head to Joey who catches it for a touchdown, and starts to dance in celebration. Chandler then tackles him, and he starts to dance in celebration.]\n[Sequence 2: Monica runs upfield and stops, waiting for a pass. Ross runs over and pulls her pants down, steps in front of her and intercepts the pass.]\n[Sequence 3: Chandler throws a pass to Ross, who catches it. Phoebe starts screaming and runs up to him and tries to tackle him. But all she ends up doing is running around his waist and screaming.]\n[Sequence 4: Ross hikes the ball to Chandler, and the camera pans down to show Rachel standing deep in the end zone, playing with her gum. Something hits her on the head and she looks up to see where it came from.]\n[Sequence 5: Monica hands the ball off to Phoebe, who runs up field and delivers a fore-arm shiver to Chandler, knocking him over and scores the touchdown, and she yells...]\nPhoebe: I love this game!!\n[cut to Ross who walks up to Rachel who is eating a baked pretzel.]\nRoss: Hey, whered you get that?\nRachel: I went really long.\nMonica: Forty-two to twenty-one! Like the turkey, Ross is done!\nRoss: Its no surprise that your winning, cause you got to pick first, so you got the better team.\nMonica: Youre so pathetic! Why cant you just accept it, were winning because Im better than you.\n(Ross makes a Yeah. Right. sound.)\nMonica: Oh, what a great argument, exhaling! All right, y'know what, Ill prove it to you, okay. Ill trade you Joey for Rachel, and Ill still win the game.\nRoss: What?! The guys against the girls? See, thats ridiculous Monica, because Im only down by three touchdowns.\nMonica: Oh, then bring it on! Oh, unless of course your afraid you might lose to a bunch of girls.\nRoss: Fine, fine, Rachel your with Monica, Joey youre with me.\nRachel: I can not believe your trading me!!\nMonica: Come on Rach, come on. Lets see whats it like to be on a winning team for a change.\nRachel: Are you gonna let me play?\nMonica: All right then.\n[cut to the guys team.]\nMargha: (coming over) The game is over, we eat now?\nChandler: No-no-no-no, the games not over, were just switching teams.\nJoey: Yeah, Chandler finds me so intimdating that its better if were on the same team.\nRoss: Right. Okay, lets play. Lets go.\nChandler: No ah, hold on a second Joe, where do Dutch people come from?\nJoey: Ah well, the ah, Pennsylvania Dutch, come from Pennsylvania.\nChandler: And the other ah, Dutch people, they come on from somewhere near the Netherlands, right?\nJoey: Nice try. (to Margha) See the Netherlands is this make believe place where Peter Pan and Tinker Bell come from.\nMargha: Oh, my.\nRoss: Enough with geography for the insane, okay? Lets play some ball, guys.\nJoey: Whoa, whoa, no, no, I-Im not playing with this guy, now.\nChandler: Fine with me.\nRoss: Okay, y'know what, lets just cut to the chase here. Okay? Heidi, which of my boys do you like?\nChandler and Joey: What are you doing? What are you doing? What are you doing? \nMargha: Which do I like?\nRoss: Yeah, y'know for dating, general merriment, taking back to your windmill...\nMargha: Well, if I had to chose right now, which by the way I find really weird, I would have to say, Chandler.\nChandler: Yes!!\nJoey: Wait a minute! Wait a minute! She obviously didnt understand the question.\nChandler: Well, you dont you have Captain Hook explain it to her.\nMargha: Im sorry, Joey, that is my chose.\nChandler: You hear that! That is her chose, mister Ill let you have her! I win! You suck! I rule all! A mini-wave in celebration of me!! (does the wave.)\nMargha: Im now thinking I would like to change my answer to, no one.\nChandler: Wh-what?\nMargha: I now find you shallow and um, a dork. All right, bye.\nJoey: Nice going. You just saved yourself a couple months of sex.\nChandler: Y'know what, it doesnt matter, cause she picked me. Me! From now on I get the dates and you have to stay home on Saturday nights watching Ready, Set, Cook!\nRoss: Save the breakthroughs for therapy, okay. The clock is ticking. We have no time, and we are losing, we are losing to girls.\nChandler: Were not gonna lose to girls.\nRoss: Hey! Its 42-21!\nJoey: This sucks, I was just up by that much!\nMonica: Are we playing football or what? Come on you hairy-backed Marries.\n[cut to the girls huddle.]\nMonica: We have to do this. We are playing for women everywhere. Okay, just think about every lousy date that you ever had, okay, every guy who kept on the TV while youre making out...\nPhoebe: Oh my God! You dated someone with a glass eye too?!\nMonica: Come on, okay, come on this is for all womankind. Lets kill um!\nRachel: Yeah!!! Kill um!!!\nPhoebe: All right, no, well I want to kill them to, but their boys, y'know how are we gonna beat three boys?\n(Another football sequence follows)\n[Sequence 1: Chandler is running past Phoebe with the ball, Phoebe flashes him, he stops and stares dumbfounded at her. Phoebe then runs up and takes the ball away.]\n[Sequence 2: Phoebe throws the ball, and its intercepted by Joey, who starts to run up field. Rachel jumps on his back in order to try and tackle him, but she doesnt slow him down. Monica and Phoebe then both grab her legs in order to stop Joey, who still manages to fight through the tackle and score the touchdown.]\n[Sequence 3: Chandler is running with the ball, Phoebe flashes him again, but Chandler covers his eyes, and keeps running. He then runs into a tree at the end of the field.]\n[cut to the girls huddle]\nMonica: All right, we still have a minute and a half to go, and were down by two points. Two points.... (she gets interrupted by the guys, who are doing a slow-motion high five.) Phoebe you do a button-hook again. Rachel, you go long.\nRachel: No! Come on! Dont make me go long. Use me. They never cover me.\nMonica: Honey, theres a reason.\nRachel: God, Im not lame, okay. I can do something. I can throw, would you let me throw, come on this is my game too.\nPhoebe: Come on Mon, let her throw the ball.\nMonica: All right Rachel, you sweep behind, Ill pitch it to you, you throw it down field to Phoebe. All right. Break.\nRachel: Thank you! Break!\nMonica: Thirty-two! Seventy-one! Hike!\n(Phoebe snaps the ball to Monica, who pitches back to Rachel.)\nThe Guys: One-Mississippi! Two-Mississippi! Three-Mississippi!\n(They all rush toward Rachel, who panics and runs away. She runs out of the park and up along the fence, she then comes back into the park and runs past Monica, as she gets to Monica, she throws the ball at Monica, and it hits her in the eye.)\nRachel: Im so sorry! Are you okay?\nMonica: No! Im not okay!\nRachel: Im sorry, they were just all coming at me, and I didnt know what to do.\nJoey: (looking at the timer) Thirty seconds left on the timer!\nChandler: Okay, okay, so we get to take that stupid troll thing home!\nMonica: Come on! Come on! Hurry! Were running out of time! Huddle up!\nPhoebe: Okay. Oooh! Oh, this is our last huddle, yeah.\nMonica: All right, Phoebe get open. Rachel, go long.\nRachel: (on the verge of tears) Okay.\nMonica: Break!\n(In slow motion, Phoebe snaps the ball, Rachel goes long. Joey and Chandler and all over Phoebe, leaving Rachel wide open. Ross starts to rush Monica, who sees Phoebe is double covered, in desperation she throws to Rachel. We see flying through the air, and then Rachel running underneath it, then the ball, then Rachel again, then the ball, then Phoebe, Chandler, and Joey staring at it in shock. Then with the grace of Jerry Rice (no offense to Jerry Rice), Rachel catches the ball, and she stops and spikes the ball. Both Phoebe and Monica erupt in celebration.)\nRachel: (in triumph) I got a touchdown! We did it!!\nChandler: Hey-hey-hey Rachel, funny thing. Actually, the ah, end zone starts at that pole, so youre five feet short, so we win!\nPhoebe: Wait-wait-wait-wait! So, explain something to me though, if, if nobody tagged Rachel, then isnt the play still going.\n(they all start to dive for the ball and Monica and Ross grab it at the same time.)\nRoss: Let go! Let go!\nMonica: Let go! Im a tiny little woman!!\nChandler: Guys! Guys! Come on! Its Thanksgiving, its not important who wins or loses. The important thing is, (to Joey) the Dutch girl picked me! Me! Not you! Holland loves Chandler! Thank you, Amsterdam! Good night!!\nMonica: Ow!!\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The park, the gang is returning to play the second half of the game.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Okay, where in the hell did you get that?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "When Mom and Dad drove you to the hospital to get your nose fixed, I swam into the lake and fished it out."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "That cup is mine!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "No its not! You want it, youre gonna have to win it!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "All right, so are we not having dinner at all?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Come on Phoebe, lets go! Come on, its time to get serious, huddle up. Joey, keep your head in the game."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Its hard, y'know, his huddle is closer to Dutch girl."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "All right look, if I take Chandler out of the running will you be able to focus?"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "What are you gonna do?"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "All right, you just make sure that Chandler catches the ball, Ill take care of the rest."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Okay."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Break!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Here you go!"}, {"line_number": 15, "type": "action", "text": "(Joey throws the ball to Chandler)"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Chandler! Chandler!"}, {"line_number": 17, "type": "action", "text": "(Chandler catches the ball and starts to run upfield.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "(to Margha) Hi."}, {"line_number": 19, "type": "action", "text": "(just as he gets in front of Margha, Monica comes up and tackles him)"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Whoa! Whoa!! Tackled by a girl! Bet ya dont see that everyday, do ya?"}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Whoa! Whoa! Whoa! Whats with the tackling?"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "What?! I just touched him and he went over."}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "Okay, you wanna play rough, we can play rough."}, {"line_number": 24, "type": "action", "text": "(They both stare each other down as we hear Lets get ready to r-r-r-rum-ble!!!)"}, {"line_number": 25, "type": "action", "text": "(A long football sequence follows.)"}, {"line_number": 26, "type": "narration", "text": "[Sequence 1: Monica throws the ball over Chandlers head to Joey who catches it for a touchdown, and starts to dance in celebration. Chandler then tackles him, and he starts to dance in celebration.]"}, {"line_number": 27, "type": "narration", "text": "[Sequence 2: Monica runs upfield and stops, waiting for a pass. Ross runs over and pulls her pants down, steps in front of her and intercepts the pass.]"}, {"line_number": 28, "type": "narration", "text": "[Sequence 3: Chandler throws a pass to Ross, who catches it. Phoebe starts screaming and runs up to him and tries to tackle him. But all she ends up doing is running around his waist and screaming.]"}, {"line_number": 29, "type": "narration", "text": "[Sequence 4: Ross hikes the ball to Chandler, and the camera pans down to show Rachel standing deep in the end zone, playing with her gum. Something hits her on the head and she looks up to see where it came from.]"}, {"line_number": 30, "type": "narration", "text": "[Sequence 5: Monica hands the ball off to Phoebe, who runs up field and delivers a fore-arm shiver to Chandler, knocking him over and scores the touchdown, and she yells...]"}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "I love this game!!"}, {"line_number": 32, "type": "narration", "text": "[cut to Ross who walks up to Rachel who is eating a baked pretzel.]"}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "Hey, whered you get that?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "I went really long."}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Forty-two to twenty-one! Like the turkey, Ross is done!"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Its no surprise that your winning, cause you got to pick first, so you got the better team."}, {"line_number": 37, "type": "dialogue", "speaker": "Monica", "text": "Youre so pathetic! Why cant you just accept it, were winning because Im better than you."}, {"line_number": 38, "type": "action", "text": "(Ross makes a Yeah. Right. sound.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Monica", "text": "Oh, what a great argument, exhaling! All right, y'know what, Ill prove it to you, okay. Ill trade you Joey for Rachel, and Ill still win the game."}, {"line_number": 40, "type": "dialogue", "speaker": "Ross", "text": "What?! The guys against the girls? See, thats ridiculous Monica, because Im only down by three touchdowns."}, {"line_number": 41, "type": "dialogue", "speaker": "Monica", "text": "Oh, then bring it on! Oh, unless of course your afraid you might lose to a bunch of girls."}, {"line_number": 42, "type": "dialogue", "speaker": "Ross", "text": "Fine, fine, Rachel your with Monica, Joey youre with me."}, {"line_number": 43, "type": "dialogue", "speaker": "Rachel", "text": "I can not believe your trading me!!"}, {"line_number": 44, "type": "dialogue", "speaker": "Monica", "text": "Come on Rach, come on. Lets see whats it like to be on a winning team for a change."}, {"line_number": 45, "type": "dialogue", "speaker": "Rachel", "text": "Are you gonna let me play?"}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "All right then."}, {"line_number": 47, "type": "narration", "text": "[cut to the guys team.]"}, {"line_number": 48, "type": "dialogue", "speaker": "Margha", "text": "(coming over) The game is over, we eat now?"}, {"line_number": 49, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no-no, the games not over, were just switching teams."}, {"line_number": 50, "type": "dialogue", "speaker": "Joey", "text": "Yeah, Chandler finds me so intimdating that its better if were on the same team."}, {"line_number": 51, "type": "dialogue", "speaker": "Ross", "text": "Right. Okay, lets play. Lets go."}, {"line_number": 52, "type": "dialogue", "speaker": "Chandler", "text": "No ah, hold on a second Joe, where do Dutch people come from?"}, {"line_number": 53, "type": "dialogue", "speaker": "Joey", "text": "Ah well, the ah, Pennsylvania Dutch, come from Pennsylvania."}, {"line_number": 54, "type": "dialogue", "speaker": "Chandler", "text": "And the other ah, Dutch people, they come on from somewhere near the Netherlands, right?"}, {"line_number": 55, "type": "dialogue", "speaker": "Joey", "text": "Nice try. (to Margha) See the Netherlands is this make believe place where Peter Pan and Tinker Bell come from."}, {"line_number": 56, "type": "dialogue", "speaker": "Margha", "text": "Oh, my."}, {"line_number": 57, "type": "dialogue", "speaker": "Ross", "text": "Enough with geography for the insane, okay? Lets play some ball, guys."}, {"line_number": 58, "type": "dialogue", "speaker": "Joey", "text": "Whoa, whoa, no, no, I-Im not playing with this guy, now."}, {"line_number": 59, "type": "dialogue", "speaker": "Chandler", "text": "Fine with me."}, {"line_number": 60, "type": "dialogue", "speaker": "Ross", "text": "Okay, y'know what, lets just cut to the chase here. Okay? Heidi, which of my boys do you like?"}, {"line_number": 61, "type": "dialogue", "speaker": "Chandler and Joey", "text": "What are you doing? What are you doing? What are you doing? "}, {"line_number": 62, "type": "dialogue", "speaker": "Margha", "text": "Which do I like?"}, {"line_number": 63, "type": "dialogue", "speaker": "Ross", "text": "Yeah, y'know for dating, general merriment, taking back to your windmill..."}, {"line_number": 64, "type": "dialogue", "speaker": "Margha", "text": "Well, if I had to chose right now, which by the way I find really weird, I would have to say, Chandler."}, {"line_number": 65, "type": "dialogue", "speaker": "Chandler", "text": "Yes!!"}, {"line_number": 66, "type": "dialogue", "speaker": "Joey", "text": "Wait a minute! Wait a minute! She obviously didnt understand the question."}, {"line_number": 67, "type": "dialogue", "speaker": "Chandler", "text": "Well, you dont you have Captain Hook explain it to her."}, {"line_number": 68, "type": "dialogue", "speaker": "Margha", "text": "Im sorry, Joey, that is my chose."}, {"line_number": 69, "type": "dialogue", "speaker": "Chandler", "text": "You hear that! That is her chose, mister Ill let you have her! I win! You suck! I rule all! A mini-wave in celebration of me!! (does the wave.)"}, {"line_number": 70, "type": "dialogue", "speaker": "Margha", "text": "Im now thinking I would like to change my answer to, no one."}, {"line_number": 71, "type": "dialogue", "speaker": "Chandler", "text": "Wh-what?"}, {"line_number": 72, "type": "dialogue", "speaker": "Margha", "text": "I now find you shallow and um, a dork. All right, bye."}, {"line_number": 73, "type": "dialogue", "speaker": "Joey", "text": "Nice going. You just saved yourself a couple months of sex."}, {"line_number": 74, "type": "dialogue", "speaker": "Chandler", "text": "Y'know what, it doesnt matter, cause she picked me. Me! From now on I get the dates and you have to stay home on Saturday nights watching Ready, Set, Cook!"}, {"line_number": 75, "type": "dialogue", "speaker": "Ross", "text": "Save the breakthroughs for therapy, okay. The clock is ticking. We have no time, and we are losing, we are losing to girls."}, {"line_number": 76, "type": "dialogue", "speaker": "Chandler", "text": "Were not gonna lose to girls."}, {"line_number": 77, "type": "dialogue", "speaker": "Ross", "text": "Hey! Its 42-21!"}, {"line_number": 78, "type": "dialogue", "speaker": "Joey", "text": "This sucks, I was just up by that much!"}, {"line_number": 79, "type": "dialogue", "speaker": "Monica", "text": "Are we playing football or what? Come on you hairy-backed Marries."}, {"line_number": 80, "type": "narration", "text": "[cut to the girls huddle.]"}, {"line_number": 81, "type": "dialogue", "speaker": "Monica", "text": "We have to do this. We are playing for women everywhere. Okay, just think about every lousy date that you ever had, okay, every guy who kept on the TV while youre making out..."}, {"line_number": 82, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God! You dated someone with a glass eye too?!"}, {"line_number": 83, "type": "dialogue", "speaker": "Monica", "text": "Come on, okay, come on this is for all womankind. Lets kill um!"}, {"line_number": 84, "type": "dialogue", "speaker": "Rachel", "text": "Yeah!!! Kill um!!!"}, {"line_number": 85, "type": "dialogue", "speaker": "Phoebe", "text": "All right, no, well I want to kill them to, but their boys, y'know how are we gonna beat three boys?"}, {"line_number": 86, "type": "action", "text": "(Another football sequence follows)"}, {"line_number": 87, "type": "narration", "text": "[Sequence 1: Chandler is running past Phoebe with the ball, Phoebe flashes him, he stops and stares dumbfounded at her. Phoebe then runs up and takes the ball away.]"}, {"line_number": 88, "type": "narration", "text": "[Sequence 2: Phoebe throws the ball, and its intercepted by Joey, who starts to run up field. Rachel jumps on his back in order to try and tackle him, but she doesnt slow him down. Monica and Phoebe then both grab her legs in order to stop Joey, who still manages to fight through the tackle and score the touchdown.]"}, {"line_number": 89, "type": "narration", "text": "[Sequence 3: Chandler is running with the ball, Phoebe flashes him again, but Chandler covers his eyes, and keeps running. He then runs into a tree at the end of the field.]"}, {"line_number": 90, "type": "narration", "text": "[cut to the girls huddle]"}, {"line_number": 91, "type": "dialogue", "speaker": "Monica", "text": "All right, we still have a minute and a half to go, and were down by two points. Two points.... (she gets interrupted by the guys, who are doing a slow-motion high five.) Phoebe you do a button-hook again. Rachel, you go long."}, {"line_number": 92, "type": "dialogue", "speaker": "Rachel", "text": "No! Come on! Dont make me go long. Use me. They never cover me."}, {"line_number": 93, "type": "dialogue", "speaker": "Monica", "text": "Honey, theres a reason."}, {"line_number": 94, "type": "dialogue", "speaker": "Rachel", "text": "God, Im not lame, okay. I can do something. I can throw, would you let me throw, come on this is my game too."}, {"line_number": 95, "type": "dialogue", "speaker": "Phoebe", "text": "Come on Mon, let her throw the ball."}, {"line_number": 96, "type": "dialogue", "speaker": "Monica", "text": "All right Rachel, you sweep behind, Ill pitch it to you, you throw it down field to Phoebe. All right. Break."}, {"line_number": 97, "type": "dialogue", "speaker": "Rachel", "text": "Thank you! Break!"}, {"line_number": 98, "type": "dialogue", "speaker": "Monica", "text": "Thirty-two! Seventy-one! Hike!"}, {"line_number": 99, "type": "action", "text": "(Phoebe snaps the ball to Monica, who pitches back to Rachel.)"}, {"line_number": 100, "type": "dialogue", "speaker": "The Guys", "text": "One-Mississippi! Two-Mississippi! Three-Mississippi!"}, {"line_number": 101, "type": "action", "text": "(They all rush toward Rachel, who panics and runs away. She runs out of the park and up along the fence, she then comes back into the park and runs past Monica, as she gets to Monica, she throws the ball at Monica, and it hits her in the eye.)"}, {"line_number": 102, "type": "dialogue", "speaker": "Rachel", "text": "Im so sorry! Are you okay?"}, {"line_number": 103, "type": "dialogue", "speaker": "Monica", "text": "No! Im not okay!"}, {"line_number": 104, "type": "dialogue", "speaker": "Rachel", "text": "Im sorry, they were just all coming at me, and I didnt know what to do."}, {"line_number": 105, "type": "dialogue", "speaker": "Joey", "text": "(looking at the timer) Thirty seconds left on the timer!"}, {"line_number": 106, "type": "dialogue", "speaker": "Chandler", "text": "Okay, okay, so we get to take that stupid troll thing home!"}, {"line_number": 107, "type": "dialogue", "speaker": "Monica", "text": "Come on! Come on! Hurry! Were running out of time! Huddle up!"}, {"line_number": 108, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. Oooh! Oh, this is our last huddle, yeah."}, {"line_number": 109, "type": "dialogue", "speaker": "Monica", "text": "All right, Phoebe get open. Rachel, go long."}, {"line_number": 110, "type": "dialogue", "speaker": "Rachel", "text": "(on the verge of tears) Okay."}, {"line_number": 111, "type": "dialogue", "speaker": "Monica", "text": "Break!"}, {"line_number": 112, "type": "action", "text": "(In slow motion, Phoebe snaps the ball, Rachel goes long. Joey and Chandler and all over Phoebe, leaving Rachel wide open. Ross starts to rush Monica, who sees Phoebe is double covered, in desperation she throws to Rachel. We see flying through the air, and then Rachel running underneath it, then the ball, then Rachel again, then the ball, then Phoebe, Chandler, and Joey staring at it in shock. Then with the grace of Jerry Rice (no offense to Jerry Rice), Rachel catches the ball, and she stops and spikes the ball. Both Phoebe and Monica erupt in celebration.)"}, {"line_number": 113, "type": "dialogue", "speaker": "Rachel", "text": "(in triumph) I got a touchdown! We did it!!"}, {"line_number": 114, "type": "dialogue", "speaker": "Chandler", "text": "Hey-hey-hey Rachel, funny thing. Actually, the ah, end zone starts at that pole, so youre five feet short, so we win!"}, {"line_number": 115, "type": "dialogue", "speaker": "Phoebe", "text": "Wait-wait-wait-wait! So, explain something to me though, if, if nobody tagged Rachel, then isnt the play still going."}, {"line_number": 116, "type": "action", "text": "(they all start to dive for the ball and Monica and Ross grab it at the same time.)"}, {"line_number": 117, "type": "dialogue", "speaker": "Ross", "text": "Let go! Let go!"}, {"line_number": 118, "type": "dialogue", "speaker": "Monica", "text": "Let go! Im a tiny little woman!!"}, {"line_number": 119, "type": "dialogue", "speaker": "Chandler", "text": "Guys! Guys! Come on! Its Thanksgiving, its not important who wins or loses. The important thing is, (to Joey) the Dutch girl picked me! Me! Not you! Holland loves Chandler! Thank you, Amsterdam! Good night!!"}, {"line_number": 120, "type": "dialogue", "speaker": "Monica", "text": "Ow!!"}, {"line_number": 121, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 6, "scene_id": "S03E09_006", "location": "Monica and Rachel's", "scene_description": "Rachel, Phoebe, Chandler, and Joey are eating Thanksgiving dinner.", "characters": ["Chandler", "Joey", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E09/scenes/S03E09_006", "raw_text": "[Scene: Monica and Rachel's, Rachel, Phoebe, Chandler, and Joey are eating Thanksgiving dinner.]\nRachel: We should defiantly play football more often. Maybe theres a like league we could join or something.\nPhoebe: Isnt there a national football league.\nChandler: Yes. Yes, there is, they play on Sundays and Monday nights.\nRachel: Oh shoot! I work Monday nights.\nPhoebe: Umm, this stuffing is amazing. Do you think we should bring them some?\nJoey: When theyre hungry enough, theyll come in.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Rachel, Phoebe, Chandler, and Joey are eating Thanksgiving dinner.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "We should defiantly play football more often. Maybe theres a like league we could join or something."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Isnt there a national football league."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Yes. Yes, there is, they play on Sundays and Monday nights."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh shoot! I work Monday nights."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, this stuffing is amazing. Do you think we should bring them some?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "When theyre hungry enough, theyll come in."}]}
{"episode_id": "S03E09", "season": 3, "episode_number": 9, "episode_title": "THE ONE WITH THE FOOTBALL", "scene_number": 7, "scene_id": "S03E09_007", "location": "The park", "scene_description": "its dark outside and Monica and Ross are still fighting over the ball.", "characters": ["Monica", "Ross"], "firestore_path": "/episodes/S03E09/scenes/S03E09_007", "raw_text": "[Scene: The park, its dark outside and Monica and Ross are still fighting over the ball.]\nMonica: Let go!\nRoss: No! You let go!\nMonica: No!\nRoss: How come its always us left in the field holding the ball?\nMonica: I dont know. I guess the other people just dont care enough.\n(It starts snowing.)\nRoss: Hey! Its starting to snow.\n(They both look up, and watch it start to snow. Then they both start fighting for the ball again.)\nRoss: Gimme the this!\nMonica: Let go!\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The park, its dark outside and Monica and Ross are still fighting over the ball.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Let go!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "No! You let go!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "No!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "How come its always us left in the field holding the ball?"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "I dont know. I guess the other people just dont care enough."}, {"line_number": 7, "type": "action", "text": "(It starts snowing.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Hey! Its starting to snow."}, {"line_number": 9, "type": "action", "text": "(They both look up, and watch it start to snow. Then they both start fighting for the ball again.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Gimme the this!"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Let go!"}, {"line_number": 12, "type": "narration", "text": "End"}]}
