{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 1, "scene_id": "S03E17_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E17/scenes/S03E17_001", "raw_text": "THE ONE WITHOUT THE SKI TRIP\nWritten by: Scott Silveri & Shana Goldberg-Meehan Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITHOUT THE SKI TRIP"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Scott Silveri & Shana Goldberg-Meehan Transcribed by: Eric Aasen "}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 2, "scene_id": "S03E17_002", "location": "Central Perk", "scene_description": "Chandler and Joey are sitting on the couch reading.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E17/scenes/S03E17_002", "raw_text": "[Scene: Central Perk, Chandler and Joey are sitting on the couch reading.]\nJoey: Can I see the comics?\nChandler: This is the New York Times.\nJoey: Okay, may I see the comics?\n[Monica and Phoebe enter.]\nMonica: Guys. I thought you were taking Ross to the game?\nChandler: We are. Hes meeting us here.\nMonica: No! Rachel is meeting us here.\nPhoebe: Oh come on, they can be in the same room.\nJoey: Yeah, you shoulda been there last night.\nPhoebe: Why? What happened now?\nJoey: Well Ross was hangin out over at our place, Rachel comes over to borrow some moisturiser from Chandler....\nChandler: Yeah y-you, how hard is it to say something? Rachel came over to borrow something.\nJoey: Anyway! Her and Ross just started yelling at each other.\nPhoebe: Wait. Why was he yelling at her? Hes the one who slept with someone else. \nJoey: Well, I guess he says that because they were on a break when it happened, that she should of forgiven him by now.\nPhoebe: Whoa!! He is soo unreasonable! God, although I think I understand what he means. Oh my God, this is like 60 Minutes, okay, when, when, at first youre really mad at that pharmaceutical company for making the drug and then y'know you just feel bad for the people because they needed to make their hair grow.\nChandler: Y'know what this is like? This is like when my parents got divorced. Man, I hope Ross doesnt try to kidnap me after Cub Scouts.\nPhoebe: Y'know I had a dream where Ross and Rachel were still together, they never broke up. And we were all just like hanging out, and everyone was happy....\nJoey: I had the same dream!\nPhoebe: Yeah, and nobody slept with that Xerox girl. \nJoey: Oh, I had the opposite dream.\nChandler: Y'know what maybe its gonna be okay, I mean its been a week.\nJoey: Yeah, I mean its never taken me a week to get over a relationship.\nMonica: Its never taken you more than a shower to get over a relationship.\n[Rachel enters.]\nMonica: (seeing her) Okay, lets go!! Lets hit the road!!\nRachel: Hey!\nMonica: Lets get the show on it! \nRachel: Okay, let me just get a cup of coffee.\nMonica: Oh Rachel, I know the best coffee house and its sooo close.\nRachel: Closer than here?\nPhoebe: (turning around and picking a cup off of a table) Oh, hey, look, I found coffee! (handing her the cup) Okay, lets skedaddle.\nRachel: Wait, Im not just gonna drink somebodys old coffee.\nPhoebe: Okay, your highness.\n[Ross enters behind Rachel, and look at each other for a moment.]\nPhoebe: (in a deep voice, imitating Ross) Um, Rachel Im really sorry. (imitating Rachel) Thats okay, do you wanna get back together? (imitating Ross) Yeah, okay. (in her normal voice) Did anyone else hear that?!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler and Joey are sitting on the couch reading.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Can I see the comics?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "This is the New York Times."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Okay, may I see the comics?"}, {"line_number": 5, "type": "narration", "text": "[Monica and Phoebe enter.]"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Guys. I thought you were taking Ross to the game?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "We are. Hes meeting us here."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "No! Rachel is meeting us here."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh come on, they can be in the same room."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Yeah, you shoulda been there last night."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Why? What happened now?"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Well Ross was hangin out over at our place, Rachel comes over to borrow some moisturiser from Chandler...."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Yeah y-you, how hard is it to say something? Rachel came over to borrow something."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Anyway! Her and Ross just started yelling at each other."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Wait. Why was he yelling at her? Hes the one who slept with someone else. "}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Well, I guess he says that because they were on a break when it happened, that she should of forgiven him by now."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Whoa!! He is soo unreasonable! God, although I think I understand what he means. Oh my God, this is like 60 Minutes, okay, when, when, at first youre really mad at that pharmaceutical company for making the drug and then y'know you just feel bad for the people because they needed to make their hair grow."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Y'know what this is like? This is like when my parents got divorced. Man, I hope Ross doesnt try to kidnap me after Cub Scouts."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Y'know I had a dream where Ross and Rachel were still together, they never broke up. And we were all just like hanging out, and everyone was happy...."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "I had the same dream!"}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, and nobody slept with that Xerox girl. "}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Oh, I had the opposite dream."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Y'know what maybe its gonna be okay, I mean its been a week."}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Yeah, I mean its never taken me a week to get over a relationship."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Its never taken you more than a shower to get over a relationship."}, {"line_number": 26, "type": "narration", "text": "[Rachel enters.]"}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "(seeing her) Okay, lets go!! Lets hit the road!!"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Hey!"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Lets get the show on it! "}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Okay, let me just get a cup of coffee."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Oh Rachel, I know the best coffee house and its sooo close."}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Closer than here?"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "(turning around and picking a cup off of a table) Oh, hey, look, I found coffee! (handing her the cup) Okay, lets skedaddle."}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "Wait, Im not just gonna drink somebodys old coffee."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, your highness."}, {"line_number": 36, "type": "narration", "text": "[Ross enters behind Rachel, and look at each other for a moment.]"}, {"line_number": 37, "type": "dialogue", "speaker": "Phoebe", "text": "(in a deep voice, imitating Ross) Um, Rachel Im really sorry. (imitating Rachel) Thats okay, do you wanna get back together? (imitating Ross) Yeah, okay. (in her normal voice) Did anyone else hear that?!"}, {"line_number": 38, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 3, "scene_id": "S03E17_003", "location": "Chandler and Joey's", "scene_description": "the whole gang is there, except for Ross and Rachel. Joey is trying to eat Chinese with chopsticks and fails miserably. Theres a knock on the door, and Chandler answers it to reveal Rachel", "characters": ["All", "Chandler", "Joey", "Monica", "Monica and Phoebe", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E17/scenes/S03E17_003", "raw_text": "[Scene: Chandler and Joey's, the whole gang is there, except for Ross and Rachel. Joey is trying to eat Chinese with chopsticks and fails miserably. Theres a knock on the door, and Chandler answers it to reveal Rachel]\nRachel: (softly) Is he here?\nChandler: No.\nRachel: Oh. (smiles) Heres your moisturiser. Hi! \nMonica and Phoebe: Hey!\nRachel: You guys are gonna love meee! Okay, check it out, Thursday night, five tickets, Calvin Klein lingerie show, and you guys are coming with me. (theyre all silent and look away) Okay, I said that out loud right?\nChandler: Yes, yes, its just that we ah, we kinda all ready, made plans with Ross.\nRachel: Oh, well okay. Well, there you go.\nPhoebe: No, its just that he got this new like home theater dealie, and he wants y'know, us to check it out.\nRachel: Hm-mm.\nChandler: Yeah, hes really excited about it too, he even recorded show times on his answering machine.\nRachel: Ohh!\nMonica: Were sorry honey.\nRachel: Oh, its okay. (starts to leave)\nJoey: Rach, its, its ah, its not that we dont want to, really. (quietly) Are we talking models in their underwear?\nRachel: And heels.\nJoey: (He turns around to Chandler looking for approval to go with Rachel, Chandler mouths Come on!) (turning back to Rachel) Ross, did ask us first, and we set that night aside.\nRachel: No, hey, come on, if he asked you first, thats only fair. (leaves)\n[Chandler makes a noise of absolute disgust and heads into the living room.]\nPhoebe: Ohhh boy, do I feel bad.\nJoey: Oh yeah.\nMonica: Very bad.\n[We see Chandler lighting up a cigarette.]\nPhoebe: Chandler what are you doing?!\nMonica: Chandler!!\nChandler: (jumps back and points at the cigarette) Oh my God!\nJoey: Youre smoking again?!\nChandler: Well, actually, yesterday I was smoking again. Today, Im, Im smoking still.\nPhoebe: Why would you start again after chewing all that quitting gum?\nChandler: Look, Im telling you this is just like my parents divorce, which is when I started smoking in the first place.\nMonica: Werent you nine?!\nChandler: Yeahhh. Im tellin ya something, that ah, first smoke after nap time....\n[Theres a knock on the door.]\nChandler: Oh thats great, with my luck, thats gonna be him.\nPhoebe: Him? Him, Ross?\nChandler: Nope, hymn 253, His Eyes Are On The Sparrow! When my parents got divorced is when I started using humour as a defence mechanism. (answers the door and its Rachel again.)\nRachel: Hi! Uhh, do you guys have plans for the weekend? Because I have my sister on hold, and she said that we could use her cabin for the weekend and go skiing. Huh? Im asking you first, right?!. I mean Im playing by the rules.\nAll: Absolutely, yeah!\nRachel: Chandler! Youre smoking? What are you doing?!\nChandler: Hey, shut up!! Youre not my real Mom!!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, the whole gang is there, except for Ross and Rachel. Joey is trying to eat Chinese with chopsticks and fails miserably. Theres a knock on the door, and Chandler answers it to reveal Rachel]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(softly) Is he here?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "No."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Oh. (smiles) Heres your moisturiser. Hi! "}, {"line_number": 5, "type": "dialogue", "speaker": "Monica and Phoebe", "text": "Hey!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "You guys are gonna love meee! Okay, check it out, Thursday night, five tickets, Calvin Klein lingerie show, and you guys are coming with me. (theyre all silent and look away) Okay, I said that out loud right?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Yes, yes, its just that we ah, we kinda all ready, made plans with Ross."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh, well okay. Well, there you go."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "No, its just that he got this new like home theater dealie, and he wants y'know, us to check it out."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Hm-mm."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, hes really excited about it too, he even recorded show times on his answering machine."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Ohh!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Were sorry honey."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Oh, its okay. (starts to leave)"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Rach, its, its ah, its not that we dont want to, really. (quietly) Are we talking models in their underwear?"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "And heels."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "(He turns around to Chandler looking for approval to go with Rachel, Chandler mouths Come on!) (turning back to Rachel) Ross, did ask us first, and we set that night aside."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "No, hey, come on, if he asked you first, thats only fair. (leaves)"}, {"line_number": 19, "type": "narration", "text": "[Chandler makes a noise of absolute disgust and heads into the living room.]"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Ohhh boy, do I feel bad."}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Oh yeah."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Very bad."}, {"line_number": 23, "type": "narration", "text": "[We see Chandler lighting up a cigarette.]"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Chandler what are you doing?!"}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Chandler!!"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "(jumps back and points at the cigarette) Oh my God!"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Youre smoking again?!"}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "Well, actually, yesterday I was smoking again. Today, Im, Im smoking still."}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "Why would you start again after chewing all that quitting gum?"}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "Look, Im telling you this is just like my parents divorce, which is when I started smoking in the first place."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Werent you nine?!"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Yeahhh. Im tellin ya something, that ah, first smoke after nap time...."}, {"line_number": 33, "type": "narration", "text": "[Theres a knock on the door.]"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "Oh thats great, with my luck, thats gonna be him."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Him? Him, Ross?"}, {"line_number": 36, "type": "dialogue", "speaker": "Chandler", "text": "Nope, hymn 253, His Eyes Are On The Sparrow! When my parents got divorced is when I started using humour as a defence mechanism. (answers the door and its Rachel again.)"}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Hi! Uhh, do you guys have plans for the weekend? Because I have my sister on hold, and she said that we could use her cabin for the weekend and go skiing. Huh? Im asking you first, right?!. I mean Im playing by the rules."}, {"line_number": 38, "type": "dialogue", "speaker": "All", "text": "Absolutely, yeah!"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Chandler! Youre smoking? What are you doing?!"}, {"line_number": 40, "type": "dialogue", "speaker": "Chandler", "text": "Hey, shut up!! Youre not my real Mom!!"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 4, "scene_id": "S03E17_004", "location": "Rosss", "scene_description": "the gang, minus Rachel of course, is there. Chandler is forced to smoke by an open window.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E17/scenes/S03E17_004", "raw_text": "[Scene: Rosss, the gang, minus Rachel of course, is there. Chandler is forced to smoke by an open window.]\nJoey: (obviously cold) Hey, can you close that window Chandler? My nipples can cut glass over here!\nPhoebe: Wait. Really?! Cause mine get me out of tickets.\nRoss: Look, you guys I just wanna say, I really, really appreciate you spending this time with me. Its been a pretty hard time right now, so I just wanna say thanks.\nChandler: Can somebody else hug him? I have to stay by the window.\nRoss: Oh hey, hey, huh, how about this weekend we have a laser disc marathon okay, and maybe a tournament on my new dart board? Huh, huh, what do you think? (in an Irish accent) Two days of darts, itll be great!\nJoey: Itll be great for next weekend.\nRoss: No, no, no, this weekend guys!\nJoey: Itll be great for next weekend. I mean, (in an Irish accent) itll be grrreat.\nRoss: Whats going on?\nPhoebe: Well, we were um, sorta invited to go skiing, y'know Rachels sisters cabin. (Chandler goes back to the window to smoke again.)\nRoss: So, for the whole weekend?\nMonica: Were really sorry, but um, she did ask us first.\nRoss: Yeah, thats okay, I mean if you guys all have to go away for the first weekend Im alone by myself, y'know then I totally, totally understand.\nPhoebe: Y'know what, I can stay, Im gonna stay. Cause the last time I went skiing I was to afraid to jump off the chair lift, I just went around and around.\nJoey: Uh, Pheebs we kinda need you to drive us all up there in your grandmothers cab, but y'know what, Ill stay.\nMonica: Noo! Ill stay. Hes my brother.\nRoss: What a pity stay?\nMonica: No! Were gonna have fun. We can make fudge!\nRoss: Pity food? Y'know what thats okay, all right, I dont need any of you to stay, okay nobody stays.\nChandler: Well, then, I might as well offer to stay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rosss, the gang, minus Rachel of course, is there. Chandler is forced to smoke by an open window.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(obviously cold) Hey, can you close that window Chandler? My nipples can cut glass over here!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Wait. Really?! Cause mine get me out of tickets."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Look, you guys I just wanna say, I really, really appreciate you spending this time with me. Its been a pretty hard time right now, so I just wanna say thanks."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Can somebody else hug him? I have to stay by the window."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Oh hey, hey, huh, how about this weekend we have a laser disc marathon okay, and maybe a tournament on my new dart board? Huh, huh, what do you think? (in an Irish accent) Two days of darts, itll be great!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Itll be great for next weekend."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "No, no, no, this weekend guys!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Itll be great for next weekend. I mean, (in an Irish accent) itll be grrreat."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Whats going on?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Well, we were um, sorta invited to go skiing, y'know Rachels sisters cabin. (Chandler goes back to the window to smoke again.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "So, for the whole weekend?"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Were really sorry, but um, she did ask us first."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Yeah, thats okay, I mean if you guys all have to go away for the first weekend Im alone by myself, y'know then I totally, totally understand."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Y'know what, I can stay, Im gonna stay. Cause the last time I went skiing I was to afraid to jump off the chair lift, I just went around and around."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Uh, Pheebs we kinda need you to drive us all up there in your grandmothers cab, but y'know what, Ill stay."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Noo! Ill stay. Hes my brother."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "What a pity stay?"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "No! Were gonna have fun. We can make fudge!"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Pity food? Y'know what thats okay, all right, I dont need any of you to stay, okay nobody stays."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Well, then, I might as well offer to stay."}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 5, "scene_id": "S03E17_005", "location": "In Phoebes Grandmothers cab", "scene_description": "driving up to the cabin. Phoebes driving, Rachels sitting shotgun, Chandler, Monica, and Joey are in the back seat.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E17/scenes/S03E17_005", "raw_text": "[Scene: In Phoebes Grandmothers cab, driving up to the cabin. Phoebes driving, Rachels sitting shotgun, Chandler, Monica, and Joey are in the back seat.]\nJoey: (to Chandler and Monica) Hey, does anybody else feel bad about Ross?\nMonica: Why? Do you think hes still mad at us?\nChandler: (to Joey) Well hes probably mad after you called him this morning to borrow his goggles.\nJoey: What? Mine arent tinted.\n[Chandler starts to light a cigarette.]\nPhoebe: Chandler!!\nChandler: What?\nPhoebe: What does the sign say?\nChandler: Beam me up Jesus.\nPhoebe: No, the No Smoking sign. Theres no smoking in my Grandmothers cab.\nChandler: Okay, well, then, I-I have to go to the bathroom.\nAll: Oh!\nPhoebe: Please!\nMonica: No Chandler no! No unscheduled stops. You can go when we stop for gas.\nChandler: Oh, come on, theres a rest stop right up there! Come on, I really have to goooooooooo.\nJoey: Oh, now I have to go!!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: In Phoebes Grandmothers cab, driving up to the cabin. Phoebes driving, Rachels sitting shotgun, Chandler, Monica, and Joey are in the back seat.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(to Chandler and Monica) Hey, does anybody else feel bad about Ross?"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Why? Do you think hes still mad at us?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "(to Joey) Well hes probably mad after you called him this morning to borrow his goggles."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "What? Mine arent tinted."}, {"line_number": 6, "type": "narration", "text": "[Chandler starts to light a cigarette.]"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Chandler!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "What does the sign say?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Beam me up Jesus."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "No, the No Smoking sign. Theres no smoking in my Grandmothers cab."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Okay, well, then, I-I have to go to the bathroom."}, {"line_number": 13, "type": "dialogue", "speaker": "All", "text": "Oh!"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Please!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "No Chandler no! No unscheduled stops. You can go when we stop for gas."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Oh, come on, theres a rest stop right up there! Come on, I really have to goooooooooo."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Oh, now I have to go!!"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 6, "scene_id": "S03E17_006", "location": "The rest stop", "scene_description": "Phoebes pulling in.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E17/scenes/S03E17_006", "raw_text": "[Scene: The rest stop, Phoebes pulling in.]\nChandler: Here we go. Okay, brace yourselves.\nMonica: What?\n[Both Chandler and Joey put their feet up against the glass, Monica doesnt and gets thrown up against the glass.]\nRachel: Okay.\nMonica: Ow!\n[Joey gets out and sprints to the bathroom and Chandler follows with a cigarette in his hands.]\nPhoebe: (to Rachel, whos staying in the cab.) Arent you gonna go?\nRachel: No. Thank you.\nMonica: (getting out) No, Rachel never pees in public restrooms.\nRachel: Well, they never have any paper in there y'know. So my rule is no tissue, no tuschy. (Phoebe laughs and gets out.) Well, if everybodys going. (She gets out and starts to close the door.)\nPhoebe: No, y'know what dont close it (Rachel slams the door shut locking themselves out.) cause the... keys...are in there.\nChandler: Oh, no-no-no-no-no-no!!\nJoey: Whats going on?\nChandler: (to Joey) My lighters in there! (points to the cab)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The rest stop, Phoebes pulling in.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Here we go. Okay, brace yourselves."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "What?"}, {"line_number": 4, "type": "narration", "text": "[Both Chandler and Joey put their feet up against the glass, Monica doesnt and gets thrown up against the glass.]"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Ow!"}, {"line_number": 7, "type": "narration", "text": "[Joey gets out and sprints to the bathroom and Chandler follows with a cigarette in his hands.]"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "(to Rachel, whos staying in the cab.) Arent you gonna go?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "No. Thank you."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "(getting out) No, Rachel never pees in public restrooms."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Well, they never have any paper in there y'know. So my rule is no tissue, no tuschy. (Phoebe laughs and gets out.) Well, if everybodys going. (She gets out and starts to close the door.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "No, y'know what dont close it (Rachel slams the door shut locking themselves out.) cause the... keys...are in there."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Oh, no-no-no-no-no-no!!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Whats going on?"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "(to Joey) My lighters in there! (points to the cab)"}, {"line_number": 16, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 7, "scene_id": "S03E17_007", "location": "The rest stop", "scene_description": "the gang is still stuck, Chandler is kneeling at the rear bumper.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "The Girls"], "firestore_path": "/episodes/S03E17/scenes/S03E17_007", "raw_text": "[Scene: The rest stop, the gang is still stuck, Chandler is kneeling at the rear bumper.]\nChandler: Damn! (stands up) The tailpipes not hot enough to light this!\nJoey: Relax okay, I-I-I can get this open. Anybody have a coat hanger?\nChandler: Oh I do! Op, no, wait a minute, I took it out of my shirt when I put it on this morning.\nMonica: So, if youre parents hadnt got divorced, youd be able to answer a question like a normal person?\nJoey: Look, I just need a wire something to jimmy it. Oh hey, one of you guys give me the underwire from your bra!\nMonica: What?!\nRachel: What?!\nJoey: Come on! Who has the biggest boobs?\nMonica: Please!!\nJoey: Whoever has the biggest boobs, has the biggest bra, therefore has the biggest wire.\nThe Girls: No, not getting my bra!\nJoey: If you wanna get back in the car, we need the wire, your call.\nPhoebe: Okay, Monicas are the biggest.\nMonica: These tiny, little non-breasts?! Please, its gotta be Rachel.\nRachel: What, no, no, no, mine are deceptively small I mean, I-I-I actually sometimes, st-stuff my bra.\nMonica: All right then, your bra would still be big.\nRachel: No, I stuff outside the bra.\nChandler: Ladies, ladies, lets just compromise okay? Phoebe, Rachel take off Monicas bra.\nPhoebe: All right, forget it, nevermind, you can have mine.\n[Chandler crumples up his cigarette pack and throws it on the ground.]\nRachel: (seeing him) Chandler, what are you doing? There is a trash can right there.\nChandler: Well, I thought if I littered, that crying Indian might come by and save us.\nPhoebe: (finishing removing her bra) Okay, there.\nJoey: Thank you Phoebe, that is very, very generous.\nChandler: Okay, now lets decide who has the nicest ass.\nJoey: (opening the door) And there you go!\nAll: Oh, yeahhhhh!!!\n[They all run to get in the cab, and Chandler pulls out a smoke.]\nMonica: Chandler!!\nChandler: At least let me smoke it to the good part.\n[Phoebe puts the car in gear and starts to back out.]\nPhoebe: Okay. (The car moves a few feet and sputters to a stop.) Oh, no!\nRachel: What, whats it, whats going on?\nPhoebe: Yeah, this has happened before.\nRachel: So you know how to fix it?\nPhoebe: Yep. Put more gas in.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The rest stop, the gang is still stuck, Chandler is kneeling at the rear bumper.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Damn! (stands up) The tailpipes not hot enough to light this!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Relax okay, I-I-I can get this open. Anybody have a coat hanger?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Oh I do! Op, no, wait a minute, I took it out of my shirt when I put it on this morning."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "So, if youre parents hadnt got divorced, youd be able to answer a question like a normal person?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Look, I just need a wire something to jimmy it. Oh hey, one of you guys give me the underwire from your bra!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "What?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Come on! Who has the biggest boobs?"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Please!!"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Whoever has the biggest boobs, has the biggest bra, therefore has the biggest wire."}, {"line_number": 12, "type": "dialogue", "speaker": "The Girls", "text": "No, not getting my bra!"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "If you wanna get back in the car, we need the wire, your call."}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, Monicas are the biggest."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "These tiny, little non-breasts?! Please, its gotta be Rachel."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "What, no, no, no, mine are deceptively small I mean, I-I-I actually sometimes, st-stuff my bra."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "All right then, your bra would still be big."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "No, I stuff outside the bra."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Ladies, ladies, lets just compromise okay? Phoebe, Rachel take off Monicas bra."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "All right, forget it, nevermind, you can have mine."}, {"line_number": 21, "type": "narration", "text": "[Chandler crumples up his cigarette pack and throws it on the ground.]"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "(seeing him) Chandler, what are you doing? There is a trash can right there."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Well, I thought if I littered, that crying Indian might come by and save us."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "(finishing removing her bra) Okay, there."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Thank you Phoebe, that is very, very generous."}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Okay, now lets decide who has the nicest ass."}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "(opening the door) And there you go!"}, {"line_number": 28, "type": "dialogue", "speaker": "All", "text": "Oh, yeahhhhh!!!"}, {"line_number": 29, "type": "narration", "text": "[They all run to get in the cab, and Chandler pulls out a smoke.]"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica", "text": "Chandler!!"}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "At least let me smoke it to the good part."}, {"line_number": 32, "type": "narration", "text": "[Phoebe puts the car in gear and starts to back out.]"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (The car moves a few feet and sputters to a stop.) Oh, no!"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "What, whats it, whats going on?"}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, this has happened before."}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "So you know how to fix it?"}, {"line_number": 37, "type": "dialogue", "speaker": "Phoebe", "text": "Yep. Put more gas in."}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 8, "scene_id": "S03E17_008", "location": "Carol and Susans", "scene_description": "Carol is setting a romantic dinner for Susan as there is a knock on the door.", "characters": ["Carol", "Ross"], "firestore_path": "/episodes/S03E17/scenes/S03E17_008", "raw_text": "[Scene: Carol and Susans, Carol is setting a romantic dinner for Susan as there is a knock on the door.]\nCarol: (answering the door) Hi! \nRoss: (entering) Hey.\nCarol: Hey, what are you doing here?\nRoss: Well, oh just ah, I was just wondering, when you and I split up, did you get the tape that was half the last episode of M*A*S*H and half the hostages coming home?\nCarol: Ah yeah, but now its Susan and me in Mexico and the hostages coming home.\nRoss: Wheres Ben?\nCarol: Hes sleeping.\nRoss: Ahh. (notices the table) Ooh, is this a ah, is this a bad time?\nCarol: Umm, yeah, actually, Susans gonna be home any minute, its kinda an anniversary.\nRoss: Oh! I thought you guys got married in uh, January?\nCarol: Its not that kind of anniversary.\nRoss: Ah! (realises) Oh.\nCarol: Sooo!! Anyway...\nRoss: Umm, candles, champagne, yeah anniversaries are great. Cause you know love lasts forever, y'know. Nothing like it in this lifetime, money in the bank, so Rachel and I broke up.\nCarol: Oh God, Ross I am so sorry.\nRoss: Yeah, well.\nCarol: Y'know what, I want to talk to you about this so much, but we should probably do it when we could really get into it, are you free for dinner tomorrow night?\nRoss: Oh yeah, Id love that.\nCarol: Oh, great! Me too.\nRoss: I guess it all started when Rachel got this new job. (he sits down at the table.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Carol and Susans, Carol is setting a romantic dinner for Susan as there is a knock on the door.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Carol", "text": "(answering the door) Hi! "}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey."}, {"line_number": 4, "type": "dialogue", "speaker": "Carol", "text": "Hey, what are you doing here?"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Well, oh just ah, I was just wondering, when you and I split up, did you get the tape that was half the last episode of M*A*S*H and half the hostages coming home?"}, {"line_number": 6, "type": "dialogue", "speaker": "Carol", "text": "Ah yeah, but now its Susan and me in Mexico and the hostages coming home."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Wheres Ben?"}, {"line_number": 8, "type": "dialogue", "speaker": "Carol", "text": "Hes sleeping."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Ahh. (notices the table) Ooh, is this a ah, is this a bad time?"}, {"line_number": 10, "type": "dialogue", "speaker": "Carol", "text": "Umm, yeah, actually, Susans gonna be home any minute, its kinda an anniversary."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Oh! I thought you guys got married in uh, January?"}, {"line_number": 12, "type": "dialogue", "speaker": "Carol", "text": "Its not that kind of anniversary."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Ah! (realises) Oh."}, {"line_number": 14, "type": "dialogue", "speaker": "Carol", "text": "Sooo!! Anyway..."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Umm, candles, champagne, yeah anniversaries are great. Cause you know love lasts forever, y'know. Nothing like it in this lifetime, money in the bank, so Rachel and I broke up."}, {"line_number": 16, "type": "dialogue", "speaker": "Carol", "text": "Oh God, Ross I am so sorry."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "Yeah, well."}, {"line_number": 18, "type": "dialogue", "speaker": "Carol", "text": "Y'know what, I want to talk to you about this so much, but we should probably do it when we could really get into it, are you free for dinner tomorrow night?"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Oh yeah, Id love that."}, {"line_number": 20, "type": "dialogue", "speaker": "Carol", "text": "Oh, great! Me too."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "I guess it all started when Rachel got this new job. (he sits down at the table.)"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 9, "scene_id": "S03E17_009", "location": "The rest stop", "scene_description": "Phoebe is on the phone to the motor club.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S03E17/scenes/S03E17_009", "raw_text": "[Scene: The rest stop, Phoebe is on the phone to the motor club.]\nPhoebe: Okay, yeah. (to Monica and Rachel) Triple A can pick us up.\nRachel: Great!\nPhoebe: Yeah, what town are we near?\nMonica: Freemont. West-Westmont, ah Westburg?\nPhoebe: (to Monica) Then why are you answering? Do you at least know what route were on?\nRachel: Yeah, we are definitely on Route 27.\nPhoebe: Okay. (on phone) We are at a rest stop on Route 27. Okay. (to Rachel) There is no Route 27. (listens) (to Rachel) Okay, either 93 or 76?\nRachel: I dont know, Im sorry, I always slept in the back when we drove up here.\nPhoebe: Okay. (on phone) Hey, can you send somebody up and down 76 and check every rest stop, and, and also 93? (listens) Okay! (hangs up) Yeah, no they dont do that.\nRachel: Ugh, okay, well somebody will come and save us.\nMonica: Who? I mean have you seen a car come by here in the last hour and a half? I think we should call Ross, maybe he can get a car and come pick us up.\nRachel: No! No, I am not getting in a car with Ross, we will just have to live here! \nPhoebe: But if...\nRachel: No you guys, I am not getting in a car with him, youll have to think of something else.\nPhoebe: Oh good, oh Joey and Chandler are back.\n[Joey walks up helping Chandler.]\nMonica: So the going for help went well?\nJoey: Oh yeah, Smokey Joe here got half way to the highway and collapsed.\nChandler: I have the lung capacity of a two year old. (starts to light another cigarette.)\nMonica: Then why are you smoking?\nChandler: Well its very unsettling.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The rest stop, Phoebe is on the phone to the motor club.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, yeah. (to Monica and Rachel) Triple A can pick us up."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Great!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, what town are we near?"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Freemont. West-Westmont, ah Westburg?"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "(to Monica) Then why are you answering? Do you at least know what route were on?"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, we are definitely on Route 27."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (on phone) We are at a rest stop on Route 27. Okay. (to Rachel) There is no Route 27. (listens) (to Rachel) Okay, either 93 or 76?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "I dont know, Im sorry, I always slept in the back when we drove up here."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (on phone) Hey, can you send somebody up and down 76 and check every rest stop, and, and also 93? (listens) Okay! (hangs up) Yeah, no they dont do that."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Ugh, okay, well somebody will come and save us."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Who? I mean have you seen a car come by here in the last hour and a half? I think we should call Ross, maybe he can get a car and come pick us up."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "No! No, I am not getting in a car with Ross, we will just have to live here! "}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "But if..."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "No you guys, I am not getting in a car with him, youll have to think of something else."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Oh good, oh Joey and Chandler are back."}, {"line_number": 17, "type": "narration", "text": "[Joey walks up helping Chandler.]"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "So the going for help went well?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Oh yeah, Smokey Joe here got half way to the highway and collapsed."}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "I have the lung capacity of a two year old. (starts to light another cigarette.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Then why are you smoking?"}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "Well its very unsettling."}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 10, "scene_id": "S03E17_010", "location": "Carol and Susans", "scene_description": "Ross is eating the dinner Carol made for Susan.", "characters": ["Carol", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E17/scenes/S03E17_010", "raw_text": "[Scene: Carol and Susans, Ross is eating the dinner Carol made for Susan.]\nRoss: ....right? Right? I mean its pretty unbelievable y'know, I mean they just took off, took off without even looking back. Y'know I dont, I dont need them, huh, Ive got you guys now as friends, you and Susan.\nCarol: Ah, Susan will be so pleased.\n[Rosss beeper goes off.]\nRoss: (looking at the page) 717? (to Carol) Wheres 717? (He gets up to return the page, Carol starts to take the last of the food into the kitchen, but Ross grabs the last piece.) Hey, youve have more of these for Susan right?\nCarol: No. But its okay, Ill just put out pickles or something.\n[Cut to the rest stop, Monica and Phoebe are waiting anxiously by the phone as it rings.]\nPhoebe: (answering the phone) (whispering) Ross, thank God.\nRoss: Pheebs? What, why are you whispering?\nPhoebe: I ate a bug.\n[Rachel starts to walk up.]\nMonica: (running over to stop Rachel) Hey Rach, the tampons here are only a penny. Lets stock up. (takes her into the bathroom)\nPhoebe: Listen Ross, we ran out of gas, and we dont know where we are, so we cant get a tow truck.\nRoss: Oh, now you want a favour?\nPhoebe: Yes, please.\nRoss: Well, oh, Im sorry your car broke down Pheebs, but Im a little too busy with some of my real friends right now, but please call to let me know you got home safely okay?\nCarol: (running over and grabbing the phone away from Ross) (on phone) Phoebe, hang on a second. (Hands Ross her keys) Here, take my car, go pick up your friends.\nRoss: No, Im not gonna pick them up.\nCarol: Listen, we both know youre gonna do it cause youre not a jerk. Okay? So you can either sulk here for a half hour and then go pick them up, or save us both time and sulk in the car.\nRoss: No, Rachel doesnt want me to....\nCarol: Look, I-I-I am sorry that Rachel dumped you cause she fell in love with that Mark guy, and you are the innocent victim in all of this, but dont punish your friends for what Rachel did to you.\nRoss: Yeah, youre right.\nCarol: (on phone) Phoebe hang on a second Ross wants to say something. (listens) What? (listens) (to Ross) You slept with someone else?!\nRoss: We were on a break!!! Okay!! (grabs the phone) We were, we were..., (calms down) yeah. Where are you? Ill find you. (hangs up)\nCarol: You slept with another woman?\nRoss: Oh, you-youre-youre one to talk.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Carol and Susans, Ross is eating the dinner Carol made for Susan.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "....right? Right? I mean its pretty unbelievable y'know, I mean they just took off, took off without even looking back. Y'know I dont, I dont need them, huh, Ive got you guys now as friends, you and Susan."}, {"line_number": 3, "type": "dialogue", "speaker": "Carol", "text": "Ah, Susan will be so pleased."}, {"line_number": 4, "type": "narration", "text": "[Rosss beeper goes off.]"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "(looking at the page) 717? (to Carol) Wheres 717? (He gets up to return the page, Carol starts to take the last of the food into the kitchen, but Ross grabs the last piece.) Hey, youve have more of these for Susan right?"}, {"line_number": 6, "type": "dialogue", "speaker": "Carol", "text": "No. But its okay, Ill just put out pickles or something."}, {"line_number": 7, "type": "narration", "text": "[Cut to the rest stop, Monica and Phoebe are waiting anxiously by the phone as it rings.]"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "(answering the phone) (whispering) Ross, thank God."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Pheebs? What, why are you whispering?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "I ate a bug."}, {"line_number": 11, "type": "narration", "text": "[Rachel starts to walk up.]"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "(running over to stop Rachel) Hey Rach, the tampons here are only a penny. Lets stock up. (takes her into the bathroom)"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Listen Ross, we ran out of gas, and we dont know where we are, so we cant get a tow truck."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Oh, now you want a favour?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, please."}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Well, oh, Im sorry your car broke down Pheebs, but Im a little too busy with some of my real friends right now, but please call to let me know you got home safely okay?"}, {"line_number": 17, "type": "dialogue", "speaker": "Carol", "text": "(running over and grabbing the phone away from Ross) (on phone) Phoebe, hang on a second. (Hands Ross her keys) Here, take my car, go pick up your friends."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "No, Im not gonna pick them up."}, {"line_number": 19, "type": "dialogue", "speaker": "Carol", "text": "Listen, we both know youre gonna do it cause youre not a jerk. Okay? So you can either sulk here for a half hour and then go pick them up, or save us both time and sulk in the car."}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "No, Rachel doesnt want me to...."}, {"line_number": 21, "type": "dialogue", "speaker": "Carol", "text": "Look, I-I-I am sorry that Rachel dumped you cause she fell in love with that Mark guy, and you are the innocent victim in all of this, but dont punish your friends for what Rachel did to you."}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Yeah, youre right."}, {"line_number": 23, "type": "dialogue", "speaker": "Carol", "text": "(on phone) Phoebe hang on a second Ross wants to say something. (listens) What? (listens) (to Ross) You slept with someone else?!"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "We were on a break!!! Okay!! (grabs the phone) We were, we were..., (calms down) yeah. Where are you? Ill find you. (hangs up)"}, {"line_number": 25, "type": "dialogue", "speaker": "Carol", "text": "You slept with another woman?"}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "Oh, you-youre-youre one to talk."}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 11, "scene_id": "S03E17_011", "location": "The rest stop", "scene_description": "Joey is making a sign.", "characters": ["All", "Chandler", "Chandler and Joey", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E17/scenes/S03E17_011", "raw_text": "[Scene: The rest stop, Joey is making a sign.]\nJoey: Okay, done.\nMonica: (reading the sign) Whats pleh?\nJoey: Thats help spelled backwards so that the helicopters can read it from the air!\nMonica: Huh. Whats doofus spelled backwards?\n[Ross drives up.]\nRachel: (all excited) Op, op, car! Car!! (sees its Ross) Ugh!!!\nPhoebe: Oh, its Ross on one of his drives!\nChandler and Joey: Hey!!\nPhoebe: Hi!\nRachel: What is he doing here?!\nRoss: He is saving your butt, ah, unless of course Im stepping on some toes here, in which case I can just mosey on, Ive got plenty of people to help on the Interstate.\nAll: No! Come on!\nRachel: All right!! Fine! Fine.\n[Ross grabs the gas can he brought along, and walks through Joeys sign destroying it.]\nJoey: Arrrghh!!\nChandler: Oh no, now its not gonna make any sense!\nPhoebe: (to Chandler and Monica) You guys, what, what do we do about Ross who drove all the way up here? What do we do? Just like send him back and were then gonna go skiing?\nChandler: Oh, this is horrible, its just horrible.\nJoey: Guys, do you think we should ask Ross to come along?\nMonica: I know, what about Rachel? I mean how are we even gonna ask her?\nRachel: Ask me what?\nMonica: Umm, if ah, it might be okay if Ross came skiing?\nChandler, Phoebe, and Joey: No, I wasnt gonna ask you that, no.\nRachel: You guys are unbelievable. No! He cannot come.\nRoss: Excuse me?\nChandler: Its horrible.\nRoss: (sarcastic) Oh please, cant I come to your special, magical cabin?\nRachel: Why would you even want to come Ross? Youre a horrible skier.\nRoss: Oh-oh, hitting me where it hurts, my ski skills.\nMonica: Here we go again.\nJoey: I-I cant handle this, you guys.\nChandler: Y'know what, I can handle it, handles my middle name. Actually its the ah, middle part of my first name.\nRoss: All right Pheebs, your cabs ready.\nRachel: All right, lets go!\nRoss: Youre welcome.\nRachel: Oh, Im sorry, were you speaking to me or sleeping with someone else?\nRoss: We were on a break!\nRachel: Y'know Ross why dont you put that on your answering machine!\nRoss: Hey-hey, its valid okay? And Im not the only one who thinks so, Monica agrees with me.\nRachel: (to Monica) What?!\nMonica: (shyly) I dont know.\nRoss: Thats what you said last night.\nMonica: What I said was, was that I understood. Joeys the one who agreed with you!\nRoss: Okay.\nRachel: Really Joey?\nJoey: (pause) What?\nPhoebe: Y'know what, but there is, there is no right or wrong, here.\nRachel: No, I think its very obvious whos wrong here.\nRoss: Obviously not to Joey.\n[They all turn around and look at Joey.]\nJoey: (pause) What?\n[They all start fighting with each other.]\nRoss: (to Rachel) Look both, Joey and Monica feel the same way that I do. No-no-no-no.\nChandler: Guys, guys, guess who I am?! (starts dancing around in an effort to stop the fighting.)\n[They stop briefly to look at Chandler, but then start fighting again.]\nPhoebe: Hey! Hey! Hey! Hey!! Hey!!! (they all stop fighting, Chandler continues to dance.) Look what youre doing to Chandler!! (Chandler finally stops) (to Ross and Rachel) Yeah, look, we know this is really, really hard for you guys. Okay? (Ross starts to leave) You dont, all right you dont have to love each other, okay? You dont, you dont even have to like each other much right now. But please, you have to figure out a way to be around each other.\nJoey: Yeah, and not put us in the middle.\nPhoebe: Yeah, otherwise, I mean thats, thats, thats just it for us hanging out together. Y'know is that what you want? (they both look away) Can you be civil?\nRachel: Yeah.\nRoss: I can.\nPhoebe: Okay. Good, all right, lets get back in the car, cause its freezing, and my chest is unsupported.\nJoey: Oh what, wait, wait a second, I mean, what are we doing? Whos going with who?\nRoss: Look, you guys, you guys should go. (Joey tries to say something, but Ross cuts him off.) No, Im, you, you planned this all out, and I dont want to ruin it, so you guys should just go.\nJoey: Come on man, you drove all the way up here.\nRoss: No, no, really, Ive got to take the car back anyway, Im spending all day tomorrow with Ben, Its fine, no guilt I promise.\nRachel: Thank you.\nMonica: All right, well call you when we get back.\nRoss: Okay.\nPhoebe: Maybe we can like go to a movie or something. \nRoss: Okay.\nPhoebe: Or, or the rodeo!!\nRoss: That would be great.\nPhoebe: Okay!\nChandler: I was being Shelly Winters from The Poseidon Adventure.\nRoss: I know!\n[They all get in the cab and drive away.]\nPhoebe: Bye!!!\n[Ross tries to start the truck, and discovers the batterys dead.]\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The rest stop, Joey is making a sign.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Okay, done."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(reading the sign) Whats pleh?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Thats help spelled backwards so that the helicopters can read it from the air!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Huh. Whats doofus spelled backwards?"}, {"line_number": 6, "type": "narration", "text": "[Ross drives up.]"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "(all excited) Op, op, car! Car!! (sees its Ross) Ugh!!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, its Ross on one of his drives!"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler and Joey", "text": "Hey!!"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Hi!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "What is he doing here?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "He is saving your butt, ah, unless of course Im stepping on some toes here, in which case I can just mosey on, Ive got plenty of people to help on the Interstate."}, {"line_number": 13, "type": "dialogue", "speaker": "All", "text": "No! Come on!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "All right!! Fine! Fine."}, {"line_number": 15, "type": "narration", "text": "[Ross grabs the gas can he brought along, and walks through Joeys sign destroying it.]"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Arrrghh!!"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Oh no, now its not gonna make any sense!"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "(to Chandler and Monica) You guys, what, what do we do about Ross who drove all the way up here? What do we do? Just like send him back and were then gonna go skiing?"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Oh, this is horrible, its just horrible."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Guys, do you think we should ask Ross to come along?"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "I know, what about Rachel? I mean how are we even gonna ask her?"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Ask me what?"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Umm, if ah, it might be okay if Ross came skiing?"}, {"line_number": 24, "type": "narration", "text": "Chandler, Phoebe, and Joey: No, I wasnt gonna ask you that, no."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "You guys are unbelievable. No! He cannot come."}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "Excuse me?"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "Its horrible."}, {"line_number": 28, "type": "dialogue", "speaker": "Ross", "text": "(sarcastic) Oh please, cant I come to your special, magical cabin?"}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Why would you even want to come Ross? Youre a horrible skier."}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "Oh-oh, hitting me where it hurts, my ski skills."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Here we go again."}, {"line_number": 32, "type": "dialogue", "speaker": "Joey", "text": "I-I cant handle this, you guys."}, {"line_number": 33, "type": "dialogue", "speaker": "Chandler", "text": "Y'know what, I can handle it, handles my middle name. Actually its the ah, middle part of my first name."}, {"line_number": 34, "type": "dialogue", "speaker": "Ross", "text": "All right Pheebs, your cabs ready."}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "All right, lets go!"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Youre welcome."}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Oh, Im sorry, were you speaking to me or sleeping with someone else?"}, {"line_number": 38, "type": "dialogue", "speaker": "Ross", "text": "We were on a break!"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Y'know Ross why dont you put that on your answering machine!"}, {"line_number": 40, "type": "dialogue", "speaker": "Ross", "text": "Hey-hey, its valid okay? And Im not the only one who thinks so, Monica agrees with me."}, {"line_number": 41, "type": "dialogue", "speaker": "Rachel", "text": "(to Monica) What?!"}, {"line_number": 42, "type": "dialogue", "speaker": "Monica", "text": "(shyly) I dont know."}, {"line_number": 43, "type": "dialogue", "speaker": "Ross", "text": "Thats what you said last night."}, {"line_number": 44, "type": "dialogue", "speaker": "Monica", "text": "What I said was, was that I understood. Joeys the one who agreed with you!"}, {"line_number": 45, "type": "dialogue", "speaker": "Ross", "text": "Okay."}, {"line_number": 46, "type": "dialogue", "speaker": "Rachel", "text": "Really Joey?"}, {"line_number": 47, "type": "dialogue", "speaker": "Joey", "text": "(pause) What?"}, {"line_number": 48, "type": "dialogue", "speaker": "Phoebe", "text": "Y'know what, but there is, there is no right or wrong, here."}, {"line_number": 49, "type": "dialogue", "speaker": "Rachel", "text": "No, I think its very obvious whos wrong here."}, {"line_number": 50, "type": "dialogue", "speaker": "Ross", "text": "Obviously not to Joey."}, {"line_number": 51, "type": "narration", "text": "[They all turn around and look at Joey.]"}, {"line_number": 52, "type": "dialogue", "speaker": "Joey", "text": "(pause) What?"}, {"line_number": 53, "type": "narration", "text": "[They all start fighting with each other.]"}, {"line_number": 54, "type": "dialogue", "speaker": "Ross", "text": "(to Rachel) Look both, Joey and Monica feel the same way that I do. No-no-no-no."}, {"line_number": 55, "type": "dialogue", "speaker": "Chandler", "text": "Guys, guys, guess who I am?! (starts dancing around in an effort to stop the fighting.)"}, {"line_number": 56, "type": "narration", "text": "[They stop briefly to look at Chandler, but then start fighting again.]"}, {"line_number": 57, "type": "dialogue", "speaker": "Phoebe", "text": "Hey! Hey! Hey! Hey!! Hey!!! (they all stop fighting, Chandler continues to dance.) Look what youre doing to Chandler!! (Chandler finally stops) (to Ross and Rachel) Yeah, look, we know this is really, really hard for you guys. Okay? (Ross starts to leave) You dont, all right you dont have to love each other, okay? You dont, you dont even have to like each other much right now. But please, you have to figure out a way to be around each other."}, {"line_number": 58, "type": "dialogue", "speaker": "Joey", "text": "Yeah, and not put us in the middle."}, {"line_number": 59, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, otherwise, I mean thats, thats, thats just it for us hanging out together. Y'know is that what you want? (they both look away) Can you be civil?"}, {"line_number": 60, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 61, "type": "dialogue", "speaker": "Ross", "text": "I can."}, {"line_number": 62, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. Good, all right, lets get back in the car, cause its freezing, and my chest is unsupported."}, {"line_number": 63, "type": "dialogue", "speaker": "Joey", "text": "Oh what, wait, wait a second, I mean, what are we doing? Whos going with who?"}, {"line_number": 64, "type": "dialogue", "speaker": "Ross", "text": "Look, you guys, you guys should go. (Joey tries to say something, but Ross cuts him off.) No, Im, you, you planned this all out, and I dont want to ruin it, so you guys should just go."}, {"line_number": 65, "type": "dialogue", "speaker": "Joey", "text": "Come on man, you drove all the way up here."}, {"line_number": 66, "type": "dialogue", "speaker": "Ross", "text": "No, no, really, Ive got to take the car back anyway, Im spending all day tomorrow with Ben, Its fine, no guilt I promise."}, {"line_number": 67, "type": "dialogue", "speaker": "Rachel", "text": "Thank you."}, {"line_number": 68, "type": "dialogue", "speaker": "Monica", "text": "All right, well call you when we get back."}, {"line_number": 69, "type": "dialogue", "speaker": "Ross", "text": "Okay."}, {"line_number": 70, "type": "dialogue", "speaker": "Phoebe", "text": "Maybe we can like go to a movie or something. "}, {"line_number": 71, "type": "dialogue", "speaker": "Ross", "text": "Okay."}, {"line_number": 72, "type": "dialogue", "speaker": "Phoebe", "text": "Or, or the rodeo!!"}, {"line_number": 73, "type": "dialogue", "speaker": "Ross", "text": "That would be great."}, {"line_number": 74, "type": "dialogue", "speaker": "Phoebe", "text": "Okay!"}, {"line_number": 75, "type": "dialogue", "speaker": "Chandler", "text": "I was being Shelly Winters from The Poseidon Adventure."}, {"line_number": 76, "type": "dialogue", "speaker": "Ross", "text": "I know!"}, {"line_number": 77, "type": "narration", "text": "[They all get in the cab and drive away.]"}, {"line_number": 78, "type": "dialogue", "speaker": "Phoebe", "text": "Bye!!!"}, {"line_number": 79, "type": "narration", "text": "[Ross tries to start the truck, and discovers the batterys dead.]"}, {"line_number": 80, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S03E17", "season": 3, "episode_number": 17, "episode_title": "THE ONE WITHOUT THE SKI TRIP", "scene_number": 12, "scene_id": "S03E17_012", "location": "Carol and Susans", "scene_description": "Carol is running to answer the door.", "characters": ["Carol", "Ross"], "firestore_path": "/episodes/S03E17/scenes/S03E17_012", "raw_text": "[Scene: Carol and Susans, Carol is running to answer the door.]\nCarol: (looking through the peephole) Ugh. (opening the door) Ross!\nRoss: (entering) Hi! Sorry Im late. Were you sleeping?\nCarol: Ahh, nooo!!\nRoss: Oh, great! Listen, oh I had to get you a whole new battery. I got you the best one I could, cause thats not where you want to skimp.\nCarol: Youre a genius, Ross.\nRoss: Yeah, well it came to about $112, but what the hell, just call it an even 110?\nCarol: Okay, Ill pay you tomorrow. (pushes him out the door)\nRoss: Okay.\nCarol: Okay, bye!!\nRoss: So they ah, they all took off, it was pretty hard watching them go, y'know?\nCarol: Yeah, okay, bye. (closes the door, turns out the lights, and runs back to the bedroom)\nRoss: (outside the door) So Im gonna take off then!\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Carol and Susans, Carol is running to answer the door.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Carol", "text": "(looking through the peephole) Ugh. (opening the door) Ross!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hi! Sorry Im late. Were you sleeping?"}, {"line_number": 4, "type": "dialogue", "speaker": "Carol", "text": "Ahh, nooo!!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Oh, great! Listen, oh I had to get you a whole new battery. I got you the best one I could, cause thats not where you want to skimp."}, {"line_number": 6, "type": "dialogue", "speaker": "Carol", "text": "Youre a genius, Ross."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Yeah, well it came to about $112, but what the hell, just call it an even 110?"}, {"line_number": 8, "type": "dialogue", "speaker": "Carol", "text": "Okay, Ill pay you tomorrow. (pushes him out the door)"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Okay."}, {"line_number": 10, "type": "dialogue", "speaker": "Carol", "text": "Okay, bye!!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "So they ah, they all took off, it was pretty hard watching them go, y'know?"}, {"line_number": 12, "type": "dialogue", "speaker": "Carol", "text": "Yeah, okay, bye. (closes the door, turns out the lights, and runs back to the bedroom)"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "(outside the door) So Im gonna take off then!"}, {"line_number": 14, "type": "narration", "text": "End"}]}
