{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 1, "scene_id": "S03E06_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E06/scenes/S03E06_001", "raw_text": "THE ONE WITH THE FLASHBACK\nWritten by: Marta Kauffman & David Crane Transcribed by: Eric Aasen\n{Transcriber's Note: Rachel has two friends that are not named, so I referred to them as Friend No. 1 and Friend No. 2.}", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE FLASHBACK"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Marta Kauffman & David Crane Transcribed by: Eric Aasen"}, {"line_number": 3, "type": "narration", "text": "{Transcriber's Note: Rachel has two friends that are not named, so I referred to them as Friend No. 1 and Friend No. 2.}"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 2, "scene_id": "S03E06_002", "location": "Central Perk", "scene_description": "the whole gang is there including Janice.", "characters": ["Janice", "Joey", "Monica and Rachel", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E06/scenes/S03E06_002", "raw_text": "[Scene: Central Perk, the whole gang is there including Janice.]\nJanice: Janice has a question. Who of the six of you has sleep with the six of you?\nPhoebe: Wow, its like a dirty math problem.\nRoss: Im sorry the answer there would be...none of us.\nJanice: Come on over the years none of you ever y'know, got drunk and stupid.\nJoey: Well, thats really a different question.\nJanice: Im sorry I find it hard to believe that a group of people who spends as much time together as you guys do has never bumped uglies.\nJoey: Well, there was that one time that Monica and Rachel got together.\nMonica and Rachel: What?!!\nRachel: Excuse me, there was no time!\nJoey: Okay, but lets say there was. How might that go?\nJanice: Okay, okay, well then answer me this. Has any of you ever.... almost?\nRachel: Does anybody need more coffee?\nRoss: Yeah, Ill take some.\nJoey: Hey, theres a dog out there!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, the whole gang is there including Janice.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Janice", "text": "Janice has a question. Who of the six of you has sleep with the six of you?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Wow, its like a dirty math problem."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Im sorry the answer there would be...none of us."}, {"line_number": 5, "type": "dialogue", "speaker": "Janice", "text": "Come on over the years none of you ever y'know, got drunk and stupid."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Well, thats really a different question."}, {"line_number": 7, "type": "dialogue", "speaker": "Janice", "text": "Im sorry I find it hard to believe that a group of people who spends as much time together as you guys do has never bumped uglies."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Well, there was that one time that Monica and Rachel got together."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica and Rachel", "text": "What?!!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Excuse me, there was no time!"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Okay, but lets say there was. How might that go?"}, {"line_number": 12, "type": "dialogue", "speaker": "Janice", "text": "Okay, okay, well then answer me this. Has any of you ever.... almost?"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Does anybody need more coffee?"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Yeah, Ill take some."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Hey, theres a dog out there!"}, {"line_number": 16, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 3, "scene_id": "S03E06_003", "location": "Monica and Phoebes", "scene_description": "three years earlier, Phoebe, Monica, and Ross are there", "characters": ["Chandler", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E06/scenes/S03E06_003", "raw_text": "[Scene: Monica and Phoebes, three years earlier, Phoebe, Monica, and Ross are there]\nPhoebe: Oh, that is so unfortunate.\nRoss: What?\nPhoebe: Cute naked guy is really starting to put on weight.\nMonica: (entering from bedroom) Okay, Ill be back in just a minute. Oh, Phoebe Im sorry that I left lipstick marks on the phone.\nPhoebe: You didnt leave lipstick marks on the phone.\nMonica: Oh, then it mustve been you. Bye. (leaves)\nPhoebe: (angrily) Bye-bye! (to Ross) Thats why I moved out.\nRoss: Hey, y'know while were on that, when are you gonna tell my sister that you dont live here anymore.\nPhoebe: I think on some levels she already knows.\nRoss: Phoebe, she doesnt know that you sneak out every night, she doesnt know that you sneak back every morning, and she doesnt know that youve been living with your Grandmothers for a week now.\nPhoebe: Okay, well maybe not on those levels.\nChandler: (entering, with a goatee) Hey.\nRoss: Hey.\nChandler: Im never gonna find a roommate, ever.\nPhoebe: Why, nobody good?\nChandler: Well lets see, there was the guy with the ferrets, thats plural. The spitter. Oh-ho, and yes, the guy that enjoyed my name so much he felt the need to make a little noise every time he said it. Nice to meet you, Chandler Bing Bing! Great apartment Chandler Bing, Bing!\nRoss: So how many more do you have tomorrow?\nChandler: Two. This photographer, who seemed really dull. And this actor guy, who Im not sure about, because when he called and I answered the phone Chandler Bing, he said Whoa-whoa, short message.\nMonica: (entering) Ross (who has his foot on the coffee table), foot on the floor or come over no more!\nRoss: (to Phoebe) Sure, your dresser is missing but this she notices.\nMonica: What?\nRoss: I have to go. Yeah, Carol should be home by now, soo...\nChandler: Umm, hows it going with you guys?\nRoss: Oh, better, actually. Y'know I-I-I think I finally figured out why we were having so much trouble lately.\nPhoebe: Oh, really?\nRoss: Yeah, y'know how I have you guys, well she doesnt really have any close friends that are just hers, but last week she meet this woman at the gym, Susan something, and they really hit it off, and I-I-I think its gonna make a difference", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Phoebes, three years earlier, Phoebe, Monica, and Ross are there]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, that is so unfortunate."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Cute naked guy is really starting to put on weight."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(entering from bedroom) Okay, Ill be back in just a minute. Oh, Phoebe Im sorry that I left lipstick marks on the phone."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "You didnt leave lipstick marks on the phone."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Oh, then it mustve been you. Bye. (leaves)"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "(angrily) Bye-bye! (to Ross) Thats why I moved out."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Hey, y'know while were on that, when are you gonna tell my sister that you dont live here anymore."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "I think on some levels she already knows."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Phoebe, she doesnt know that you sneak out every night, she doesnt know that you sneak back every morning, and she doesnt know that youve been living with your Grandmothers for a week now."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, well maybe not on those levels."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "(entering, with a goatee) Hey."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Hey."}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Im never gonna find a roommate, ever."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Why, nobody good?"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Well lets see, there was the guy with the ferrets, thats plural. The spitter. Oh-ho, and yes, the guy that enjoyed my name so much he felt the need to make a little noise every time he said it. Nice to meet you, Chandler Bing Bing! Great apartment Chandler Bing, Bing!"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "So how many more do you have tomorrow?"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Two. This photographer, who seemed really dull. And this actor guy, who Im not sure about, because when he called and I answered the phone Chandler Bing, he said Whoa-whoa, short message."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "(entering) Ross (who has his foot on the coffee table), foot on the floor or come over no more!"}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "(to Phoebe) Sure, your dresser is missing but this she notices."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "What?"}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "I have to go. Yeah, Carol should be home by now, soo..."}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "Umm, hows it going with you guys?"}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Oh, better, actually. Y'know I-I-I think I finally figured out why we were having so much trouble lately."}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, really?"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Yeah, y'know how I have you guys, well she doesnt really have any close friends that are just hers, but last week she meet this woman at the gym, Susan something, and they really hit it off, and I-I-I think its gonna make a difference"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 4, "scene_id": "S03E06_004", "location": "Chandlers", "scene_description": "Chandler is interviewing a potential roommate.", "characters": ["Chandler", "Eric"], "firestore_path": "/episodes/S03E06/scenes/S03E06_004", "raw_text": "[Scene: Chandlers, Chandler is interviewing a potential roommate.]\nChandler: Soo, ah, Eric, what kind of photography do ya do?\nEric: Oh, mostly fashion, so there may be models here from time to time, I hope thats cool.\nChandler: Yes, that is cool. Because I have models here y'know......never.\nEric: Oh, yeah, during the summer, I spend most weekends at my sisters beach house, which you are welcome to use by the way. Although, I should probably tell you, shes a porn star. (Chandler breaks his pencil in half)\nChandler: Well, listen I ah, still have one more person to ah meet, but unless it turns out to be your sister, I think youre chances are pretty good. (Eric offers to shake hands) All right. (Chandler hugs him.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandlers, Chandler is interviewing a potential roommate.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Soo, ah, Eric, what kind of photography do ya do?"}, {"line_number": 3, "type": "dialogue", "speaker": "Eric", "text": "Oh, mostly fashion, so there may be models here from time to time, I hope thats cool."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Yes, that is cool. Because I have models here y'know......never."}, {"line_number": 5, "type": "dialogue", "speaker": "Eric", "text": "Oh, yeah, during the summer, I spend most weekends at my sisters beach house, which you are welcome to use by the way. Although, I should probably tell you, shes a porn star. (Chandler breaks his pencil in half)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Well, listen I ah, still have one more person to ah meet, but unless it turns out to be your sister, I think youre chances are pretty good. (Eric offers to shake hands) All right. (Chandler hugs him.)"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 5, "scene_id": "S03E06_005", "location": "Chandlers", "scene_description": "Chandler is interviewing Joey.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E06/scenes/S03E06_005", "raw_text": "[Scene: Chandlers, Chandler is interviewing Joey.]\nChandler: (running around the apartment pointing out things) Bedroom. Bathroom. Living room. This right here is the kitchen, and thanks for coming by, (opens door) Bye-bye.\nJoey: Dont you ah, dont you wanna ask me any questions?\nChandler: Sure. Ummm. Whats up?\nJoey: Well, ah, Im an actor. Im fairly neat. I ah, I got my own TV. Oh, and dont worry Im totally okay with the gay thing.\nChandler: What gay thing?\nJoey: Ah, y'know just in general people being gay, thing. Im totally cool with that.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandlers, Chandler is interviewing Joey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(running around the apartment pointing out things) Bedroom. Bathroom. Living room. This right here is the kitchen, and thanks for coming by, (opens door) Bye-bye."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Dont you ah, dont you wanna ask me any questions?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Sure. Ummm. Whats up?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Well, ah, Im an actor. Im fairly neat. I ah, I got my own TV. Oh, and dont worry Im totally okay with the gay thing."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "What gay thing?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Ah, y'know just in general people being gay, thing. Im totally cool with that."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 6, "scene_id": "S03E06_006", "location": "the hallway", "scene_description": "Monica is coming up the stairs.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S03E06/scenes/S03E06_006", "raw_text": "[Scene: the hallway, Monica is coming up the stairs.]\nChandler: Well okay Jerry, thanks for stopping by.\n(Joey is leaving and notices Monica, as Monica notices him)\nMonica: Hi.\nJoey: Hey!\n(Joey leaves and Monica mouths to Chandler Oh my God!)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: the hallway, Monica is coming up the stairs.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Well okay Jerry, thanks for stopping by."}, {"line_number": 3, "type": "action", "text": "(Joey is leaving and notices Monica, as Monica notices him)"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Hi."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Hey!"}, {"line_number": 6, "type": "action", "text": "(Joey leaves and Monica mouths to Chandler Oh my God!)"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 7, "scene_id": "S03E06_007", "location": "A bar", "scene_description": "Chandler is entering.", "characters": ["Chandler", "Monica", "Rachel", "Waitress"], "firestore_path": "/episodes/S03E06/scenes/S03E06_007", "raw_text": "[Scene: A bar, Chandler is entering.]\nChandler: Hey, Mon.\nMonica: Hey-hey-hey. You wanna hear something that sucks.\nChandler: Do I ever.\nMonica: Chris says theyre closing down the bar.\nChandler: No way!\nMonica: Yeah, apparently theyre turning it into some kinda coffee place.\nChandler: Just coffee! Where are we gonna hang out now?\nMonica: Got me.\nChandler: (to bartender) Can I get a beer.\nMonica: Hey, did you pick a roommate?\nChandler: You betcha!\nMonica: Is it the Italian guy?\nChandler: Um-mm, yeah right!\nMonica: Hes so cute.\nChandler: Oh yes, and thats what I want a roommate that I can walk around with and be referred to as the funny one.\nMonica: Oh look, the pool tables free. Rack em up. Ill be back in just a minute. Get ready for me to whip your butt.\nChandler: Okay, but after that, were shootin some pool.\nRachel: (sitting at a table with some of her friends) (to waitress) Oh, um, no, no, no, no excuse me, hello. Hi. My friend ordered an onion, not an olive, and uh I ordered a rum and Diet Coke, which I dont think this is.\nWaitress: I am so sorry.\nRachel: Thats all right. (to her friends) I mean hard is it to get a couple drinks right, huh?\nFriend No. 1: Well, I would like to propose a toast to the woman, who in one year from today, become Mrs. Dr. Barry Farber DDS\nRachel: Ummm, I think its time to see the ring again. (holds her hand out and they all scream)\nFriend No. 2: Oh, isnt it exciting, I mean its like having a boyfriend for life.\nRachel: Yeah, I know.\nFriend No. 1: What?\nRachel: Oh, I dont know. Well maybe its just the idea of Barry for the rest of my life. I dont know I think I feel like I need to have one last fling, y'know, just to sorta get it out of my system. (Chandler is listening in very intensely)\nFriend No. 1: Rachel stop!\nFriend No. 2: Youre so bad!\nRachel: Im serious, I really, I think I need just to have some...meaningless, sex y'know, with the next guy that I see.\n(Chandler throws the cue ball under there table.)\nChandler: Excuse, I seem to have dropped my ball.\nRachel: Yeah, so?\nChandler: (picks it up) And now Ive picked it up again. (walks over to Monica.)\nMonica: Oh my God, I went to high school with her. (to Rachel) Rachel! Hi!\nRachel: Monica! Look! Hi! What do ya think? (shows her, her ring)\nMonica: Oh my God, you cant even see where the Titanic hit it.\nRachel: Yes, his name is Barry, hes a doctor, thank you very much.\nMonica: Awww, just like you always wanted. Congratulations\nRachel: Thank you. So how-how bout you, are-are you seeing anybody?\nMonica: Aww, not right now.\nRachel: Oh, but thats okay.\nMonica: I know.\nRachel: Yeah.\n(An awkward silence)\nMonica: So, Ill get-get back to my friend.\nRachel: Oh, yeah, sure, sure, sure, sure. (points at Chandler, who holds up the cue ball as a Remember me? thing) Listen, can we please have lunch the next time Im in the city?\nMonica: Oh, thatd be great.\nRachel: Okay!\nMonica: Thanks.\nRachel: Bye!\nMonica: Bye! (to Chandler) Ten bucks says, I never see that woman again in my life.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A bar, Chandler is entering.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey, Mon."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Hey-hey-hey. You wanna hear something that sucks."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Do I ever."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Chris says theyre closing down the bar."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "No way!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Yeah, apparently theyre turning it into some kinda coffee place."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Just coffee! Where are we gonna hang out now?"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Got me."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "(to bartender) Can I get a beer."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Hey, did you pick a roommate?"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "You betcha!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Is it the Italian guy?"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Um-mm, yeah right!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Hes so cute."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Oh yes, and thats what I want a roommate that I can walk around with and be referred to as the funny one."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Oh look, the pool tables free. Rack em up. Ill be back in just a minute. Get ready for me to whip your butt."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Okay, but after that, were shootin some pool."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "(sitting at a table with some of her friends) (to waitress) Oh, um, no, no, no, no excuse me, hello. Hi. My friend ordered an onion, not an olive, and uh I ordered a rum and Diet Coke, which I dont think this is."}, {"line_number": 20, "type": "dialogue", "speaker": "Waitress", "text": "I am so sorry."}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Thats all right. (to her friends) I mean hard is it to get a couple drinks right, huh?"}, {"line_number": 22, "type": "narration", "text": "Friend No. 1: Well, I would like to propose a toast to the woman, who in one year from today, become Mrs. Dr. Barry Farber DDS"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Ummm, I think its time to see the ring again. (holds her hand out and they all scream)"}, {"line_number": 24, "type": "narration", "text": "Friend No. 2: Oh, isnt it exciting, I mean its like having a boyfriend for life."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I know."}, {"line_number": 26, "type": "narration", "text": "Friend No. 1: What?"}, {"line_number": 27, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I dont know. Well maybe its just the idea of Barry for the rest of my life. I dont know I think I feel like I need to have one last fling, y'know, just to sorta get it out of my system. (Chandler is listening in very intensely)"}, {"line_number": 28, "type": "narration", "text": "Friend No. 1: Rachel stop!"}, {"line_number": 29, "type": "narration", "text": "Friend No. 2: Youre so bad!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Im serious, I really, I think I need just to have some...meaningless, sex y'know, with the next guy that I see."}, {"line_number": 31, "type": "action", "text": "(Chandler throws the cue ball under there table.)"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Excuse, I seem to have dropped my ball."}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, so?"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "(picks it up) And now Ive picked it up again. (walks over to Monica.)"}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Oh my God, I went to high school with her. (to Rachel) Rachel! Hi!"}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "Monica! Look! Hi! What do ya think? (shows her, her ring)"}, {"line_number": 37, "type": "dialogue", "speaker": "Monica", "text": "Oh my God, you cant even see where the Titanic hit it."}, {"line_number": 38, "type": "dialogue", "speaker": "Rachel", "text": "Yes, his name is Barry, hes a doctor, thank you very much."}, {"line_number": 39, "type": "dialogue", "speaker": "Monica", "text": "Awww, just like you always wanted. Congratulations"}, {"line_number": 40, "type": "dialogue", "speaker": "Rachel", "text": "Thank you. So how-how bout you, are-are you seeing anybody?"}, {"line_number": 41, "type": "dialogue", "speaker": "Monica", "text": "Aww, not right now."}, {"line_number": 42, "type": "dialogue", "speaker": "Rachel", "text": "Oh, but thats okay."}, {"line_number": 43, "type": "dialogue", "speaker": "Monica", "text": "I know."}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 45, "type": "action", "text": "(An awkward silence)"}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "So, Ill get-get back to my friend."}, {"line_number": 47, "type": "dialogue", "speaker": "Rachel", "text": "Oh, yeah, sure, sure, sure, sure. (points at Chandler, who holds up the cue ball as a Remember me? thing) Listen, can we please have lunch the next time Im in the city?"}, {"line_number": 48, "type": "dialogue", "speaker": "Monica", "text": "Oh, thatd be great."}, {"line_number": 49, "type": "dialogue", "speaker": "Rachel", "text": "Okay!"}, {"line_number": 50, "type": "dialogue", "speaker": "Monica", "text": "Thanks."}, {"line_number": 51, "type": "dialogue", "speaker": "Rachel", "text": "Bye!"}, {"line_number": 52, "type": "dialogue", "speaker": "Monica", "text": "Bye! (to Chandler) Ten bucks says, I never see that woman again in my life."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 8, "scene_id": "S03E06_008", "location": "Monica and Phoebes", "scene_description": "Ross is on the phone, as Phoebe is walking by carrying a lamp.", "characters": ["Eric", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E06/scenes/S03E06_008", "raw_text": "[Scene: Monica and Phoebes, Ross is on the phone, as Phoebe is walking by carrying a lamp.]\nRoss: No real-, honey, really its fine, just g-go with Susan. Really, I, no, I think girls night out is a great idea. Okay, okay, bye\nPhoebe: So what are they doing?\nRoss: I dont know, something girlie.\nPhoebe: (to Monica, whos entering) Hey, youre early.\nMonica: What are you doing with the lamp?\nPhoebe: Im just taking it to be re-wired.\nMonica: Oh, well dont take it to the same place you took the stereo, cause theyve had that thing for over a week.\n(There is a knock on the door, Phoebe answers it, its Mr. Heckles)\nPhoebe: No, no, Mr. Heckles no one is making any noise up here.\nMr. Heckles: Youre disturbing my oboe practice.\nPhoebe: You dont play the oboe!\nMr. Heckles: I could play the oboe!\nPhoebe: Then Im gonna have to ask you to keep it down. (slams the door in his face.)\n(in the hallway, Eric is moving in)\nMr. Heckles: (to Eric) Who are you?\nEric: Hi, Im Eric, Im gonna be Chandlers new roommate.\nMr. Heckles: Im Chandlers new roommate.\nEric: I-I-I dont think so.\nMr. Heckles: I could be Chandlers new roommate.\nEric: But, he told me over the phone.\nMr. Heckles: He told me in person.\nEric: Thats weird.\nMr. Heckles: Well, Im going to go into my new apartment now. (goes over to the door and opens it) Ehh! (Eric leaves)\n(inside Chandlers apartment, Chandler is coming in from his bedroom, sees Mr. Heckles, and screams.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Phoebes, Ross is on the phone, as Phoebe is walking by carrying a lamp.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "No real-, honey, really its fine, just g-go with Susan. Really, I, no, I think girls night out is a great idea. Okay, okay, bye"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "So what are they doing?"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "I dont know, something girlie."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "(to Monica, whos entering) Hey, youre early."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "What are you doing with the lamp?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Im just taking it to be re-wired."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Oh, well dont take it to the same place you took the stereo, cause theyve had that thing for over a week."}, {"line_number": 9, "type": "action", "text": "(There is a knock on the door, Phoebe answers it, its Mr. Heckles)"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "No, no, Mr. Heckles no one is making any noise up here."}, {"line_number": 11, "type": "narration", "text": "Mr. Heckles: Youre disturbing my oboe practice."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "You dont play the oboe!"}, {"line_number": 13, "type": "narration", "text": "Mr. Heckles: I could play the oboe!"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Then Im gonna have to ask you to keep it down. (slams the door in his face.)"}, {"line_number": 15, "type": "action", "text": "(in the hallway, Eric is moving in)"}, {"line_number": 16, "type": "narration", "text": "Mr. Heckles: (to Eric) Who are you?"}, {"line_number": 17, "type": "dialogue", "speaker": "Eric", "text": "Hi, Im Eric, Im gonna be Chandlers new roommate."}, {"line_number": 18, "type": "narration", "text": "Mr. Heckles: Im Chandlers new roommate."}, {"line_number": 19, "type": "dialogue", "speaker": "Eric", "text": "I-I-I dont think so."}, {"line_number": 20, "type": "narration", "text": "Mr. Heckles: I could be Chandlers new roommate."}, {"line_number": 21, "type": "dialogue", "speaker": "Eric", "text": "But, he told me over the phone."}, {"line_number": 22, "type": "narration", "text": "Mr. Heckles: He told me in person."}, {"line_number": 23, "type": "dialogue", "speaker": "Eric", "text": "Thats weird."}, {"line_number": 24, "type": "narration", "text": "Mr. Heckles: Well, Im going to go into my new apartment now. (goes over to the door and opens it) Ehh! (Eric leaves)"}, {"line_number": 25, "type": "action", "text": "(inside Chandlers apartment, Chandler is coming in from his bedroom, sees Mr. Heckles, and screams.)"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 9, "scene_id": "S03E06_009", "location": "the hallway", "scene_description": "Joey is moving in, Monica is leaving.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S03E06/scenes/S03E06_009", "raw_text": "[Scene: the hallway, Joey is moving in, Monica is leaving.]\nMonica: Hi, again.\nJoey: Hey! (goes into the apartment)\nChandler: (leaving to go to work) Hey!\nMonica: Thank you soo, much.\nChandler: Oh, dont thank me, thank the jerk that never showed up. Okay, I gotta get to get to work.\n(Joey comes back into the hallway and starts to pick up a heavy box)\nMonica: You want some help with that?\nJoey: Oh, no thanks, I got it. (picks it up) No I dont!\nMonica: Whoa! Are you okay?\nJoey: Whew! Stood up to fast, got a little head rush.\nMonica: Its the heat. (has her hand on his chest, and then pulls it away) And-and the humidity.\nJoey: Thats a uh, thats a tough combination.\nMonica: Do you wanna come in for some lemonade?\nJoey: Like you wouldnt believe. (they go into the apartment) Wow! This is a great place.\nMonica: Thank you. Just make yourself comfortable.\nJoey: Gotcha.\nMonica: This place is really my Grandmothers. (Joey starts to take off all of his clothes, while Monica gets the glasses and pours the lemonade.) I got it from her when she moved to Florida, otherwise I could never afford a place like this. So if the landlord ever asks, Im 87 year old woman, whos afraid of her VCR. So are you thirsty?\nJoey: Oh, you bet I am!\nMonica: (turning around) Okay, heres your penis!\nCommercial Break\n[Scene: continued from earlier.]\nMonica: Oh my God!!! What are you doing?!!\nJoey: You said, you wanna come in for some lemonade?\nMonica: So?!\nJoey: Whoa, ah!! Were you just gonna give me some lemonade?\nMonica: Yeah huh!! Cover yourself up!\nJoey: Oh right, right.\nMonica: I dont believe this! When someone asks you in for lemonade, and to you that means they wanna have sex?\nJoey: Well usually...yeah! Well, not just lemonade, iced tea, sometimes juice. Well, sorry, I just, I thought you liked me. Im such a jerk.\nMonica: Its okay. I suppose it could happen to anyone, not anyone I know, but... By the way I can still see it.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: the hallway, Joey is moving in, Monica is leaving.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Hi, again."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Hey! (goes into the apartment)"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "(leaving to go to work) Hey!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Thank you soo, much."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Oh, dont thank me, thank the jerk that never showed up. Okay, I gotta get to get to work."}, {"line_number": 7, "type": "action", "text": "(Joey comes back into the hallway and starts to pick up a heavy box)"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "You want some help with that?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Oh, no thanks, I got it. (picks it up) No I dont!"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Whoa! Are you okay?"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Whew! Stood up to fast, got a little head rush."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Its the heat. (has her hand on his chest, and then pulls it away) And-and the humidity."}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Thats a uh, thats a tough combination."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Do you wanna come in for some lemonade?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Like you wouldnt believe. (they go into the apartment) Wow! This is a great place."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Thank you. Just make yourself comfortable."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Gotcha."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "This place is really my Grandmothers. (Joey starts to take off all of his clothes, while Monica gets the glasses and pours the lemonade.) I got it from her when she moved to Florida, otherwise I could never afford a place like this. So if the landlord ever asks, Im 87 year old woman, whos afraid of her VCR. So are you thirsty?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Oh, you bet I am!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "(turning around) Okay, heres your penis!"}, {"line_number": 21, "type": "narration", "text": "Commercial Break"}, {"line_number": 22, "type": "narration", "text": "[Scene: continued from earlier.]"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Oh my God!!! What are you doing?!!"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "You said, you wanna come in for some lemonade?"}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "So?!"}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Whoa, ah!! Were you just gonna give me some lemonade?"}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Yeah huh!! Cover yourself up!"}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "Oh right, right."}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "I dont believe this! When someone asks you in for lemonade, and to you that means they wanna have sex?"}, {"line_number": 30, "type": "dialogue", "speaker": "Joey", "text": "Well usually...yeah! Well, not just lemonade, iced tea, sometimes juice. Well, sorry, I just, I thought you liked me. Im such a jerk."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Its okay. I suppose it could happen to anyone, not anyone I know, but... By the way I can still see it."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 10, "scene_id": "S03E06_010", "location": "Monica and Phoebes", "scene_description": "Monica is vacuuming.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E06/scenes/S03E06_010", "raw_text": "[Scene: Monica and Phoebes, Monica is vacuuming.]\nMonica: Pheebs?\nPhoebe: Huh?\nMonica: Wheres your bed?\nPhoebe: Its not in the apartment? (Monica gives a Come on look) Oh no. I cant believe this is happening again.\nMonica: What?\nPhoebe: Okay, enough with the third degree! I-Ive, I dont live here anymore.\nMonica: What are you talking about?\nPhoebe: Im sorry, I-I-I-I dont live here anymore. I-I didnt know how to tell you, but y'know everybody else knows!\nMonica: Everybody knows!\nPhoebe: That was supposed to be a good thing, I forget why. Just listen, Monica, I, do you know, okay, do you know, I couldnt sleep for like a month because I got like a dot of ink on one of the sofa cushions. \nMonica: Well, you-you coulda just turned the cushion over.\nPhoebe: Yeah, I wouldve except I had a big spaghetti stain on the other side.\nMonica: What?!?!\nPhoebe: Okay, this is what Im talking about, this. I-I need to live in a land where people can spill.\nMonica: You can spill. In the sink.\nPhoebe: Aw, honey its not your fault, y'know this is who you are, and I love you, and I want us to be friends, and if I keep living here I dont see that happening.\nMonica: I love you, too. \nPhoebe: Aww, good. (they hug) What?\nMonica: What? Im just said.\nPhoebe: No youre not, youre wondering which cushion it is.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Phoebes, Monica is vacuuming.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Pheebs?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Huh?"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Wheres your bed?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Its not in the apartment? (Monica gives a Come on look) Oh no. I cant believe this is happening again."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "What?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, enough with the third degree! I-Ive, I dont live here anymore."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "What are you talking about?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Im sorry, I-I-I-I dont live here anymore. I-I didnt know how to tell you, but y'know everybody else knows!"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Everybody knows!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "That was supposed to be a good thing, I forget why. Just listen, Monica, I, do you know, okay, do you know, I couldnt sleep for like a month because I got like a dot of ink on one of the sofa cushions. "}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Well, you-you coulda just turned the cushion over."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, I wouldve except I had a big spaghetti stain on the other side."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "What?!?!"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, this is what Im talking about, this. I-I need to live in a land where people can spill."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "You can spill. In the sink."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Aw, honey its not your fault, y'know this is who you are, and I love you, and I want us to be friends, and if I keep living here I dont see that happening."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "I love you, too. "}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Aww, good. (they hug) What?"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "What? Im just said."}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "No youre not, youre wondering which cushion it is."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 11, "scene_id": "S03E06_011", "location": "Chandler and Joey's", "scene_description": "(now) Joey is watching Baywatch, as Chandler enters from his bedroom.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S03E06/scenes/S03E06_011", "raw_text": "[Scene: Chandler and Joey's, (now) Joey is watching Baywatch, as Chandler enters from his bedroom.]\nChandler: So ah, whatcha watching?\nJoey: Baywatch.\nChandler: Whats it about?\nJoey: Lifeguards.\nChandler: Well, it sounds kinda stupid... (looks at the TV) Whos she?\nJoey: Nicole Eggert. You'll like her.\n(Baywatch goes into one of those running scenes.)\nChandler: Wow! Look at them run.\nJoey: They do that a lot. Hey, you want a beer?\nChandler: Yeah, Ill go get one.\nJoey: No, no, no, dont get up, I got a cooler right here.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, (now) Joey is watching Baywatch, as Chandler enters from his bedroom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "So ah, whatcha watching?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Baywatch."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Whats it about?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Lifeguards."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Well, it sounds kinda stupid... (looks at the TV) Whos she?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Nicole Eggert. You'll like her."}, {"line_number": 8, "type": "action", "text": "(Baywatch goes into one of those running scenes.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Wow! Look at them run."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "They do that a lot. Hey, you want a beer?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, Ill go get one."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "No, no, no, dont get up, I got a cooler right here."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 12, "scene_id": "S03E06_012", "location": "Monicas", "scene_description": "Monica is coming out of the bathroom wearing nothing but a towel, as Chandler is entering.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S03E06/scenes/S03E06_012", "raw_text": "[Scene: Monicas, Monica is coming out of the bathroom wearing nothing but a towel, as Chandler is entering.]\nChandler: Well, hello!\nMonica: Hey.\nChandler: Do you have any beers? Were out of beers.\nMonica: (all depressed) Help yourself.\nChandler: You okay?\nMonica: Phoebe moved out.\nChandler: Right.\nMonica: I dont understand, I mean am I so hard to live, is this why I dont have a boyfriend?\nChandler: Noo!! You dont have a boyfriend because....I dont, I dont know why you dont have a boyfriend. You should have a boyfriend.\nMonica: Well, I think so.\nChandler: Oh-ho, come here. (goes and hugs her) Listen, you are one of my favourite people and the most beautiful woman Ive ever known in real life.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas, Monica is coming out of the bathroom wearing nothing but a towel, as Chandler is entering.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Well, hello!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Hey."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Do you have any beers? Were out of beers."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(all depressed) Help yourself."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "You okay?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Phoebe moved out."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Right."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "I dont understand, I mean am I so hard to live, is this why I dont have a boyfriend?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Noo!! You dont have a boyfriend because....I dont, I dont know why you dont have a boyfriend. You should have a boyfriend."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Well, I think so."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Oh-ho, come here. (goes and hugs her) Listen, you are one of my favourite people and the most beautiful woman Ive ever known in real life."}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 13, "scene_id": "S03E06_013", "location": "the bar", "scene_description": "Ross is entering, Phoebe is at the bar, they are the only two in the place.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S03E06/scenes/S03E06_013", "raw_text": "[Scene: the bar, Ross is entering, Phoebe is at the bar, they are the only two in the place.]\nRoss: (all depressed) Hi. Where is everybody?\nPhoebe: Oh, its already closed, Chris gave me the keys to lock up-what is wrong?\nRoss: My marriage, I think my marriage is um, is kinda over.\nPhoebe: Oh no! Why?\nRoss: Cause Carols a lesbian. (Phoebe is shocked) And, and Im not one. And apparently its not a mix and match situation.\nPhoebe: Oh my God! I dont believe it! Oh, you poor bunny.\nRoss: (sets out a bunch of shot glasses and starts to poor himself a drink, many drinks) Im an idiot. I mean shoulda seen it, I mean Carol and Id be out and shed, shed see some beautiful woman, and, and shed be Ross y'know look at her, and Id think, God, my wife is cool!\nPhoebe: Aw! Hey, do you think that Susan person is her lover?\nRoss: Well, now I do!!\nPhoebe: Im sorry.\nRoss: Seven years. I mean weve been together seven years, shes the only woman whos ever loved me, and the only woman Ive-Ive ever....\nPhoebe: Aw, God Ross. Oh.(goes over and hugs him)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: the bar, Ross is entering, Phoebe is at the bar, they are the only two in the place.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "(all depressed) Hi. Where is everybody?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, its already closed, Chris gave me the keys to lock up-what is wrong?"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "My marriage, I think my marriage is um, is kinda over."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Oh no! Why?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Cause Carols a lesbian. (Phoebe is shocked) And, and Im not one. And apparently its not a mix and match situation."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God! I dont believe it! Oh, you poor bunny."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "(sets out a bunch of shot glasses and starts to poor himself a drink, many drinks) Im an idiot. I mean shoulda seen it, I mean Carol and Id be out and shed, shed see some beautiful woman, and, and shed be Ross y'know look at her, and Id think, God, my wife is cool!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Aw! Hey, do you think that Susan person is her lover?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Well, now I do!!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Im sorry."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Seven years. I mean weve been together seven years, shes the only woman whos ever loved me, and the only woman Ive-Ive ever...."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Aw, God Ross. Oh.(goes over and hugs him)"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 14, "scene_id": "S03E06_014", "location": "Monicas", "scene_description": "Chandler and Monica are still hugging each other.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S03E06/scenes/S03E06_014", "raw_text": "[Scene: Monicas, Chandler and Monica are still hugging each other.]\nChandler: Umm, this is nice.\nMonica: I know, it is isnt it?\nChandler: No, I mean it, this feels really good. Is it a hundred percent cotton?\nMonica: Yeah! And I got it on sale, too.\nChandler: Anyway, I should go, one of the lifeguards was just about to dismantle a nuclear device.\nMonica: Well, if you wanna get a drink later we can.\nChandler: Oh yeah, that sounds great. (starts to leave) Oh, and listen, its, its gonna be....\nMonica: I know. Thanks. (Chandler leaves)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas, Chandler and Monica are still hugging each other.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Umm, this is nice."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "I know, it is isnt it?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "No, I mean it, this feels really good. Is it a hundred percent cotton?"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Yeah! And I got it on sale, too."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Anyway, I should go, one of the lifeguards was just about to dismantle a nuclear device."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Well, if you wanna get a drink later we can."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Oh yeah, that sounds great. (starts to leave) Oh, and listen, its, its gonna be...."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "I know. Thanks. (Chandler leaves)"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 15, "scene_id": "S03E06_015", "location": "the bar", "scene_description": "Phoebe is still hugging Ross.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E06/scenes/S03E06_015", "raw_text": "[Scene: the bar, Phoebe is still hugging Ross.]\nRoss: Maybe this wouldve happened if Id been more nurturing, or Id paid more attention, or I... had a uterus. I cant believe this!\nPhoebe: I know no, no, y'know you dont deserve this, you dont Ross. Youre, youre really, youre so good. (kisses him on the cheek)\nRoss: Thanks.\nPhoebe: And youre so sweet. (kisses him on the other cheek) And youre kind (kisses him on the lips)\nRoss: Thanks. (kisses her on the lips)\n(They pause, and they the start kissing passionately, and taking off each others clothes, and they start to lie down on the pool table.)\nRoss: Wait, wait, wait, wait, wait.\nPhoebe: Huh?\n(Ross tries to clear off the pool table by knocking the balls to the other end of the table, but they all bounce back, and he frantically starts to throw them into the pockets.)\nPhoebe: Okay, its okay.\n(Phoebe jumps on to the table and lays down, Ross follows her and hits his head on the light hanging over the pool table.)\nPhoebe: Oh. (they start kissing again)\nRoss: Wait, wait, wait.\nPhoebe: What?\nRoss: My foot is stuck in the pocket.\nPhoebe: What?\nRoss: No, I cant get it out.\nPhoebe: Well, thats not something a girl wants to hear.\nRoss: No, come on dont start. (they start kissing again) Ouch!\nPhoebe: What?\nRoss: Stupid balls are in the way. (holds up two balls)\n(They both look at each other and start laughing (Lisa almost lost it there), and sit up. Ross hits his head on the lamp again.)\nRoss: Oh well. It probably wouldve been the most constructive solution.\nPhoebe: You have chalk on your face.\nRoss: Huh? (the rest of the gang enters)\nPhoebe: Oh, Ross youre right, I dont know why I always thought this was real grass.\nMonica: Hey, are you okay?\nRoss: My wifes a lesbian.\nJoey: Cool!!\nChandler: Ross-Joey, Joey-Ross. (they shake hands)\nRoss: Hi.\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: the bar, Phoebe is still hugging Ross.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Maybe this wouldve happened if Id been more nurturing, or Id paid more attention, or I... had a uterus. I cant believe this!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "I know no, no, y'know you dont deserve this, you dont Ross. Youre, youre really, youre so good. (kisses him on the cheek)"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Thanks."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "And youre so sweet. (kisses him on the other cheek) And youre kind (kisses him on the lips)"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Thanks. (kisses her on the lips)"}, {"line_number": 7, "type": "action", "text": "(They pause, and they the start kissing passionately, and taking off each others clothes, and they start to lie down on the pool table.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Wait, wait, wait, wait, wait."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Huh?"}, {"line_number": 10, "type": "action", "text": "(Ross tries to clear off the pool table by knocking the balls to the other end of the table, but they all bounce back, and he frantically starts to throw them into the pockets.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, its okay."}, {"line_number": 12, "type": "action", "text": "(Phoebe jumps on to the table and lays down, Ross follows her and hits his head on the light hanging over the pool table.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Oh. (they start kissing again)"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Wait, wait, wait."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "My foot is stuck in the pocket."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "No, I cant get it out."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Well, thats not something a girl wants to hear."}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "No, come on dont start. (they start kissing again) Ouch!"}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Stupid balls are in the way. (holds up two balls)"}, {"line_number": 23, "type": "action", "text": "(They both look at each other and start laughing (Lisa almost lost it there), and sit up. Ross hits his head on the lamp again.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "Oh well. It probably wouldve been the most constructive solution."}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "You have chalk on your face."}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "Huh? (the rest of the gang enters)"}, {"line_number": 27, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, Ross youre right, I dont know why I always thought this was real grass."}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Hey, are you okay?"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "My wifes a lesbian."}, {"line_number": 30, "type": "dialogue", "speaker": "Joey", "text": "Cool!!"}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "Ross-Joey, Joey-Ross. (they shake hands)"}, {"line_number": 32, "type": "dialogue", "speaker": "Ross", "text": "Hi."}, {"line_number": 33, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S03E06", "season": 3, "episode_number": 6, "episode_title": "THE ONE WITH THE FLASHBACK", "scene_number": 16, "scene_id": "S03E06_016", "location": "the bar", "scene_description": "Chandler is playing pool, as Rachel enters.", "characters": ["Chandler", "Her Friends", "Rachel"], "firestore_path": "/episodes/S03E06/scenes/S03E06_016", "raw_text": "[Scene: the bar, Chandler is playing pool, as Rachel enters.]\nChandler: I cant believe you came back.\nRachel: Dont say anything. I dont wanna speak, I dont wanna think. I just want you to take me and kiss me and make love to me right here, right now.\n(She hits the jukebox Fonzy style, and Its That Time of Season starts to play, as they start to kiss.)\nFriend No. 2: Rachel! Rachel! (stirs Rachel from her dream, shes in her car driving back from the city)\nRachel: What?\nFriend No. 2: You missed the exit!\nRachel: Oh, sorry.\nFriend No. 1: My God, what were you thinking about?\nRachel: Um, (shyly) Barry.\nHer Friends: Awwww!!\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: the bar, Chandler is playing pool, as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "I cant believe you came back."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Dont say anything. I dont wanna speak, I dont wanna think. I just want you to take me and kiss me and make love to me right here, right now."}, {"line_number": 4, "type": "action", "text": "(She hits the jukebox Fonzy style, and Its That Time of Season starts to play, as they start to kiss.)"}, {"line_number": 5, "type": "narration", "text": "Friend No. 2: Rachel! Rachel! (stirs Rachel from her dream, shes in her car driving back from the city)"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 7, "type": "narration", "text": "Friend No. 2: You missed the exit!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh, sorry."}, {"line_number": 9, "type": "narration", "text": "Friend No. 1: My God, what were you thinking about?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Um, (shyly) Barry."}, {"line_number": 11, "type": "dialogue", "speaker": "Her Friends", "text": "Awwww!!"}, {"line_number": 12, "type": "narration", "text": "End"}]}
