{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 1, "scene_id": "S03E07_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S03E07/scenes/S03E07_001", "raw_text": "THE ONE WITH THE RACE CAR BED\nWritten by: Seth Kurland Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE RACE CAR BED"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Seth Kurland Transcribed by: Eric Aasen"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 2, "scene_id": "S03E07_002", "location": "Central Perk", "scene_description": "the whole gang is there, Ross is telling a story about what happened at work and the rest of the gang are thinking to themselves, denoted by italics.", "characters": ["Chandler", "Gunther", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_002", "raw_text": "[Scene: Central Perk, the whole gang is there, Ross is telling a story about what happened at work and the rest of the gang are thinking to themselves, denoted by italics.]\nRoss: So I told Carl, Nobody, no matter how famous their parents are, nobody is allowed to climb on the dinosaur. But of course this went in one ear and out.....\nRachel: I love how he cares so much about stuff. If I squint I can pretend hes Alan Alda.\nMonica: Oh good, another dinosaur story. When are those gonna become extinct?\nChandler: If I was a superhero who could fly and be invisible, that would be the best.\nGunther: What does Rachel see in this guy? I love Rachel. I wish she was my wife.\n(Joey is singing in his head.)\nPhoebe: Whos singing?\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, the whole gang is there, Ross is telling a story about what happened at work and the rest of the gang are thinking to themselves, denoted by italics.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "So I told Carl, Nobody, no matter how famous their parents are, nobody is allowed to climb on the dinosaur. But of course this went in one ear and out....."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "I love how he cares so much about stuff. If I squint I can pretend hes Alan Alda."}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Oh good, another dinosaur story. When are those gonna become extinct?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "If I was a superhero who could fly and be invisible, that would be the best."}, {"line_number": 6, "type": "dialogue", "speaker": "Gunther", "text": "What does Rachel see in this guy? I love Rachel. I wish she was my wife."}, {"line_number": 7, "type": "action", "text": "(Joey is singing in his head.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Whos singing?"}, {"line_number": 9, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 3, "scene_id": "S03E07_003", "location": "Monica and Rachel's", "scene_description": "the whole gang is there including Janice, theyre watching Happy Days.", "characters": ["Chandler", "Janice", "Joey", "Matress King", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_003", "raw_text": "[Scene: Monica and Rachel's, the whole gang is there including Janice, theyre watching Happy Days.]\nRoss: Hey. When you guys were kids and you played Happy Days, who were you? I was always Richie.\nMonica: I was always Joanne.\nJoey: Question. Was ah, Egg the Gellers! the war cry of your neighbourhood?\n(A commercial for the Mattress King, Janices ex-husband, comes on TV.)\nPhoebe: Ewww! Oh! Its the Mattress King!\nJoey: Booo!!\nChandler: (to Janice) Dont look honey. Change the channel! Change the channel!\nJanice: Wait! Wait! I wanna see this. After I divorce him, half of that kingdom is gonna be mine.\nMatress King: (on TV) Despair fills the mattress showroom. My kingdom is suddenly without a queen. Im so depressed Im going to slash... my prices!! Check it out! Four ninety-nine for a pillow top queen set! Im going medieval on prices!\nChandler: What a wank!\nJanice: Oh, I cannot believe hes using our divorce to sell mattresses.\nMonica: I know! And four ninety-nine for a pillow top queen set, who cares about the divorce, those babies will sell themselves. (they all stare at her) And Im appalled for you by the way.\nMatress King: (on TV) Im close. Im cheap. Im the king.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, the whole gang is there including Janice, theyre watching Happy Days.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey. When you guys were kids and you played Happy Days, who were you? I was always Richie."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "I was always Joanne."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Question. Was ah, Egg the Gellers! the war cry of your neighbourhood?"}, {"line_number": 5, "type": "action", "text": "(A commercial for the Mattress King, Janices ex-husband, comes on TV.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Ewww! Oh! Its the Mattress King!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Booo!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "(to Janice) Dont look honey. Change the channel! Change the channel!"}, {"line_number": 9, "type": "dialogue", "speaker": "Janice", "text": "Wait! Wait! I wanna see this. After I divorce him, half of that kingdom is gonna be mine."}, {"line_number": 10, "type": "dialogue", "speaker": "Matress King", "text": "(on TV) Despair fills the mattress showroom. My kingdom is suddenly without a queen. Im so depressed Im going to slash... my prices!! Check it out! Four ninety-nine for a pillow top queen set! Im going medieval on prices!"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "What a wank!"}, {"line_number": 12, "type": "dialogue", "speaker": "Janice", "text": "Oh, I cannot believe hes using our divorce to sell mattresses."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "I know! And four ninety-nine for a pillow top queen set, who cares about the divorce, those babies will sell themselves. (they all stare at her) And Im appalled for you by the way."}, {"line_number": 14, "type": "dialogue", "speaker": "Matress King", "text": "(on TV) Im close. Im cheap. Im the king."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 4, "scene_id": "S03E07_004", "location": "Central Perk", "scene_description": "Rachel is on the phone, everyone else is there except Joey.", "characters": ["All", "Chandler", "Gunther", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_004", "raw_text": "[Scene: Central Perk, Rachel is on the phone, everyone else is there except Joey.]\nRachel: Okay. (listens) Okay, daddy well see you tomorrow night. (listens) Okay bye-bye. (hangs up)\nRoss: We?\nRachel: Are ah, having dinner with my Dad tomorrow night, I hope thats okay.\nRoss: Oh shoot, tomorrows not so good, Im supposed to um, fall off the Empire State building and land on a bicycle with no seat. Sorry.\nRachel: Ross, my father doesnt hate you.\nRoss: Please, he refers to me as wethead.\nRachel: But honey he calls everybody by a nickname! Okay, look, I know, all right, just one dinner, please, just one night for me, please. I just want him to love you like I do. (Ross looks at her) All right, well not exactly like I do, but, but, if you do come to dinner, Ill love you like I do in that black thing that you like.\nChandler: (leaning in) Ill go.\nRoss: Fine.\nRachel: Thank you.\nRoss: Hi Gunther.\nGunther: Yeah, well see!\nJoey: (entering) Hey, you guys!\nPhoebe: Hey!\nJoey: Guess what?\nRoss: What?\nJoey: I got a gig!\nAll: Yay!!\nChandler: See, thats why I could never be an actor. Because I cant say gig.\nPhoebe: Yeah, I cant say croissant. (realises) Oh my God!\nMonica: Whats the part?\nJoey: Well, its not a part, no. Im teaching acting for soap operas down at the Learning Extension.\nRoss: Come on! Thats great.\nAll: Wow!\nJoey: Yeah, yeah. Its like my chance to give something back to the acting community.\nRoss: Yknow your probably not allowed to sleep with any of your students.\nJoey: (glares at him) I know!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Rachel is on the phone, everyone else is there except Joey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Okay. (listens) Okay, daddy well see you tomorrow night. (listens) Okay bye-bye. (hangs up)"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "We?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Are ah, having dinner with my Dad tomorrow night, I hope thats okay."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Oh shoot, tomorrows not so good, Im supposed to um, fall off the Empire State building and land on a bicycle with no seat. Sorry."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Ross, my father doesnt hate you."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Please, he refers to me as wethead."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "But honey he calls everybody by a nickname! Okay, look, I know, all right, just one dinner, please, just one night for me, please. I just want him to love you like I do. (Ross looks at her) All right, well not exactly like I do, but, but, if you do come to dinner, Ill love you like I do in that black thing that you like."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "(leaning in) Ill go."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Fine."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Thank you."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Hi Gunther."}, {"line_number": 13, "type": "dialogue", "speaker": "Gunther", "text": "Yeah, well see!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey, you guys!"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Hey!"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Guess what?"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "I got a gig!"}, {"line_number": 19, "type": "dialogue", "speaker": "All", "text": "Yay!!"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "See, thats why I could never be an actor. Because I cant say gig."}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, I cant say croissant. (realises) Oh my God!"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Whats the part?"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Well, its not a part, no. Im teaching acting for soap operas down at the Learning Extension."}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "Come on! Thats great."}, {"line_number": 25, "type": "dialogue", "speaker": "All", "text": "Wow!"}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Yeah, yeah. Its like my chance to give something back to the acting community."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Yknow your probably not allowed to sleep with any of your students."}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "(glares at him) I know!"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 5, "scene_id": "S03E07_005", "location": "Mattress King", "scene_description": "Monica and Phoebe are shopping for a new mattress.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S03E07/scenes/S03E07_005", "raw_text": "[Scene: Mattress King, Monica and Phoebe are shopping for a new mattress.]\nPhoebe: Ugh! I dont know Monica. It feels funny just being here. I mean if you buy a bed from Janices ex-husband, thats like betraying Chandler.\nMonica: Not at these prices.\nPhoebe: (sees a little kid playing with a race car bed) (to kid) Hi. Y'know in England this car would be on the other side of the store. (the kid just stares at her, and she makes the that went right over your head motion) Woo!\nMonica: (lying down on a mattress) Oh! Ohhhhh! Oh! Phoebe, come here. Aw, this is my new bed. You gotta feel this bad boy.\nPhoebe: Eh, Monica it, it feels so weird, y'know, Chandlers your friend... (hops onto the bed) Oh! Oh my God! Aw, all right take this bed, you can make other friends.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Mattress King, Monica and Phoebe are shopping for a new mattress.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Ugh! I dont know Monica. It feels funny just being here. I mean if you buy a bed from Janices ex-husband, thats like betraying Chandler."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Not at these prices."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "(sees a little kid playing with a race car bed) (to kid) Hi. Y'know in England this car would be on the other side of the store. (the kid just stares at her, and she makes the that went right over your head motion) Woo!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(lying down on a mattress) Oh! Ohhhhh! Oh! Phoebe, come here. Aw, this is my new bed. You gotta feel this bad boy."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Eh, Monica it, it feels so weird, y'know, Chandlers your friend... (hops onto the bed) Oh! Oh my God! Aw, all right take this bed, you can make other friends."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 6, "scene_id": "S03E07_006", "location": "Classroom. Joey is writing his name on the board", "scene_description": "but turns around before hes done which causes him to write his name with a downward curve, and he then underlines it, and draws the line right through his name.", "characters": ["Joey"], "firestore_path": "/episodes/S03E07/scenes/S03E07_006", "raw_text": "[Scene: Classroom. Joey is writing his name on the board, but turns around before hes done which causes him to write his name with a downward curve, and he then underlines it, and draws the line right through his name.]\nJoey: Good evening. Im Mr. Tribbiani. And I will be teaching acting for soap operas. Now um, on my first day as (proudly) Dr. Drake Remoray on Days of Our Lives, (looks for a reaction from his students, and gets none.) I learned that one of the most important things in soap opera acting is reacting, this does not mean acting again, it means, you dont have a line, but someone else just did. And it goes like this. (looks all intense for a moment and then gasps, the students cheer him) Thanks, thanks, a lot. Oh, by the way, before I forget to work in soap operas some of you will have to become much more attractive. All right, moving right along.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Classroom. Joey is writing his name on the board, but turns around before hes done which causes him to write his name with a downward curve, and he then underlines it, and draws the line right through his name.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Good evening. Im Mr. Tribbiani. And I will be teaching acting for soap operas. Now um, on my first day as (proudly) Dr. Drake Remoray on Days of Our Lives, (looks for a reaction from his students, and gets none.) I learned that one of the most important things in soap opera acting is reacting, this does not mean acting again, it means, you dont have a line, but someone else just did. And it goes like this. (looks all intense for a moment and then gasps, the students cheer him) Thanks, thanks, a lot. Oh, by the way, before I forget to work in soap operas some of you will have to become much more attractive. All right, moving right along."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 7, "scene_id": "S03E07_007", "location": "Monica and Rachel's", "scene_description": "Joey is entering, Phoebe is already there waiting for the delievery guy.", "characters": ["Guy", "Joey", "Phoebe"], "firestore_path": "/episodes/S03E07/scenes/S03E07_007", "raw_text": "[Scene: Monica and Rachel's, Joey is entering, Phoebe is already there waiting for the delievery guy.]\nJoey: Hi!\nPhoebe: Hey! Ooh! How was teaching last night?\nJoey: Oh it was great. Yeah, you get to say stuff like, Hey, the bell doesnt dismiss you, I dismiss you.\nPhoebe: Ooooh, nice.\nJoey: Oh, and guess what, I got an audition for All My Children.\nPhoebe: Oh, yay!\nJoey: Yeah, its this great part, this boxer named Nick. And Im so, so right for it, y'know, hes just like me. Except hes a boxer, and has an evil twin.\n(There is a knock on the door.)\nPhoebe: Oh. (goes and answers the door and there is this huge black delievery guy.) \nGuy: Dom da-da dom! Here ye! Here ye! Delivery from the Mattress King. (to Phoebe) You Miss Geller?\nPhoebe: Okay.\nGuy: Sign here. (hands her a clipboard)\nPhoebe: Oh, do I have a middle name. All right Monica Velula Geller. Its that bedroom there. (points to Monicas room)\nJoey: Hey, Monica bought a bed from the Mattress King?\nPhoebe: Yeah, so please, please, please, dont say anything to Chandler.\nJoey: You want me to lie to Chandler?\nPhoebe: Is that a problem?\nJoey: No.\nPhoebe: Oh, hey, hey Nick the boxer lets see what you got. All right ya, put em up. Come on. (they start shadow boxing)\nJoey: Hey, youre ah, pretty good at this.\nPhoebe: Yeah, well I had to learn, I was staying at the Y and some off the young men werent acting Christian enough.\nJoey: Ahh!\n(Joey throws a punch and just lightly taps her on the shoulder, Phoebe counters with a jab to the nose.)\nJoey: Hey now!\n(Phoebe throws another jab, and lands it on Joeys nose, causing it to bleed.)\nJoey: Hey!!! Oww!! And Im bleeding.\nPhoebe: Oh! Oh! Oh!\nJoey: Okay, great.\nPhoebe: Wow! And Im a vegetarian! All right, all right, well Im sorry, well put some ice on it. \nJoey: Okay.\nPhoebe: Kay, put your head back.\nJoey: All right. I cant see.\nPhoebe: All right, I have ya. Oh God.\nGuy: Which bedroom do ya want it in Miss Geller?\nPhoebe: Oh, its the compulsively neat one by the window, okay.\nGuy: Gotcha. (he and his helper walk in carrying the racecar bed.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Joey is entering, Phoebe is already there waiting for the delievery guy.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey! Ooh! How was teaching last night?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Oh it was great. Yeah, you get to say stuff like, Hey, the bell doesnt dismiss you, I dismiss you."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Ooooh, nice."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Oh, and guess what, I got an audition for All My Children."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, yay!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Yeah, its this great part, this boxer named Nick. And Im so, so right for it, y'know, hes just like me. Except hes a boxer, and has an evil twin."}, {"line_number": 9, "type": "action", "text": "(There is a knock on the door.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Oh. (goes and answers the door and there is this huge black delievery guy.) "}, {"line_number": 11, "type": "dialogue", "speaker": "Guy", "text": "Dom da-da dom! Here ye! Here ye! Delivery from the Mattress King. (to Phoebe) You Miss Geller?"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 13, "type": "dialogue", "speaker": "Guy", "text": "Sign here. (hands her a clipboard)"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, do I have a middle name. All right Monica Velula Geller. Its that bedroom there. (points to Monicas room)"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Hey, Monica bought a bed from the Mattress King?"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, so please, please, please, dont say anything to Chandler."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "You want me to lie to Chandler?"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Is that a problem?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "No."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, hey, hey Nick the boxer lets see what you got. All right ya, put em up. Come on. (they start shadow boxing)"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Hey, youre ah, pretty good at this."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, well I had to learn, I was staying at the Y and some off the young men werent acting Christian enough."}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Ahh!"}, {"line_number": 24, "type": "action", "text": "(Joey throws a punch and just lightly taps her on the shoulder, Phoebe counters with a jab to the nose.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Hey now!"}, {"line_number": 26, "type": "action", "text": "(Phoebe throws another jab, and lands it on Joeys nose, causing it to bleed.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Hey!!! Oww!! And Im bleeding."}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! Oh! Oh!"}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "Okay, great."}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Wow! And Im a vegetarian! All right, all right, well Im sorry, well put some ice on it. "}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Okay."}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "Kay, put your head back."}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "All right. I cant see."}, {"line_number": 34, "type": "dialogue", "speaker": "Phoebe", "text": "All right, I have ya. Oh God."}, {"line_number": 35, "type": "dialogue", "speaker": "Guy", "text": "Which bedroom do ya want it in Miss Geller?"}, {"line_number": 36, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, its the compulsively neat one by the window, okay."}, {"line_number": 37, "type": "dialogue", "speaker": "Guy", "text": "Gotcha. (he and his helper walk in carrying the racecar bed.)"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 8, "scene_id": "S03E07_008", "location": "Restaurant", "scene_description": "Rachel and Ross and Dr. Green are having dinner.", "characters": ["Dr Green", "Rachel", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_008", "raw_text": "[Scene: Restaurant, Rachel and Ross and Dr. Green are having dinner.]\nRachel: Hi Daddy!\nDr. Green: This where they put it? What, there no table available in the kitchen! Hello, baby.\nRachel: You remember Ross.\nDr. Green: Um-hmm.\nRoss: Nice to see you again Dr. Green. \nDr. Green: So! (they both try to sit next to Rachel but Dr. Green is successful.) (to Ross) Hows the library?\nRoss: Ugh, museum.\nDr. Green: What happened to the library?\nRoss: There never was a library. I mean there are libraries, its just that I ah, I never worked at one.\nDr. Green: You know whats really good here, the lobster. What do you say shall I just order three.\nRoss: Yeah, if youre really hungry. (Dr. Green stares at him) It was a joke, I made a joke.\nRachel: Yeah, actually Daddy Ross is allergic to lobster.\nDr. Green: What kind of person is allergic to lobster? I guess the kind of person that works at a library.\nRoss: Its not a library...\nDr. Green: (interrupting him) I know!! Its a museum! What, youre the only one around here who can make a joke! At least mine was funny. Ah, waiter, we will have two lobsters and a menu. (nods at Ross, and mouths I dont know to the waiter.)\n[Scene: After dinner.]\nRoss: So, Dr. Green, hows the old boat.\nDr. Green: They found rust. You know what rust does to a boat?\nRoss: It gives it a nice antiquey look.\nDr. Green: (he stares at Ross) Rust, is boat cancer, Ross.\nRoss: Wow. Im sorry, when I was a kid I lost a bike to that. (Rachel giggles at that)\nDr. Green: Excuse me for a moment, will you please, I want to say good night to the Levines, before we go.\nRachel: Okay.\nRoss: Okay! (picks up a knife and pretends to stab his heart.)\nRachel: Aw honey stop! Its not that bad.\nRoss: Yeah. (sees the bill) Op! Uh-oh! I think your Dad mustve added wrong. He only tipped like four percent.\nRachel: Yeah. Thats Daddy.\nRoss: Thats Daddy?! But doesnt it bother you? Youre a waitress.\nRachel: Yes, it bothers me Ross, but y'know if he was a regular at the coffee house, Id be serving him sneezers.\nRoss: So?\nRachel: So. Ross, Ive bugged him about this a million times, hes not gonna change.\nRoss: You really serve people sneezers?\nRachel: Well um, I dont.\nDr Green: You kids ready?\nRoss: Thanks again, Dr. Green.\nDr. Green: All right.\n(Ross takes a twenty and slips it underneath the bill when Dr. Green isnt looking.)\nDr. Green: Oh, wait, wait, wait, wait, I think I forgot my receipt.\nRoss: Oh, ah, you dont need that.\nDr. Green: Why not?\nRoss: The carbon, its messy, I mean it gets on your fingers and causes, the, the ah, night blindness.\nDr. Green: (gets his receipt and notices the twenty) What is this? Who put a twenty down here? Huh?\nRoss: Oh, yeah, that would be me, um, I have, I have a problem I-I tip way too much, way, way, too much, its a sickness really.\nRachel: Yeah it is, it is. (to Ross) We really, really have to do something about that.\nRoss: I know.\nDr. Green: Excuse me, you think Im cheap?\nRachel: Oh Daddy, no he didnt mean anything by that, he really didnt.\nRoss: Nothing I do means anything, really.\nDr. Green: This is nice. I pay two hundred dollars for dinner, you put down twenty, and you come out looking like Mr. Big Shot. You really want to be Mr. Big Shot? Here, Ill tell you what, you pay the whole bill, Mr. Big Shot, all right. (rips up the bill, and throws it at Ross, then leaves)\nRoss: Well Mr. Big Shot is better than wethead.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Restaurant, Rachel and Ross and Dr. Green are having dinner.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hi Daddy!"}, {"line_number": 3, "type": "narration", "text": "Dr. Green: This where they put it? What, there no table available in the kitchen! Hello, baby."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "You remember Ross."}, {"line_number": 5, "type": "narration", "text": "Dr. Green: Um-hmm."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Nice to see you again Dr. Green. "}, {"line_number": 7, "type": "narration", "text": "Dr. Green: So! (they both try to sit next to Rachel but Dr. Green is successful.) (to Ross) Hows the library?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Ugh, museum."}, {"line_number": 9, "type": "narration", "text": "Dr. Green: What happened to the library?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "There never was a library. I mean there are libraries, its just that I ah, I never worked at one."}, {"line_number": 11, "type": "narration", "text": "Dr. Green: You know whats really good here, the lobster. What do you say shall I just order three."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Yeah, if youre really hungry. (Dr. Green stares at him) It was a joke, I made a joke."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, actually Daddy Ross is allergic to lobster."}, {"line_number": 14, "type": "narration", "text": "Dr. Green: What kind of person is allergic to lobster? I guess the kind of person that works at a library."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Its not a library..."}, {"line_number": 16, "type": "narration", "text": "Dr. Green: (interrupting him) I know!! Its a museum! What, youre the only one around here who can make a joke! At least mine was funny. Ah, waiter, we will have two lobsters and a menu. (nods at Ross, and mouths I dont know to the waiter.)"}, {"line_number": 17, "type": "narration", "text": "[Scene: After dinner.]"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "So, Dr. Green, hows the old boat."}, {"line_number": 19, "type": "narration", "text": "Dr. Green: They found rust. You know what rust does to a boat?"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "It gives it a nice antiquey look."}, {"line_number": 21, "type": "narration", "text": "Dr. Green: (he stares at Ross) Rust, is boat cancer, Ross."}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Wow. Im sorry, when I was a kid I lost a bike to that. (Rachel giggles at that)"}, {"line_number": 23, "type": "narration", "text": "Dr. Green: Excuse me for a moment, will you please, I want to say good night to the Levines, before we go."}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Okay! (picks up a knife and pretends to stab his heart.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Aw honey stop! Its not that bad."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Yeah. (sees the bill) Op! Uh-oh! I think your Dad mustve added wrong. He only tipped like four percent."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Yeah. Thats Daddy."}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Thats Daddy?! But doesnt it bother you? Youre a waitress."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Yes, it bothers me Ross, but y'know if he was a regular at the coffee house, Id be serving him sneezers."}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "So?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "So. Ross, Ive bugged him about this a million times, hes not gonna change."}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "You really serve people sneezers?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "Well um, I dont."}, {"line_number": 35, "type": "dialogue", "speaker": "Dr Green", "text": "You kids ready?"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Thanks again, Dr. Green."}, {"line_number": 37, "type": "narration", "text": "Dr. Green: All right."}, {"line_number": 38, "type": "action", "text": "(Ross takes a twenty and slips it underneath the bill when Dr. Green isnt looking.)"}, {"line_number": 39, "type": "narration", "text": "Dr. Green: Oh, wait, wait, wait, wait, I think I forgot my receipt."}, {"line_number": 40, "type": "dialogue", "speaker": "Ross", "text": "Oh, ah, you dont need that."}, {"line_number": 41, "type": "narration", "text": "Dr. Green: Why not?"}, {"line_number": 42, "type": "dialogue", "speaker": "Ross", "text": "The carbon, its messy, I mean it gets on your fingers and causes, the, the ah, night blindness."}, {"line_number": 43, "type": "narration", "text": "Dr. Green: (gets his receipt and notices the twenty) What is this? Who put a twenty down here? Huh?"}, {"line_number": 44, "type": "dialogue", "speaker": "Ross", "text": "Oh, yeah, that would be me, um, I have, I have a problem I-I tip way too much, way, way, too much, its a sickness really."}, {"line_number": 45, "type": "dialogue", "speaker": "Rachel", "text": "Yeah it is, it is. (to Ross) We really, really have to do something about that."}, {"line_number": 46, "type": "dialogue", "speaker": "Ross", "text": "I know."}, {"line_number": 47, "type": "narration", "text": "Dr. Green: Excuse me, you think Im cheap?"}, {"line_number": 48, "type": "dialogue", "speaker": "Rachel", "text": "Oh Daddy, no he didnt mean anything by that, he really didnt."}, {"line_number": 49, "type": "dialogue", "speaker": "Ross", "text": "Nothing I do means anything, really."}, {"line_number": 50, "type": "narration", "text": "Dr. Green: This is nice. I pay two hundred dollars for dinner, you put down twenty, and you come out looking like Mr. Big Shot. You really want to be Mr. Big Shot? Here, Ill tell you what, you pay the whole bill, Mr. Big Shot, all right. (rips up the bill, and throws it at Ross, then leaves)"}, {"line_number": 51, "type": "dialogue", "speaker": "Ross", "text": "Well Mr. Big Shot is better than wethead."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 9, "scene_id": "S03E07_009", "location": "Classroom", "scene_description": "Joey is lecturing on facial expressions.", "characters": ["Joey", "Student"], "firestore_path": "/episodes/S03E07/scenes/S03E07_009", "raw_text": "[Scene: Classroom, Joey is lecturing on facial expressions.]\nJoey: Okay, some tricks of the trade. Now, Ive never been able to cry as an actor, so if Im in a scene where I have to cry, I cut a hole in my pocket, take a pair of tweezers, and just start pulling. Or ah, or, lets say I wanna convey that Ive just done something evil. That would be the basic I have a fishhook in my eyebrow and I like it (Does it by raising one eyebrow, and showing off the pretend fishhook.) Okay, lets say Ive just gotten bad news, well all I do there is try and divide 232 by 13. (looks all confused) And thats how its done. Great soap opera acting tonight everybody, class dismissed.\nStudent: Hey, Mr. Trib.\nJoey: Hey-hey.\nStudent: Guess what, I got an audition!\nJoey: Awww, one of my students got an audition. Im so proud.\nStudent: I was wondering if you would consider coaching me for it?\nJoey: You bet! Whats the part?\nStudent: Oh its great, its a role on All My Children, Nick the boxer.\n(Joey does the 232 divided by 13 bad news look.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Classroom, Joey is lecturing on facial expressions.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Okay, some tricks of the trade. Now, Ive never been able to cry as an actor, so if Im in a scene where I have to cry, I cut a hole in my pocket, take a pair of tweezers, and just start pulling. Or ah, or, lets say I wanna convey that Ive just done something evil. That would be the basic I have a fishhook in my eyebrow and I like it (Does it by raising one eyebrow, and showing off the pretend fishhook.) Okay, lets say Ive just gotten bad news, well all I do there is try and divide 232 by 13. (looks all confused) And thats how its done. Great soap opera acting tonight everybody, class dismissed."}, {"line_number": 3, "type": "dialogue", "speaker": "Student", "text": "Hey, Mr. Trib."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Hey-hey."}, {"line_number": 5, "type": "dialogue", "speaker": "Student", "text": "Guess what, I got an audition!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Awww, one of my students got an audition. Im so proud."}, {"line_number": 7, "type": "dialogue", "speaker": "Student", "text": "I was wondering if you would consider coaching me for it?"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "You bet! Whats the part?"}, {"line_number": 9, "type": "dialogue", "speaker": "Student", "text": "Oh its great, its a role on All My Children, Nick the boxer."}, {"line_number": 10, "type": "action", "text": "(Joey does the 232 divided by 13 bad news look.)"}, {"line_number": 11, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 10, "scene_id": "S03E07_010", "location": "Hallway", "scene_description": "Ross and Rachel are returning from dinner.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_010", "raw_text": "[Scene: Hallway, Ross and Rachel are returning from dinner.]\nRachel: You had to do it, didnt you? You couldnt just leave it alone.\nRoss: Four percent. Okay. I tip more than that when theres a bug in my food.\nRachel: Ross, tonight was about the two of you getting along. (Ross groans and rubs his neck) Oh, would you just see my chiropractor, already.\nRoss: Yeah, Im gonna go to a doctor who went to school in a mini-mall.\n(they go into Monica and Rachels, and see Phoebe hopping around.)\nRoss: Hey Pheebs, what are you doing?\nPhoebe: Im, Im freaking out! Monica kinda trusted me with something and she shouldnt have! All right, I havent lived here in a while, so I have to ask you something. Does Monica still turn on the lights in her bedroom?\nRachel: Um. yeah.\nPhoebe: I am soo dead. (goes to Monicas room)\nRachel: All right, look, heres the bottom line Ross, this is fixable, if we act fast, okay. So, Ill invite him to brunch tomorrow and you can make nice.\nRoss: Look, honey, I have tried to make nice, it doesnt work.\nRachel: Okay, look, Ross, I realise that my Father is difficult, but thats why you have got to be the bigger man here.\nRoss: Look sweetie, I could be the bigger man, I could be the biggest man, I could be a big, huge, giant man, and it still wouldnt make any difference, except that I could pick your Father up and say Like me! Like me tiny doctor!\nRachel: Okay, well cant you just try it one more time Ross? For me? For me?\nRoss: Rachel one brunch is not gonna solve anything. You gotta face it, okay were never gonna get along.\nRachel: Okay, well you are just gonna have too, okay. Because I already got a Mother and a Father who cannot stay in the same room together, okay, I dont wanna have to have a separate room for you too!! (starts to cry)\nRoss: Okay, okay, okay. (hugs her) Ill get the bagels.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Hallway, Ross and Rachel are returning from dinner.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "You had to do it, didnt you? You couldnt just leave it alone."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Four percent. Okay. I tip more than that when theres a bug in my food."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Ross, tonight was about the two of you getting along. (Ross groans and rubs his neck) Oh, would you just see my chiropractor, already."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Yeah, Im gonna go to a doctor who went to school in a mini-mall."}, {"line_number": 6, "type": "action", "text": "(they go into Monica and Rachels, and see Phoebe hopping around.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Hey Pheebs, what are you doing?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Im, Im freaking out! Monica kinda trusted me with something and she shouldnt have! All right, I havent lived here in a while, so I have to ask you something. Does Monica still turn on the lights in her bedroom?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Um. yeah."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "I am soo dead. (goes to Monicas room)"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "All right, look, heres the bottom line Ross, this is fixable, if we act fast, okay. So, Ill invite him to brunch tomorrow and you can make nice."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Look, honey, I have tried to make nice, it doesnt work."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Okay, look, Ross, I realise that my Father is difficult, but thats why you have got to be the bigger man here."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Look sweetie, I could be the bigger man, I could be the biggest man, I could be a big, huge, giant man, and it still wouldnt make any difference, except that I could pick your Father up and say Like me! Like me tiny doctor!"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Okay, well cant you just try it one more time Ross? For me? For me?"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Rachel one brunch is not gonna solve anything. You gotta face it, okay were never gonna get along."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Okay, well you are just gonna have too, okay. Because I already got a Mother and a Father who cannot stay in the same room together, okay, I dont wanna have to have a separate room for you too!! (starts to cry)"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Okay, okay, okay. (hugs her) Ill get the bagels."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 11, "scene_id": "S03E07_011", "location": "Monicas bedroom", "scene_description": "Phoebe is trying to hide the bed from Monica.", "characters": ["Chandler", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E07/scenes/S03E07_011", "raw_text": "[Scene: Monicas bedroom, Phoebe is trying to hide the bed from Monica.]\nMonica: (sees the bed) Whats this?\nPhoebe: Isnt it cool! Varoom! Varoom!\nMonica: This is not the bed I ordered!\nPhoebe: I know, you mustve won like a contest or something! \n(Phoebe starts to make a sound like a car accelerating)\nMonica: Phoebe!\n(Phoebe makes a sound like a car screeching to a halt.)\nMonica: Why is this car in my bedroom?\nPhoebe: Im sorry, okay, I-I wasnt looking, and the store says that they wont take it back because you signed for it...\nMonica: When did I sign for it?\nPhoebe: When I was you! Y'know what, its all Joeys fault, cause he left his nose open!\nMonica: Did you make brownies today?\nChandler: Knock, knock.\nMonica: (to Phoebe) Quick, take off your dress, he wont notice the bed.\nChandler: Hey, Im going for sushi does anybody want.. (enters and sees the bed) Whoa-whoa, somebody missed the off ramp.\nPhoebe: Its Monicas bed. What?\nChandler: Okay. (to Monica) Its a racecar.\nPhoebe: So. This has always been Monicas bed, what youre just noticing now, how self-involved are you?\nChandler: Okay, well it this bed isnt new, how come there is plastic on the mattress?\nMonica: Sometimes I have bad dreams. (starts to break down, and Phoebe offers her, her hand to comfort her.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas bedroom, Phoebe is trying to hide the bed from Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "(sees the bed) Whats this?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Isnt it cool! Varoom! Varoom!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "This is not the bed I ordered!"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "I know, you mustve won like a contest or something! "}, {"line_number": 6, "type": "action", "text": "(Phoebe starts to make a sound like a car accelerating)"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Phoebe!"}, {"line_number": 8, "type": "action", "text": "(Phoebe makes a sound like a car screeching to a halt.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Why is this car in my bedroom?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Im sorry, okay, I-I wasnt looking, and the store says that they wont take it back because you signed for it..."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "When did I sign for it?"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "When I was you! Y'know what, its all Joeys fault, cause he left his nose open!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Did you make brownies today?"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Knock, knock."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "(to Phoebe) Quick, take off your dress, he wont notice the bed."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Hey, Im going for sushi does anybody want.. (enters and sees the bed) Whoa-whoa, somebody missed the off ramp."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Its Monicas bed. What?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Okay. (to Monica) Its a racecar."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "So. This has always been Monicas bed, what youre just noticing now, how self-involved are you?"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "Okay, well it this bed isnt new, how come there is plastic on the mattress?"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Sometimes I have bad dreams. (starts to break down, and Phoebe offers her, her hand to comfort her.)"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 12, "scene_id": "S03E07_012", "location": "Classroom", "scene_description": "Joey is coaching his student.", "characters": ["Joey", "Student"], "firestore_path": "/episodes/S03E07/scenes/S03E07_012", "raw_text": "[Scene: Classroom, Joey is coaching his student.]\nStudent: Look, I just saw my best friends brains smeared across the canvas, thats not gonna be me, not me.\nJoey: Wow! That was good. That was...(points to his pocket) Tweezers?\nStudent: No.\nJoey: Whoa. That was really good.\nStudent: Thanks, any suggestions?\n(Joey gets the evil look on his face.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Classroom, Joey is coaching his student.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Student", "text": "Look, I just saw my best friends brains smeared across the canvas, thats not gonna be me, not me."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Wow! That was good. That was...(points to his pocket) Tweezers?"}, {"line_number": 4, "type": "dialogue", "speaker": "Student", "text": "No."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Whoa. That was really good."}, {"line_number": 6, "type": "dialogue", "speaker": "Student", "text": "Thanks, any suggestions?"}, {"line_number": 7, "type": "action", "text": "(Joey gets the evil look on his face.)"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 13, "scene_id": "S03E07_013", "location": "Central Perk", "scene_description": "Chandler, Monica, and Phoebe are there, yelling at Joey.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S03E07/scenes/S03E07_013", "raw_text": "[Scene: Central Perk, Chandler, Monica, and Phoebe are there, yelling at Joey.]\nChandler: You told him to play the boxer gay!!\nJoey: Well, I-I mightve said supergay.\nChandler: You totally screwed him over.\nMonica: Joey, youre this guys teacher. I mean how could you do this?\nJoey: Because, Monica, the guys so good, and I really, really want this part.\nPhoebe: Well, if you really, really want it, then its okay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler, Monica, and Phoebe are there, yelling at Joey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "You told him to play the boxer gay!!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Well, I-I mightve said supergay."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "You totally screwed him over."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Joey, youre this guys teacher. I mean how could you do this?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Because, Monica, the guys so good, and I really, really want this part."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Well, if you really, really want it, then its okay."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 14, "scene_id": "S03E07_014", "location": "Monica and Rachel's", "scene_description": "Rachel is greeting her Father for their brunch.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S03E07/scenes/S03E07_014", "raw_text": "[Scene: Monica and Rachel's, Rachel is greeting her Father for their brunch.]\nRachel: (opening the door) Hi Daddy.\nDr. Green: Baby. Ross.\nRoss: Dr. Green. How are you? (offers his hand, and Dr. Green puts his scarf on it.)\nDr. Green: Thanks for dinner last night.\nRoss: Thank you for teaching me a valuable lesson.\nDr. Green: Nice hair. Whatd ya do? Swim here?\nRoss: (to Rachel) Okay, thats it, I cant take it anymore.\nRachel: What? What? Hes interested in you. He-he likes your hair, he just wants to know how you got here.\nRoss: Oh, please. Sweetie its hopeless, okay, Im just gonna go. (starts to leave rubbing his neck)\nRachel: What?!\nRoss: Look, look Im sorry. Its just that....\nDr. Green: Ross? Whats with the neck?\nRachel: Hes got this thing. And I keep telling him to go to my chiropractor...\nDr. Green: Youre still going to that chiropractor, that man couldnt get into medical school in Extapa!\nRoss: Thank you! Thats what I keep saying.\nRachel: Excuse me, Dr. Bobby happens to be an excellent doctor.\nRoss: Uh.\nDr. Green: Wait a minute, his name is Dr. Bobby?\nRachel: Well thats his last name.\nRoss: And his first name.\nDr. Green: Hes Bobby Bobby?\nRachel: Its Robert Bobby.\nDr. Green: Oh.\nRachel: And um, excuse me, he helps me.\nRoss: Oh-ho please. Ask her how?\nDr. Green: What do you need help for?\nRachel: With my alignment. Ive got one leg shorter than the other.\nDr. Green: Oh God!\nRoss: Argue with that.\nRachel: What? Its true, my right leg is two inches shorter.\nDr. Green: Come on! Youre just titling! (to Ross) Her legs are fine!\nRoss: I know that!\nDr. Green: So, why do you let her go to a chiropractor for?\nRachel: Im sorry, let her?\nRoss: What can I do, she doesnt listen to me about renters insurance either.\nDr. Green: Wait a minute, you dont have renters insurance?!\nRachel: No.\nDr. Green: Well what if somebody steals something? How are you gonna run after him with one leg shorter than the other?!\n(Both he and Ross start laughing)\nRoss: Hey, would you ah, would you like some juice?\nDr. Green: Id love some juice. Thanks.\nRoss: Okay. (to Rachel) Wow! This is going so well. Did you see us? Did you see?\nRachel: Yeah honey, Im standing right there! Why didnt you just tell him about the mole I havent got checked yet.\nRoss: Excellent!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Rachel is greeting her Father for their brunch.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(opening the door) Hi Daddy."}, {"line_number": 3, "type": "narration", "text": "Dr. Green: Baby. Ross."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Dr. Green. How are you? (offers his hand, and Dr. Green puts his scarf on it.)"}, {"line_number": 5, "type": "narration", "text": "Dr. Green: Thanks for dinner last night."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Thank you for teaching me a valuable lesson."}, {"line_number": 7, "type": "narration", "text": "Dr. Green: Nice hair. Whatd ya do? Swim here?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "(to Rachel) Okay, thats it, I cant take it anymore."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "What? What? Hes interested in you. He-he likes your hair, he just wants to know how you got here."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Oh, please. Sweetie its hopeless, okay, Im just gonna go. (starts to leave rubbing his neck)"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Look, look Im sorry. Its just that...."}, {"line_number": 13, "type": "narration", "text": "Dr. Green: Ross? Whats with the neck?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Hes got this thing. And I keep telling him to go to my chiropractor..."}, {"line_number": 15, "type": "narration", "text": "Dr. Green: Youre still going to that chiropractor, that man couldnt get into medical school in Extapa!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Thank you! Thats what I keep saying."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Excuse me, Dr. Bobby happens to be an excellent doctor."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Uh."}, {"line_number": 19, "type": "narration", "text": "Dr. Green: Wait a minute, his name is Dr. Bobby?"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Well thats his last name."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "And his first name."}, {"line_number": 22, "type": "narration", "text": "Dr. Green: Hes Bobby Bobby?"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Its Robert Bobby."}, {"line_number": 24, "type": "narration", "text": "Dr. Green: Oh."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "And um, excuse me, he helps me."}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "Oh-ho please. Ask her how?"}, {"line_number": 27, "type": "narration", "text": "Dr. Green: What do you need help for?"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "With my alignment. Ive got one leg shorter than the other."}, {"line_number": 29, "type": "narration", "text": "Dr. Green: Oh God!"}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "Argue with that."}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "What? Its true, my right leg is two inches shorter."}, {"line_number": 32, "type": "narration", "text": "Dr. Green: Come on! Youre just titling! (to Ross) Her legs are fine!"}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "I know that!"}, {"line_number": 34, "type": "narration", "text": "Dr. Green: So, why do you let her go to a chiropractor for?"}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "Im sorry, let her?"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "What can I do, she doesnt listen to me about renters insurance either."}, {"line_number": 37, "type": "narration", "text": "Dr. Green: Wait a minute, you dont have renters insurance?!"}, {"line_number": 38, "type": "dialogue", "speaker": "Rachel", "text": "No."}, {"line_number": 39, "type": "narration", "text": "Dr. Green: Well what if somebody steals something? How are you gonna run after him with one leg shorter than the other?!"}, {"line_number": 40, "type": "action", "text": "(Both he and Ross start laughing)"}, {"line_number": 41, "type": "dialogue", "speaker": "Ross", "text": "Hey, would you ah, would you like some juice?"}, {"line_number": 42, "type": "narration", "text": "Dr. Green: Id love some juice. Thanks."}, {"line_number": 43, "type": "dialogue", "speaker": "Ross", "text": "Okay. (to Rachel) Wow! This is going so well. Did you see us? Did you see?"}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Yeah honey, Im standing right there! Why didnt you just tell him about the mole I havent got checked yet."}, {"line_number": 45, "type": "dialogue", "speaker": "Ross", "text": "Excellent!"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 15, "scene_id": "S03E07_015", "location": "Classroom", "scene_description": "Joey is talking to his students.", "characters": ["Joey"], "firestore_path": "/episodes/S03E07/scenes/S03E07_015", "raw_text": "[Scene: Classroom, Joey is talking to his students.]\nJoey: (sadly) There will come a time in each of your careers when youll have a chance to screw over another soap opera actor. I had such an opportunity in the recent, present. And Im ashamed to say that I took it, I advised a fellow actor to play a role, homosexually. Yeah, we both auditioned for the part, and uh, as it turned out, they ah, they liked the stupid gay thing and cast him. And now, hes got a two year contract opposite Susan Luchhi, the first lady of daytime television, and me, me Im stuck here teaching a bunch of people, most of whom are too ugly to even be on TV. Im sorry, Im sorry, Im sorry. (he gets a huge round of applause from his students.) Thank you.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Classroom, Joey is talking to his students.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(sadly) There will come a time in each of your careers when youll have a chance to screw over another soap opera actor. I had such an opportunity in the recent, present. And Im ashamed to say that I took it, I advised a fellow actor to play a role, homosexually. Yeah, we both auditioned for the part, and uh, as it turned out, they ah, they liked the stupid gay thing and cast him. And now, hes got a two year contract opposite Susan Luchhi, the first lady of daytime television, and me, me Im stuck here teaching a bunch of people, most of whom are too ugly to even be on TV. Im sorry, Im sorry, Im sorry. (he gets a huge round of applause from his students.) Thank you."}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 16, "scene_id": "S03E07_016", "location": "Mattress King", "scene_description": "Monica is trying to return her bed.", "characters": ["Janice", "Jester", "Joey", "Monica"], "firestore_path": "/episodes/S03E07/scenes/S03E07_016", "raw_text": "[Scene: Mattress King, Monica is trying to return her bed.]\nJester: Uh, may I help you?\nMonica: Yeah, I talked to you on the phone, Im the lady that got stuck with the racecar bed.\nJester: Look, its like I told you, theres nothing I can do. You signed for it, Monica Velula Geller.\nJoey: All right, Jester man, look we wanna see the king.\nJester: Nobody sees the king!\nJoey: Oh-ho-kay, Im talking to the king. (starts to go to a back room)\nJester: Hey! You cant go back there!\n(Joey goes to the door, but stops and looks through the window at Janice and the Mattress King, her ex-husband, kissing.)\nJanice: Oh my God.\n(Joey fakes a scream.)\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Mattress King, Monica is trying to return her bed.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Jester", "text": "Uh, may I help you?"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Yeah, I talked to you on the phone, Im the lady that got stuck with the racecar bed."}, {"line_number": 4, "type": "dialogue", "speaker": "Jester", "text": "Look, its like I told you, theres nothing I can do. You signed for it, Monica Velula Geller."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "All right, Jester man, look we wanna see the king."}, {"line_number": 6, "type": "dialogue", "speaker": "Jester", "text": "Nobody sees the king!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Oh-ho-kay, Im talking to the king. (starts to go to a back room)"}, {"line_number": 8, "type": "dialogue", "speaker": "Jester", "text": "Hey! You cant go back there!"}, {"line_number": 9, "type": "action", "text": "(Joey goes to the door, but stops and looks through the window at Janice and the Mattress King, her ex-husband, kissing.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Janice", "text": "Oh my God."}, {"line_number": 11, "type": "action", "text": "(Joey fakes a scream.)"}, {"line_number": 12, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S03E07", "season": 3, "episode_number": 7, "episode_title": "THE ONE WITH THE RACE CAR BED", "scene_number": 17, "scene_id": "S03E07_017", "location": "Monicas bedroom", "scene_description": "Chandler is playing with the bed.", "characters": ["Chandler"], "firestore_path": "/episodes/S03E07/scenes/S03E07_017", "raw_text": "[Scene: Monicas bedroom, Chandler is playing with the bed.]\nChandler: Varrrrrroom! Hey! Watch it lady! Varrrrrrrrrrom! (makes a screeching sound as he pretends to stomp on the brakes.) Hey-hey good lookin! (honks the beds little horn on the steering wheel.) Varrrrrrrrroom. (notices Rachel and stops) All right, Ill leave. My beds so boring.\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas bedroom, Chandler is playing with the bed.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Varrrrrroom! Hey! Watch it lady! Varrrrrrrrrrom! (makes a screeching sound as he pretends to stomp on the brakes.) Hey-hey good lookin! (honks the beds little horn on the steering wheel.) Varrrrrrrrroom. (notices Rachel and stops) All right, Ill leave. My beds so boring."}, {"line_number": 3, "type": "narration", "text": "End"}]}
