{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 1, "scene_id": "S04E24_001", "location": "", "scene_description": "", "characters": [], "firestore_path": "/episodes/S04E24/scenes/S04E24_001", "raw_text": "THE ONE WITH ROSS'S WEDDING: Part 2", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH ROSS'S WEDDING: Part 2"}]}
{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 2, "scene_id": "S04E24_002", "location": "Monica and Rachel's", "scene_description": "the phone rings and Phoebe answers it.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S04E24/scenes/S04E24_002", "raw_text": "[Scene: Monica and Rachel's, the phone rings and Phoebe answers it.]\nPhoebe: Hello.\nJoey: (on phone) Hey, Pheebs! Its Joey!\nPhoebe: Hey, Joey! Hey! Ooh! Ooh! I just say someone on thethat looks just like you on the subway. And I was gonna go over and say hi! but then I figured, he doesnt care if he looks like you.\nJoey: That just cost me four bucks. But uh listen, I just called to see how the chick and the duck are doing?\nPhoebe: Ohh, theyre having a great time with their Aunt Phoebe! Aunt Rachel hasnt been helpful at all. So, do you miss me?\nJoey: Kinda, but Ive just been having way too much fun.\nPhoebe: So youre not homesick yet?\nJoey: No, I dont think so.\nPhoebe: All right, the seven of us miss you.\nJoey: Whos seven?\nPhoebe: Yknow, me, Rachel, the birds, the babies\nJoey: Ahh, the babies miss me?\n(There is a knock on Rachel and Phoebes door.)\nPhoebe: Ooh, the pizza guys here!\nJoey: What? You ordered pizza without me?!\nPhoebe: Yeah. But yknow we were thinking about you, yknow we ordered the Joey Special.\nJoey: Two pizzas?!\nPhoebe: Yep! Okay, gotta go, talk to you later.\nJoey: Wait, well, where did you get it from?! \n(Phoebe has already hung up, leaving Joey in the dark. So Joey decides to watch some TV and turns on a rerun of Cheers, with the theme song playing. At first, hes happy, but as the song progresses Joey gets depressed and homesick.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, the phone rings and Phoebe answers it.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Hello."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "(on phone) Hey, Pheebs! Its Joey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Hey, Joey! Hey! Ooh! Ooh! I just say someone on thethat looks just like you on the subway. And I was gonna go over and say hi! but then I figured, he doesnt care if he looks like you."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "That just cost me four bucks. But uh listen, I just called to see how the chick and the duck are doing?"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh, theyre having a great time with their Aunt Phoebe! Aunt Rachel hasnt been helpful at all. So, do you miss me?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Kinda, but Ive just been having way too much fun."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "So youre not homesick yet?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "No, I dont think so."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "All right, the seven of us miss you."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Whos seven?"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Yknow, me, Rachel, the birds, the babies"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Ahh, the babies miss me?"}, {"line_number": 14, "type": "action", "text": "(There is a knock on Rachel and Phoebes door.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh, the pizza guys here!"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "What? You ordered pizza without me?!"}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah. But yknow we were thinking about you, yknow we ordered the Joey Special."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Two pizzas?!"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Yep! Okay, gotta go, talk to you later."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Wait, well, where did you get it from?! "}, {"line_number": 21, "type": "action", "text": "(Phoebe has already hung up, leaving Joey in the dark. So Joey decides to watch some TV and turns on a rerun of Cheers, with the theme song playing. At first, hes happy, but as the song progresses Joey gets depressed and homesick.)"}]}
{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 3, "scene_id": "S04E24_003", "location": "Ross and Emilys planned wedding place", "scene_description": "Monica is dragging Emily in.", "characters": ["Emily", "Monica", "Ross"], "firestore_path": "/episodes/S04E24/scenes/S04E24_003", "raw_text": "[Scene: Ross and Emilys planned wedding place, Monica is dragging Emily in.]\nEmily: Monica, why have you brought me here of all places?!\nMonica: Youll see.\nEmily: I tell you, this wedding is not going to happen.\n(At that Ross plugs in some Christmas lights to light the place up.)\nEmily: Oh God.\nRoss: Okay? But-but imagine a lot more lights, okay? And-and yknow fewer bricks, and-and-and flowers, and candles\nMonica: And the musicians, look, they can go over here (Points to a little alcove), okay? And the chairs can face this way (Points), and (Points to Ross) You go.\nRoss: But-but, if you dont love this, well do it in any other place at any other time. Really, its fine, whatever you want.\nEmily: Its perfect.\nRoss: And, I dont know, if it starts to rain\nEmily: Well then well get wet. (They kiss.)\nMonica: Ohh. And I dont even have a date.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Emilys planned wedding place, Monica is dragging Emily in.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Emily", "text": "Monica, why have you brought me here of all places?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Youll see."}, {"line_number": 4, "type": "dialogue", "speaker": "Emily", "text": "I tell you, this wedding is not going to happen."}, {"line_number": 5, "type": "action", "text": "(At that Ross plugs in some Christmas lights to light the place up.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Emily", "text": "Oh God."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Okay? But-but imagine a lot more lights, okay? And-and yknow fewer bricks, and-and-and flowers, and candles"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "And the musicians, look, they can go over here (Points to a little alcove), okay? And the chairs can face this way (Points), and (Points to Ross) You go."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "But-but, if you dont love this, well do it in any other place at any other time. Really, its fine, whatever you want."}, {"line_number": 10, "type": "dialogue", "speaker": "Emily", "text": "Its perfect."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "And, I dont know, if it starts to rain"}, {"line_number": 12, "type": "dialogue", "speaker": "Emily", "text": "Well then well get wet. (They kiss.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Ohh. And I dont even have a date."}]}
{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 4, "scene_id": "S04E24_004", "location": "Monica and Rachel's", "scene_description": "Rachel is in her bedroom.", "characters": ["Chandler", "Emily", "Housekeeper", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Ross and Monica", "Ticket Agent", "Waiter"], "firestore_path": "/episodes/S04E24/scenes/S04E24_004", "raw_text": "[Scene: Monica and Rachel's, Rachel is in her bedroom.]\nRachel: Pheebs?\nPhoebe: Yeah?\nRachel: Do you remember where the duck food is?\nPhoebe: Yeah, its in the guys apartment under the sink. Why?\nRachel: (enters with a bag packed) Because Im going to London.\nPhoebe: What?! What do you mean youre going to London?\nRachel: Yeah, I have to tell Ross that I love him. Now honey, you take care, you dont have those babies until I get back. (Kisses her stomach.) \nPhoebe: IRachel, you cant go! Ross loves Emily!\nRachel: Yeah, I know, I know, I know he does. But I have to tell him how I feel! He deserves to have all the information and then he can make an informed decision.\nPhoebe: Thats not why youre going! Youre going because you hope hes gonna say, \"Yeah, I love you too, Rach. Forget that British chippy.\"\nRachel: OhhDo you think he will?!\nPhoebe: No! Because hes in love with the British chippy! Look, Rachel, if you go, youre just gonna mess with his head and ruin his wedding! Yknow, its too late! You missed youre chance! Im sorry, I know this must be really hard, its over.\nRachel: Yknow what? No. Its not over until someone says, \"I do.\" (Exits)\nPhoebe: I do! I do! I do! (Chases her into the hall, but Rachel doesnt stop.) I do! (Gives up.) Ugh, like I can really chase you. Im carrying a litter.\nCommercial Break\n[Scene: Moving Shot towards The Waltham House. A phone  is ringing.]\nHousekeeper: The Waltham Residence.\nPhoebe: Oh...yes..is this..umm..Emilys Parents house.\nHousekeeper: This is the housekeeper speaking. And by the way, young lady, that is not how one addresses oneself on the telephone. First one identifies oneself and then asks for the person with whom one wishes to speak.\nPhoebe: (In a British accent) This is Phoebe Buffay. I was wondering, please, if-if its not too much trouble, please, umm, might I speak to Miss Emily Waltham, please?\nHousekeeper: Miss Waltham, is at the rehearsal dinner and its not polite to make fun of people. Goodbye.\nPhoebe: No no no, Ill be nice, I swear!!!  Could you just give me the number for where they are?\nHousekeeper: Im afraid, Im not at liberty to divulge that information.\nPhoebe: Ok, somebody is on their way to ruin wedding okay. And I have to warn somebody, alright. So if you dont give me that number then Im going to come over there and kick your snooty ass all the way to New Glocken..shire.\nHousekeeper: Hangs up.\nPhoebe: Hello, Hello. Ohh, OHH, she knew I could kick her ass.\n[Scene: Rehearsal dinner hall. Ross and Emily are standing in the reception area. Monica arrives with her parents.]\nMonica: Hey.\nRoss: (Ross hugs his mom and dad)Hi. Mom. Dad.\nMrs. Geller: Sweetheart. Oh sorry were late, my fault, I insisted on riding the tube.\nMr. Geller: (embarrassed) Judy, the kids..\nMrs. Geller: Jack, thats what they call the subway.\nMr. Geller: Ohh, I thought that you....\nRoss and Monica: Dad, dad. We got it!! We Got It!!!\nEmily: Ohh, here comes my dad and stepmum. Mister and Misses Geller, this is Steven and Andrea Waltham.\nMr. Waltham: (Shaking everyone's hand.) Hello. Hello. How do you do? How do you do? Very nice to meet you. (Looking over at his wife.) Darling its the Gellers. (She pays no attention shes talking on a cellular phone.) (Louder) Darling, its the Gellers. (Shes still not responding.) Shes very self-absorbed, you know. I should never have married her.\nMrs. Waltham: (Looking evilly at her husband) Sorry, what?\nMr. Waltham: Its the Gellers!\nMrs. Waltham: Where?\nMr. Waltham: Well theres one (pointing towards Jack) and theres another (pointing towards Judy).\nMrs. Waltham: Lovely to meet you.\nMr. Waltham: Terribly nice of you to offer to pay for half the wedding. (He hand a multipage bill to Jack.)\nMr. Geller: Ohh forget it. Too hell with tradition, were happy to do it.\nMrs. Geller: We know how expensive weddings can be, besides this may be the only wedding we get to throw (patting Monica on the shoulder.).\nMonica: Ha ha, a joke thats funny in all countries.\n(Ross quickly directs the families to their tables.)\n[Scene: Chandler and Joey are standing by the kitchen entrance. A waiter comes out.]\nWaiter: Sir? (Looking at Joey.)\nJoey: Whats in it?\nWaiter: Goat cheese, water chestnuts, and panchetta. (Joey Looks down disgustingly at the food.)\nJoey: (Looking up at the waiter)Thats not food...No, I dont, no...(Taps Chandler on the shoulder.) Everything's different here...I want to go home. I...I miss my family. I miss the coffee house. I cant even remember what Phoebe looks like.\nChandler: Joey, its been three days, okay.. Your just a little homesick, Okay. Would you just try to relax. Just, just try to enjoy yourself.\nJoey: (Pointing at Chandler.) Your different here too. Your mean in England. (Chandler throws his hands up to his head in frustration. They walk away from each other.)\n[Camera pans to the Geller family table. Ross, Rachel, Mr. and Mrs. Geller are there.]\nMr. Geller: (Looking at ht wedding bill.) What the hell!!!\nRoss: whats up, Dad?\nMr. Geller: This bill for my half of the wedding. its insane.\nMrs. Geller: How could it be so much? The receptions at their house.\nMr. Geller: (Pointing items out on the bill.) Flowers, liquor, recarpet first floor. New guest bath, landscaping. Im paying to remodel this guys house. (Angrily gets up.) Im going to give that son on a bitch, a piece of my mind.\nRoss: (Holding him back.)Dad, dad, please. Look I dont want anything to upset Emily tonight. Alright, she's had a hard enough couple of days as it is. (Picks up the bill.) Now here, here, let me go talk to him, okay?\nMr. Geller: And you tell him no one takes advantage of the Gellers.\nMrs. Geller: Ooh, Jack....(He looks over to her) Sometimes I forget how powerful you can be. (They embrace and kiss passionately.)\nMonica: (Looking nauseous from her parents kissing.) And Im going to go get drunk. (Gets up to get a drink.)\n[Scene: An airport in New York.]\nRachel: (Running to the ticket counter) Ooh, ooh, ooh,ooh,ooh. (Slightly out of breath) Hi.\nTicket Agent: (Cheerfully.) Hello.\nRachel: (Faking cheerfulness.) Hello. Umm, when is your next flight to London?\nTicket Agent: (looking at her computer terminal) Theres one leaving in thirty minutes.\nRachel: Ohh, good.\nTicket Agent: And I do have one seat left. \nRachel: Ohh, thank you, thank you, thank you.\nTicket Agent: The last minute fare on this ticket is twenty seven hundred dollars.\nRachel: (looking through her wallet.) Ohh, I just dont think I have enough left on my credit card.\nTicket Agent: Well you can split it with another credit card.\nRachel: Ohh, okay, how about five. (She hands her all the credit cards.) Ohh, thank you.\nTicket Agent: Im just going to need to see your passport.\nRachel: (Looking through her purse.) Okay, you know what? I dont have it, but I can tell you exactly where it is on my night stand, and...okay. But you know what? I have my drivers license and I have a twenty. (She slides it across the counter.)\nTicket Agent: (Slides the twenty back and tosses her credit card onto the counter.)\n[Scene: The Rehearsal dinner hall. Ross is at the Walthams table discussing the bill.]\nRoss: Look, face it, my father is not going to pay for the build-in barbecue and believe me you can kiss you gazebo goodbye. Now I might be able to get you the new lawn.\nMr. Waltham: Ahh, then you have to give us the lawn ornaments.\nRoss: I go back there with lawn ornaments, hes going to laugh in my face.\nMrs. Waltham: This is ridiculous. I mean we had an agreement. (Ross looks frustrated. She begins to scream at her husband.) Will you say something, Steven?! Please!!!\nMr. Waltham: Dont take that tone with me. (She looks evilly at him.) All-all right you can. (He looks over at Ross and Shrugs.)\n[Scene: The Girls apartment. Phoebe is dialing the phone and Rachel runs in the door.]\nRachel: (Running to her room.) Hi, Pheebs.\nPhoebe: (Looking relieved. She puts down the phone.) Oh thank god. Oh, you changed your mind. Oh, look I know you probably want to be alone, and you dont want to talk about it, thats fine. I just want you to know, I think you are doing the right thing and...\nRachel: (Running back out the door with her passport.) Bye, Pheebs.\nPhoebe: (Trying to get up.) Wait!! Where are you going?! What are you doing?! No!! Wait!! (Not able to get up.) God!! Why am I always pregnant when she does that?!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Rachel is in her bedroom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Pheebs?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Do you remember where the duck food is?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, its in the guys apartment under the sink. Why?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "(enters with a bag packed) Because Im going to London."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "What?! What do you mean youre going to London?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I have to tell Ross that I love him. Now honey, you take care, you dont have those babies until I get back. (Kisses her stomach.) "}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "IRachel, you cant go! Ross loves Emily!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I know, I know, I know he does. But I have to tell him how I feel! He deserves to have all the information and then he can make an informed decision."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Thats not why youre going! Youre going because you hope hes gonna say, \"Yeah, I love you too, Rach. Forget that British chippy.\""}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "OhhDo you think he will?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "No! Because hes in love with the British chippy! Look, Rachel, if you go, youre just gonna mess with his head and ruin his wedding! Yknow, its too late! You missed youre chance! Im sorry, I know this must be really hard, its over."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Yknow what? No. Its not over until someone says, \"I do.\" (Exits)"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "I do! I do! I do! (Chases her into the hall, but Rachel doesnt stop.) I do! (Gives up.) Ugh, like I can really chase you. Im carrying a litter."}, {"line_number": 16, "type": "narration", "text": "Commercial Break"}, {"line_number": 17, "type": "narration", "text": "[Scene: Moving Shot towards The Waltham House. A phone  is ringing.]"}, {"line_number": 18, "type": "dialogue", "speaker": "Housekeeper", "text": "The Waltham Residence."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Oh...yes..is this..umm..Emilys Parents house."}, {"line_number": 20, "type": "dialogue", "speaker": "Housekeeper", "text": "This is the housekeeper speaking. And by the way, young lady, that is not how one addresses oneself on the telephone. First one identifies oneself and then asks for the person with whom one wishes to speak."}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "(In a British accent) This is Phoebe Buffay. I was wondering, please, if-if its not too much trouble, please, umm, might I speak to Miss Emily Waltham, please?"}, {"line_number": 22, "type": "dialogue", "speaker": "Housekeeper", "text": "Miss Waltham, is at the rehearsal dinner and its not polite to make fun of people. Goodbye."}, {"line_number": 23, "type": "dialogue", "speaker": "Phoebe", "text": "No no no, Ill be nice, I swear!!!  Could you just give me the number for where they are?"}, {"line_number": 24, "type": "dialogue", "speaker": "Housekeeper", "text": "Im afraid, Im not at liberty to divulge that information."}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "Ok, somebody is on their way to ruin wedding okay. And I have to warn somebody, alright. So if you dont give me that number then Im going to come over there and kick your snooty ass all the way to New Glocken..shire."}, {"line_number": 26, "type": "dialogue", "speaker": "Housekeeper", "text": "Hangs up."}, {"line_number": 27, "type": "dialogue", "speaker": "Phoebe", "text": "Hello, Hello. Ohh, OHH, she knew I could kick her ass."}, {"line_number": 28, "type": "narration", "text": "[Scene: Rehearsal dinner hall. Ross and Emily are standing in the reception area. Monica arrives with her parents.]"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Hey."}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "(Ross hugs his mom and dad)Hi. Mom. Dad."}, {"line_number": 31, "type": "narration", "text": "Mrs. Geller: Sweetheart. Oh sorry were late, my fault, I insisted on riding the tube."}, {"line_number": 32, "type": "narration", "text": "Mr. Geller: (embarrassed) Judy, the kids.."}, {"line_number": 33, "type": "narration", "text": "Mrs. Geller: Jack, thats what they call the subway."}, {"line_number": 34, "type": "narration", "text": "Mr. Geller: Ohh, I thought that you...."}, {"line_number": 35, "type": "dialogue", "speaker": "Ross and Monica", "text": "Dad, dad. We got it!! We Got It!!!"}, {"line_number": 36, "type": "dialogue", "speaker": "Emily", "text": "Ohh, here comes my dad and stepmum. Mister and Misses Geller, this is Steven and Andrea Waltham."}, {"line_number": 37, "type": "narration", "text": "Mr. Waltham: (Shaking everyone's hand.) Hello. Hello. How do you do? How do you do? Very nice to meet you. (Looking over at his wife.) Darling its the Gellers. (She pays no attention shes talking on a cellular phone.) (Louder) Darling, its the Gellers. (Shes still not responding.) Shes very self-absorbed, you know. I should never have married her."}, {"line_number": 38, "type": "narration", "text": "Mrs. Waltham: (Looking evilly at her husband) Sorry, what?"}, {"line_number": 39, "type": "narration", "text": "Mr. Waltham: Its the Gellers!"}, {"line_number": 40, "type": "narration", "text": "Mrs. Waltham: Where?"}, {"line_number": 41, "type": "narration", "text": "Mr. Waltham: Well theres one (pointing towards Jack) and theres another (pointing towards Judy)."}, {"line_number": 42, "type": "narration", "text": "Mrs. Waltham: Lovely to meet you."}, {"line_number": 43, "type": "narration", "text": "Mr. Waltham: Terribly nice of you to offer to pay for half the wedding. (He hand a multipage bill to Jack.)"}, {"line_number": 44, "type": "narration", "text": "Mr. Geller: Ohh forget it. Too hell with tradition, were happy to do it."}, {"line_number": 45, "type": "narration", "text": "Mrs. Geller: We know how expensive weddings can be, besides this may be the only wedding we get to throw (patting Monica on the shoulder.)."}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "Ha ha, a joke thats funny in all countries."}, {"line_number": 47, "type": "action", "text": "(Ross quickly directs the families to their tables.)"}, {"line_number": 48, "type": "narration", "text": "[Scene: Chandler and Joey are standing by the kitchen entrance. A waiter comes out.]"}, {"line_number": 49, "type": "dialogue", "speaker": "Waiter", "text": "Sir? (Looking at Joey.)"}, {"line_number": 50, "type": "dialogue", "speaker": "Joey", "text": "Whats in it?"}, {"line_number": 51, "type": "dialogue", "speaker": "Waiter", "text": "Goat cheese, water chestnuts, and panchetta. (Joey Looks down disgustingly at the food.)"}, {"line_number": 52, "type": "dialogue", "speaker": "Joey", "text": "(Looking up at the waiter)Thats not food...No, I dont, no...(Taps Chandler on the shoulder.) Everything's different here...I want to go home. I...I miss my family. I miss the coffee house. I cant even remember what Phoebe looks like."}, {"line_number": 53, "type": "dialogue", "speaker": "Chandler", "text": "Joey, its been three days, okay.. Your just a little homesick, Okay. Would you just try to relax. Just, just try to enjoy yourself."}, {"line_number": 54, "type": "dialogue", "speaker": "Joey", "text": "(Pointing at Chandler.) Your different here too. Your mean in England. (Chandler throws his hands up to his head in frustration. They walk away from each other.)"}, {"line_number": 55, "type": "narration", "text": "[Camera pans to the Geller family table. Ross, Rachel, Mr. and Mrs. Geller are there.]"}, {"line_number": 56, "type": "narration", "text": "Mr. Geller: (Looking at ht wedding bill.) What the hell!!!"}, {"line_number": 57, "type": "dialogue", "speaker": "Ross", "text": "whats up, Dad?"}, {"line_number": 58, "type": "narration", "text": "Mr. Geller: This bill for my half of the wedding. its insane."}, {"line_number": 59, "type": "narration", "text": "Mrs. Geller: How could it be so much? The receptions at their house."}, {"line_number": 60, "type": "narration", "text": "Mr. Geller: (Pointing items out on the bill.) Flowers, liquor, recarpet first floor. New guest bath, landscaping. Im paying to remodel this guys house. (Angrily gets up.) Im going to give that son on a bitch, a piece of my mind."}, {"line_number": 61, "type": "dialogue", "speaker": "Ross", "text": "(Holding him back.)Dad, dad, please. Look I dont want anything to upset Emily tonight. Alright, she's had a hard enough couple of days as it is. (Picks up the bill.) Now here, here, let me go talk to him, okay?"}, {"line_number": 62, "type": "narration", "text": "Mr. Geller: And you tell him no one takes advantage of the Gellers."}, {"line_number": 63, "type": "narration", "text": "Mrs. Geller: Ooh, Jack....(He looks over to her) Sometimes I forget how powerful you can be. (They embrace and kiss passionately.)"}, {"line_number": 64, "type": "dialogue", "speaker": "Monica", "text": "(Looking nauseous from her parents kissing.) And Im going to go get drunk. (Gets up to get a drink.)"}, {"line_number": 65, "type": "narration", "text": "[Scene: An airport in New York.]"}, {"line_number": 66, "type": "dialogue", "speaker": "Rachel", "text": "(Running to the ticket counter) Ooh, ooh, ooh,ooh,ooh. (Slightly out of breath) Hi."}, {"line_number": 67, "type": "dialogue", "speaker": "Ticket Agent", "text": "(Cheerfully.) Hello."}, {"line_number": 68, "type": "dialogue", "speaker": "Rachel", "text": "(Faking cheerfulness.) Hello. Umm, when is your next flight to London?"}, {"line_number": 69, "type": "dialogue", "speaker": "Ticket Agent", "text": "(looking at her computer terminal) Theres one leaving in thirty minutes."}, {"line_number": 70, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, good."}, {"line_number": 71, "type": "dialogue", "speaker": "Ticket Agent", "text": "And I do have one seat left. "}, {"line_number": 72, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, thank you, thank you, thank you."}, {"line_number": 73, "type": "dialogue", "speaker": "Ticket Agent", "text": "The last minute fare on this ticket is twenty seven hundred dollars."}, {"line_number": 74, "type": "dialogue", "speaker": "Rachel", "text": "(looking through her wallet.) Ohh, I just dont think I have enough left on my credit card."}, {"line_number": 75, "type": "dialogue", "speaker": "Ticket Agent", "text": "Well you can split it with another credit card."}, {"line_number": 76, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, okay, how about five. (She hands her all the credit cards.) Ohh, thank you."}, {"line_number": 77, "type": "dialogue", "speaker": "Ticket Agent", "text": "Im just going to need to see your passport."}, {"line_number": 78, "type": "dialogue", "speaker": "Rachel", "text": "(Looking through her purse.) Okay, you know what? I dont have it, but I can tell you exactly where it is on my night stand, and...okay. But you know what? I have my drivers license and I have a twenty. (She slides it across the counter.)"}, {"line_number": 79, "type": "dialogue", "speaker": "Ticket Agent", "text": "(Slides the twenty back and tosses her credit card onto the counter.)"}, {"line_number": 80, "type": "narration", "text": "[Scene: The Rehearsal dinner hall. Ross is at the Walthams table discussing the bill.]"}, {"line_number": 81, "type": "dialogue", "speaker": "Ross", "text": "Look, face it, my father is not going to pay for the build-in barbecue and believe me you can kiss you gazebo goodbye. Now I might be able to get you the new lawn."}, {"line_number": 82, "type": "narration", "text": "Mr. Waltham: Ahh, then you have to give us the lawn ornaments."}, {"line_number": 83, "type": "dialogue", "speaker": "Ross", "text": "I go back there with lawn ornaments, hes going to laugh in my face."}, {"line_number": 84, "type": "narration", "text": "Mrs. Waltham: This is ridiculous. I mean we had an agreement. (Ross looks frustrated. She begins to scream at her husband.) Will you say something, Steven?! Please!!!"}, {"line_number": 85, "type": "narration", "text": "Mr. Waltham: Dont take that tone with me. (She looks evilly at him.) All-all right you can. (He looks over at Ross and Shrugs.)"}, {"line_number": 86, "type": "narration", "text": "[Scene: The Girls apartment. Phoebe is dialing the phone and Rachel runs in the door.]"}, {"line_number": 87, "type": "dialogue", "speaker": "Rachel", "text": "(Running to her room.) Hi, Pheebs."}, {"line_number": 88, "type": "dialogue", "speaker": "Phoebe", "text": "(Looking relieved. She puts down the phone.) Oh thank god. Oh, you changed your mind. Oh, look I know you probably want to be alone, and you dont want to talk about it, thats fine. I just want you to know, I think you are doing the right thing and..."}, {"line_number": 89, "type": "dialogue", "speaker": "Rachel", "text": "(Running back out the door with her passport.) Bye, Pheebs."}, {"line_number": 90, "type": "dialogue", "speaker": "Phoebe", "text": "(Trying to get up.) Wait!! Where are you going?! What are you doing?! No!! Wait!! (Not able to get up.) God!! Why am I always pregnant when she does that?!"}]}
{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 5, "scene_id": "S04E24_005", "location": "The Rehearsal Dinner Hall. Chandler", "scene_description": "Joey, Ross, Emily, Monica, and all the bridal party are seated at the table. Chandler gets up to make a toast.", "characters": ["Chandler", "Drunk Man", "Felicity", "Joey", "Monica", "Passenger", "Phoebe", "Rachel", "Ross", "Ticket Agent"], "firestore_path": "/episodes/S04E24/scenes/S04E24_005", "raw_text": "[Scene: The Rehearsal Dinner Hall. Chandler, Joey, Ross, Emily, Monica, and all the bridal party are seated at the table. Chandler gets up to make a toast.]\nChandler: Id like to toast, Ross and Emily. Of course, my big toast will be tomorrow at the wedding, so this is kind of my little toast or Melba toast, if you will. (No one in the room laughs. He starts to get flustered.) Okay. I known Ross for a long time. In fact, I knew him when he was going out with his first girlfriend. (Ross looks embarrassed.) And I thought things were going to work out for him..Until the day he over inflated her. (He laughs. Jack looks at Judy and no one in the room laughs.) Ohh, Dear God.. (A cellular phone rings.)\nMrs. Waltham: Hello, Waltham Interiors.\nPhoebe: Oh, hi, Mrs. Waltham. I need to speak with ether one of the best men, or Rosss sister Monica.\nMrs. Waltham: Who is this?\nPhoebe: Oh, Im Phoebe Buffay. Im one of Rosss best friends.\nMrs. Waltham: Well, if youre on e of Rosss best friends, why arent you here?\nPhoebe: Yeah, um, I cant fly. Im having my brothers babies.\nMrs. Waltham: Oh, am I on the radio?\nPhoebe: No..umm, could I talk to one of them? Its very very important.\nMrs. Waltham: No, Im bored with you now. Im going to cut you off. (She hangs up.)\nPhoebe: Ohh! Okay, Im going to have to kick her ass too.\nChandler: (Continuing his toast.) And Im sure were all very excited that Ross and Emily are getting married at Montgomery Hall. I mean to think, my friend getting married in Monty Hall. (No reaction from the people.) Ohh, come on!! Monty Hall!! Lets make a Deal!! Come on, you people!! All right, forget it!! Congratulations, Ross and Emily. (He sits down.)\nJoey: Hey, best man number two, Joey Tribbiani. Now Im not good with the jokes like Chandler here. Boy...but ahh, I just want to say congratulation to the happy couple. I first met Ross in this coffee house back home...Home...New York City...Where everybody knows my name. Well anyway, I love you guys. (pointing at everyone.) But not as much as I love America. (Looking at Chandler.) Could we please..go home now?\n(One of the bridesmaids, Felicity, puts her arm around Joey.)\nFelicity: (Putting her arm around Joey.) Are you going home? I was hoping to get to know you better.\nJoey: (Putting his arm around her.) Im not going anywhere, sweetheart.\n[Scene: Later that evening at the rehearsal dinner. Chandler and Monica are sitting on a sofa. Chandler is covering his face in embarrassment because of the toast.]\nMonica: I was laughing. (Patting him on the knee.)\nChandler: Out loud?\nMonica: Well I didnt want everyone to think I was stupid.\nChandler: So how are you doing?\nMonica: My mothers driving me crazy, but Ross is getting married. Im happy. (A drunken man approaches.) Im not going to let anything spoil that.\nDrunk Man: I just want to say that Ross is a wonderful young man.\nMonica: Well, thanks, we like him.\nDrunk Man: My god!! You must have been a teenage when you had him. (Monica stares straight forward after the comment. Chandler tries to console her by patting her on the shoulder.)\n(Ross and Emilys parents are seated at a table. Ross is between them and they are discussing the wedding bill.)\nMr. Geller: Theres no way in hell, Im paying for it.\nRoss: Look, were down to just one point. Could we please, maybe just settle it after the wedding.\nMr. Geller: All-right fine, but I just want to say, Im not paying for your wine cellar. You thieving, would be speaking German if it werent for us, cheap little man. (Emilys stepmum looks shocked. Jack and Judy get up and leave.)\n(Chandlers trying to console Monica.)\nChandler: The guy was hammered, okay? Theres no way, you look like Rosss mother.\nMonica: Then why would he say it?\nChandler: Because hes crazy. Okay? He came up to me earlier and thanked me for my very moving performance in Titanic.\nMonica: Oh, my mothers right. Im never going to get married.\nChandler: Ahh, you know what? That is....Who wouldnt want you?\nMonica: Ohh, Please?! Im a single mom, with a thirty year old son!!\n[Scene: The airport. Rachel runs up to the ticket counter.]\nRachel: Hi, Im back. Listen, I need to...\nTicket Agent: Hello.\nRachel: Hello. I need to get on the 11 o'clock flight.\nTicket Agent: Oh Im afraid that plane has already pulled away from the gate.\nRachel: Okay, you know what/ Youre going to have to call that plane and tell them to swing around and come and pick me up.\nTicket Agent: I cant do that.\nRachel: Sure, you know what? Come on, well just tell them that there was like a problem with like the \"engine\".\nTicket Agent: Im afraid Im going to have to ask you to step aside, Miss.\nRachel: Look, If I dont get to London!! He is going to marry that other girl!!!\nTicket Agent: I cant imagine why.\nRachel: All right, you know what? I am not leaving here, until you call that plane back!! (She pounds her hand on the counter twice. The ticket agent counters by placing the closed sign on the counter and tapping it twice.)\n[Scene: Chandlers hotel room. Ross bursts into the room.]\nRoss: (Screaming) Im getting married today!! Whoo-hoo!!\nChandler: (With the covers pulled up to his chin.) Morning, Ross.\nRoss: Im getting married, to..day!!\nChandler: Yeah you are!!\nRoss: Ahh, whoo-hoo!!(He runs back out the door.\nMonica: (Comes up for below the covers and looks concerned.) Do you think he knew I was here? (Chandler quickly looks at Monica not knowing what to say.)\nCommercial Break\n[Scene: Chandlers hotel room. Chandler and Monica are lying in the bed together talking. Theres an awkward air between them. They are both clutching the covers in from of them.]\nChandler: Well Ive-Ive never done that with you before.\nMonica: (In am uneasy voice.) Nope. (She chuckles uneasily.)\nChandler: So, ahh, how are ya? How ya...How ya... You okay?\nMonica: Yep, yep...You?\nChandler: Yes...Yes..Uh-huh, You?(Looking over at her. She looks back.) We did you.\nMonica: Well...Id better get going.\nChandler: Oh yea yea, absolutely.\nMonica: (Scoots towards the side of the bed.) Could you not look?\nChandler: I dont want to look.\n[Scene: The Virgin Atlantic flight to London that Rachel is on.]\nRachel: Ohhh.(she rhythmically taps her hands on the magazine on her lap.)\nPassenger: Ahh, ahh, excuse me.\nRachel: Yeah?\nPassenger: If youre planning on doing that throughout the entire flight. Please tell me now. So that I could that a sedative...or perhaps slip you one.\nRachel: Oh. Im sorry. Im very sorry. Sorry. (She hums and sighs happily.) Its just, Im ahh, Im kinda excited. Im, ahh, going to London to ahh, tell this guy that I love him and... (He puts his headphones on to ignore her.) \n[Scene: Joey enters his hotel room. The phone is ringing.]\nJoey: Hello?\nPhoebe: (Angrily.) Hey, were the hell have you been?!\nJoey: Hey. I spent the night out. I met this cute bridesmaid. She is so...\nPhoebe: I dont want to hear about her!!\nJoey: Ahh Pheebs, you know youre still my number one girl.\nPhoebe: No! No, we have an emergency. Okay? Rachels coming to London.\nJoey: Ohh great!!!\nPhoebe: No its not great. No, shes coming to tell Ross that she loves him.\nJoey: (Confused.) But, he loves Emily?\nPhoebe: I KNOW THAT!!! You have to stop her!! Shes going to ruin the wedding!!\nJoey: Okay.\nPhoebe: All right, so, okay...\nJoey: Hold on. Hold on. (Picking up a note pad and writing and reading the message aloud.) Rachel coming. Do...Something.\nPhoebe: Okay, so Im done my part, okay. Its your responsibility now, okay. The burden is off me, right?\nJoey: Right!\nPhoebe: So tell me about this girl?\n(The guys hotel room. Joeys there. Chandler comes out of the bathroom in a robe.)\nJoey: Hey.\nChandler: Hey.\nJoey: Have you seen Monica?\nChandler: (Very defensive.) Im not seeing Monica.\nJoey: (With a confused look on his face.) What?\nChandler: What?\nJoey: Look weve got to find her. Phoebe just called!! Rachels coming to tell Ross she loves him!!\nChandler: Oh my god!\nJoey: I know! Thats why we got to find Monica!! You know where she is? \nChandler: No!! Okay!! Whats with the third degree?! Why dont you just shine a light in my eyes?! (Joey looks totally confused.)\n[Scene: The plane. Rachel's telling her story to the passenger on her left. The one on her left is still wearing his headphones.]\nRachel: ...And so then I realized. All this stuff I had been doing. proposing to Joshua, lying to Ross about why I couldnt come to the wedding. Was all just a way of...\nPassenger: (Frustrated he takes his headphones off.) Oh, oh oh!! Im sorry, can I interrupt? You know I just want to say..That you are a horrible, horrible person.\nRachel: Ehh, pardon me?\nPassenger: You say you love this man, yet youre about to ruin the happiest day of his life. Im afraid I have to agree with you friend Pheebs.. This is a..this is a...terrible, terrible plan. \nRachel: But he has to know how I feel!\nPassenger: But why? He loves this...this Emily person. No good can come of this.\nRachel: (Sighing) Well I-I think your wrong.\nPassenger: Oh-no.(He bites his fist at her.)And by the way, it seems to be perfectly clear that you were on a break. (Rachel gasps and doesnt know what to say. He puts his headphones back on.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Rehearsal Dinner Hall. Chandler, Joey, Ross, Emily, Monica, and all the bridal party are seated at the table. Chandler gets up to make a toast.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Id like to toast, Ross and Emily. Of course, my big toast will be tomorrow at the wedding, so this is kind of my little toast or Melba toast, if you will. (No one in the room laughs. He starts to get flustered.) Okay. I known Ross for a long time. In fact, I knew him when he was going out with his first girlfriend. (Ross looks embarrassed.) And I thought things were going to work out for him..Until the day he over inflated her. (He laughs. Jack looks at Judy and no one in the room laughs.) Ohh, Dear God.. (A cellular phone rings.)"}, {"line_number": 3, "type": "narration", "text": "Mrs. Waltham: Hello, Waltham Interiors."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, hi, Mrs. Waltham. I need to speak with ether one of the best men, or Rosss sister Monica."}, {"line_number": 5, "type": "narration", "text": "Mrs. Waltham: Who is this?"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, Im Phoebe Buffay. Im one of Rosss best friends."}, {"line_number": 7, "type": "narration", "text": "Mrs. Waltham: Well, if youre on e of Rosss best friends, why arent you here?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, um, I cant fly. Im having my brothers babies."}, {"line_number": 9, "type": "narration", "text": "Mrs. Waltham: Oh, am I on the radio?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "No..umm, could I talk to one of them? Its very very important."}, {"line_number": 11, "type": "narration", "text": "Mrs. Waltham: No, Im bored with you now. Im going to cut you off. (She hangs up.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh! Okay, Im going to have to kick her ass too."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "(Continuing his toast.) And Im sure were all very excited that Ross and Emily are getting married at Montgomery Hall. I mean to think, my friend getting married in Monty Hall. (No reaction from the people.) Ohh, come on!! Monty Hall!! Lets make a Deal!! Come on, you people!! All right, forget it!! Congratulations, Ross and Emily. (He sits down.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Hey, best man number two, Joey Tribbiani. Now Im not good with the jokes like Chandler here. Boy...but ahh, I just want to say congratulation to the happy couple. I first met Ross in this coffee house back home...Home...New York City...Where everybody knows my name. Well anyway, I love you guys. (pointing at everyone.) But not as much as I love America. (Looking at Chandler.) Could we please..go home now?"}, {"line_number": 15, "type": "action", "text": "(One of the bridesmaids, Felicity, puts her arm around Joey.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Felicity", "text": "(Putting her arm around Joey.) Are you going home? I was hoping to get to know you better."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "(Putting his arm around her.) Im not going anywhere, sweetheart."}, {"line_number": 18, "type": "narration", "text": "[Scene: Later that evening at the rehearsal dinner. Chandler and Monica are sitting on a sofa. Chandler is covering his face in embarrassment because of the toast.]"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "I was laughing. (Patting him on the knee.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "Out loud?"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Well I didnt want everyone to think I was stupid."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "So how are you doing?"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "My mothers driving me crazy, but Ross is getting married. Im happy. (A drunken man approaches.) Im not going to let anything spoil that."}, {"line_number": 24, "type": "dialogue", "speaker": "Drunk Man", "text": "I just want to say that Ross is a wonderful young man."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Well, thanks, we like him."}, {"line_number": 26, "type": "dialogue", "speaker": "Drunk Man", "text": "My god!! You must have been a teenage when you had him. (Monica stares straight forward after the comment. Chandler tries to console her by patting her on the shoulder.)"}, {"line_number": 27, "type": "action", "text": "(Ross and Emilys parents are seated at a table. Ross is between them and they are discussing the wedding bill.)"}, {"line_number": 28, "type": "narration", "text": "Mr. Geller: Theres no way in hell, Im paying for it."}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Look, were down to just one point. Could we please, maybe just settle it after the wedding."}, {"line_number": 30, "type": "narration", "text": "Mr. Geller: All-right fine, but I just want to say, Im not paying for your wine cellar. You thieving, would be speaking German if it werent for us, cheap little man. (Emilys stepmum looks shocked. Jack and Judy get up and leave.)"}, {"line_number": 31, "type": "action", "text": "(Chandlers trying to console Monica.)"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "The guy was hammered, okay? Theres no way, you look like Rosss mother."}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Then why would he say it?"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "Because hes crazy. Okay? He came up to me earlier and thanked me for my very moving performance in Titanic."}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Oh, my mothers right. Im never going to get married."}, {"line_number": 36, "type": "dialogue", "speaker": "Chandler", "text": "Ahh, you know what? That is....Who wouldnt want you?"}, {"line_number": 37, "type": "dialogue", "speaker": "Monica", "text": "Ohh, Please?! Im a single mom, with a thirty year old son!!"}, {"line_number": 38, "type": "narration", "text": "[Scene: The airport. Rachel runs up to the ticket counter.]"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Hi, Im back. Listen, I need to..."}, {"line_number": 40, "type": "dialogue", "speaker": "Ticket Agent", "text": "Hello."}, {"line_number": 41, "type": "dialogue", "speaker": "Rachel", "text": "Hello. I need to get on the 11 o'clock flight."}, {"line_number": 42, "type": "dialogue", "speaker": "Ticket Agent", "text": "Oh Im afraid that plane has already pulled away from the gate."}, {"line_number": 43, "type": "dialogue", "speaker": "Rachel", "text": "Okay, you know what/ Youre going to have to call that plane and tell them to swing around and come and pick me up."}, {"line_number": 44, "type": "dialogue", "speaker": "Ticket Agent", "text": "I cant do that."}, {"line_number": 45, "type": "dialogue", "speaker": "Rachel", "text": "Sure, you know what? Come on, well just tell them that there was like a problem with like the \"engine\"."}, {"line_number": 46, "type": "dialogue", "speaker": "Ticket Agent", "text": "Im afraid Im going to have to ask you to step aside, Miss."}, {"line_number": 47, "type": "dialogue", "speaker": "Rachel", "text": "Look, If I dont get to London!! He is going to marry that other girl!!!"}, {"line_number": 48, "type": "dialogue", "speaker": "Ticket Agent", "text": "I cant imagine why."}, {"line_number": 49, "type": "dialogue", "speaker": "Rachel", "text": "All right, you know what? I am not leaving here, until you call that plane back!! (She pounds her hand on the counter twice. The ticket agent counters by placing the closed sign on the counter and tapping it twice.)"}, {"line_number": 50, "type": "narration", "text": "[Scene: Chandlers hotel room. Ross bursts into the room.]"}, {"line_number": 51, "type": "dialogue", "speaker": "Ross", "text": "(Screaming) Im getting married today!! Whoo-hoo!!"}, {"line_number": 52, "type": "dialogue", "speaker": "Chandler", "text": "(With the covers pulled up to his chin.) Morning, Ross."}, {"line_number": 53, "type": "dialogue", "speaker": "Ross", "text": "Im getting married, to..day!!"}, {"line_number": 54, "type": "dialogue", "speaker": "Chandler", "text": "Yeah you are!!"}, {"line_number": 55, "type": "dialogue", "speaker": "Ross", "text": "Ahh, whoo-hoo!!(He runs back out the door."}, {"line_number": 56, "type": "dialogue", "speaker": "Monica", "text": "(Comes up for below the covers and looks concerned.) Do you think he knew I was here? (Chandler quickly looks at Monica not knowing what to say.)"}, {"line_number": 57, "type": "narration", "text": "Commercial Break"}, {"line_number": 58, "type": "narration", "text": "[Scene: Chandlers hotel room. Chandler and Monica are lying in the bed together talking. Theres an awkward air between them. They are both clutching the covers in from of them.]"}, {"line_number": 59, "type": "dialogue", "speaker": "Chandler", "text": "Well Ive-Ive never done that with you before."}, {"line_number": 60, "type": "dialogue", "speaker": "Monica", "text": "(In am uneasy voice.) Nope. (She chuckles uneasily.)"}, {"line_number": 61, "type": "dialogue", "speaker": "Chandler", "text": "So, ahh, how are ya? How ya...How ya... You okay?"}, {"line_number": 62, "type": "dialogue", "speaker": "Monica", "text": "Yep, yep...You?"}, {"line_number": 63, "type": "dialogue", "speaker": "Chandler", "text": "Yes...Yes..Uh-huh, You?(Looking over at her. She looks back.) We did you."}, {"line_number": 64, "type": "dialogue", "speaker": "Monica", "text": "Well...Id better get going."}, {"line_number": 65, "type": "dialogue", "speaker": "Chandler", "text": "Oh yea yea, absolutely."}, {"line_number": 66, "type": "dialogue", "speaker": "Monica", "text": "(Scoots towards the side of the bed.) Could you not look?"}, {"line_number": 67, "type": "dialogue", "speaker": "Chandler", "text": "I dont want to look."}, {"line_number": 68, "type": "narration", "text": "[Scene: The Virgin Atlantic flight to London that Rachel is on.]"}, {"line_number": 69, "type": "dialogue", "speaker": "Rachel", "text": "Ohhh.(she rhythmically taps her hands on the magazine on her lap.)"}, {"line_number": 70, "type": "dialogue", "speaker": "Passenger", "text": "Ahh, ahh, excuse me."}, {"line_number": 71, "type": "dialogue", "speaker": "Rachel", "text": "Yeah?"}, {"line_number": 72, "type": "dialogue", "speaker": "Passenger", "text": "If youre planning on doing that throughout the entire flight. Please tell me now. So that I could that a sedative...or perhaps slip you one."}, {"line_number": 73, "type": "dialogue", "speaker": "Rachel", "text": "Oh. Im sorry. Im very sorry. Sorry. (She hums and sighs happily.) Its just, Im ahh, Im kinda excited. Im, ahh, going to London to ahh, tell this guy that I love him and... (He puts his headphones on to ignore her.) "}, {"line_number": 74, "type": "narration", "text": "[Scene: Joey enters his hotel room. The phone is ringing.]"}, {"line_number": 75, "type": "dialogue", "speaker": "Joey", "text": "Hello?"}, {"line_number": 76, "type": "dialogue", "speaker": "Phoebe", "text": "(Angrily.) Hey, were the hell have you been?!"}, {"line_number": 77, "type": "dialogue", "speaker": "Joey", "text": "Hey. I spent the night out. I met this cute bridesmaid. She is so..."}, {"line_number": 78, "type": "dialogue", "speaker": "Phoebe", "text": "I dont want to hear about her!!"}, {"line_number": 79, "type": "dialogue", "speaker": "Joey", "text": "Ahh Pheebs, you know youre still my number one girl."}, {"line_number": 80, "type": "dialogue", "speaker": "Phoebe", "text": "No! No, we have an emergency. Okay? Rachels coming to London."}, {"line_number": 81, "type": "dialogue", "speaker": "Joey", "text": "Ohh great!!!"}, {"line_number": 82, "type": "dialogue", "speaker": "Phoebe", "text": "No its not great. No, shes coming to tell Ross that she loves him."}, {"line_number": 83, "type": "dialogue", "speaker": "Joey", "text": "(Confused.) But, he loves Emily?"}, {"line_number": 84, "type": "dialogue", "speaker": "Phoebe", "text": "I KNOW THAT!!! You have to stop her!! Shes going to ruin the wedding!!"}, {"line_number": 85, "type": "dialogue", "speaker": "Joey", "text": "Okay."}, {"line_number": 86, "type": "dialogue", "speaker": "Phoebe", "text": "All right, so, okay..."}, {"line_number": 87, "type": "dialogue", "speaker": "Joey", "text": "Hold on. Hold on. (Picking up a note pad and writing and reading the message aloud.) Rachel coming. Do...Something."}, {"line_number": 88, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, so Im done my part, okay. Its your responsibility now, okay. The burden is off me, right?"}, {"line_number": 89, "type": "dialogue", "speaker": "Joey", "text": "Right!"}, {"line_number": 90, "type": "dialogue", "speaker": "Phoebe", "text": "So tell me about this girl?"}, {"line_number": 91, "type": "action", "text": "(The guys hotel room. Joeys there. Chandler comes out of the bathroom in a robe.)"}, {"line_number": 92, "type": "dialogue", "speaker": "Joey", "text": "Hey."}, {"line_number": 93, "type": "dialogue", "speaker": "Chandler", "text": "Hey."}, {"line_number": 94, "type": "dialogue", "speaker": "Joey", "text": "Have you seen Monica?"}, {"line_number": 95, "type": "dialogue", "speaker": "Chandler", "text": "(Very defensive.) Im not seeing Monica."}, {"line_number": 96, "type": "dialogue", "speaker": "Joey", "text": "(With a confused look on his face.) What?"}, {"line_number": 97, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 98, "type": "dialogue", "speaker": "Joey", "text": "Look weve got to find her. Phoebe just called!! Rachels coming to tell Ross she loves him!!"}, {"line_number": 99, "type": "dialogue", "speaker": "Chandler", "text": "Oh my god!"}, {"line_number": 100, "type": "dialogue", "speaker": "Joey", "text": "I know! Thats why we got to find Monica!! You know where she is? "}, {"line_number": 101, "type": "dialogue", "speaker": "Chandler", "text": "No!! Okay!! Whats with the third degree?! Why dont you just shine a light in my eyes?! (Joey looks totally confused.)"}, {"line_number": 102, "type": "narration", "text": "[Scene: The plane. Rachel's telling her story to the passenger on her left. The one on her left is still wearing his headphones.]"}, {"line_number": 103, "type": "dialogue", "speaker": "Rachel", "text": "...And so then I realized. All this stuff I had been doing. proposing to Joshua, lying to Ross about why I couldnt come to the wedding. Was all just a way of..."}, {"line_number": 104, "type": "dialogue", "speaker": "Passenger", "text": "(Frustrated he takes his headphones off.) Oh, oh oh!! Im sorry, can I interrupt? You know I just want to say..That you are a horrible, horrible person."}, {"line_number": 105, "type": "dialogue", "speaker": "Rachel", "text": "Ehh, pardon me?"}, {"line_number": 106, "type": "dialogue", "speaker": "Passenger", "text": "You say you love this man, yet youre about to ruin the happiest day of his life. Im afraid I have to agree with you friend Pheebs.. This is a..this is a...terrible, terrible plan. "}, {"line_number": 107, "type": "dialogue", "speaker": "Rachel", "text": "But he has to know how I feel!"}, {"line_number": 108, "type": "dialogue", "speaker": "Passenger", "text": "But why? He loves this...this Emily person. No good can come of this."}, {"line_number": 109, "type": "dialogue", "speaker": "Rachel", "text": "(Sighing) Well I-I think your wrong."}, {"line_number": 110, "type": "dialogue", "speaker": "Passenger", "text": "Oh-no.(He bites his fist at her.)And by the way, it seems to be perfectly clear that you were on a break. (Rachel gasps and doesnt know what to say. He puts his headphones back on.)"}]}
{"episode_id": "S04E24", "season": 4, "episode_number": 24, "episode_title": "THE ONE WITH ROSS'S WEDDING: Part 2", "scene_number": 6, "scene_id": "S04E24_006", "location": "The church where Ross and Emily are to be married. Judy", "scene_description": "Andrea, and Monica enter together.", "characters": ["Chandler", "Emily", "Felicity", "Joey", "Minister", "Minster", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E24/scenes/S04E24_006", "raw_text": "[Scene: The church where Ross and Emily are to be married. Judy, Andrea, and Monica enter together.]\nMrs. Geller: (Looking around at the chapel.) Oh my God! Its like a fairyland.\nMrs. Waltham: I know, its horrible isnt it?\nMonica: Well, I love it. I only hope my wedding looks this good.\nMrs. Geller: I just hope...\nMonica: (Angrily.) You can let some of them go by!(Judy and Andrea go to the front of the chapel. Joey approaches Monica.)\nJoey: (Whispering.) Pisst, Monica. Alright, we really need to start looking out for Rachel. Ill cover the front door. You watch that big hole at the back of the building and I got Chandler covering Ross.\nMonica: (Awkwardly.) Why would I care where Chandler is? You know uhh...You know sometimes I dont even like Chandler.\nJoey: Okay. (They both walk off to watch for Rachel.)\n(Ross and chandler are standing next to the alter. Ross is practicing for the wedding.)\nRoss: (Using a slightly different inflection for each.) I do. I do. I do.\nChandler: Oh yea, your right. Its the second one.\nRoss: (Very Nervous)Really?\n[Scene: Joeys in the front entrance watching for Rachel. The bridesmaid he met at the rehearsal dinner come in.)\nFelicity: (In a sexy voice.)Hello Joey.\nJoey: Hey, Felicity.\nFelicity: Umm, I thought about you all day.\nJoey: Yeah.\nFelicity: Um-hum. Talk New York to me again.\nJoey: (In a New York accent.) Fuggetaboutit. (She giggles.) How you doin?\nFelicity: Mmm. (She pushes him up against the wall and they begin to kiss.)\nJoey: Oh, yeah.\n(Back in the chapel. The parents are still fighting over the bill. Ross is refereeing.)\nMrs. Geller: Theres nothing to discuss. Were not paying for your wine cellar.\nMr. Waltham: (Pleading.) You-you have to meet me in the middle here.\nMr. Geller: (Forcefully.) Hey, you keep pushing me on this, my foots going to meet the middle of your ass.\nRoss: Dad!! (Emily comes running in.)\nEmily: What-whats going on?!\nRoss: Nothing, nothing. Everything's under control.\nMr. Waltham: You want a piece of me, sir? Is that what your saying? (Pointing at Jack and poking him) You want a piece of me?\nRoss: (Stepping in between them.)Okay! Okay! Thats it!! Parents!! Parents!! Back away!! All right, this is our wedding day!  From now on everyone gets along, and if I hear one more word. NO GRANDCHILDREN! (Pointing at his mother.) Thats right!!\nMr. Geller: Okay, okay.\nMr. Waltham: Sorry old boy, sorry. Sorry. Sorry. (Them all walk away. As he leaves he mutters to Jack.) I could kill you with my thumb, you know.\nEmily: What was all that about?\nRoss: (Sighing.) It was...This disagreement over...(She sighs. Ross notices her in her wedding dress.) My god. You...you look beautiful.\nEmily: (Giggles.) Ohh...(She realizes that shes in her gown.) Oh! You were not meant to see me before the wedding. Its bad luck.\nRoss: You know what, I think weve had all the bad luck were going to have. (He hugs her.)\n(The front entrance. Joey and the bridesmaid are up against the wall kissing. Rachel comes in the door and walks by Joey unnoticed. She walks into the chapel and sees Ross and Emily kissing. She looks as though she wants to cry. Emily walks away and Ross turns and sees Rachel standing there.)\nRoss: My God. Rachel! (He walks towards her, grasps her hands and kisses her on the cheek.) Your here. I cant believe it. (She giggles.) What happen? Why are you here?\nRachel: Well I just came...(She touches him near his heart. Shes almost in tears.) I just needed to tell you...(Looking into his eyes. She takes a deep breath.) Congratulations. (He hugs her. She can barely hold back the tears.)\n[Scene: Camera fades to one of the band members playing guitar at the wedding. The chapel is full of guest. A groomsmen escorts a bridesmaid down the isle. Joey is waiting with Mrs. Waltham to escort he down the isle. A cellular phone rings.]\nMrs. Waltham: (Answering the phone.) Hello, Waltham Interiors.\nPhoebe: Mrs. Waltham. Hi. Its Phoebe again.\nMrs. Waltham: (Throws her head back in disgust.) Why?!\nPhoebe: Yea. Can I please, please, please talk to one of the best men? This is going to be the last time I promise.\nMrs. Waltham: (Slapping the phone into Joeys chest.) Joey theres a girl on the phone for you.\nJoey: (Smiling.) Ohh great!! (Putting the phone to his ear.) Hello. (He begins to escort her down the aisle.)\nPhoebe: Did you stop Rachel?\nJoey: No, but its okay. She just came in and gave him a hug, that it.\nPhoebe: So nothing got ruined?\nJoey: No.\nPhoebe: Oh thats so great! Ohh, so whats going on now?\nJoey: Ah, Im-Im walking down the aisle...Still walking. (Mrs. Waltham takes her place.) Im about to pass the bridesmaid I hooked up with last night. (Looking at the bridesmaid.) Hey! (Talking to Phoebe.) I told her \"Hey.\" And now Im at the front with Ross. Its Phoebe. (He shows Ross the phone.) He looks pretty mad. Uh...Id better go.\nPhoebe: No!! wait, wait, wait!! Oh please, hold it up so I can listen. (Joey looks at Ross and holds the phone above Rosss shoulder.)\n(Chandler escorts Monica down the aisle.)\nChandler: What we did last night was....\nMonica: Stupid.\nChandler: Totally crazy stupid. (He nods his head at the people seated.)\nMonica: What were we thinking?\nChandler: Im coming over tonight though, right?\nMonica: Oh yeah. Definitely.\n(They quickly take their places and Here Comes the Bride Begins to play. Everyone seated looks back. Emily is being escorted up the aisle by her father. She kisses him on the cheek and takes her place by Rosss side.)\nMinister: Friends. Family. We are gathered to celebrate here today the joyous union of Ross and Emily. May the happiness we share with them today be with them always. Now Emily, repeat after me. I, Emily...\nEmily: I, Emily...\nMinster: Take thee Ross...\nEmily: Take thee Ross...\nMinster: As my lawfully wedded husband, in sickness and in health, till death parts us.\nEmily: As my lawfully wedded husband, in sickness and in health, until death parts us.\nMinster: Now Ross, repeat after me. I Ross...\nRoss: I Ross...\nMinister: Take thee, Emily...\nRoss: Take thee, Rachel...(All his friends have looks of shock on their faces. He realizes what he said. Quickly he says.) Emily. (A slight chuckle.) Emily.\nMinister: (Looking and feeling awkward. he looks towards Emily.) Uhh...Shall I go on? \n(Rachel looks all around as if all the eyes in the chapel were looking at her as the picture fades to black.)\nClosing Credits\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The church where Ross and Emily are to be married. Judy, Andrea, and Monica enter together.]"}, {"line_number": 2, "type": "narration", "text": "Mrs. Geller: (Looking around at the chapel.) Oh my God! Its like a fairyland."}, {"line_number": 3, "type": "narration", "text": "Mrs. Waltham: I know, its horrible isnt it?"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Well, I love it. I only hope my wedding looks this good."}, {"line_number": 5, "type": "narration", "text": "Mrs. Geller: I just hope..."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "(Angrily.) You can let some of them go by!(Judy and Andrea go to the front of the chapel. Joey approaches Monica.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "(Whispering.) Pisst, Monica. Alright, we really need to start looking out for Rachel. Ill cover the front door. You watch that big hole at the back of the building and I got Chandler covering Ross."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "(Awkwardly.) Why would I care where Chandler is? You know uhh...You know sometimes I dont even like Chandler."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Okay. (They both walk off to watch for Rachel.)"}, {"line_number": 10, "type": "action", "text": "(Ross and chandler are standing next to the alter. Ross is practicing for the wedding.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "(Using a slightly different inflection for each.) I do. I do. I do."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Oh yea, your right. Its the second one."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "(Very Nervous)Really?"}, {"line_number": 14, "type": "narration", "text": "[Scene: Joeys in the front entrance watching for Rachel. The bridesmaid he met at the rehearsal dinner come in.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Felicity", "text": "(In a sexy voice.)Hello Joey."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Hey, Felicity."}, {"line_number": 17, "type": "dialogue", "speaker": "Felicity", "text": "Umm, I thought about you all day."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Yeah."}, {"line_number": 19, "type": "dialogue", "speaker": "Felicity", "text": "Um-hum. Talk New York to me again."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "(In a New York accent.) Fuggetaboutit. (She giggles.) How you doin?"}, {"line_number": 21, "type": "dialogue", "speaker": "Felicity", "text": "Mmm. (She pushes him up against the wall and they begin to kiss.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Oh, yeah."}, {"line_number": 23, "type": "action", "text": "(Back in the chapel. The parents are still fighting over the bill. Ross is refereeing.)"}, {"line_number": 24, "type": "narration", "text": "Mrs. Geller: Theres nothing to discuss. Were not paying for your wine cellar."}, {"line_number": 25, "type": "narration", "text": "Mr. Waltham: (Pleading.) You-you have to meet me in the middle here."}, {"line_number": 26, "type": "narration", "text": "Mr. Geller: (Forcefully.) Hey, you keep pushing me on this, my foots going to meet the middle of your ass."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Dad!! (Emily comes running in.)"}, {"line_number": 28, "type": "dialogue", "speaker": "Emily", "text": "What-whats going on?!"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Nothing, nothing. Everything's under control."}, {"line_number": 30, "type": "narration", "text": "Mr. Waltham: You want a piece of me, sir? Is that what your saying? (Pointing at Jack and poking him) You want a piece of me?"}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "(Stepping in between them.)Okay! Okay! Thats it!! Parents!! Parents!! Back away!! All right, this is our wedding day!  From now on everyone gets along, and if I hear one more word. NO GRANDCHILDREN! (Pointing at his mother.) Thats right!!"}, {"line_number": 32, "type": "narration", "text": "Mr. Geller: Okay, okay."}, {"line_number": 33, "type": "narration", "text": "Mr. Waltham: Sorry old boy, sorry. Sorry. Sorry. (Them all walk away. As he leaves he mutters to Jack.) I could kill you with my thumb, you know."}, {"line_number": 34, "type": "dialogue", "speaker": "Emily", "text": "What was all that about?"}, {"line_number": 35, "type": "dialogue", "speaker": "Ross", "text": "(Sighing.) It was...This disagreement over...(She sighs. Ross notices her in her wedding dress.) My god. You...you look beautiful."}, {"line_number": 36, "type": "dialogue", "speaker": "Emily", "text": "(Giggles.) Ohh...(She realizes that shes in her gown.) Oh! You were not meant to see me before the wedding. Its bad luck."}, {"line_number": 37, "type": "dialogue", "speaker": "Ross", "text": "You know what, I think weve had all the bad luck were going to have. (He hugs her.)"}, {"line_number": 38, "type": "action", "text": "(The front entrance. Joey and the bridesmaid are up against the wall kissing. Rachel comes in the door and walks by Joey unnoticed. She walks into the chapel and sees Ross and Emily kissing. She looks as though she wants to cry. Emily walks away and Ross turns and sees Rachel standing there.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Ross", "text": "My God. Rachel! (He walks towards her, grasps her hands and kisses her on the cheek.) Your here. I cant believe it. (She giggles.) What happen? Why are you here?"}, {"line_number": 40, "type": "dialogue", "speaker": "Rachel", "text": "Well I just came...(She touches him near his heart. Shes almost in tears.) I just needed to tell you...(Looking into his eyes. She takes a deep breath.) Congratulations. (He hugs her. She can barely hold back the tears.)"}, {"line_number": 41, "type": "narration", "text": "[Scene: Camera fades to one of the band members playing guitar at the wedding. The chapel is full of guest. A groomsmen escorts a bridesmaid down the isle. Joey is waiting with Mrs. Waltham to escort he down the isle. A cellular phone rings.]"}, {"line_number": 42, "type": "narration", "text": "Mrs. Waltham: (Answering the phone.) Hello, Waltham Interiors."}, {"line_number": 43, "type": "dialogue", "speaker": "Phoebe", "text": "Mrs. Waltham. Hi. Its Phoebe again."}, {"line_number": 44, "type": "narration", "text": "Mrs. Waltham: (Throws her head back in disgust.) Why?!"}, {"line_number": 45, "type": "dialogue", "speaker": "Phoebe", "text": "Yea. Can I please, please, please talk to one of the best men? This is going to be the last time I promise."}, {"line_number": 46, "type": "narration", "text": "Mrs. Waltham: (Slapping the phone into Joeys chest.) Joey theres a girl on the phone for you."}, {"line_number": 47, "type": "dialogue", "speaker": "Joey", "text": "(Smiling.) Ohh great!! (Putting the phone to his ear.) Hello. (He begins to escort her down the aisle.)"}, {"line_number": 48, "type": "dialogue", "speaker": "Phoebe", "text": "Did you stop Rachel?"}, {"line_number": 49, "type": "dialogue", "speaker": "Joey", "text": "No, but its okay. She just came in and gave him a hug, that it."}, {"line_number": 50, "type": "dialogue", "speaker": "Phoebe", "text": "So nothing got ruined?"}, {"line_number": 51, "type": "dialogue", "speaker": "Joey", "text": "No."}, {"line_number": 52, "type": "dialogue", "speaker": "Phoebe", "text": "Oh thats so great! Ohh, so whats going on now?"}, {"line_number": 53, "type": "dialogue", "speaker": "Joey", "text": "Ah, Im-Im walking down the aisle...Still walking. (Mrs. Waltham takes her place.) Im about to pass the bridesmaid I hooked up with last night. (Looking at the bridesmaid.) Hey! (Talking to Phoebe.) I told her \"Hey.\" And now Im at the front with Ross. Its Phoebe. (He shows Ross the phone.) He looks pretty mad. Uh...Id better go."}, {"line_number": 54, "type": "dialogue", "speaker": "Phoebe", "text": "No!! wait, wait, wait!! Oh please, hold it up so I can listen. (Joey looks at Ross and holds the phone above Rosss shoulder.)"}, {"line_number": 55, "type": "action", "text": "(Chandler escorts Monica down the aisle.)"}, {"line_number": 56, "type": "dialogue", "speaker": "Chandler", "text": "What we did last night was...."}, {"line_number": 57, "type": "dialogue", "speaker": "Monica", "text": "Stupid."}, {"line_number": 58, "type": "dialogue", "speaker": "Chandler", "text": "Totally crazy stupid. (He nods his head at the people seated.)"}, {"line_number": 59, "type": "dialogue", "speaker": "Monica", "text": "What were we thinking?"}, {"line_number": 60, "type": "dialogue", "speaker": "Chandler", "text": "Im coming over tonight though, right?"}, {"line_number": 61, "type": "dialogue", "speaker": "Monica", "text": "Oh yeah. Definitely."}, {"line_number": 62, "type": "action", "text": "(They quickly take their places and Here Comes the Bride Begins to play. Everyone seated looks back. Emily is being escorted up the aisle by her father. She kisses him on the cheek and takes her place by Rosss side.)"}, {"line_number": 63, "type": "dialogue", "speaker": "Minister", "text": "Friends. Family. We are gathered to celebrate here today the joyous union of Ross and Emily. May the happiness we share with them today be with them always. Now Emily, repeat after me. I, Emily..."}, {"line_number": 64, "type": "dialogue", "speaker": "Emily", "text": "I, Emily..."}, {"line_number": 65, "type": "dialogue", "speaker": "Minster", "text": "Take thee Ross..."}, {"line_number": 66, "type": "dialogue", "speaker": "Emily", "text": "Take thee Ross..."}, {"line_number": 67, "type": "dialogue", "speaker": "Minster", "text": "As my lawfully wedded husband, in sickness and in health, till death parts us."}, {"line_number": 68, "type": "dialogue", "speaker": "Emily", "text": "As my lawfully wedded husband, in sickness and in health, until death parts us."}, {"line_number": 69, "type": "dialogue", "speaker": "Minster", "text": "Now Ross, repeat after me. I Ross..."}, {"line_number": 70, "type": "dialogue", "speaker": "Ross", "text": "I Ross..."}, {"line_number": 71, "type": "dialogue", "speaker": "Minister", "text": "Take thee, Emily..."}, {"line_number": 72, "type": "dialogue", "speaker": "Ross", "text": "Take thee, Rachel...(All his friends have looks of shock on their faces. He realizes what he said. Quickly he says.) Emily. (A slight chuckle.) Emily."}, {"line_number": 73, "type": "dialogue", "speaker": "Minister", "text": "(Looking and feeling awkward. he looks towards Emily.) Uhh...Shall I go on? "}, {"line_number": 74, "type": "action", "text": "(Rachel looks all around as if all the eyes in the chapel were looking at her as the picture fades to black.)"}, {"line_number": 75, "type": "narration", "text": "Closing Credits"}, {"line_number": 76, "type": "narration", "text": "End"}]}
