{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 1, "scene_id": "S04E08_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E08/scenes/S04E08_001", "raw_text": "THE ONE WITH CHANDLER IN A BOX\nWritten by: Michael Borkow Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH CHANDLER IN A BOX"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Michael Borkow Transcribed by: Eric Aasen"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 2, "scene_id": "S04E08_002", "location": "Chandler and Joey's", "scene_description": "Joey is sitting at the counter reading a magazine as the phone rings.", "characters": ["Chandler", "Joey", "Voice"], "firestore_path": "/episodes/S04E08/scenes/S04E08_002", "raw_text": "[Scene: Chandler and Joey's, Joey is sitting at the counter reading a magazine as the phone rings.]\nJoey: (answering phone) Hello.\nChandler: (on phone) Hey, its me. I know you cant stand to be in the same room as me, so I just thought Id try and apologize over the phone. All I (Joey hangs up the phone in disgust.)\n(Pause)\n(The phone rings again.)\nJoey: (answering phone) Hello.\nChandler: Look I never should have kissed your girlfriend, but Im (Joey hangs up the phone again.)\n(Pause)\n(The phone rings yet again.)\nJoey: (answering phone) Stop callin!!\nVoice: (on phone) Hey! Hey! Hey! This is 92.3, WXRK, K-Rock for our $1,000 daily challenge.\nJoey: All right!\nVoice: What is the name of your roommate who is very, very sorry and would do anything (Joey realizes its Chandler and hangs up the phone in anger.)\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is sitting at the counter reading a magazine as the phone rings.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(answering phone) Hello."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "(on phone) Hey, its me. I know you cant stand to be in the same room as me, so I just thought Id try and apologize over the phone. All I (Joey hangs up the phone in disgust.)"}, {"line_number": 4, "type": "action", "text": "(Pause)"}, {"line_number": 5, "type": "action", "text": "(The phone rings again.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(answering phone) Hello."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Look I never should have kissed your girlfriend, but Im (Joey hangs up the phone again.)"}, {"line_number": 8, "type": "action", "text": "(Pause)"}, {"line_number": 9, "type": "action", "text": "(The phone rings yet again.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "(answering phone) Stop callin!!"}, {"line_number": 11, "type": "dialogue", "speaker": "Voice", "text": "(on phone) Hey! Hey! Hey! This is 92.3, WXRK, K-Rock for our $1,000 daily challenge."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "All right!"}, {"line_number": 13, "type": "dialogue", "speaker": "Voice", "text": "What is the name of your roommate who is very, very sorry and would do anything (Joey realizes its Chandler and hangs up the phone in anger.)"}, {"line_number": 14, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 3, "scene_id": "S04E08_003", "location": "Monica and Rachel's", "scene_description": "everyone but Joey and Chandler are there getting ready for Thanksgiving.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E08/scenes/S04E08_003", "raw_text": "[Scene: Monica and Rachel's, everyone but Joey and Chandler are there getting ready for Thanksgiving.]\nChandler: (entering) Aww, turkey! Aww, giving thanks! Aww!\nPhoebe: Look everyone, its the spirit of Thanksgiving!\nRachel: So are things with you and Joey any better?\nChandler: They couldnt be worse. I spent eight hours calling him last night, just trying to get him to talk to me.\nRachel: Oh wow, eight hours? So you could probably really use one of those plug-in telephone headsets huh?\nRoss: Should we all expect Christmas gifts that can be stolen from your office?\nRachel: You shouldnt.\nPhoebe: Speaking of Christmas, umm since Monica and I are starting a new business and have like no money, umm, this year maybe we could do secret Santa, and then we each only buy one gift. And-and theres the added mystery of who gets who.\nRoss: Who gets whom. (They all look at him.) I dont know why I do that.\n[Cut to later, the gang, minus Joey, is watching the Thanksgiving Day parade.]\nRachel: Well, Im gonna take a nap, turkey makes me sleepy.\nMonica: We havent eaten yet!\nRachel: I know, but all that work youre doing to get it ready, I just (goes into her bedroom.)\nChandler: Hey, by any chance did either of pick uh Rachel for your secret Santa, cause I wanna trade for her.\nPhoebe: I picked her! Oh thank God you want her! Ooh!\nChandler: Wow! Why do you want to get rid of her so badly?\nPhoebe: Because she exchanges every gift she ever gets, its like impossible to get her something she likes. Come on, lets trade!\nChandler: Oh thats not true! Thats not true! I got her that backpack and she loved it! I remember how much she was crying the day when that big dog ran off with it (notices the look on Monica and Phoebes faces.) Oh, there was no big dog. All right this sucks! I already got her this briefcase, and I had R.G. put on it (Phoebe looks confused.) Her initials\nPhoebe: Ohh.\nMonica: Well, maybe you could give to somebody else. Ooh, like Ross Geller.\nChandler: Op, y'know what though, its kindve a girlie briefcase.\nMonica: Who cares? He works in a museum!\nChandler: Hey, what time is it? The big game is about to start!\nPhoebe: You dont have to do that, Ross and Joey arent here, you can watch the parade if you want.\nChandler: Thanks.\nMonica: What is wrong with this freezer?! (She jabs her arm into the freezer and a piece of ice flies into her eye.) Ow! Ow!!\nPhoebe: God, what happened?!\nMonica: Oh my God, ice just got in my eye!\nRachel: (standing in her doorway) People are trying to sleep in here!\nChandler: Monica got ice in her eye, and it hurts.\nPhoebe: Open it up, let me see.\nMonica: Oh, yknow what, I cant, it really kills.\nChandler: Well maybe you should put some ice on it.\nPhoebe: Ooh, God it looks bad.\nRachel: Honey, maybe we should take you to a doctor.\nMonica: No, my eye doctor is Richard! I cant go to him when I dont have a boyfriend!\nChandler: Hes really picky about his patients.\nPhoebe: Honey, youve got to go. Whats his office number?\nMonica: Like I remember his office number! (Pause) Speed dial 7.\nPhoebe: (on phone) Hi! Yeah, Im calling on behalf of Monica Gellers eye, and is um, is Richard Burke in today. (Listens) (to Monica) Hes out of town, but does she want to see the on-call doctor?\nMonica: Yes!!\nPhoebe: Yes! Shes very excited about that.\n[Cut to later, Phoebe is adding butter to something and Ross is watching.]\nPhoebe: This is so cool, til Monica gets back, its like Im head chef and I get to make all the decisions. (She looks at the remaining butter, and then decides to add it to the dish.)\nRoss: Hey-hey, I thought she told you to follow the recipe exactly!\nPhoebe: Okay, get out of my kitchen!\nChandler: (entering) All right! Okay! I think I am making some progress with Joey, when I went into the apartment he went straight into his bedroom but he only slammed the door once! (Ross is pleased.) I mean yeah, he gave me the finger while doing it.\nPhoebe: All right I I gotta call my mom and ask her a left handed cooking question.\nRoss: So listen ah, I picked Monica for secret Santa, but Im already getting her something for Chanukah, I was wondering if you wanna switch.\nChandler: Oh yknow what, I was already trying to trade for ah, well, you.\nRoss: Really?! Wow! Thats-thats so nice, what are you gonna get me?\nChandler: I dont know R.G., I was thinking something girlie for your office.\nRoss: Yeah, well maybe Phoebe will switch with me.\nChandler: Oh no-no-no, you dont want to do that, then youre gonna get stuck with Rachel and she exchanges every gift she ever gets.\nRoss: Oh, thats not true! Ive got her lots of stuff she never took back.\nChandler: Like?\nRoss: Like uh, that gold necklace I got her last year.\nChandler: When was the last time you saw her wear it?\nRoss: Well, she wore it all Christmas day, and then uh\nChandler: Big dog?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, everyone but Joey and Chandler are there getting ready for Thanksgiving.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(entering) Aww, turkey! Aww, giving thanks! Aww!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Look everyone, its the spirit of Thanksgiving!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "So are things with you and Joey any better?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "They couldnt be worse. I spent eight hours calling him last night, just trying to get him to talk to me."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Oh wow, eight hours? So you could probably really use one of those plug-in telephone headsets huh?"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Should we all expect Christmas gifts that can be stolen from your office?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "You shouldnt."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Speaking of Christmas, umm since Monica and I are starting a new business and have like no money, umm, this year maybe we could do secret Santa, and then we each only buy one gift. And-and theres the added mystery of who gets who."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Who gets whom. (They all look at him.) I dont know why I do that."}, {"line_number": 11, "type": "narration", "text": "[Cut to later, the gang, minus Joey, is watching the Thanksgiving Day parade.]"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Well, Im gonna take a nap, turkey makes me sleepy."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "We havent eaten yet!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "I know, but all that work youre doing to get it ready, I just (goes into her bedroom.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Hey, by any chance did either of pick uh Rachel for your secret Santa, cause I wanna trade for her."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "I picked her! Oh thank God you want her! Ooh!"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Wow! Why do you want to get rid of her so badly?"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Because she exchanges every gift she ever gets, its like impossible to get her something she likes. Come on, lets trade!"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Oh thats not true! Thats not true! I got her that backpack and she loved it! I remember how much she was crying the day when that big dog ran off with it (notices the look on Monica and Phoebes faces.) Oh, there was no big dog. All right this sucks! I already got her this briefcase, and I had R.G. put on it (Phoebe looks confused.) Her initials"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Well, maybe you could give to somebody else. Ooh, like Ross Geller."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "Op, y'know what though, its kindve a girlie briefcase."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Who cares? He works in a museum!"}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "Hey, what time is it? The big game is about to start!"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "You dont have to do that, Ross and Joey arent here, you can watch the parade if you want."}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Thanks."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "What is wrong with this freezer?! (She jabs her arm into the freezer and a piece of ice flies into her eye.) Ow! Ow!!"}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "God, what happened?!"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Oh my God, ice just got in my eye!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "(standing in her doorway) People are trying to sleep in here!"}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "Monica got ice in her eye, and it hurts."}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "Open it up, let me see."}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Oh, yknow what, I cant, it really kills."}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "Well maybe you should put some ice on it."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh, God it looks bad."}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "Honey, maybe we should take you to a doctor."}, {"line_number": 37, "type": "dialogue", "speaker": "Monica", "text": "No, my eye doctor is Richard! I cant go to him when I dont have a boyfriend!"}, {"line_number": 38, "type": "dialogue", "speaker": "Chandler", "text": "Hes really picky about his patients."}, {"line_number": 39, "type": "dialogue", "speaker": "Phoebe", "text": "Honey, youve got to go. Whats his office number?"}, {"line_number": 40, "type": "dialogue", "speaker": "Monica", "text": "Like I remember his office number! (Pause) Speed dial 7."}, {"line_number": 41, "type": "dialogue", "speaker": "Phoebe", "text": "(on phone) Hi! Yeah, Im calling on behalf of Monica Gellers eye, and is um, is Richard Burke in today. (Listens) (to Monica) Hes out of town, but does she want to see the on-call doctor?"}, {"line_number": 42, "type": "dialogue", "speaker": "Monica", "text": "Yes!!"}, {"line_number": 43, "type": "dialogue", "speaker": "Phoebe", "text": "Yes! Shes very excited about that."}, {"line_number": 44, "type": "narration", "text": "[Cut to later, Phoebe is adding butter to something and Ross is watching.]"}, {"line_number": 45, "type": "dialogue", "speaker": "Phoebe", "text": "This is so cool, til Monica gets back, its like Im head chef and I get to make all the decisions. (She looks at the remaining butter, and then decides to add it to the dish.)"}, {"line_number": 46, "type": "dialogue", "speaker": "Ross", "text": "Hey-hey, I thought she told you to follow the recipe exactly!"}, {"line_number": 47, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, get out of my kitchen!"}, {"line_number": 48, "type": "dialogue", "speaker": "Chandler", "text": "(entering) All right! Okay! I think I am making some progress with Joey, when I went into the apartment he went straight into his bedroom but he only slammed the door once! (Ross is pleased.) I mean yeah, he gave me the finger while doing it."}, {"line_number": 49, "type": "dialogue", "speaker": "Phoebe", "text": "All right I I gotta call my mom and ask her a left handed cooking question."}, {"line_number": 50, "type": "dialogue", "speaker": "Ross", "text": "So listen ah, I picked Monica for secret Santa, but Im already getting her something for Chanukah, I was wondering if you wanna switch."}, {"line_number": 51, "type": "dialogue", "speaker": "Chandler", "text": "Oh yknow what, I was already trying to trade for ah, well, you."}, {"line_number": 52, "type": "dialogue", "speaker": "Ross", "text": "Really?! Wow! Thats-thats so nice, what are you gonna get me?"}, {"line_number": 53, "type": "dialogue", "speaker": "Chandler", "text": "I dont know R.G., I was thinking something girlie for your office."}, {"line_number": 54, "type": "dialogue", "speaker": "Ross", "text": "Yeah, well maybe Phoebe will switch with me."}, {"line_number": 55, "type": "dialogue", "speaker": "Chandler", "text": "Oh no-no-no, you dont want to do that, then youre gonna get stuck with Rachel and she exchanges every gift she ever gets."}, {"line_number": 56, "type": "dialogue", "speaker": "Ross", "text": "Oh, thats not true! Ive got her lots of stuff she never took back."}, {"line_number": 57, "type": "dialogue", "speaker": "Chandler", "text": "Like?"}, {"line_number": 58, "type": "dialogue", "speaker": "Ross", "text": "Like uh, that gold necklace I got her last year."}, {"line_number": 59, "type": "dialogue", "speaker": "Chandler", "text": "When was the last time you saw her wear it?"}, {"line_number": 60, "type": "dialogue", "speaker": "Ross", "text": "Well, she wore it all Christmas day, and then uh"}, {"line_number": 61, "type": "dialogue", "speaker": "Chandler", "text": "Big dog?"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 4, "scene_id": "S04E08_004", "location": "Chandler and Joey's", "scene_description": "Joey is repacking the furniture into boxes to return it.", "characters": ["Joey", "Ross"], "firestore_path": "/episodes/S04E08/scenes/S04E08_004", "raw_text": "[Scene: Chandler and Joey's, Joey is repacking the furniture into boxes to return it.]\nRoss: (entering) Hey!\nJoey: Hey!\nRoss: What are you doing?\nJoey: Im sending back all this stuff that Chandler bought out of guilt.\nRoss: Everything? Even the TV?\nJoey: No! Im putting that in my room.\nRoss: Listen, Joey, I know what he did was wrong but dont you think you could at least hear the guy out?\nJoey: Back when you and Rachel were together, if Chandler had kissed her, would you hear him out?\nRoss: Thats a good point. So uh, how long are you gonna punish him?\nJoey: Five years. \nRoss: Youve sentenced him?!\nJoey: Hey! Dont do the crime if you cant do the time.\nRoss: Joey, the guys your best friend.\nJoey: No, was my best friend. Anyway, I dont know why youre pushing for him so hard. With him out of the way as my best friend, theres a spot open.\nRoss: Oh, who? Me?\nJoey: Yeah!\nRoss: Wow! Im honored! And yknow what Im gonna do as my first act as your best friend?\nJoey: What?\nRoss: Im gonna get you to talk to Chandler.\nJoey: All right. But if you werent my best friend.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is repacking the furniture into boxes to return it.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "What are you doing?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Im sending back all this stuff that Chandler bought out of guilt."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Everything? Even the TV?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "No! Im putting that in my room."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Listen, Joey, I know what he did was wrong but dont you think you could at least hear the guy out?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Back when you and Rachel were together, if Chandler had kissed her, would you hear him out?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Thats a good point. So uh, how long are you gonna punish him?"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Five years. "}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Youve sentenced him?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Hey! Dont do the crime if you cant do the time."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Joey, the guys your best friend."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "No, was my best friend. Anyway, I dont know why youre pushing for him so hard. With him out of the way as my best friend, theres a spot open."}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Oh, who? Me?"}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Yeah!"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Wow! Im honored! And yknow what Im gonna do as my first act as your best friend?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "What?"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Im gonna get you to talk to Chandler."}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "All right. But if you werent my best friend."}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 5, "scene_id": "S04E08_005", "location": "Central Perk", "scene_description": "Chandler and Kathy are sitting at a table and talking about Joey.", "characters": ["Chandler", "Gunther", "Joey", "Kathy"], "firestore_path": "/episodes/S04E08/scenes/S04E08_005", "raw_text": "[Scene: Central Perk, Chandler and Kathy are sitting at a table and talking about Joey.]\nKathy: Oh my God, is it really that bad?\nChandler: I walk into a room and he wont even talk to me, he just mumbles something in Italian. And I know he only knows the bad words.\nJoey: (entering) Hey Gunther, have you uh, have you seen Chandler?\nGunther: I thought you were Chandler. But umm, one of who is over there.\n(Joey turns around and sees them kissing.)\nKathy: Oh.\nChandler: Hey Joe.\nJoey: (Something in Italian.) (Storms out.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler and Kathy are sitting at a table and talking about Joey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Kathy", "text": "Oh my God, is it really that bad?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "I walk into a room and he wont even talk to me, he just mumbles something in Italian. And I know he only knows the bad words."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey Gunther, have you uh, have you seen Chandler?"}, {"line_number": 5, "type": "dialogue", "speaker": "Gunther", "text": "I thought you were Chandler. But umm, one of who is over there."}, {"line_number": 6, "type": "action", "text": "(Joey turns around and sees them kissing.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Kathy", "text": "Oh."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Hey Joe."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "(Something in Italian.) (Storms out.)"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 6, "scene_id": "S04E08_006", "location": "Dr. Burkes office", "scene_description": "Rachel and Monica are waiting as the doctor arrives.", "characters": ["Doctor", "Monica", "Nurse", "Rachel"], "firestore_path": "/episodes/S04E08/scenes/S04E08_006", "raw_text": "[Scene: Dr. Burkes office, Rachel and Monica are waiting as the doctor arrives.]\nDoctor: Ill be right with you. Okay? (to the nurse) Thanks, Wendy.\nMonica: Oh my God! How cute is the on-call doctor?\nRachel: Ooh, so cute, that Im thinking about jamming this pen in my eye.\n(The intercom buzzes.)\nNurse: Dr. Burke will see you know.\nMonica: Oh no-no-no, not Dr. Burke. Dr. Burke is out of town. The-the on-call doctor will see me now.\nNurse: Dr. Richard Burke is out of town. Dr. Timothy Burke, his son, will see you now.\nDr. Timothy Burke: Ready?\n(Monica looks at Rachel, who gives her the thumbs up.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Dr. Burkes office, Rachel and Monica are waiting as the doctor arrives.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Doctor", "text": "Ill be right with you. Okay? (to the nurse) Thanks, Wendy."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! How cute is the on-call doctor?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Ooh, so cute, that Im thinking about jamming this pen in my eye."}, {"line_number": 5, "type": "action", "text": "(The intercom buzzes.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Nurse", "text": "Dr. Burke will see you know."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Oh no-no-no, not Dr. Burke. Dr. Burke is out of town. The-the on-call doctor will see me now."}, {"line_number": 8, "type": "dialogue", "speaker": "Nurse", "text": "Dr. Richard Burke is out of town. Dr. Timothy Burke, his son, will see you now."}, {"line_number": 9, "type": "narration", "text": "Dr. Timothy Burke: Ready?"}, {"line_number": 10, "type": "action", "text": "(Monica looks at Rachel, who gives her the thumbs up.)"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 7, "scene_id": "S04E08_007", "location": "Chandler and Joey's", "scene_description": "Joey is packing as Chandler rushes in.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E08/scenes/S04E08_007", "raw_text": "[Scene: Chandler and Joey's, Joey is packing as Chandler rushes in.]\nChandler: Hey! Im sorry! That(sees that Joey is about to leave) where are you going?\nJoey: My folks.\nChandler: Oh, uh, when-when are you coming back?\nJoey: I dont know. I might stay there for a few days while I look for an apartment.\nChandler: What?!\nJoey: Yeah, yknow at first I thought we could talk about this yknow, work it out, but uh, seeing you two together I dont think I\nChandler: Hey, look, what do you want me to say? Do you want me to say that Ill stop seeing her?\nJoey: Look, its not about her. Okay? But seeing you two together just reminds me of what you did. And I dont want to live with some one who doesnt know what it is to be a friend. So, Ill see ya. (He starts to leave, but Chandler grabs his bag and stops him.)\nChandler: Hey, look, I know what it is to be a friend, I just-I just screwed up!\nJoey: Yeah! You did! And thats why Im leaving.\n(The chick and the duck walk into the living room.)\nChandler: All right look, if youre not gonna stay for me, then at least stay for them! Okay, they have had a very difficult year! What with the robbery and all!\nJoey: When that guy was robbing us, and I was locked in the entertainment unit for like six hours, you know what I was doing in there all that time? I was thinking about how I let you down! \nChandler: What?\nJoey: Yeah! But if wouldve know what kind of friend you were gonna turn out to be, I wouldnt have worried about it so much! See you around!\nChandler: All right, wait! Come on! Just wait one second! There has to be something that I can do! Something! If we still had that entertainment unit I would get in it for six hours and think about how I let you down. (Joey looks intrigued) What?\nJoey: Weve got a box. (Motions to a large wooden box next to him.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is packing as Chandler rushes in.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Im sorry! That(sees that Joey is about to leave) where are you going?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "My folks."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Oh, uh, when-when are you coming back?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "I dont know. I might stay there for a few days while I look for an apartment."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "What?!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Yeah, yknow at first I thought we could talk about this yknow, work it out, but uh, seeing you two together I dont think I"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Hey, look, what do you want me to say? Do you want me to say that Ill stop seeing her?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Look, its not about her. Okay? But seeing you two together just reminds me of what you did. And I dont want to live with some one who doesnt know what it is to be a friend. So, Ill see ya. (He starts to leave, but Chandler grabs his bag and stops him.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Hey, look, I know what it is to be a friend, I just-I just screwed up!"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Yeah! You did! And thats why Im leaving."}, {"line_number": 12, "type": "action", "text": "(The chick and the duck walk into the living room.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "All right look, if youre not gonna stay for me, then at least stay for them! Okay, they have had a very difficult year! What with the robbery and all!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "When that guy was robbing us, and I was locked in the entertainment unit for like six hours, you know what I was doing in there all that time? I was thinking about how I let you down! "}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Yeah! But if wouldve know what kind of friend you were gonna turn out to be, I wouldnt have worried about it so much! See you around!"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "All right, wait! Come on! Just wait one second! There has to be something that I can do! Something! If we still had that entertainment unit I would get in it for six hours and think about how I let you down. (Joey looks intrigued) What?"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Weve got a box. (Motions to a large wooden box next to him.)"}, {"line_number": 19, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 8, "scene_id": "S04E08_008", "location": "Dr. Burkes office", "scene_description": "Tim is examining Monica.", "characters": ["Monica", "Tim"], "firestore_path": "/episodes/S04E08/scenes/S04E08_008", "raw_text": "[Scene: Dr. Burkes office, Tim is examining Monica.]\nTim: Last time I saw you, it was the morning I left for college. And you were just standing outside The Dairy Queen.\nMonica: I was probably waiting for it to open.\nTim: I gotta tell you, you look great now.\nMonica: You look great too.\nTim: Youre an excellent patient!\nMonica: So how does it look?\nTim: Well, youve got a little scratch on your cornea, your gonna have to wear a patch for a couple of days.\nMonica: Like a pirate?!\nTim: If that helps you. \nMonica: Umm, so how long have you been working with your dad? (He looks at her) Come on, one of us had to mention him.\nTim: I moved back here a couple of months ago.\nMonica: Oh. Big family dinner tonight?\nTim: Uh. (He holds up a brown lunch bag.)\nMonica: No way!\nTim: I was gonna have Thanksgiving at my girlfriends.\nMonica: (disappointed) Oh.\nTim: But we broke up.\nMonica: (happy) Oh. \nTim: She-she wasnt ready for a serious commitment.\nMonica: (sympathetic) Oh. (in a pirates voice) So you made her walk the plank? Aye, matie?\nTim: Youre not wearing the patch yet.\nMonica: I know.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Dr. Burkes office, Tim is examining Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Tim", "text": "Last time I saw you, it was the morning I left for college. And you were just standing outside The Dairy Queen."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "I was probably waiting for it to open."}, {"line_number": 4, "type": "dialogue", "speaker": "Tim", "text": "I gotta tell you, you look great now."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "You look great too."}, {"line_number": 6, "type": "dialogue", "speaker": "Tim", "text": "Youre an excellent patient!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "So how does it look?"}, {"line_number": 8, "type": "dialogue", "speaker": "Tim", "text": "Well, youve got a little scratch on your cornea, your gonna have to wear a patch for a couple of days."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Like a pirate?!"}, {"line_number": 10, "type": "dialogue", "speaker": "Tim", "text": "If that helps you. "}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Umm, so how long have you been working with your dad? (He looks at her) Come on, one of us had to mention him."}, {"line_number": 12, "type": "dialogue", "speaker": "Tim", "text": "I moved back here a couple of months ago."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Oh. Big family dinner tonight?"}, {"line_number": 14, "type": "dialogue", "speaker": "Tim", "text": "Uh. (He holds up a brown lunch bag.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "No way!"}, {"line_number": 16, "type": "dialogue", "speaker": "Tim", "text": "I was gonna have Thanksgiving at my girlfriends."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "(disappointed) Oh."}, {"line_number": 18, "type": "dialogue", "speaker": "Tim", "text": "But we broke up."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "(happy) Oh. "}, {"line_number": 20, "type": "dialogue", "speaker": "Tim", "text": "She-she wasnt ready for a serious commitment."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "(sympathetic) Oh. (in a pirates voice) So you made her walk the plank? Aye, matie?"}, {"line_number": 22, "type": "dialogue", "speaker": "Tim", "text": "Youre not wearing the patch yet."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "I know."}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 9, "scene_id": "S04E08_009", "location": "Monica and Rachel's", "scene_description": "Its closer to dinner. Monica has just told everyone that Tim is coming to dinner.", "characters": ["Chandler", "Joey", "Kathy", "Monica", "Phoebe", "Rachel", "Ross", "Tim"], "firestore_path": "/episodes/S04E08/scenes/S04E08_009", "raw_text": "[Scene: Monica and Rachel's, Its closer to dinner. Monica has just told everyone that Tim is coming to dinner.]\nRoss: Hes coming here for Thanksgiving!\nRachel: I know, its sick.\nMonica: Why is it sick?\nRachel: Because its Richards son! Its like inviting Greek tragedy over for dinner!\nMonica: Hey, come on, Phoebe, you understand dont you?\nPhoebe: Yeah, I can see where Id be your best shot but, no. Im sorry, but I think its twisted.\nRoss: Yeah.\nJoey: (coming out of the bathroom) Whats twisted?\nMonica: Me going out with Richards son.\nJoey: Ewwwww!! Ew! Ew! Ew!\nChandler: (He is now in the box, in their living room.) Sounds like a really bad idea to me.\nRachel: Is he okay in there?\nJoey: Hes fine!\nRoss: Hey, y'know, Mon, if things wrong out between you and Richards son, youd be able to tell your kids, that you slept with their grandfather.\nMonica: Fine! Judge all you want to but, (points to Ross) married a lesbian, (points to Rachel) left a man at the altar, (points to Phoebe) fell in love with a gay ice dancer, (points to Joey) threw a girls wooden leg in a fire, (points to Chandler) livin in a box!! (goes to her room)\nRachel: So now, what exactly is the point of the box?\nJoey: Chandler?\nChandler: The meaning of the box is three fold. One (holds a finger up through the air hole), it gives me the time to think about what I did. Two (holds up another finger), it proves how much I care about my friendship with Joey. And three (holds up a third finger), it hurts!\nRoss: (to Rachel) Oh hey! Hey uh, you remember the necklace I gave you last year? Can I see it?\nRachel: (worried) Why?\nRoss: I just wanna check something.\nRachel: Okay. (She goes into her bedroom)\nRoss: (He puts his hand over the hole on the box.) (to Chandler) Now, well see.\nChandler: Air hole! Air hole!! (Ross retracts his hand quickly.)\nRachel: (coming out of her bedroom with a necklace) Here it is! I love it. I wear it all the time.\nRoss: (grabbing the necklace) The necklace I got you was gold, this one is silver.\nRachel: Huh, well maybe it uh, it changed. \nRoss: Oh my God! You actually exchanged it!\nRachel: Well isnt it better that I exchanged it for something that I enjoy and that I can get a lot of use out of?\nRoss: What did you get?\nRachel: Credit. \n(Theres a knock on the door.)\nMonica: (running in from her bedroom) Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! (opens the door) Hi, Tim.\nTim: Hi. (gives her a bottle of wine)\nMonica: Thank you. Come meet my friends. This is uh, Phoebe. \nTim: Hi, nice to meet you.\nMonica: And Joey.\nJoey: Hey!\nTim: Hi, Joey.\nMonica: My brother, Ross.\nRoss: Hey.\nMonica: And Rachel. (Chandler clears his voice loudly) And thats Chandler.\nChandler: How do ya do.\nTim: Whats\nMonica: Umm, well, hes\nJoey: Hes doin some thinkin!\n[cut to later, Joey, Rachel, Ross, and Tim are watching the football game, and they all cheer loudly.]\nChandler: What happened? What happened?!\nJoey: You kissed my girlfriend!\n(A commercial for sunglasses comes on.)\nRachel: Ooh, I like those sunglasses.\nRoss: Like em, like em? Or, Id like to get store credit for that amount like em?\nRachel: (Swears in Italian, its the same term used by Joey earlier and Joey nods his approval.)\nMonica: All right everybody, this turkey is ready!\nTim: Where can I wash up?\nMonica: Here, let me show you. Okay, the towels are hanging next to the sink, and umm, you can use the fancy soap.\nTim: Thank you.\nRachel: Fancy soap? I thought we were savin that for the Pope!\nMonica: See hes nice. Right?\nPhoebe: Yeah, but Monica, do you actually want to be in a relationship where you can actually use the phrase, \"Thats not how your dad used to do it.\"\nTim: Wow! Everything looks great! Where should I sit?\nMonica: I saved you a seat. (Motions to the one next to her.)\nRachel: (pouring the wine) Sick-sick-sick-sick.\n(Theres a loud knocking.)\nPhoebe: Oh, Ill get it. (goes over to the door.)\nChandler: Gotcha! (laughs)\nJoey: That doesnt sound like thinking to me!\nChandler: Sorry!\nJoey: Yknow I dont think you should be talking at all in there! I think youve got to much thinking to do to be talking and making jokes!\nChandler: Okay, okay, you got it!\nRachel: Ross, can you pass me the yams?\nRoss: Sure! Oh, and Joeys got the mashed potatoes if you want to exchange them.\nRachel: Would you stop?! What is the matter with you?!\nMonica: Oh-ho-ho, weve got company.\nRoss: Theres nothing the matter with me. See, Im not completely devoid of sentiment, see I have feelings.\nRachel: Okay, fine. (She gets up and walks into her bedroom)\n(an awkward silence follows)\nChandler: You cant tell, but Im trying to break the tension by mooning you guys!\nJoey: All right, look! If this is just a big joke to you, then forget about it, all right?! This means something to me! And if it doesnt mean anything to you, then you should get out of there, otherwise youre just an idiot in a box!\nChandler: Youre right, and Im sorry! This means a lot to me! I want you to be my friend again! I swear, I wont say another word tonight.\nJoey: So are you gonna start taking this thing seriously?\nChandler: Absolutely!\nJoey: That sounds like another word to me! Are you gonna take this seriously? (Theres no response from Chandler.) Okay.\n(Rachel comes back carrying a shoe box.)\nRachel: Dont say that I have no sentiment! (Starts to show Ross whats in the box.) This is a movie stub from our first date! This is an eggshell from the first time you made me breakfast in bed! (Holds up a bone) This is from the museum from the first time we were together. Okay, maybe I exchange gifts sometimes, but I keep the things that matter! \nRoss: I dont know what to say, Im sorry. Though, youre not supposed to take these. (Points to the bone) Its like a million years old, we, we actually, we had people looking for that.\n(Rachel glares at him.)\n[Cut to the balcony with Monica and Tim.]\nMonica: (putting off her coat) Ooh, this always happens. (Her coat gets stuck.)\nTim: Here, let me help. (Does so.)\nMonica: Thank you.\nTim: You-you have a very beautiful eye.\nMonica: Yknow all my friends think this is weird. \nTim: Yknow I-I thought it was gonna be weird, I mean I almost called and canceled, but it really isnt.\nMonica: I know! I mean its like me and your dad, thats a totally separate thing.\nTim: Oh, I totally agree.\nMonica: Were just two people who find each other very attractive. Right?\n(Tim leans in to kiss her. They stop, and when he tries to kiss her again, Monica pulls away.)\nTim: What?\nMonica: Nothing. Nothing.\nTim: No-no really, was-was that not okay?\nMonica: No-no-no that was good, it was, that was uh, that was a goood kiss\nTim: Oh my God! It didnt remind you of\nMonica: (interrupting) Dont say it!\nTim: No, but it did! Didnt it?!\nMonica: Yeah!\nTim: Oh man!!\nMonica: I know!\n(They both shiver in horror.)\n[cut to later, Tim has left. Monica is still shivering. Theres a knock on the door.]\nJoey: Ill get it. (Its Kathy.)\nKathy: (sees its Joey) Oh.\nJoey: Hey.\nKathy: Hey. Listen, I want you to know how sorry I am\nJoey: Thats okay. Chandlers the one Im mad at.\nKathy: Well, Im still sorry. Is he here?\nJoey: In the box.\nKathy: (going over to the box) Chandler?\nPhoebe: Oh, he-he cant talk right now.\nKathy: Why not? Whats going on?\nPhoebe: Hes just trying to show Joey how much he means to him.\nKathy: By being in a box?\nRachel: Joey, had reasons. \nPhoebe: They were threefold.\nKathy: Oh. Well uh, (to Chandler) you not being able to talk may make this easier. Listen umm (She looks at the gang who are watching, they take the hint and leave them alone.) Listen I dont wanna be someone who comes between two best friends. I just, I cant stand seeing what this is doing to you guys, and I dont wanna be the cause of that. So, I dont think we can see each other anymore. Im gonna go to my moms in Chicago, Im gonna stay there for awhile. I think this couldve be something really amazing, but yknow this is probably for the best. Yknow? Im gonna miss you. Good-bye, Chandler. \n(She gets up and leaves, Chandler waves good-bye with one finger extended through the air hole. Ross glares at Joey.)\nJoey: (starting to cry) Open the box!! (Runs over to do so.)\nRachel: What?!\nJoey: He can still catch her! Come on, get out of there! (He opens the box) Get out of there!\nChandler: So?\nJoey: Yeah, were gonna be fine! Get out!\nChandler: Yeah?\nJoey: Yeah, you did some real good thinkin in there.\nChandler: Man, this is \n(Joey says something unintelligible and they hug.)\nJoey: Now go! Cause you can still catch her! And Merry Christmas from youre secret Santa! (Chandler runs out and closes the door.) \n(After hes gone.) \nJoey: All right, who got Chandler? Cause I uh, need to trade.\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Its closer to dinner. Monica has just told everyone that Tim is coming to dinner.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hes coming here for Thanksgiving!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "I know, its sick."}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Why is it sick?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Because its Richards son! Its like inviting Greek tragedy over for dinner!"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Hey, come on, Phoebe, you understand dont you?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, I can see where Id be your best shot but, no. Im sorry, but I think its twisted."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "(coming out of the bathroom) Whats twisted?"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Me going out with Richards son."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Ewwwww!! Ew! Ew! Ew!"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "(He is now in the box, in their living room.) Sounds like a really bad idea to me."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Is he okay in there?"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Hes fine!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Hey, y'know, Mon, if things wrong out between you and Richards son, youd be able to tell your kids, that you slept with their grandfather."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Fine! Judge all you want to but, (points to Ross) married a lesbian, (points to Rachel) left a man at the altar, (points to Phoebe) fell in love with a gay ice dancer, (points to Joey) threw a girls wooden leg in a fire, (points to Chandler) livin in a box!! (goes to her room)"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "So now, what exactly is the point of the box?"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Chandler?"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "The meaning of the box is three fold. One (holds a finger up through the air hole), it gives me the time to think about what I did. Two (holds up another finger), it proves how much I care about my friendship with Joey. And three (holds up a third finger), it hurts!"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "(to Rachel) Oh hey! Hey uh, you remember the necklace I gave you last year? Can I see it?"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "(worried) Why?"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "I just wanna check something."}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Okay. (She goes into her bedroom)"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "(He puts his hand over the hole on the box.) (to Chandler) Now, well see."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Air hole! Air hole!! (Ross retracts his hand quickly.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "(coming out of her bedroom with a necklace) Here it is! I love it. I wear it all the time."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "(grabbing the necklace) The necklace I got you was gold, this one is silver."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Huh, well maybe it uh, it changed. "}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Oh my God! You actually exchanged it!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Well isnt it better that I exchanged it for something that I enjoy and that I can get a lot of use out of?"}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "What did you get?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Credit. "}, {"line_number": 33, "type": "action", "text": "(Theres a knock on the door.)"}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "(running in from her bedroom) Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! Ill get it! (opens the door) Hi, Tim."}, {"line_number": 35, "type": "dialogue", "speaker": "Tim", "text": "Hi. (gives her a bottle of wine)"}, {"line_number": 36, "type": "dialogue", "speaker": "Monica", "text": "Thank you. Come meet my friends. This is uh, Phoebe. "}, {"line_number": 37, "type": "dialogue", "speaker": "Tim", "text": "Hi, nice to meet you."}, {"line_number": 38, "type": "dialogue", "speaker": "Monica", "text": "And Joey."}, {"line_number": 39, "type": "dialogue", "speaker": "Joey", "text": "Hey!"}, {"line_number": 40, "type": "dialogue", "speaker": "Tim", "text": "Hi, Joey."}, {"line_number": 41, "type": "dialogue", "speaker": "Monica", "text": "My brother, Ross."}, {"line_number": 42, "type": "dialogue", "speaker": "Ross", "text": "Hey."}, {"line_number": 43, "type": "dialogue", "speaker": "Monica", "text": "And Rachel. (Chandler clears his voice loudly) And thats Chandler."}, {"line_number": 44, "type": "dialogue", "speaker": "Chandler", "text": "How do ya do."}, {"line_number": 45, "type": "dialogue", "speaker": "Tim", "text": "Whats"}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "Umm, well, hes"}, {"line_number": 47, "type": "dialogue", "speaker": "Joey", "text": "Hes doin some thinkin!"}, {"line_number": 48, "type": "narration", "text": "[cut to later, Joey, Rachel, Ross, and Tim are watching the football game, and they all cheer loudly.]"}, {"line_number": 49, "type": "dialogue", "speaker": "Chandler", "text": "What happened? What happened?!"}, {"line_number": 50, "type": "dialogue", "speaker": "Joey", "text": "You kissed my girlfriend!"}, {"line_number": 51, "type": "action", "text": "(A commercial for sunglasses comes on.)"}, {"line_number": 52, "type": "dialogue", "speaker": "Rachel", "text": "Ooh, I like those sunglasses."}, {"line_number": 53, "type": "dialogue", "speaker": "Ross", "text": "Like em, like em? Or, Id like to get store credit for that amount like em?"}, {"line_number": 54, "type": "dialogue", "speaker": "Rachel", "text": "(Swears in Italian, its the same term used by Joey earlier and Joey nods his approval.)"}, {"line_number": 55, "type": "dialogue", "speaker": "Monica", "text": "All right everybody, this turkey is ready!"}, {"line_number": 56, "type": "dialogue", "speaker": "Tim", "text": "Where can I wash up?"}, {"line_number": 57, "type": "dialogue", "speaker": "Monica", "text": "Here, let me show you. Okay, the towels are hanging next to the sink, and umm, you can use the fancy soap."}, {"line_number": 58, "type": "dialogue", "speaker": "Tim", "text": "Thank you."}, {"line_number": 59, "type": "dialogue", "speaker": "Rachel", "text": "Fancy soap? I thought we were savin that for the Pope!"}, {"line_number": 60, "type": "dialogue", "speaker": "Monica", "text": "See hes nice. Right?"}, {"line_number": 61, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, but Monica, do you actually want to be in a relationship where you can actually use the phrase, \"Thats not how your dad used to do it.\""}, {"line_number": 62, "type": "dialogue", "speaker": "Tim", "text": "Wow! Everything looks great! Where should I sit?"}, {"line_number": 63, "type": "dialogue", "speaker": "Monica", "text": "I saved you a seat. (Motions to the one next to her.)"}, {"line_number": 64, "type": "dialogue", "speaker": "Rachel", "text": "(pouring the wine) Sick-sick-sick-sick."}, {"line_number": 65, "type": "action", "text": "(Theres a loud knocking.)"}, {"line_number": 66, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, Ill get it. (goes over to the door.)"}, {"line_number": 67, "type": "dialogue", "speaker": "Chandler", "text": "Gotcha! (laughs)"}, {"line_number": 68, "type": "dialogue", "speaker": "Joey", "text": "That doesnt sound like thinking to me!"}, {"line_number": 69, "type": "dialogue", "speaker": "Chandler", "text": "Sorry!"}, {"line_number": 70, "type": "dialogue", "speaker": "Joey", "text": "Yknow I dont think you should be talking at all in there! I think youve got to much thinking to do to be talking and making jokes!"}, {"line_number": 71, "type": "dialogue", "speaker": "Chandler", "text": "Okay, okay, you got it!"}, {"line_number": 72, "type": "dialogue", "speaker": "Rachel", "text": "Ross, can you pass me the yams?"}, {"line_number": 73, "type": "dialogue", "speaker": "Ross", "text": "Sure! Oh, and Joeys got the mashed potatoes if you want to exchange them."}, {"line_number": 74, "type": "dialogue", "speaker": "Rachel", "text": "Would you stop?! What is the matter with you?!"}, {"line_number": 75, "type": "dialogue", "speaker": "Monica", "text": "Oh-ho-ho, weve got company."}, {"line_number": 76, "type": "dialogue", "speaker": "Ross", "text": "Theres nothing the matter with me. See, Im not completely devoid of sentiment, see I have feelings."}, {"line_number": 77, "type": "dialogue", "speaker": "Rachel", "text": "Okay, fine. (She gets up and walks into her bedroom)"}, {"line_number": 78, "type": "action", "text": "(an awkward silence follows)"}, {"line_number": 79, "type": "dialogue", "speaker": "Chandler", "text": "You cant tell, but Im trying to break the tension by mooning you guys!"}, {"line_number": 80, "type": "dialogue", "speaker": "Joey", "text": "All right, look! If this is just a big joke to you, then forget about it, all right?! This means something to me! And if it doesnt mean anything to you, then you should get out of there, otherwise youre just an idiot in a box!"}, {"line_number": 81, "type": "dialogue", "speaker": "Chandler", "text": "Youre right, and Im sorry! This means a lot to me! I want you to be my friend again! I swear, I wont say another word tonight."}, {"line_number": 82, "type": "dialogue", "speaker": "Joey", "text": "So are you gonna start taking this thing seriously?"}, {"line_number": 83, "type": "dialogue", "speaker": "Chandler", "text": "Absolutely!"}, {"line_number": 84, "type": "dialogue", "speaker": "Joey", "text": "That sounds like another word to me! Are you gonna take this seriously? (Theres no response from Chandler.) Okay."}, {"line_number": 85, "type": "action", "text": "(Rachel comes back carrying a shoe box.)"}, {"line_number": 86, "type": "dialogue", "speaker": "Rachel", "text": "Dont say that I have no sentiment! (Starts to show Ross whats in the box.) This is a movie stub from our first date! This is an eggshell from the first time you made me breakfast in bed! (Holds up a bone) This is from the museum from the first time we were together. Okay, maybe I exchange gifts sometimes, but I keep the things that matter! "}, {"line_number": 87, "type": "dialogue", "speaker": "Ross", "text": "I dont know what to say, Im sorry. Though, youre not supposed to take these. (Points to the bone) Its like a million years old, we, we actually, we had people looking for that."}, {"line_number": 88, "type": "action", "text": "(Rachel glares at him.)"}, {"line_number": 89, "type": "narration", "text": "[Cut to the balcony with Monica and Tim.]"}, {"line_number": 90, "type": "dialogue", "speaker": "Monica", "text": "(putting off her coat) Ooh, this always happens. (Her coat gets stuck.)"}, {"line_number": 91, "type": "dialogue", "speaker": "Tim", "text": "Here, let me help. (Does so.)"}, {"line_number": 92, "type": "dialogue", "speaker": "Monica", "text": "Thank you."}, {"line_number": 93, "type": "dialogue", "speaker": "Tim", "text": "You-you have a very beautiful eye."}, {"line_number": 94, "type": "dialogue", "speaker": "Monica", "text": "Yknow all my friends think this is weird. "}, {"line_number": 95, "type": "dialogue", "speaker": "Tim", "text": "Yknow I-I thought it was gonna be weird, I mean I almost called and canceled, but it really isnt."}, {"line_number": 96, "type": "dialogue", "speaker": "Monica", "text": "I know! I mean its like me and your dad, thats a totally separate thing."}, {"line_number": 97, "type": "dialogue", "speaker": "Tim", "text": "Oh, I totally agree."}, {"line_number": 98, "type": "dialogue", "speaker": "Monica", "text": "Were just two people who find each other very attractive. Right?"}, {"line_number": 99, "type": "action", "text": "(Tim leans in to kiss her. They stop, and when he tries to kiss her again, Monica pulls away.)"}, {"line_number": 100, "type": "dialogue", "speaker": "Tim", "text": "What?"}, {"line_number": 101, "type": "dialogue", "speaker": "Monica", "text": "Nothing. Nothing."}, {"line_number": 102, "type": "dialogue", "speaker": "Tim", "text": "No-no really, was-was that not okay?"}, {"line_number": 103, "type": "dialogue", "speaker": "Monica", "text": "No-no-no that was good, it was, that was uh, that was a goood kiss"}, {"line_number": 104, "type": "dialogue", "speaker": "Tim", "text": "Oh my God! It didnt remind you of"}, {"line_number": 105, "type": "dialogue", "speaker": "Monica", "text": "(interrupting) Dont say it!"}, {"line_number": 106, "type": "dialogue", "speaker": "Tim", "text": "No, but it did! Didnt it?!"}, {"line_number": 107, "type": "dialogue", "speaker": "Monica", "text": "Yeah!"}, {"line_number": 108, "type": "dialogue", "speaker": "Tim", "text": "Oh man!!"}, {"line_number": 109, "type": "dialogue", "speaker": "Monica", "text": "I know!"}, {"line_number": 110, "type": "action", "text": "(They both shiver in horror.)"}, {"line_number": 111, "type": "narration", "text": "[cut to later, Tim has left. Monica is still shivering. Theres a knock on the door.]"}, {"line_number": 112, "type": "dialogue", "speaker": "Joey", "text": "Ill get it. (Its Kathy.)"}, {"line_number": 113, "type": "dialogue", "speaker": "Kathy", "text": "(sees its Joey) Oh."}, {"line_number": 114, "type": "dialogue", "speaker": "Joey", "text": "Hey."}, {"line_number": 115, "type": "dialogue", "speaker": "Kathy", "text": "Hey. Listen, I want you to know how sorry I am"}, {"line_number": 116, "type": "dialogue", "speaker": "Joey", "text": "Thats okay. Chandlers the one Im mad at."}, {"line_number": 117, "type": "dialogue", "speaker": "Kathy", "text": "Well, Im still sorry. Is he here?"}, {"line_number": 118, "type": "dialogue", "speaker": "Joey", "text": "In the box."}, {"line_number": 119, "type": "dialogue", "speaker": "Kathy", "text": "(going over to the box) Chandler?"}, {"line_number": 120, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, he-he cant talk right now."}, {"line_number": 121, "type": "dialogue", "speaker": "Kathy", "text": "Why not? Whats going on?"}, {"line_number": 122, "type": "dialogue", "speaker": "Phoebe", "text": "Hes just trying to show Joey how much he means to him."}, {"line_number": 123, "type": "dialogue", "speaker": "Kathy", "text": "By being in a box?"}, {"line_number": 124, "type": "dialogue", "speaker": "Rachel", "text": "Joey, had reasons. "}, {"line_number": 125, "type": "dialogue", "speaker": "Phoebe", "text": "They were threefold."}, {"line_number": 126, "type": "dialogue", "speaker": "Kathy", "text": "Oh. Well uh, (to Chandler) you not being able to talk may make this easier. Listen umm (She looks at the gang who are watching, they take the hint and leave them alone.) Listen I dont wanna be someone who comes between two best friends. I just, I cant stand seeing what this is doing to you guys, and I dont wanna be the cause of that. So, I dont think we can see each other anymore. Im gonna go to my moms in Chicago, Im gonna stay there for awhile. I think this couldve be something really amazing, but yknow this is probably for the best. Yknow? Im gonna miss you. Good-bye, Chandler. "}, {"line_number": 127, "type": "action", "text": "(She gets up and leaves, Chandler waves good-bye with one finger extended through the air hole. Ross glares at Joey.)"}, {"line_number": 128, "type": "dialogue", "speaker": "Joey", "text": "(starting to cry) Open the box!! (Runs over to do so.)"}, {"line_number": 129, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 130, "type": "dialogue", "speaker": "Joey", "text": "He can still catch her! Come on, get out of there! (He opens the box) Get out of there!"}, {"line_number": 131, "type": "dialogue", "speaker": "Chandler", "text": "So?"}, {"line_number": 132, "type": "dialogue", "speaker": "Joey", "text": "Yeah, were gonna be fine! Get out!"}, {"line_number": 133, "type": "dialogue", "speaker": "Chandler", "text": "Yeah?"}, {"line_number": 134, "type": "dialogue", "speaker": "Joey", "text": "Yeah, you did some real good thinkin in there."}, {"line_number": 135, "type": "dialogue", "speaker": "Chandler", "text": "Man, this is "}, {"line_number": 136, "type": "action", "text": "(Joey says something unintelligible and they hug.)"}, {"line_number": 137, "type": "dialogue", "speaker": "Joey", "text": "Now go! Cause you can still catch her! And Merry Christmas from youre secret Santa! (Chandler runs out and closes the door.) "}, {"line_number": 138, "type": "narration", "text": "(After hes gone.) "}, {"line_number": 139, "type": "dialogue", "speaker": "Joey", "text": "All right, who got Chandler? Cause I uh, need to trade."}, {"line_number": 140, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S04E08", "season": 4, "episode_number": 8, "episode_title": "THE ONE WITH CHANDLER IN A BOX", "scene_number": 10, "scene_id": "S04E08_010", "location": "Monica and Rachel's Balcony", "scene_description": "the gang is all there watching Chandler.", "characters": ["Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E08/scenes/S04E08_010", "raw_text": "[Scene: Monica and Rachel's Balcony, the gang is all there watching Chandler.]\nRachel: Oh, he sees her!\nMonica: Oh, hes catching up to her!\nPhoebe: Oh, she sees him! Oh, theyre hugging!\nRoss: Hes taking her purse!\nJoey: Uhh, thats not them. Im gonna go call the police.\nPhoebe: Oh, there they are!\n(They watch them making up and sigh)\nPhoebe: All right, get a room.\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's Balcony, the gang is all there watching Chandler.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Oh, he sees her!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Oh, hes catching up to her!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, she sees him! Oh, theyre hugging!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Hes taking her purse!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Uhh, thats not them. Im gonna go call the police."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, there they are!"}, {"line_number": 8, "type": "action", "text": "(They watch them making up and sigh)"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "All right, get a room."}, {"line_number": 10, "type": "narration", "text": "End"}]}
