{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 1, "scene_id": "S04E07_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S04E07/scenes/S04E07_001", "raw_text": "THE ONE WHERE CHANDLER CROSSES A LINE\nWritten by: Adam Chase Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WHERE CHANDLER CROSSES A LINE"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Adam Chase Transcribed by: Eric Aasen"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 2, "scene_id": "S04E07_002", "location": "Monica and Rachel's", "scene_description": "everyone except Joey and Chandler are there eating breakfast.", "characters": ["All", "Chandler", "Phoebe", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_002", "raw_text": "[Scene: Monica and Rachel's, everyone except Joey and Chandler are there eating breakfast.]\nChandler: (entering in a bathrobe) I just walked in the bathroom and saw Kathy naked! It was like torture!\nRoss: Y'know if we ever go to war and youre captured, youre in for a big surprise.\nChandler: It just keeps getting worse and worse! Y'know? I mean its bad enough that Im in love with my roommates girlfriendwhich by the way, I think she knows. Because every time were in the room together theres this weird like energy between us. And call me crazy, but I think she likes me too. And now I have seen her naked. I mean at least when Ive seen her with clothes on, I could imagine her body was like covered in boles or something. But there are no boles, shes smooth! Smooth! (leaves)\n(Pause)\nPhoebe: Wow! Could everyone totally see up his robe?\nAll: Yeah! Oh my God!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, everyone except Joey and Chandler are there eating breakfast.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(entering in a bathrobe) I just walked in the bathroom and saw Kathy naked! It was like torture!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Y'know if we ever go to war and youre captured, youre in for a big surprise."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "It just keeps getting worse and worse! Y'know? I mean its bad enough that Im in love with my roommates girlfriendwhich by the way, I think she knows. Because every time were in the room together theres this weird like energy between us. And call me crazy, but I think she likes me too. And now I have seen her naked. I mean at least when Ive seen her with clothes on, I could imagine her body was like covered in boles or something. But there are no boles, shes smooth! Smooth! (leaves)"}, {"line_number": 5, "type": "action", "text": "(Pause)"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Wow! Could everyone totally see up his robe?"}, {"line_number": 7, "type": "dialogue", "speaker": "All", "text": "Yeah! Oh my God!"}, {"line_number": 8, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 3, "scene_id": "S04E07_003", "location": "Central Perk", "scene_description": "Joey is getting a phone number from a woman (Casey) as Chandler watches from the doorway.", "characters": ["Casey", "Chandler", "Joey"], "firestore_path": "/episodes/S04E07/scenes/S04E07_003", "raw_text": "[Scene: Central Perk, Joey is getting a phone number from a woman (Casey) as Chandler watches from the doorway.]\nCasey: Here you go.\nJoey: Great! All right, so Ill call you later.\nCasey: Great! (leaves)\nChandler: (rushing up) Hey-Hey-Hey! Who was that?\nJoey: That would be Casey. Were going out tonight.\nChandler: Goin out, huh? Wow! Wow! (Does a little celebration dance) So things didnt work out with Kathy, huh? Bummer.\nJoey: No, things are fine with Kathy. Im having a late dinner with her tonight, right after my early dinner with Casey.\nChandler: (shocked) What?\nJoey: Yeah-yeah. And the craziest thing is that I just ate a whole pizza by myself! (Laughs)\nChandler: Wait! Youre going out with Kathy!\nJoey: Yeah. Why are you getting so upset?\nChandler: Well, Im upsetfor you. I mean, having sex with an endless line of beautiful women must be very unfulfilling for you. (He cant believe he just sad that.)\nJoey: What is the big deal? Its not like were exclusive.\nChandler: Look, Joey, Kathy is clearly not fulfilling your emotional needs. But Casey, I mean granted I only saw the back of her head, but I got this sense that shes-shes smart, and funny, and gets you.\nJoey: You got all that from the back of her head?\nChandler: All right look, I think its time for you to settle down. Y'know? Make a choice, pick a lane.\nJoey: Whos Elaine?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is getting a phone number from a woman (Casey) as Chandler watches from the doorway.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Casey", "text": "Here you go."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Great! All right, so Ill call you later."}, {"line_number": 4, "type": "dialogue", "speaker": "Casey", "text": "Great! (leaves)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(rushing up) Hey-Hey-Hey! Who was that?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "That would be Casey. Were going out tonight."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Goin out, huh? Wow! Wow! (Does a little celebration dance) So things didnt work out with Kathy, huh? Bummer."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "No, things are fine with Kathy. Im having a late dinner with her tonight, right after my early dinner with Casey."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "(shocked) What?"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Yeah-yeah. And the craziest thing is that I just ate a whole pizza by myself! (Laughs)"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Wait! Youre going out with Kathy!"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Yeah. Why are you getting so upset?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Well, Im upsetfor you. I mean, having sex with an endless line of beautiful women must be very unfulfilling for you. (He cant believe he just sad that.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "What is the big deal? Its not like were exclusive."}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Look, Joey, Kathy is clearly not fulfilling your emotional needs. But Casey, I mean granted I only saw the back of her head, but I got this sense that shes-shes smart, and funny, and gets you."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "You got all that from the back of her head?"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "All right look, I think its time for you to settle down. Y'know? Make a choice, pick a lane."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Whos Elaine?"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 4, "scene_id": "S04E07_004", "location": "Monica and Rachel's", "scene_description": "Ross and Monica are sitting on the couch playing cards, and Phoebe is working on a new song.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_004", "raw_text": "[Scene: Monica and Rachel's, Ross and Monica are sitting on the couch playing cards, and Phoebe is working on a new song.]\nPhoebe: (singing) \"Little, tiny Tarzan, swinging on a nose hair. Swinging with the greatest of ease\" Darn it! Now, I dont know who to get to the next verse.\nRoss: Oh, you could just go uh, \"greatest of ease (plays air guitar) BAH-bah-bha-bhannn.\" Then go right into it.\nPhoebe: Yeah, ooh, I like that! Yeah. Wait! How do you know about bah-bah-bha-bhan?\nRoss: Well umm, yknow, I used to play.\nPhoebe: Oh yeah, thats right, the keyboards, huh?\nRoss: Yeah, just a little in high school, but then I really got into it in college. I mean thats-thats when I really found my sound.\n(Monica is taking a drink as Ross says that, laughs, and snorts her drink.)\nMonica: Oh God! Orange juice just came out of my nose, but it was totally worth it. Oh my God, I completely forgot about your sound.\nRoss: Yeah.\nMonica: He used to lock himself in the basement for hours. No one was every allowed to hear, \"The Sound.\"\nPhoebe: I wanna hear \"The Sound.\"\nRoss: Really? No. I mean, nah, I havent played in so long, and-and, well its-its really personal stuff, yknow?\nPhoebe: Come on, play that funky music white boy.\nMonica: Yeah!\nRoss: No, you guys, I mean my keyboards are all the way up inNo, yeah, okay. (Runs out.)\n[Cut to later that same day, Ross has retrieved his keyboard and is about to debut, \"The Sound.\"]\nRoss: Okay, guys.\nChandler: All right! Bring it on, you\nRoss: Here we go. (Plays one note) Yknow, Ive-Ive never played my stuff for anyone before, so its important that-that you understand its about communicating very private emotions. (Plays another note) Yknow, umm, you should-you should think of umm, my work as wordless sound poems. Thats what Im\nChandler: (interrupting) Oh my God! Play!\n(Ross starts to play. He plays a key that has a back beat sound attached to it. Over the background music he plays the sound of a barking dog, a mooing cow, a laser beam, someone coughing, a jackhammer, a doorbell, a police siren, a ray gun, breaking dishes, and for a closer he plays the sound of a loud crash. Basically, the music sucks.)\nMonica: (At a loss for words) Boy, that was-that was, umm terrific.\nChandler: Really, bitchin!\nPhoebe: Wow, it was sowow!\nRoss: Really?! I mean, really?!!\nRachel: Yeah, I mean, you should play in public!\nRoss: Wow! Thanks, you guys. Thats uhohhh, I wanna, I wanna play you another piece! Umm! Uh-oh! I left my uh, helicopter sounds on another disk. Ill be right back! Okay? (Runs to fetch them) This is so nice, ImI am so (starts to break up and leaves)\nMonica: Oh God bless my dad sound proofing the basement!\nRachel: Oh, I cant believe I ever let him touch me with those fingers.\nPhoebe: What are you guys talking about, I loved it! It was soo moving. Oh, plus its just, its so different from the stuff you usually hear.\nChandler: You mean like, music?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Ross and Monica are sitting on the couch playing cards, and Phoebe is working on a new song.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "(singing) \"Little, tiny Tarzan, swinging on a nose hair. Swinging with the greatest of ease\" Darn it! Now, I dont know who to get to the next verse."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Oh, you could just go uh, \"greatest of ease (plays air guitar) BAH-bah-bha-bhannn.\" Then go right into it."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, ooh, I like that! Yeah. Wait! How do you know about bah-bah-bha-bhan?"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Well umm, yknow, I used to play."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh yeah, thats right, the keyboards, huh?"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Yeah, just a little in high school, but then I really got into it in college. I mean thats-thats when I really found my sound."}, {"line_number": 8, "type": "action", "text": "(Monica is taking a drink as Ross says that, laughs, and snorts her drink.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Oh God! Orange juice just came out of my nose, but it was totally worth it. Oh my God, I completely forgot about your sound."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "He used to lock himself in the basement for hours. No one was every allowed to hear, \"The Sound.\""}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "I wanna hear \"The Sound.\""}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Really? No. I mean, nah, I havent played in so long, and-and, well its-its really personal stuff, yknow?"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Come on, play that funky music white boy."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Yeah!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "No, you guys, I mean my keyboards are all the way up inNo, yeah, okay. (Runs out.)"}, {"line_number": 17, "type": "narration", "text": "[Cut to later that same day, Ross has retrieved his keyboard and is about to debut, \"The Sound.\"]"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Okay, guys."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "All right! Bring it on, you"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Here we go. (Plays one note) Yknow, Ive-Ive never played my stuff for anyone before, so its important that-that you understand its about communicating very private emotions. (Plays another note) Yknow, umm, you should-you should think of umm, my work as wordless sound poems. Thats what Im"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "(interrupting) Oh my God! Play!"}, {"line_number": 22, "type": "action", "text": "(Ross starts to play. He plays a key that has a back beat sound attached to it. Over the background music he plays the sound of a barking dog, a mooing cow, a laser beam, someone coughing, a jackhammer, a doorbell, a police siren, a ray gun, breaking dishes, and for a closer he plays the sound of a loud crash. Basically, the music sucks.)"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "(At a loss for words) Boy, that was-that was, umm terrific."}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "Really, bitchin!"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "Wow, it was sowow!"}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "Really?! I mean, really?!!"}, {"line_number": 27, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I mean, you should play in public!"}, {"line_number": 28, "type": "dialogue", "speaker": "Ross", "text": "Wow! Thanks, you guys. Thats uhohhh, I wanna, I wanna play you another piece! Umm! Uh-oh! I left my uh, helicopter sounds on another disk. Ill be right back! Okay? (Runs to fetch them) This is so nice, ImI am so (starts to break up and leaves)"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Oh God bless my dad sound proofing the basement!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I cant believe I ever let him touch me with those fingers."}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "What are you guys talking about, I loved it! It was soo moving. Oh, plus its just, its so different from the stuff you usually hear."}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "You mean like, music?"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 5, "scene_id": "S04E07_005", "location": "Chandler and Joey's", "scene_description": "Chandler is watching Yasmein Bleeth running on TV, and the duck starts quacking.", "characters": ["Chandler", "Joey", "Kathy"], "firestore_path": "/episodes/S04E07/scenes/S04E07_005", "raw_text": "[Scene: Chandler and Joey's, Chandler is watching Yasmein Bleeth running on TV, and the duck starts quacking.]\nChandler: Yeah, I know what youre thinkin! Yes, yes, your breasts are just as firm and juicy.\n(Theres a knock on the door.)\nChandler: Come in!\nKathy: (entering) Hey! (sees whats on TV) Oh God, is that Baywatch?\nChandler: Uh yes, but uh, I just watch it for the articles.\nKathy: So is Joey around?\nChandler: No-no, hes not back yet, but hell be here any minute. So uh, come on in. Have a seat. Bow or stern?\nKathy: I uh, dont really have a preference. You?\nChandler: I like it in the stern. (Realizes what he just said.) of the boat. (The phone rings, and he answers it.) (on phone) Hello.\nJoey: (on the other end at a pay phone) Hey, its me. Listen Casey and I were on our way back and had a little car trouble.\nChandler: What happened?\nJoey: We broke down on the Parkway, so I have to walk back and get some transmission fluid. And hey, listen could you please tell Kathy that Ill be there as soon as I can.\nChandler: Why cant you tell her?\nJoey: Cause I only have one quarter, and I think my time is about to(he stops talking suddenly)\nChandler: Joey! Joey!!\nJoey: Yeah?\nChandler: I thought your time ran out.\nJoey: Me too, but I guess I do have a couple of more(his time runs out for real)\nChandler: (to Kathy) Uhh, that was Joey. Hes running a little late, he says hes sorry.\nKathy: Oh.\nChandler: So I guess its just uh, you and me then.\nKathy: Oh, okay.\nChandler: Yeah, I think it is!\nKathy: So what did you do today?\nChandler: Oh, I had an appointment to get my haircut\nKathy: (interrupting) Oh, it looks great!\nChandler: and then it got canceled.\nKathy: Well, I could cut it.\nChandler: Really?! You do that?\nKathy: Yeah, I do. Of course, I learned at my aunts dog grooming shop, but hey, what do you say?\nChandler: Dog grooming huh? Okay, just dont make my tail too poofy.\n[Cut to later, Kathy is cutting Chandlers hair.]\nKathy: You have really great hair.\nChandler: Well, thanks. I grow it myself. (Kathy is running her fingers through his hair, and Chandler catches himself enjoying it too much.) Yknow who also has great hair is Joey!\nKathy: Yes! Yeah! Joey has great hair! Umm, Im basically done here. Just let me get this off your neck.\n(Kathy leans in really close and Chandler mouths \"Oh my God.\" She moves around in front of him and kneels at his feet.)\nChandler: What-what cha doin?\nKathy: Checking to see if its even.\nChandler: Kay.\nKathy: Looks good.\n(They lean in to kiss and are interrupted by the phone.)\nChandler: (jumping up to answer the phone) Oh the phone! The phones making sounds! (On phone) Hello!\nJoey: (on phone) Hey dude, its me.\nChandler: Hey its Joey!\nJoey: Listen uh, Im really sorry, it looks like Im gonna be stuck here for a while. I got the transmission fluid, but when I went to put it in the car, the transmission wasnt there!\nChandler: What?\nJoey: Yeah, it mustve fallen out a few blocks back. I just figured we hit a dog.\nChandler: Okay.\nJoey: Listen uh, could you put Kathy on, I wanna apologize.\nChandler: Oh yeah man. (to Kathy) Joey. (Hands her the phone.)\nKathy: (on phone) Hey. (listens) Oh no its fine, dont worry about it. (listens) Yeah-no, stop apologizing, its okay. (listens) Yeah! Ill talk to you tomorrow. (hangs up) (to Chandler) I should uh, probably go.\nChandler: Yeah. Yes! Yeah. \n(Kathy leaves and Chandler groans in agony. Kathy knocks on the door and Chandler opens it.)\nKathy: I forgot my purse.\nChandler: Oh. \n(They kiss, passionately.)\nKathy: No, I really did forget my purse.\n(They kiss again.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Chandler is watching Yasmein Bleeth running on TV, and the duck starts quacking.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I know what youre thinkin! Yes, yes, your breasts are just as firm and juicy."}, {"line_number": 3, "type": "action", "text": "(Theres a knock on the door.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Come in!"}, {"line_number": 5, "type": "dialogue", "speaker": "Kathy", "text": "(entering) Hey! (sees whats on TV) Oh God, is that Baywatch?"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Uh yes, but uh, I just watch it for the articles."}, {"line_number": 7, "type": "dialogue", "speaker": "Kathy", "text": "So is Joey around?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "No-no, hes not back yet, but hell be here any minute. So uh, come on in. Have a seat. Bow or stern?"}, {"line_number": 9, "type": "dialogue", "speaker": "Kathy", "text": "I uh, dont really have a preference. You?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "I like it in the stern. (Realizes what he just said.) of the boat. (The phone rings, and he answers it.) (on phone) Hello."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "(on the other end at a pay phone) Hey, its me. Listen Casey and I were on our way back and had a little car trouble."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "What happened?"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "We broke down on the Parkway, so I have to walk back and get some transmission fluid. And hey, listen could you please tell Kathy that Ill be there as soon as I can."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Why cant you tell her?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Cause I only have one quarter, and I think my time is about to(he stops talking suddenly)"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Joey! Joey!!"}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Yeah?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "I thought your time ran out."}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Me too, but I guess I do have a couple of more(his time runs out for real)"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "(to Kathy) Uhh, that was Joey. Hes running a little late, he says hes sorry."}, {"line_number": 21, "type": "dialogue", "speaker": "Kathy", "text": "Oh."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "So I guess its just uh, you and me then."}, {"line_number": 23, "type": "dialogue", "speaker": "Kathy", "text": "Oh, okay."}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I think it is!"}, {"line_number": 25, "type": "dialogue", "speaker": "Kathy", "text": "So what did you do today?"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Oh, I had an appointment to get my haircut"}, {"line_number": 27, "type": "dialogue", "speaker": "Kathy", "text": "(interrupting) Oh, it looks great!"}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "and then it got canceled."}, {"line_number": 29, "type": "dialogue", "speaker": "Kathy", "text": "Well, I could cut it."}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "Really?! You do that?"}, {"line_number": 31, "type": "dialogue", "speaker": "Kathy", "text": "Yeah, I do. Of course, I learned at my aunts dog grooming shop, but hey, what do you say?"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Dog grooming huh? Okay, just dont make my tail too poofy."}, {"line_number": 33, "type": "narration", "text": "[Cut to later, Kathy is cutting Chandlers hair.]"}, {"line_number": 34, "type": "dialogue", "speaker": "Kathy", "text": "You have really great hair."}, {"line_number": 35, "type": "dialogue", "speaker": "Chandler", "text": "Well, thanks. I grow it myself. (Kathy is running her fingers through his hair, and Chandler catches himself enjoying it too much.) Yknow who also has great hair is Joey!"}, {"line_number": 36, "type": "dialogue", "speaker": "Kathy", "text": "Yes! Yeah! Joey has great hair! Umm, Im basically done here. Just let me get this off your neck."}, {"line_number": 37, "type": "action", "text": "(Kathy leans in really close and Chandler mouths \"Oh my God.\" She moves around in front of him and kneels at his feet.)"}, {"line_number": 38, "type": "dialogue", "speaker": "Chandler", "text": "What-what cha doin?"}, {"line_number": 39, "type": "dialogue", "speaker": "Kathy", "text": "Checking to see if its even."}, {"line_number": 40, "type": "dialogue", "speaker": "Chandler", "text": "Kay."}, {"line_number": 41, "type": "dialogue", "speaker": "Kathy", "text": "Looks good."}, {"line_number": 42, "type": "action", "text": "(They lean in to kiss and are interrupted by the phone.)"}, {"line_number": 43, "type": "dialogue", "speaker": "Chandler", "text": "(jumping up to answer the phone) Oh the phone! The phones making sounds! (On phone) Hello!"}, {"line_number": 44, "type": "dialogue", "speaker": "Joey", "text": "(on phone) Hey dude, its me."}, {"line_number": 45, "type": "dialogue", "speaker": "Chandler", "text": "Hey its Joey!"}, {"line_number": 46, "type": "dialogue", "speaker": "Joey", "text": "Listen uh, Im really sorry, it looks like Im gonna be stuck here for a while. I got the transmission fluid, but when I went to put it in the car, the transmission wasnt there!"}, {"line_number": 47, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 48, "type": "dialogue", "speaker": "Joey", "text": "Yeah, it mustve fallen out a few blocks back. I just figured we hit a dog."}, {"line_number": 49, "type": "dialogue", "speaker": "Chandler", "text": "Okay."}, {"line_number": 50, "type": "dialogue", "speaker": "Joey", "text": "Listen uh, could you put Kathy on, I wanna apologize."}, {"line_number": 51, "type": "dialogue", "speaker": "Chandler", "text": "Oh yeah man. (to Kathy) Joey. (Hands her the phone.)"}, {"line_number": 52, "type": "dialogue", "speaker": "Kathy", "text": "(on phone) Hey. (listens) Oh no its fine, dont worry about it. (listens) Yeah-no, stop apologizing, its okay. (listens) Yeah! Ill talk to you tomorrow. (hangs up) (to Chandler) I should uh, probably go."}, {"line_number": 53, "type": "dialogue", "speaker": "Chandler", "text": "Yeah. Yes! Yeah. "}, {"line_number": 54, "type": "action", "text": "(Kathy leaves and Chandler groans in agony. Kathy knocks on the door and Chandler opens it.)"}, {"line_number": 55, "type": "dialogue", "speaker": "Kathy", "text": "I forgot my purse."}, {"line_number": 56, "type": "dialogue", "speaker": "Chandler", "text": "Oh. "}, {"line_number": 57, "type": "action", "text": "(They kiss, passionately.)"}, {"line_number": 58, "type": "dialogue", "speaker": "Kathy", "text": "No, I really did forget my purse."}, {"line_number": 59, "type": "action", "text": "(They kiss again.)"}, {"line_number": 60, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 6, "scene_id": "S04E07_006", "location": "Chandler and Joey's", "scene_description": "continued from earlier. Chandler and Kathy are still kissing, then they stop suddenly.", "characters": ["Chandler", "Kathy"], "firestore_path": "/episodes/S04E07/scenes/S04E07_006", "raw_text": "[Scene: Chandler and Joey's, continued from earlier. Chandler and Kathy are still kissing, then they stop suddenly.]\nChandler: No-no-no-no, this is bad! Its bad! This is bad!\nKathy: Horrible!\nChandler: Wait the uh, the kiss or the situation?\nKathy: No-no-no, the kiss was good.\nChandler: Okay!\nKathy: No, but thats bad!\nChandler: Ooh! Yes! Okay! Heres what we do, we-we forget it happened.\nKathy: What?!\nChandler: Okay, we-we swallow our feelings. Even if it means were unhappy forever. Sound good?\nKathy: Can you really do that?\nChandler: I have to; hes my best friend, and youre seeing him.\nKathy: Chandler, I like Joey a lot, but with you\nChandler: (interrupting) Oh-no-no-no! Dont! Dont! See-see, youre getting me confused, Im starting to urn. \nKathy: Im sorry. If you wanna pretend that nothing happened, I can try.\nChandler: I-I think we have too.\nKathy: Okay. Bye.\nChandler: Bye. (Kathy leaves and Chandler wonders over to and leans up against the door.) Are you still out there?\nKathy: (outside the door) No. (Chandler opens the door and they kiss again.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, continued from earlier. Chandler and Kathy are still kissing, then they stop suddenly.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no-no, this is bad! Its bad! This is bad!"}, {"line_number": 3, "type": "dialogue", "speaker": "Kathy", "text": "Horrible!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Wait the uh, the kiss or the situation?"}, {"line_number": 5, "type": "dialogue", "speaker": "Kathy", "text": "No-no-no, the kiss was good."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Okay!"}, {"line_number": 7, "type": "dialogue", "speaker": "Kathy", "text": "No, but thats bad!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Ooh! Yes! Okay! Heres what we do, we-we forget it happened."}, {"line_number": 9, "type": "dialogue", "speaker": "Kathy", "text": "What?!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Okay, we-we swallow our feelings. Even if it means were unhappy forever. Sound good?"}, {"line_number": 11, "type": "dialogue", "speaker": "Kathy", "text": "Can you really do that?"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "I have to; hes my best friend, and youre seeing him."}, {"line_number": 13, "type": "dialogue", "speaker": "Kathy", "text": "Chandler, I like Joey a lot, but with you"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "(interrupting) Oh-no-no-no! Dont! Dont! See-see, youre getting me confused, Im starting to urn. "}, {"line_number": 15, "type": "dialogue", "speaker": "Kathy", "text": "Im sorry. If you wanna pretend that nothing happened, I can try."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "I-I think we have too."}, {"line_number": 17, "type": "dialogue", "speaker": "Kathy", "text": "Okay. Bye."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Bye. (Kathy leaves and Chandler wonders over to and leans up against the door.) Are you still out there?"}, {"line_number": 19, "type": "dialogue", "speaker": "Kathy", "text": "(outside the door) No. (Chandler opens the door and they kiss again.)"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 7, "scene_id": "S04E07_007", "location": "Central Perk", "scene_description": "Ross is performing, his music hasnt improved.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_007", "raw_text": "[Scene: Central Perk, Ross is performing, his music hasnt improved.]\nRoss: (His voice is altered to sound like a computer.) Electrifying. (He plays the sound of a ticking clock.) Emphatic time-time-time\nMonica: (to Rachel and Phoebe) Y'know, theres a Starbucks about three blocks down.\nPhoebe: (pushing Monica back onto the couch) Its so inspired! Look at him! Look at him go!\n[cut back to Ross who finally finishes his so-called song with the same crash from before. He gets some applause, mainly cause hes done.]\nRoss: (with the altered voice) Thank you guys-guys-guys\nMonica: (to Phoebe) Hey, arent you up next?\nPhoebe: Oh no, Im not playing tonight.\nRachel: Why not?\nPhoebe: I cant follow Ross! Itd be like those bicycle ridding chimps that followed The Beetles. No.\nMonica: Phoebe, Ross sucks! \nRachel: Phoebe, the place has emptied because of him.\nPhoebe: Oh my God, hes not even appreciated in his own time. I would give anything to not be appreciated in my own time!\n(Rachel and Monica look at each other, and agree on something without saying anything.)\nMonica: Okay. Umm, Phoebe, you suck too.\nRachel: Yeah, Phoebe youre awful!\nPhoebe: You guys. You suck too. (She hugs them both.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross is performing, his music hasnt improved.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "(His voice is altered to sound like a computer.) Electrifying. (He plays the sound of a ticking clock.) Emphatic time-time-time"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(to Rachel and Phoebe) Y'know, theres a Starbucks about three blocks down."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "(pushing Monica back onto the couch) Its so inspired! Look at him! Look at him go!"}, {"line_number": 5, "type": "narration", "text": "[cut back to Ross who finally finishes his so-called song with the same crash from before. He gets some applause, mainly cause hes done.]"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "(with the altered voice) Thank you guys-guys-guys"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "(to Phoebe) Hey, arent you up next?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Oh no, Im not playing tonight."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Why not?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "I cant follow Ross! Itd be like those bicycle ridding chimps that followed The Beetles. No."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, Ross sucks! "}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe, the place has emptied because of him."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God, hes not even appreciated in his own time. I would give anything to not be appreciated in my own time!"}, {"line_number": 14, "type": "action", "text": "(Rachel and Monica look at each other, and agree on something without saying anything.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Okay. Umm, Phoebe, you suck too."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, Phoebe youre awful!"}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "You guys. You suck too. (She hugs them both.)"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 8, "scene_id": "S04E07_008", "location": "Chandler and Joey's", "scene_description": "Joey is opening the door, but Chandler has the chain on it.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E07/scenes/S04E07_008", "raw_text": "[Scene: Chandler and Joey's, Joey is opening the door, but Chandler has the chain on it.]\nJoey: Aww man! I cant believe I locked myself out again! (He knocks on the door.)\nChandler: Hang on buddy! (He goes over and unlocks the door and opens it to reveal a fully furnished apartment.)\nJoey: (rushing in) Oh my God! What happened here? Did you do all this?\nChandler: I sure did.\nJoey: Why?\nChandler: Well, I just thought itd make me feel good to do something nice for my friend.\nJoey: Well, youre amazing.\nChandler: Oh no-no-no. This is amazing. (He goes over and presses a button on a remote control that opens the entertainment center doors revealing the TV.)\nJoey: (very excited) A TV as if it appears from nowhere! Thats the dream! Man, how did you afford this stuff?\nChandler: Well, yknow Im 29. I mean who needs a savings account.\nJoey: Oh, you are the best friends anyone has ever had.\nChandler: Oh, I dont know.\nJoey: Oh-no-no-no, you are! You do this, you give me the great advice, and hey listen, I was thinking about what you said yesterday about focusing on one woman, Im gonna do that.\nChandler: You mean with Casey.\nJoey: No-no-no, I think Im gonna see how things go with Kathy. Shes pretty cool.\nChandler: Or Casey.\nJoey: No-no, Kathy.\nChandler: Could be Casey.\nJoey: No. No, Kathy.\nChandler: Consider Casey.\nJoey: Yknow what I think? I think somebodys got a little crush on Casey. How bout I fix you two up? What do you think?\nChandler: That all the pieces of my life are falling right into place!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is opening the door, but Chandler has the chain on it.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Aww man! I cant believe I locked myself out again! (He knocks on the door.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Hang on buddy! (He goes over and unlocks the door and opens it to reveal a fully furnished apartment.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(rushing in) Oh my God! What happened here? Did you do all this?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "I sure did."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Why?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Well, I just thought itd make me feel good to do something nice for my friend."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Well, youre amazing."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Oh no-no-no. This is amazing. (He goes over and presses a button on a remote control that opens the entertainment center doors revealing the TV.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "(very excited) A TV as if it appears from nowhere! Thats the dream! Man, how did you afford this stuff?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Well, yknow Im 29. I mean who needs a savings account."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Oh, you are the best friends anyone has ever had."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Oh, I dont know."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Oh-no-no-no, you are! You do this, you give me the great advice, and hey listen, I was thinking about what you said yesterday about focusing on one woman, Im gonna do that."}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "You mean with Casey."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "No-no-no, I think Im gonna see how things go with Kathy. Shes pretty cool."}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Or Casey."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "No-no, Kathy."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Could be Casey."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "No. No, Kathy."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Consider Casey."}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Yknow what I think? I think somebodys got a little crush on Casey. How bout I fix you two up? What do you think?"}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "That all the pieces of my life are falling right into place!"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 9, "scene_id": "S04E07_009", "location": "Central Perk", "scene_description": "Ross has just finished playing.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_009", "raw_text": "[Scene: Central Perk, Ross has just finished playing.]\nRoss: (to Phoebe) Hey!\nPhoebe: Hey! You were really great! You were really, really great!\nRoss: Oh, thanks, thanks. So Monica tells me that uh, you dont want to play anymore because me and y'know my talent. Is that true?\nPhoebe: Well, kinda. Yeah. Yeah.\nRoss: Pheebs\nPhoebe: Yeah, I-I cantI mean yknow I was trying to be really y'know okay and upbeat about it, I justI feel so dwarfed by your musical gift. I\nRoss: See but, Pheebs that-that is the exact opposite intent of my music. Yknow my music is-is meant to inspire, and if it bothers you this much, then I I wont play anymore.\nPhoebe: Oh no. No-no-no, dont do that! How could I live with myself if I knew I was depriving the world of your music.\nRoss: Yeah, okay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross has just finished playing.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "(to Phoebe) Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey! You were really great! You were really, really great!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Oh, thanks, thanks. So Monica tells me that uh, you dont want to play anymore because me and y'know my talent. Is that true?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Well, kinda. Yeah. Yeah."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Pheebs"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, I-I cantI mean yknow I was trying to be really y'know okay and upbeat about it, I justI feel so dwarfed by your musical gift. I"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "See but, Pheebs that-that is the exact opposite intent of my music. Yknow my music is-is meant to inspire, and if it bothers you this much, then I I wont play anymore."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh no. No-no-no, dont do that! How could I live with myself if I knew I was depriving the world of your music."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Yeah, okay."}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 10, "scene_id": "S04E07_010", "location": "Central Perk", "scene_description": "Rachel and Monica are sitting on the couch and Phoebe is getting coffee as Chandler enters. Ross is also there.", "characters": ["Chandler", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_010", "raw_text": "[Scene: Central Perk, Rachel and Monica are sitting on the couch and Phoebe is getting coffee as Chandler enters. Ross is also there.]\nRoss: Hey Chandler! Saw the new furniture. Very nice.\nMonica: Yeah! Joey has the best boyfriend ever!\nChandler: I kissed Kathy.\nRoss: What?\nMonica: Are you serious?\nPhoebe: Does Joey know?\nChandler: No. Is there anyway, anyway you think hell understand this?\nMonica: You obviously havent screwed over a lot of your friends. (They all look at her) Which we all appreciate.\nRoss: No the-the sad thing is, if you had told him how you felt before you kissed her, knowing Joey, he probably just wouldve just stepped aside.\nChandler: Oh, dont say that! Dont say that. Thats not true. Is it?\nPhoebe: I think maybe, yeah.\nMonica: He loves you.\nChandler: Then why didnt you tell me to do that?!!\nRoss: Well, I said-I said something to Phoebe.\nPhoebe: Yeah! No, thats right. And I thought it was a really good idea.\nRachel: I know, I remember that!\nMonica: I remember you did.\nChandler: God!! (Sits down in disgust.) What am I gonna do?!\nRachel: Well, Chandler, youre gonna have to tell him.\nChandler: Why?! Why do I have to tell him?!\nRachel: Because you do.\nChandler: Yeah, I know.\nRoss: Hey, would it be okay if I wrote a song about this.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Rachel and Monica are sitting on the couch and Phoebe is getting coffee as Chandler enters. Ross is also there.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey Chandler! Saw the new furniture. Very nice."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Yeah! Joey has the best boyfriend ever!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "I kissed Kathy."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Are you serious?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Does Joey know?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "No. Is there anyway, anyway you think hell understand this?"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "You obviously havent screwed over a lot of your friends. (They all look at her) Which we all appreciate."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "No the-the sad thing is, if you had told him how you felt before you kissed her, knowing Joey, he probably just wouldve just stepped aside."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Oh, dont say that! Dont say that. Thats not true. Is it?"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "I think maybe, yeah."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "He loves you."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Then why didnt you tell me to do that?!!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Well, I said-I said something to Phoebe."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! No, thats right. And I thought it was a really good idea."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "I know, I remember that!"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "I remember you did."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "God!! (Sits down in disgust.) What am I gonna do?!"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Well, Chandler, youre gonna have to tell him."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Why?! Why do I have to tell him?!"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Because you do."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I know."}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "Hey, would it be okay if I wrote a song about this."}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 11, "scene_id": "S04E07_011", "location": "Chandler and Joey's", "scene_description": "Joey is watching TV as Chandler enters.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S04E07/scenes/S04E07_011", "raw_text": "[Scene: Chandler and Joey's, Joey is watching TV as Chandler enters.]\nChandler: Hey!\nJoey: Hey! Samboucha Margarita? \nChandler: Is that a real thing?\nJoey: Well, we only had samboucha, so it is now.\nChandler: Listen ah, Joe, I-I need to, I need to talk to you about something.\nJoey: Whats up?\nChandler: Its-its about Kathy. Umm, uh, I like her. I like her a lot actually.\nJoey: You do?\nChandler: Yeah.\nJoey: Well, youre timing couldnt be better. Shes not my girlfriend anymore.\nChandler: What?\nJoey: Yeah, she broke up with me.\nChandler: Oh uh, when?\nJoey: Just now, after acting class. At first I thought she was doing some kind of scene, thats why I let people watch.\nChandler: Oh man, I am so sorry. Are, are you okay?\nJoey: Well, Ive been better. But, Im all right. So you like her huh?\nChandler: Yes, but I-I uh, dont have too.\nJoey: No-no-no, no its uh, its okay.\nChandler: Yeah?\nJoey: Yeah. You know why? Cause you came to me first.\nChandler: Well, I thought that would be the best thing to do.\nJoey: But hey, listen just so you know, you might have youre work cut out for you. Cause when I talked to her, I kinda got the feeling that shes into some other guy. So\nChandler: See uh, thats-thats actually what I wanted to talk to you about. I-I think I know who the other guy is.\nJoey: Who?\nChandler: Its me. Im the other guy.\nJoey: What?\nChandler: Yeah, I mean when you were late last night, Kathy and I got to talking, and one thing to another and\nJoey: And what?! Did you sleep with her?!\nChandler: No! No! No! I just kissed her.\nJoey: What?!! Thats even worse!!\nChandler: How is that worse?!\nJoey: I dont know! But its the same!\nChandler: Look, Im sorry! But theres nothing I can do, I think Im in love with her!\nJoey: Who cares?! You went behind my back! I would never do that to you!\nChandler: Youre right, I have no excuses! I was totally over the line.\nJoey: Over the line?! You-youre-youre so far past the line, that you-you cant even see the line! The line is a dot to you!\nChandler: Yes. Yes! Right! And I feel horrible. You have to believe me!\nJoey: Is that why you bought all this stuff?! (Chandler makes a face like \"Well, kinda.\") Well, yknow what I will not watch your TV, I will not listen to your stereo, and theres a cinnamon raisin loaf in the new bread maker that Im not gonna eat! You know why?!\nChandler: Probably because\nJoey: Because its all tainted with your betrayal. From now on this apartment is empty for me! And Im not happy about you either. (The bread maker dings) Oh, and just so you know, I made that bread for you. (Joey walks into his bedroom and slams the door.)\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is watching TV as Chandler enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Hey! Samboucha Margarita? "}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Is that a real thing?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Well, we only had samboucha, so it is now."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Listen ah, Joe, I-I need to, I need to talk to you about something."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Whats up?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Its-its about Kathy. Umm, uh, I like her. I like her a lot actually."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "You do?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Yeah."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Well, youre timing couldnt be better. Shes not my girlfriend anymore."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Yeah, she broke up with me."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Oh uh, when?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Just now, after acting class. At first I thought she was doing some kind of scene, thats why I let people watch."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Oh man, I am so sorry. Are, are you okay?"}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Well, Ive been better. But, Im all right. So you like her huh?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Yes, but I-I uh, dont have too."}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "No-no-no, no its uh, its okay."}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "Yeah?"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Yeah. You know why? Cause you came to me first."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "Well, I thought that would be the best thing to do."}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "But hey, listen just so you know, you might have youre work cut out for you. Cause when I talked to her, I kinda got the feeling that shes into some other guy. So"}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "See uh, thats-thats actually what I wanted to talk to you about. I-I think I know who the other guy is."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Who?"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Its me. Im the other guy."}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "What?"}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I mean when you were late last night, Kathy and I got to talking, and one thing to another and"}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "And what?! Did you sleep with her?!"}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "No! No! No! I just kissed her."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "What?!! Thats even worse!!"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "How is that worse?!"}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "I dont know! But its the same!"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "Look, Im sorry! But theres nothing I can do, I think Im in love with her!"}, {"line_number": 35, "type": "dialogue", "speaker": "Joey", "text": "Who cares?! You went behind my back! I would never do that to you!"}, {"line_number": 36, "type": "dialogue", "speaker": "Chandler", "text": "Youre right, I have no excuses! I was totally over the line."}, {"line_number": 37, "type": "dialogue", "speaker": "Joey", "text": "Over the line?! You-youre-youre so far past the line, that you-you cant even see the line! The line is a dot to you!"}, {"line_number": 38, "type": "dialogue", "speaker": "Chandler", "text": "Yes. Yes! Right! And I feel horrible. You have to believe me!"}, {"line_number": 39, "type": "dialogue", "speaker": "Joey", "text": "Is that why you bought all this stuff?! (Chandler makes a face like \"Well, kinda.\") Well, yknow what I will not watch your TV, I will not listen to your stereo, and theres a cinnamon raisin loaf in the new bread maker that Im not gonna eat! You know why?!"}, {"line_number": 40, "type": "dialogue", "speaker": "Chandler", "text": "Probably because"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "Because its all tainted with your betrayal. From now on this apartment is empty for me! And Im not happy about you either. (The bread maker dings) Oh, and just so you know, I made that bread for you. (Joey walks into his bedroom and slams the door.)"}, {"line_number": 42, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S04E07", "season": 4, "episode_number": 7, "episode_title": "THE ONE WHERE CHANDLER CROSSES A LINE", "scene_number": 12, "scene_id": "S04E07_012", "location": "Central Perk", "scene_description": "Ross is playing his music. Monica, Phoebe, and Rachel are sitting on the couch.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E07/scenes/S04E07_012", "raw_text": "[Scene: Central Perk, Ross is playing his music. Monica, Phoebe, and Rachel are sitting on the couch.]\nPhoebe: Oh my God, hes lost it. Hes totally lost it.\nMonica: (removing ear plugs) What?\nRachel: Phoebe, his music could not get any worse. There are rats in the basement that are hanging themselves.\n(Ross finally finishes with the same crash, and gets some applause.)\nRoss: Thank you, thanks. (Sits down next to the girls) Yeah, I lost it. Yknow, Im not gonna play anymore, (to Phoebe) would you, can you finish my set?\nPhoebe: After that? Yeah! No, I mean if I can help.\n(Phoebe gets up and goes to play, Ross goes over and sits down next to Monica and Rachel.)\nRoss: Yeah, like I could lose it.\nRachel: What?\nRoss: I played bad on purpose guys.\n(Both Monica and Rachel laugh.)\nMonica: Okay, so you were trying to play bad this whole time.\nRoss: Yeahno, just that last song.\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross is playing his music. Monica, Phoebe, and Rachel are sitting on the couch.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God, hes lost it. Hes totally lost it."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(removing ear plugs) What?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe, his music could not get any worse. There are rats in the basement that are hanging themselves."}, {"line_number": 5, "type": "action", "text": "(Ross finally finishes with the same crash, and gets some applause.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Thank you, thanks. (Sits down next to the girls) Yeah, I lost it. Yknow, Im not gonna play anymore, (to Phoebe) would you, can you finish my set?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "After that? Yeah! No, I mean if I can help."}, {"line_number": 8, "type": "action", "text": "(Phoebe gets up and goes to play, Ross goes over and sits down next to Monica and Rachel.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Yeah, like I could lose it."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "I played bad on purpose guys."}, {"line_number": 12, "type": "action", "text": "(Both Monica and Rachel laugh.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Okay, so you were trying to play bad this whole time."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Yeahno, just that last song."}, {"line_number": 15, "type": "narration", "text": "End"}]}
