{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 1, "scene_id": "S04E16_001", "location": "", "scene_description": "", "characters": [], "firestore_path": "/episodes/S04E16/scenes/S04E16_001", "raw_text": "THE ONE WITH THE FAKE PARTY\nTeleplay by Shana Goldberg-Meehan & Scott Silveri  Story by Alicia Sky Varinaitis Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE FAKE PARTY"}, {"line_number": 2, "type": "narration", "text": "Teleplay by Shana Goldberg-Meehan & Scott Silveri  Story by Alicia Sky Varinaitis Transcribed by: Eric Aasen"}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 2, "scene_id": "S04E16_002", "location": "Monica and Rachel's erm", "scene_description": "Chandler and Joey's, Chandler, Monica, and Phoebe are there. Phoebe is stressing out about something.", "characters": ["Chandler", "Joey", "Monica", "Phoebe"], "firestore_path": "/episodes/S04E16/scenes/S04E16_002", "raw_text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, Chandler, Monica, and Phoebe are there. Phoebe is stressing out about something.]\nMonica: What is it hon?\nPhoebe: I-I cant find anything that I want to eat! Everything I eat makes me nauseous! Im telling you, being pregnant is no piece of cakeooh! Cake! (Chandler shrugs, and Phoebe grimaces.) No.\nMonica: Aww, honey Im sorry.\nPhoebe: God! Ooh! What is that smell? Its coming from the bathroom. Ooh! (She goes to the bathroom.)\nChandler: Wow! Pregnancy does give you some weird cravings.\n[Cut to the bathroom, Joey is taking a shower and Phoebe knocks on the door.]\nJoey: Yeah?\nPhoebe: Its me. Its Phoebe. Listen theres something in here I want to eat, what-what smells so good?\n(Joey sticks his head out of the shower curtain.)\nJoey: Is it the shampoo? Its guava.\nPhoebe: (she smells his head) No!\nJoey: Oh! Wait-wait! (Reaches inside the shower.) Is it my bologna sandwich?\nPhoebe: Yes. Yes. Yes. I cant believe it! The baby wants bologna! Maybe he wants me to eat meat? I cant eat meat!\nJoey: Oh, wait-wait! (Reaches into the shower again.) Maybe its a pickle?!\n(Phoebe grimaces at the smell.)\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, Chandler, Monica, and Phoebe are there. Phoebe is stressing out about something.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "What is it hon?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "I-I cant find anything that I want to eat! Everything I eat makes me nauseous! Im telling you, being pregnant is no piece of cakeooh! Cake! (Chandler shrugs, and Phoebe grimaces.) No."}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Aww, honey Im sorry."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "God! Ooh! What is that smell? Its coming from the bathroom. Ooh! (She goes to the bathroom.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Wow! Pregnancy does give you some weird cravings."}, {"line_number": 7, "type": "narration", "text": "[Cut to the bathroom, Joey is taking a shower and Phoebe knocks on the door.]"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Yeah?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Its me. Its Phoebe. Listen theres something in here I want to eat, what-what smells so good?"}, {"line_number": 10, "type": "action", "text": "(Joey sticks his head out of the shower curtain.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Is it the shampoo? Its guava."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "(she smells his head) No!"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Oh! Wait-wait! (Reaches inside the shower.) Is it my bologna sandwich?"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Yes. Yes. Yes. I cant believe it! The baby wants bologna! Maybe he wants me to eat meat? I cant eat meat!"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Oh, wait-wait! (Reaches into the shower again.) Maybe its a pickle?!"}, {"line_number": 16, "type": "action", "text": "(Phoebe grimaces at the smell.)"}, {"line_number": 17, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 3, "scene_id": "S04E16_003", "location": "Central Perk", "scene_description": "Chandler, Monica, Joey and Rachel are there. Rachel is writing something on a pad, and then crumples it up and throws it on the floor.", "characters": ["All", "Chandler", "Emily", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E16/scenes/S04E16_003", "raw_text": "[Scene: Central Perk, Chandler, Monica, Joey and Rachel are there. Rachel is writing something on a pad, and then crumples it up and throws it on the floor.]\nChandler: What are you writing?\nRachel: Well, Joshuas coming in tomorrow and since I dont have the guts to ask him out, Im going to sell him a coat and put this note in the pocket.\nChandler: Oh yeah? (He grabs the pad and starts reading it.) Joshua, give me a call sometime, guys like you (Pause) never go out of stylewhat did you throw away?\n(Ross and Emily enter.)\nChandler: Hi guys!\nAll: Hey!\nJoey: Hey, what have you guys been up too?\nRoss: Oh, we went to see a collection of Victorian doorknobs and the Cupert-Hewitt museum.\nChandler: Without me?!\nEmily: My uncle dragged us there. But, it actually it turned out to be really interesting.\nRoss: Yeah.\nEmily: They were so ornate and beautiful, I mean look at that! (Shows them a doorknob she has.)\nMonica: I dont know how museums work in England but, here, youre not supposed to take stuff.\nEmily: I uh, I got it from the gift shop. They have really lax security there. (Chandler is shocked.) Its a joke. (They all laugh.)\nRoss: Bye. (They kiss.)\nEmily: Right, Ive got to be off, Ill see ya. Buh-bye then. (She leaves.)\nJoey: Wow! You guys seem to be having a good time.\nRoss: Oh yeah, shes-shes amazing. And-and shes so much fun. And! Yknow what? When Im with her, Im fun! I even signed up for helicopter classes. (Chandler is shocked.) Shes leaving in two days, I dont have to do it.\nMonica: Oh no, two days, you must be bummed.\nRoss: Yeah, shes got to go back to London. But you know what? Ive been prepared for this from the start. We both knew we had two weeks together, and thats it. Yknow.\nJoey: Hey thats what all my relationships are like.\nChandler: Yes, but in Rosss case, they both know in two weeks thats it.\n(Phoebe enters.)\nRoss: Pheebs!\nAll: Hey!\nRoss: (starts rubbing her belly) Hello! Hello!\nPhoebe: (angered by the rubbing) Yes! I know! I know! Yeah! So the baby is totally craving meat. This afternoon I tried tricking it, I made it a soy-burger to make it think it was getting meat, yknow? And I got nauseous.\nChandler: Maybe thats because soy-burgers suck!\nPhoebe: Being pregnant is tough on your tummy.\nJoey: Hey, but at least you got that cool, pregnant lady glow.\nPhoebe: Thats sweat. You throw up all morning, youll have that glow too.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler, Monica, Joey and Rachel are there. Rachel is writing something on a pad, and then crumples it up and throws it on the floor.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "What are you writing?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Well, Joshuas coming in tomorrow and since I dont have the guts to ask him out, Im going to sell him a coat and put this note in the pocket."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Oh yeah? (He grabs the pad and starts reading it.) Joshua, give me a call sometime, guys like you (Pause) never go out of stylewhat did you throw away?"}, {"line_number": 5, "type": "action", "text": "(Ross and Emily enter.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Hi guys!"}, {"line_number": 7, "type": "dialogue", "speaker": "All", "text": "Hey!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Hey, what have you guys been up too?"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Oh, we went to see a collection of Victorian doorknobs and the Cupert-Hewitt museum."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Without me?!"}, {"line_number": 11, "type": "dialogue", "speaker": "Emily", "text": "My uncle dragged us there. But, it actually it turned out to be really interesting."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 13, "type": "dialogue", "speaker": "Emily", "text": "They were so ornate and beautiful, I mean look at that! (Shows them a doorknob she has.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "I dont know how museums work in England but, here, youre not supposed to take stuff."}, {"line_number": 15, "type": "dialogue", "speaker": "Emily", "text": "I uh, I got it from the gift shop. They have really lax security there. (Chandler is shocked.) Its a joke. (They all laugh.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Bye. (They kiss.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Emily", "text": "Right, Ive got to be off, Ill see ya. Buh-bye then. (She leaves.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Wow! You guys seem to be having a good time."}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Oh yeah, shes-shes amazing. And-and shes so much fun. And! Yknow what? When Im with her, Im fun! I even signed up for helicopter classes. (Chandler is shocked.) Shes leaving in two days, I dont have to do it."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Oh no, two days, you must be bummed."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Yeah, shes got to go back to London. But you know what? Ive been prepared for this from the start. We both knew we had two weeks together, and thats it. Yknow."}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Hey thats what all my relationships are like."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Yes, but in Rosss case, they both know in two weeks thats it."}, {"line_number": 24, "type": "action", "text": "(Phoebe enters.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Pheebs!"}, {"line_number": 26, "type": "dialogue", "speaker": "All", "text": "Hey!"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "(starts rubbing her belly) Hello! Hello!"}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "(angered by the rubbing) Yes! I know! I know! Yeah! So the baby is totally craving meat. This afternoon I tried tricking it, I made it a soy-burger to make it think it was getting meat, yknow? And I got nauseous."}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "Maybe thats because soy-burgers suck!"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Being pregnant is tough on your tummy."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Hey, but at least you got that cool, pregnant lady glow."}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "Thats sweat. You throw up all morning, youll have that glow too."}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 4, "scene_id": "S04E16_004", "location": "Bloomingdales", "scene_description": "Rachel is preparing to slip Joshua the note.", "characters": ["Joshua", "Rachel"], "firestore_path": "/episodes/S04E16/scenes/S04E16_004", "raw_text": "[Scene: Bloomingdales, Rachel is preparing to slip Joshua the note.]\nJoshua: (coming in from a changing room) Okay!\nRachel: Oh, heres that trench-coat that you wanted.\nJoshua: Oh great! (He tries on the coat.) Wow! Yeah, its comfortable. \nRachel: Yeah?\nJoshua: Man, I could really flash somebody in this thing. (He goes to put his hands in his pockets.)\nRachel: (stopping him) Oh no-no, no-no, they dont want you to put your hands in the pockets until you are out of the store.\nJoshua: Why not?!\nRachel: Well, thats because of a lot of(She imitates someone picking their nose and placing the treasure found in the pockets.)\nJoshua: Yknow, they ruin it for everybody.\nRachel: I know!\nJoshua: Yknow, I wore that cashmere sweater on a date last night.\nRachel: Oh?\nJoshua: Yeah, it was my first date since the uh, since the divorce.\nRachel: Well, congratulations, so do you love her?\nJoshua: No, no, no, shes nice but, yknow, it just it made me realize that Im just not, Im just not ready to be dating, yknow?\nRachel: Huh. Well, uh, thats uh, thats interesting. (She goes over and retrieves her note.)\nJoshua: (noticing her) Hey-whoa-hey-hey, what was that?\nRachel: Oh, its just an anti-theft device.\nJoshua: Then uh, whats-whats this? (Shows her the real anti-theft device.)\nRachel: You need that, you need that too cause obviously, a thief could just tear this up. (Rips up the note.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Bloomingdales, Rachel is preparing to slip Joshua the note.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joshua", "text": "(coming in from a changing room) Okay!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Oh, heres that trench-coat that you wanted."}, {"line_number": 4, "type": "dialogue", "speaker": "Joshua", "text": "Oh great! (He tries on the coat.) Wow! Yeah, its comfortable. "}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Yeah?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joshua", "text": "Man, I could really flash somebody in this thing. (He goes to put his hands in his pockets.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "(stopping him) Oh no-no, no-no, they dont want you to put your hands in the pockets until you are out of the store."}, {"line_number": 8, "type": "dialogue", "speaker": "Joshua", "text": "Why not?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Well, thats because of a lot of(She imitates someone picking their nose and placing the treasure found in the pockets.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joshua", "text": "Yknow, they ruin it for everybody."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "I know!"}, {"line_number": 12, "type": "dialogue", "speaker": "Joshua", "text": "Yknow, I wore that cashmere sweater on a date last night."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Oh?"}, {"line_number": 14, "type": "dialogue", "speaker": "Joshua", "text": "Yeah, it was my first date since the uh, since the divorce."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Well, congratulations, so do you love her?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joshua", "text": "No, no, no, shes nice but, yknow, it just it made me realize that Im just not, Im just not ready to be dating, yknow?"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Huh. Well, uh, thats uh, thats interesting. (She goes over and retrieves her note.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Joshua", "text": "(noticing her) Hey-whoa-hey-hey, what was that?"}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Oh, its just an anti-theft device."}, {"line_number": 20, "type": "dialogue", "speaker": "Joshua", "text": "Then uh, whats-whats this? (Shows her the real anti-theft device.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "You need that, you need that too cause obviously, a thief could just tear this up. (Rips up the note.)"}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 5, "scene_id": "S04E16_005", "location": "Monica and Rachel's erm", "scene_description": "Chandler and Joey's, Ross is writing on the Magna-Doodle as Rachel enters.", "characters": ["All", "Chandler", "Chandler and Joey", "Emily", "Joey", "Joshua", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E16/scenes/S04E16_005", "raw_text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, Ross is writing on the Magna-Doodle as Rachel enters.]\nRachel: Oops, sorry. Listen, we-we have to have a party tonight! Actually, we have to have one in five minutes, so everybody cancel your plans.\nChandler: What are you talking about?\nJoey: Yeah, what going on?\nRachel: We have to have a surprise Bon Voyage party for Emily. But its actually for Joshua. (Starts handing out party hats.) Look, he said hes not ready to date, so I had to invite him to a party if I wanted to see him outside of work, and now I have the perfect opportunity to seduce him! (Hands Ross a party hat.)\nRoss: Well, as much as Id like to meet Josh and warn him, Emily and I arent going to be here. All right? I mean, shes going to come by first to say good-bye, and then Ive got a whole special evening planned. So Im sorry, no party.\nJoey: Awwww!\nEmily: (entering) Hello?\nRachel: Surprise!!!\nChandler and Joey: Surprise!! \nEmily: No ones ever thrown me a surprise party before!\nRachel: Well, it was all Rosss idea.\nEmily: Youre so sweet! And Im so surprised!\nRoss: You really didnt know?\n[Cut to later, the party is in full swing. Rachel is in the kitchen and Chandler goes over to talk to her.]\nChandler: Why are you in here if Joshua is all the way over there? (Points to the living room.)\nRachel: Uhh, because Im trying to play hard to get. Oh, quick hes looking over here, say something funny.\nChandler: Like what?\n(Rachel laughs hysterically.)\nJoey: What-what-what is so funny?\nChandler: I said, \"Like what?\"\nJoey: Now thats a thinker.\nRachel: Okay, yknow what, yknow what? This playing hard to get thing is not working. Umm, hand-hand me those cherries. (Chandler does so.) Okay. Okay. (She does a little sexy walk over to where Joshua is standing.) Hi!\nJoshua: Hi!\nRachel: Care for a cherry?\nJoshua: Oh, no thanks.\nRachel: No? Yknow, I can tie one of these into a knot using just my tongue. \n(She tries to demonstrate this unique ability, but only succeeds in choking on it.)\nJoshua: You okay? (Rachel swallowed it whole and is not hacking like a heavy smoker in the morning.) You all right? (Rachel walks away, coughing.)\nRoss: (interrupting Monica and Emily) So we should probably get going soon.\nEmily: Oh, but the partys only just getting started!\nRoss: Yeah, but we-we have to be at the Four Seasons for drinks in 15 minutes and then yknow, then The Plaza for dinner.\nEmily: So why did you plan a party at the same time?\nRoss: No-no-no, no, umm, actually American surprise parties are-are-are very short. Its usually, \"Surprise!\" And then, \"Oh my God, Im so surprisedgood-bye!\"\nEmily: But Ross, Im such having a great time! Your sister has just been telling me that you used to dress up like little, old ladies and hold make-believe tea parties.\nRoss: Monica said that did she? (He squeezes Monicas knee really hardly and Monica winces in pain.)\n[Cut to Joey and Phoebe in the kitchen. Phoebe is watching Joey make a sandwich.]\nPhoebe: Ooh, yeah. Then what are you going to put on top of that?\nJoey: A little salami. \nPhoebe: Ooh yeah! Then umm, what goes on top of the salami?\nJoey: Pastrami. \nPhoebe: Oooh, yeah. Youre a genius.\n(Rachel enters, she has changed clothes.)\nRachel: Oh, could somebody give me a hand with this zipper?\nJoey: Yeah. (He goes over to her.)\nRachel: Up!\nMonica: You changed?\nRachel: Yeah, I did. I needed my lucky dress.\nMonica: And lucky means, more cleavage? \nChandler: Does for me.\n(Joey starts wiping lint off of her back, but goes at little too far and Rachel just glares at him. He stops, gives her the okay symbol and walks away.)\nRachel: Ohh, God! Look at him, hes so cute. I wanna go over there, grab him, and kiss him! How can I kiss him and not letting him know that I like him?\nJoey: Oh! I know how you can get him, take off your bra.\nRachel: What?\nJoey: There was a seen in Footloose...\nChandler: Flashdance.\nJoey: Yeah-yeah, yeah, with that-that uh, plumber girl\nChandler: She was a welder.\nJoey: What? Were you like in the movie, or Anyway, she takes off her bra under her shirt and pulls it out the sleeve. Very sexy, and classy.\nMonica: Or if you want to kiss him, umm, you could use mistletoe.\nRachel: Its not Christmas!\nMonica: Or Spin the Bottle?\nRachel: Hes not 11!\nEmily: (with her coat on, shes leaving with Ross) Thank you so much for this. It was really so thoughtful of you.\nRachel: What? Youre leaving?!\nRoss: Yes, we have something we have to get to.\nJoshua: Uhh, yeah, I think Im going to take-off too.\nRachel: No! You guys cant leave yet! You have to stay, we-we got the whole big thing planned!\nRoss: What big thing?\n[Cut to later, the whole group is seated on the floor and Rachel is explaining the rules of Spin the Bottle.]\nRachel: (spinning the bottle) So, Spin the Bottle works like this: I spin the bottle, it lands on Gunther, so I would have to kiss Gunther. (She crawls over to where Gunther is sitting and sees the look of anticipation on Gunthers face and decides not to kiss him.) All right. Who wants to go first?\nEmily: Ill go.\nAll: Yay!\n(Emily spins the bottle and it lands on Joey.)\nJoey: Welcome to America. (They both kiss.)\n(Joey spins the bottle and it lands on Emily.)\nMonica: Two in a row! Youve got to use your tongues now! (They kiss again.)\nRachel: Yay! Emily! \n(Emily spins the bottle and once again, it lands on Joey.)\nChandler: What are the odds? What are the odds?\n(They both move to kiss again.)\nRoss: (stopping them) Okay, that-thats enough! Yknow, lets, lets let someone else play.\nJoey: If you didnt want to play, why did you come to the party?\nRachel: Okay, my turn!!\n(Rachel spins the bottle and it lands on.wait for it.Joshua. (You thought I was going to say Ross, didnt you?) Rachel squeals in delight and starts a slow sexy crawl over to Joshua, making sure he and everyone else watching gets a good look at her cleavage.)\nPhoebe: Oh my God!! The baby just kicked!\nAll: Ohh!\nRachel: Its okay! Its okay! It kicked once, itll kick again!\nAll: Oh my God!\n(They all stand up and go over to Phoebe to feel the baby, preventing Rachel from kissing Joshua.)\nRachel: All right, well, everybody just remember where they were sitting. \n(She crawls over to Joshua and kisses the back of his knee. He feels it and looks down, Rachel pretends shes knocking a bug off his leg.)\nRachel: Just a bug.\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, Ross is writing on the Magna-Doodle as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Oops, sorry. Listen, we-we have to have a party tonight! Actually, we have to have one in five minutes, so everybody cancel your plans."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "What are you talking about?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Yeah, what going on?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "We have to have a surprise Bon Voyage party for Emily. But its actually for Joshua. (Starts handing out party hats.) Look, he said hes not ready to date, so I had to invite him to a party if I wanted to see him outside of work, and now I have the perfect opportunity to seduce him! (Hands Ross a party hat.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Well, as much as Id like to meet Josh and warn him, Emily and I arent going to be here. All right? I mean, shes going to come by first to say good-bye, and then Ive got a whole special evening planned. So Im sorry, no party."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Awwww!"}, {"line_number": 8, "type": "dialogue", "speaker": "Emily", "text": "(entering) Hello?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Surprise!!!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler and Joey", "text": "Surprise!! "}, {"line_number": 11, "type": "dialogue", "speaker": "Emily", "text": "No ones ever thrown me a surprise party before!"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Well, it was all Rosss idea."}, {"line_number": 13, "type": "dialogue", "speaker": "Emily", "text": "Youre so sweet! And Im so surprised!"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "You really didnt know?"}, {"line_number": 15, "type": "narration", "text": "[Cut to later, the party is in full swing. Rachel is in the kitchen and Chandler goes over to talk to her.]"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Why are you in here if Joshua is all the way over there? (Points to the living room.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Uhh, because Im trying to play hard to get. Oh, quick hes looking over here, say something funny."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Like what?"}, {"line_number": 19, "type": "action", "text": "(Rachel laughs hysterically.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "What-what-what is so funny?"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "I said, \"Like what?\""}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Now thats a thinker."}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Okay, yknow what, yknow what? This playing hard to get thing is not working. Umm, hand-hand me those cherries. (Chandler does so.) Okay. Okay. (She does a little sexy walk over to where Joshua is standing.) Hi!"}, {"line_number": 24, "type": "dialogue", "speaker": "Joshua", "text": "Hi!"}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "Care for a cherry?"}, {"line_number": 26, "type": "dialogue", "speaker": "Joshua", "text": "Oh, no thanks."}, {"line_number": 27, "type": "dialogue", "speaker": "Rachel", "text": "No? Yknow, I can tie one of these into a knot using just my tongue. "}, {"line_number": 28, "type": "action", "text": "(She tries to demonstrate this unique ability, but only succeeds in choking on it.)"}, {"line_number": 29, "type": "dialogue", "speaker": "Joshua", "text": "You okay? (Rachel swallowed it whole and is not hacking like a heavy smoker in the morning.) You all right? (Rachel walks away, coughing.)"}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "(interrupting Monica and Emily) So we should probably get going soon."}, {"line_number": 31, "type": "dialogue", "speaker": "Emily", "text": "Oh, but the partys only just getting started!"}, {"line_number": 32, "type": "dialogue", "speaker": "Ross", "text": "Yeah, but we-we have to be at the Four Seasons for drinks in 15 minutes and then yknow, then The Plaza for dinner."}, {"line_number": 33, "type": "dialogue", "speaker": "Emily", "text": "So why did you plan a party at the same time?"}, {"line_number": 34, "type": "dialogue", "speaker": "Ross", "text": "No-no-no, no, umm, actually American surprise parties are-are-are very short. Its usually, \"Surprise!\" And then, \"Oh my God, Im so surprisedgood-bye!\""}, {"line_number": 35, "type": "dialogue", "speaker": "Emily", "text": "But Ross, Im such having a great time! Your sister has just been telling me that you used to dress up like little, old ladies and hold make-believe tea parties."}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Monica said that did she? (He squeezes Monicas knee really hardly and Monica winces in pain.)"}, {"line_number": 37, "type": "narration", "text": "[Cut to Joey and Phoebe in the kitchen. Phoebe is watching Joey make a sandwich.]"}, {"line_number": 38, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh, yeah. Then what are you going to put on top of that?"}, {"line_number": 39, "type": "dialogue", "speaker": "Joey", "text": "A little salami. "}, {"line_number": 40, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh yeah! Then umm, what goes on top of the salami?"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "Pastrami. "}, {"line_number": 42, "type": "dialogue", "speaker": "Phoebe", "text": "Oooh, yeah. Youre a genius."}, {"line_number": 43, "type": "action", "text": "(Rachel enters, she has changed clothes.)"}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Oh, could somebody give me a hand with this zipper?"}, {"line_number": 45, "type": "dialogue", "speaker": "Joey", "text": "Yeah. (He goes over to her.)"}, {"line_number": 46, "type": "dialogue", "speaker": "Rachel", "text": "Up!"}, {"line_number": 47, "type": "dialogue", "speaker": "Monica", "text": "You changed?"}, {"line_number": 48, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I did. I needed my lucky dress."}, {"line_number": 49, "type": "dialogue", "speaker": "Monica", "text": "And lucky means, more cleavage? "}, {"line_number": 50, "type": "dialogue", "speaker": "Chandler", "text": "Does for me."}, {"line_number": 51, "type": "action", "text": "(Joey starts wiping lint off of her back, but goes at little too far and Rachel just glares at him. He stops, gives her the okay symbol and walks away.)"}, {"line_number": 52, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, God! Look at him, hes so cute. I wanna go over there, grab him, and kiss him! How can I kiss him and not letting him know that I like him?"}, {"line_number": 53, "type": "dialogue", "speaker": "Joey", "text": "Oh! I know how you can get him, take off your bra."}, {"line_number": 54, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 55, "type": "dialogue", "speaker": "Joey", "text": "There was a seen in Footloose..."}, {"line_number": 56, "type": "dialogue", "speaker": "Chandler", "text": "Flashdance."}, {"line_number": 57, "type": "dialogue", "speaker": "Joey", "text": "Yeah-yeah, yeah, with that-that uh, plumber girl"}, {"line_number": 58, "type": "dialogue", "speaker": "Chandler", "text": "She was a welder."}, {"line_number": 59, "type": "dialogue", "speaker": "Joey", "text": "What? Were you like in the movie, or Anyway, she takes off her bra under her shirt and pulls it out the sleeve. Very sexy, and classy."}, {"line_number": 60, "type": "dialogue", "speaker": "Monica", "text": "Or if you want to kiss him, umm, you could use mistletoe."}, {"line_number": 61, "type": "dialogue", "speaker": "Rachel", "text": "Its not Christmas!"}, {"line_number": 62, "type": "dialogue", "speaker": "Monica", "text": "Or Spin the Bottle?"}, {"line_number": 63, "type": "dialogue", "speaker": "Rachel", "text": "Hes not 11!"}, {"line_number": 64, "type": "dialogue", "speaker": "Emily", "text": "(with her coat on, shes leaving with Ross) Thank you so much for this. It was really so thoughtful of you."}, {"line_number": 65, "type": "dialogue", "speaker": "Rachel", "text": "What? Youre leaving?!"}, {"line_number": 66, "type": "dialogue", "speaker": "Ross", "text": "Yes, we have something we have to get to."}, {"line_number": 67, "type": "dialogue", "speaker": "Joshua", "text": "Uhh, yeah, I think Im going to take-off too."}, {"line_number": 68, "type": "dialogue", "speaker": "Rachel", "text": "No! You guys cant leave yet! You have to stay, we-we got the whole big thing planned!"}, {"line_number": 69, "type": "dialogue", "speaker": "Ross", "text": "What big thing?"}, {"line_number": 70, "type": "narration", "text": "[Cut to later, the whole group is seated on the floor and Rachel is explaining the rules of Spin the Bottle.]"}, {"line_number": 71, "type": "dialogue", "speaker": "Rachel", "text": "(spinning the bottle) So, Spin the Bottle works like this: I spin the bottle, it lands on Gunther, so I would have to kiss Gunther. (She crawls over to where Gunther is sitting and sees the look of anticipation on Gunthers face and decides not to kiss him.) All right. Who wants to go first?"}, {"line_number": 72, "type": "dialogue", "speaker": "Emily", "text": "Ill go."}, {"line_number": 73, "type": "dialogue", "speaker": "All", "text": "Yay!"}, {"line_number": 74, "type": "action", "text": "(Emily spins the bottle and it lands on Joey.)"}, {"line_number": 75, "type": "dialogue", "speaker": "Joey", "text": "Welcome to America. (They both kiss.)"}, {"line_number": 76, "type": "action", "text": "(Joey spins the bottle and it lands on Emily.)"}, {"line_number": 77, "type": "dialogue", "speaker": "Monica", "text": "Two in a row! Youve got to use your tongues now! (They kiss again.)"}, {"line_number": 78, "type": "dialogue", "speaker": "Rachel", "text": "Yay! Emily! "}, {"line_number": 79, "type": "action", "text": "(Emily spins the bottle and once again, it lands on Joey.)"}, {"line_number": 80, "type": "dialogue", "speaker": "Chandler", "text": "What are the odds? What are the odds?"}, {"line_number": 81, "type": "action", "text": "(They both move to kiss again.)"}, {"line_number": 82, "type": "dialogue", "speaker": "Ross", "text": "(stopping them) Okay, that-thats enough! Yknow, lets, lets let someone else play."}, {"line_number": 83, "type": "dialogue", "speaker": "Joey", "text": "If you didnt want to play, why did you come to the party?"}, {"line_number": 84, "type": "dialogue", "speaker": "Rachel", "text": "Okay, my turn!!"}, {"line_number": 85, "type": "action", "text": "(Rachel spins the bottle and it lands on.wait for it.Joshua. (You thought I was going to say Ross, didnt you?) Rachel squeals in delight and starts a slow sexy crawl over to Joshua, making sure he and everyone else watching gets a good look at her cleavage.)"}, {"line_number": 86, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God!! The baby just kicked!"}, {"line_number": 87, "type": "dialogue", "speaker": "All", "text": "Ohh!"}, {"line_number": 88, "type": "dialogue", "speaker": "Rachel", "text": "Its okay! Its okay! It kicked once, itll kick again!"}, {"line_number": 89, "type": "dialogue", "speaker": "All", "text": "Oh my God!"}, {"line_number": 90, "type": "action", "text": "(They all stand up and go over to Phoebe to feel the baby, preventing Rachel from kissing Joshua.)"}, {"line_number": 91, "type": "dialogue", "speaker": "Rachel", "text": "All right, well, everybody just remember where they were sitting. "}, {"line_number": 92, "type": "action", "text": "(She crawls over to Joshua and kisses the back of his knee. He feels it and looks down, Rachel pretends shes knocking a bug off his leg.)"}, {"line_number": 93, "type": "dialogue", "speaker": "Rachel", "text": "Just a bug."}, {"line_number": 94, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 6, "scene_id": "S04E16_006", "location": "Monica and Rachel's erm", "scene_description": "Chandler and Joey's, it is later in the party. The Spin the Bottle game is over and Chandler is making a sandwich as Phoebe watches.", "characters": ["All", "Chandler", "Emily", "Gunther", "Joey", "Joey and Monica", "Joshua", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S04E16/scenes/S04E16_006", "raw_text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, it is later in the party. The Spin the Bottle game is over and Chandler is making a sandwich as Phoebe watches.]\nPhoebe: Yknow it doesnt matter how much Im craving it. Yknow why Im never gonna eat meat? Because its murder, cold blooded murder.\nChandler: Okay. \n(He takes a bite out of the sandwich and as he does so, Phoebe attacks the other end and starts devouring the sandwich.)\nChandler: Theres a Phoebe on my sandwich! (He walks away, giving the sandwich to Phoebe.)\nJoey: Phoebe, what-what are you doing?!\nPhoebe: I cant help it. I need the meat. The baby needs the meat.\nJoey: All right look, yknow how-yknow how when youre dating someone and you dont want to cheat on them, unless its with someone really hot?\nPhoebe: Yeah, totally!\nJoey: All right. Okay. Well this is the same kind of deal. If youre going to do something wrong, (He grabs two steaks from the freezer) do it right!\n[Cut to later, Phoebe is finishing off her steak.]\nJoey: Feel better now?\nPhoebe: Yeah, but at what cost? Six more months, three meals a day, Im gonna eat like, yknow millions of cows.\nJoey: Hey, what if I said, I could even things out for ya, meatwise.\nPhoebe: What?\nJoey: Well, I eat a lot of meat right?\nPhoebe: Yeah.\nJoey: Well, suppose until the babys born I laid off it. No extra animals would die, you-youd just be eating my animals.\nPhoebe: Joey, I cant believe you would do that for me.\nJoey: Absolutely! I could be a vegetarian. Theres no meat in beer, right?\n[Cut to Ross and Emily standing by the foosball table.]\nRoss: Okay, we could still make dinner if we skipped the appetisers and asked for our check right away.\n(Rachel enters, she has changed once again. This time into her high school cheerleading uniform.)\nEmily: But, we cant go now. It looks like Rachels gonna put on a skit.\nMonica: Oh my God! Have you lost your mind?\nRachel: No-n-n-n-no! I am finally thinking clearly. My lucky dress wasnt working out to well for me, but for four years, this baby never missed.\nMonica: Rachel-Rachel-Rachel I-I cannot, I cant let(pause), actually I kinda want to see what happens.\nJoshua: Hey!\nRachel: Hi!\nJoshua: Nice uh, costume.\nRachel: Ohh, yeah, well I wanted to give Emily a big American good-bye cheer. So okay! (Runs into the living room) Ready! Okay! Gimme an E!\nAll: E!\nRachel: Gimme an M!\nAll: M!\nRachel: Gimme an I!\nAll: I!\nRachel: Gimme an L!\nAll: L!\nRachel: Gimme a Y!\nAll: Y!\nRachel: What do you get? (She throws her pom-poms to Joey and Phoebe and performs a cartwheel.) Emily!! (Tries to do another one.) EmilWhoa!! (She falls in Chandlers room.) Okay! So thats me as a cheerleader! Ta-dum! (Gunthers the only one that claps.)\n(Joey and Monica rush over to her.)\nJoey and Monica: Are you all right?\nRachel: Im fine! Im fine! Im just losing a tooth, its no big deal. I have a dentist! Yknow. Im gonna go put some ice on it. Excuse me. (She goes over to the ice and Joey and Monica follow her.) What do I do now? What do I do now?\nMonica: I think youre done.\nJoey: Okay, time to take off the bra. (She glares at him.)\nJoshua: Umm, that was really great, but I-I gotta take-off actually.\nJoey: (trying not to be obvious) Take the bra off.\nRachel: All right, come on, lets go get your coat.\nJoshua: Okay.\n(They both go to Chandlers bedroom to get his coat.)\n[Cut to Gunther and Emily.]\nGunther: Rachel is my girlfriend.\n[Cut to Chandlers bedroom.]\nJoshua: So, this was uh, really fun.\nRachel: Oh, yeah! Real fun. (She makes a decision.) Yknow, this bra Really, bothers me. (She starts taking off her bra.) Yknow, this used to be my bedroom. Yeah. A lot of memories in here, a lot of memories. If these walls could talk, yknow what theyd say? Wanna hear some memories? (She is now violently pulling on her bra in order to remove it, but it isnt co-operating.)\nJoshua: Need uh, need a little hand there.\nRachel: Oh no-no-no! No, I got this all under control.\nJoshua: You really dont seem like you do. Thats\n(She is still yanking on the bra, but it is stuck in her sleeve. Finally, she gives up.)\nRachel: Ughhhh!! Forget it! (Sits down heavily on the bed.) This is, this is not how this is supposed to happen.\nJoshua: Well, what was supposed to happen?\nRachel: Can you not look at me when I say this? (He turns around) I thought that if I could get you here, I could seduce you.\nJoshua: Huh. Oh, boy! (Sits down next to her.) Uhh, I-I dont wear suits to work, and I bought six of them from you.\nRachel: Well, Im sorry, I thought you needed them!\nJoshua: No, no-no, no-no, my point is that I kept coming back because, I wanted to see you.\nRachel: Why?!\nJoshua: Because I-I like you.\nRachel: You like me?\nJoshua: Yeah! I mean youre-youre beautiful and smart and sophisticateda lot of this isnt based on tonight.\nRachel: Yeah but-but-but you liked me! Oh my God, I cant believe this, all this time, I liked you and you liked me!\nJoshua: But\nRachel: Oh no-no-no dont say but! No-no, buts never good! Lets just leave it at, you like me and I like you.\nJoshua: Okay uh, however\nRachel: Oh, now see thats a fancy but.\nJoshua: My marriage like just ended, and Im really not ready to get into anything yet.\nRachel: But.\nJoshua: Im sorry, I, I just need a little time.\nRachel: Okay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, it is later in the party. The Spin the Bottle game is over and Chandler is making a sandwich as Phoebe watches.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Yknow it doesnt matter how much Im craving it. Yknow why Im never gonna eat meat? Because its murder, cold blooded murder."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Okay. "}, {"line_number": 4, "type": "action", "text": "(He takes a bite out of the sandwich and as he does so, Phoebe attacks the other end and starts devouring the sandwich.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Theres a Phoebe on my sandwich! (He walks away, giving the sandwich to Phoebe.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Phoebe, what-what are you doing?!"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "I cant help it. I need the meat. The baby needs the meat."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "All right look, yknow how-yknow how when youre dating someone and you dont want to cheat on them, unless its with someone really hot?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, totally!"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "All right. Okay. Well this is the same kind of deal. If youre going to do something wrong, (He grabs two steaks from the freezer) do it right!"}, {"line_number": 11, "type": "narration", "text": "[Cut to later, Phoebe is finishing off her steak.]"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Feel better now?"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, but at what cost? Six more months, three meals a day, Im gonna eat like, yknow millions of cows."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Hey, what if I said, I could even things out for ya, meatwise."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Well, I eat a lot of meat right?"}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Well, suppose until the babys born I laid off it. No extra animals would die, you-youd just be eating my animals."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Joey, I cant believe you would do that for me."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Absolutely! I could be a vegetarian. Theres no meat in beer, right?"}, {"line_number": 21, "type": "narration", "text": "[Cut to Ross and Emily standing by the foosball table.]"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Okay, we could still make dinner if we skipped the appetisers and asked for our check right away."}, {"line_number": 23, "type": "action", "text": "(Rachel enters, she has changed once again. This time into her high school cheerleading uniform.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Emily", "text": "But, we cant go now. It looks like Rachels gonna put on a skit."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! Have you lost your mind?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "No-n-n-n-no! I am finally thinking clearly. My lucky dress wasnt working out to well for me, but for four years, this baby never missed."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Rachel-Rachel-Rachel I-I cannot, I cant let(pause), actually I kinda want to see what happens."}, {"line_number": 28, "type": "dialogue", "speaker": "Joshua", "text": "Hey!"}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 30, "type": "dialogue", "speaker": "Joshua", "text": "Nice uh, costume."}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, yeah, well I wanted to give Emily a big American good-bye cheer. So okay! (Runs into the living room) Ready! Okay! Gimme an E!"}, {"line_number": 32, "type": "dialogue", "speaker": "All", "text": "E!"}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Gimme an M!"}, {"line_number": 34, "type": "dialogue", "speaker": "All", "text": "M!"}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "Gimme an I!"}, {"line_number": 36, "type": "dialogue", "speaker": "All", "text": "I!"}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Gimme an L!"}, {"line_number": 38, "type": "dialogue", "speaker": "All", "text": "L!"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Gimme a Y!"}, {"line_number": 40, "type": "dialogue", "speaker": "All", "text": "Y!"}, {"line_number": 41, "type": "dialogue", "speaker": "Rachel", "text": "What do you get? (She throws her pom-poms to Joey and Phoebe and performs a cartwheel.) Emily!! (Tries to do another one.) EmilWhoa!! (She falls in Chandlers room.) Okay! So thats me as a cheerleader! Ta-dum! (Gunthers the only one that claps.)"}, {"line_number": 42, "type": "action", "text": "(Joey and Monica rush over to her.)"}, {"line_number": 43, "type": "dialogue", "speaker": "Joey and Monica", "text": "Are you all right?"}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Im fine! Im fine! Im just losing a tooth, its no big deal. I have a dentist! Yknow. Im gonna go put some ice on it. Excuse me. (She goes over to the ice and Joey and Monica follow her.) What do I do now? What do I do now?"}, {"line_number": 45, "type": "dialogue", "speaker": "Monica", "text": "I think youre done."}, {"line_number": 46, "type": "dialogue", "speaker": "Joey", "text": "Okay, time to take off the bra. (She glares at him.)"}, {"line_number": 47, "type": "dialogue", "speaker": "Joshua", "text": "Umm, that was really great, but I-I gotta take-off actually."}, {"line_number": 48, "type": "dialogue", "speaker": "Joey", "text": "(trying not to be obvious) Take the bra off."}, {"line_number": 49, "type": "dialogue", "speaker": "Rachel", "text": "All right, come on, lets go get your coat."}, {"line_number": 50, "type": "dialogue", "speaker": "Joshua", "text": "Okay."}, {"line_number": 51, "type": "action", "text": "(They both go to Chandlers bedroom to get his coat.)"}, {"line_number": 52, "type": "narration", "text": "[Cut to Gunther and Emily.]"}, {"line_number": 53, "type": "dialogue", "speaker": "Gunther", "text": "Rachel is my girlfriend."}, {"line_number": 54, "type": "narration", "text": "[Cut to Chandlers bedroom.]"}, {"line_number": 55, "type": "dialogue", "speaker": "Joshua", "text": "So, this was uh, really fun."}, {"line_number": 56, "type": "dialogue", "speaker": "Rachel", "text": "Oh, yeah! Real fun. (She makes a decision.) Yknow, this bra Really, bothers me. (She starts taking off her bra.) Yknow, this used to be my bedroom. Yeah. A lot of memories in here, a lot of memories. If these walls could talk, yknow what theyd say? Wanna hear some memories? (She is now violently pulling on her bra in order to remove it, but it isnt co-operating.)"}, {"line_number": 57, "type": "dialogue", "speaker": "Joshua", "text": "Need uh, need a little hand there."}, {"line_number": 58, "type": "dialogue", "speaker": "Rachel", "text": "Oh no-no-no! No, I got this all under control."}, {"line_number": 59, "type": "dialogue", "speaker": "Joshua", "text": "You really dont seem like you do. Thats"}, {"line_number": 60, "type": "action", "text": "(She is still yanking on the bra, but it is stuck in her sleeve. Finally, she gives up.)"}, {"line_number": 61, "type": "dialogue", "speaker": "Rachel", "text": "Ughhhh!! Forget it! (Sits down heavily on the bed.) This is, this is not how this is supposed to happen."}, {"line_number": 62, "type": "dialogue", "speaker": "Joshua", "text": "Well, what was supposed to happen?"}, {"line_number": 63, "type": "dialogue", "speaker": "Rachel", "text": "Can you not look at me when I say this? (He turns around) I thought that if I could get you here, I could seduce you."}, {"line_number": 64, "type": "dialogue", "speaker": "Joshua", "text": "Huh. Oh, boy! (Sits down next to her.) Uhh, I-I dont wear suits to work, and I bought six of them from you."}, {"line_number": 65, "type": "dialogue", "speaker": "Rachel", "text": "Well, Im sorry, I thought you needed them!"}, {"line_number": 66, "type": "dialogue", "speaker": "Joshua", "text": "No, no-no, no-no, my point is that I kept coming back because, I wanted to see you."}, {"line_number": 67, "type": "dialogue", "speaker": "Rachel", "text": "Why?!"}, {"line_number": 68, "type": "dialogue", "speaker": "Joshua", "text": "Because I-I like you."}, {"line_number": 69, "type": "dialogue", "speaker": "Rachel", "text": "You like me?"}, {"line_number": 70, "type": "dialogue", "speaker": "Joshua", "text": "Yeah! I mean youre-youre beautiful and smart and sophisticateda lot of this isnt based on tonight."}, {"line_number": 71, "type": "dialogue", "speaker": "Rachel", "text": "Yeah but-but-but you liked me! Oh my God, I cant believe this, all this time, I liked you and you liked me!"}, {"line_number": 72, "type": "dialogue", "speaker": "Joshua", "text": "But"}, {"line_number": 73, "type": "dialogue", "speaker": "Rachel", "text": "Oh no-no-no dont say but! No-no, buts never good! Lets just leave it at, you like me and I like you."}, {"line_number": 74, "type": "dialogue", "speaker": "Joshua", "text": "Okay uh, however"}, {"line_number": 75, "type": "dialogue", "speaker": "Rachel", "text": "Oh, now see thats a fancy but."}, {"line_number": 76, "type": "dialogue", "speaker": "Joshua", "text": "My marriage like just ended, and Im really not ready to get into anything yet."}, {"line_number": 77, "type": "dialogue", "speaker": "Rachel", "text": "But."}, {"line_number": 78, "type": "dialogue", "speaker": "Joshua", "text": "Im sorry, I, I just need a little time."}, {"line_number": 79, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 7, "scene_id": "S04E16_007", "location": "The hallway", "scene_description": "Ross is sitting on the step drinking a beer as Rachel comes out of the guys apartment.", "characters": ["Chandler", "Joshua", "Rachel", "Ross"], "firestore_path": "/episodes/S04E16/scenes/S04E16_007", "raw_text": "[Scene: The hallway, Ross is sitting on the step drinking a beer as Rachel comes out of the guys apartment.]\nRachel: Ohh, here you are. I was looking for you before. Joshuas gone so you and Emily are free to go.\nRoss: Thats okay. Shes still in there enjoying her fake party and uh, its too late to do any of the things I had planned, so\nRachel: Oh, Ross, Im sorry. I completely ruined your evening.\nRoss: Yeah.\nRachel: Well, if it makes you feel any better, I made a fool out of myself.\nRoss: Helps a little.\nRachel: Is there room on that step for a pathetic loser?\nRoss: Yeah, have a seat.\nRachel: Im so sorry.\nRoss: Thats okay, I mean it was just two-week thing anyway, I just didnt want it to end this way, yknow?\nRachel: Well, maybe you didnt want it to end?\nRoss: What do you mean?\nRachel: You seem to really like her.\nRoss: Yeah, I really do. Yeah, but what am I gonna do, I mean we-we both agreed that it was gonna be a two-week thing, yknow no commitment.\nRachel: Ross, that girl just spent the entire evening talking to your friends, asking to hear stories about you, looking through Monicas photo albums, I mean you dont do that if youre just in it for two weeks.\nRoss: You think?\nRachel: Yeah, you got like 14 hours until she has to be at the airport, and youre sitting here in the hallway with a 28-year-old cheerleader with a fat lip.\nRoss: Hey, youre right.\nRachel: Yeah.\nRoss: Thanks. (He starts to go inside and stops.) What photo album was it?\nRachel: I dont know, it was you and a bunch of albino kids.\nRoss: Oh my God! Those werent albino kids, that was computer camp! Rach! (He hurries inside and Chandler is taking out the garbage.)\nRachel: Hey.\nChandler: Hey.\nRachel: Youre a pathetic loser, right?\nChandler: Oh-ho, yeah!\nRachel: Sit!\n(He does so, and immediately starts looking pathetic.)\nJoshua: Hi. (He has just returned.)\nRachel: Oh my gosh, Joshua!\nJoshua: All those things I said about not being ready\nRachel: Theyre not true?\nJoshua: No, theyre-theyre all true.\nRachel: Oh.\nJoshua: But\nRachel: Oh! Oh, I love that but.\n(They move to kiss, but realise that Chandler is staring at them. Chandler urges them on.)\nRachel: You wanna go inside and have some coffee?\nJoshua: Yeah.\nRachel: Okay. (Joshua goes inside and to Chandler.) Every time.\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The hallway, Ross is sitting on the step drinking a beer as Rachel comes out of the guys apartment.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, here you are. I was looking for you before. Joshuas gone so you and Emily are free to go."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Thats okay. Shes still in there enjoying her fake party and uh, its too late to do any of the things I had planned, so"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Oh, Ross, Im sorry. I completely ruined your evening."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Well, if it makes you feel any better, I made a fool out of myself."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Helps a little."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Is there room on that step for a pathetic loser?"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Yeah, have a seat."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Im so sorry."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Thats okay, I mean it was just two-week thing anyway, I just didnt want it to end this way, yknow?"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Well, maybe you didnt want it to end?"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "What do you mean?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "You seem to really like her."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Yeah, I really do. Yeah, but what am I gonna do, I mean we-we both agreed that it was gonna be a two-week thing, yknow no commitment."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Ross, that girl just spent the entire evening talking to your friends, asking to hear stories about you, looking through Monicas photo albums, I mean you dont do that if youre just in it for two weeks."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "You think?"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, you got like 14 hours until she has to be at the airport, and youre sitting here in the hallway with a 28-year-old cheerleader with a fat lip."}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Hey, youre right."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Thanks. (He starts to go inside and stops.) What photo album was it?"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "I dont know, it was you and a bunch of albino kids."}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "Oh my God! Those werent albino kids, that was computer camp! Rach! (He hurries inside and Chandler is taking out the garbage.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Hey."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Hey."}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Youre a pathetic loser, right?"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "Oh-ho, yeah!"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Sit!"}, {"line_number": 29, "type": "action", "text": "(He does so, and immediately starts looking pathetic.)"}, {"line_number": 30, "type": "dialogue", "speaker": "Joshua", "text": "Hi. (He has just returned.)"}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Oh my gosh, Joshua!"}, {"line_number": 32, "type": "dialogue", "speaker": "Joshua", "text": "All those things I said about not being ready"}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Theyre not true?"}, {"line_number": 34, "type": "dialogue", "speaker": "Joshua", "text": "No, theyre-theyre all true."}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "Oh."}, {"line_number": 36, "type": "dialogue", "speaker": "Joshua", "text": "But"}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Oh! Oh, I love that but."}, {"line_number": 38, "type": "action", "text": "(They move to kiss, but realise that Chandler is staring at them. Chandler urges them on.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "You wanna go inside and have some coffee?"}, {"line_number": 40, "type": "dialogue", "speaker": "Joshua", "text": "Yeah."}, {"line_number": 41, "type": "dialogue", "speaker": "Rachel", "text": "Okay. (Joshua goes inside and to Chandler.) Every time."}, {"line_number": 42, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S04E16", "season": 4, "episode_number": 16, "episode_title": "THE ONE WITH THE FAKE PARTY", "scene_number": 8, "scene_id": "S04E16_008", "location": "Monica and Rachel's erm", "scene_description": "Chandler and Joey's, the next day. Phoebe is busy making a sandwich.", "characters": ["Joey", "Phoebe"], "firestore_path": "/episodes/S04E16/scenes/S04E16_008", "raw_text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, the next day. Phoebe is busy making a sandwich.]\nJoey: Oooh, what you got there?\nPhoebe: Pastrami.\nJoey: Oh-ho-ho, yeah! Hey! Yknow what goes good with that?\nPhoebe: Hm-mm, corn beef.\nJoey: Ooh, I was gonna say bologna, but thats much better. How about a little of that smoked turkey?\nPhoebe: Okay.\nJoey: (He starts looking longingly at the sandwich.) Oh mama! Uh when-when is the baby due?\nPhoebe: Six months.\nJoey: Ugh. Now if a cow should die of natural causes, I can have one of those right?\nPhoebe: Not if I get there first.\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's erm, Chandler and Joey's, the next day. Phoebe is busy making a sandwich.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Oooh, what you got there?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Pastrami."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Oh-ho-ho, yeah! Hey! Yknow what goes good with that?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Hm-mm, corn beef."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Ooh, I was gonna say bologna, but thats much better. How about a little of that smoked turkey?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "(He starts looking longingly at the sandwich.) Oh mama! Uh when-when is the baby due?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Six months."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Ugh. Now if a cow should die of natural causes, I can have one of those right?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Not if I get there first."}, {"line_number": 12, "type": "narration", "text": "End"}]}
