{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 1, "scene_id": "S05E09_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S05E09/scenes/S05E09_001", "raw_text": "THE ONE WITH ROSS'S SANDWICH\nWritten by: Andrew Reich & Ted Cohen Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH ROSS'S SANDWICH"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Andrew Reich & Ted Cohen Transcribed by: Eric Aasen"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 2, "scene_id": "S05E09_002", "location": "Monica and Rachel's", "scene_description": "the entire gang is there, eating breakfast. Phoebe is on the couch, fidgeting.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_002", "raw_text": "[Scene: Monica and Rachel's, the entire gang is there, eating breakfast. Phoebe is on the couch, fidgeting.]\nPhoebe: What am I sitting on?\nChandler: Top of the world? Dock of the bay? (He tries to think of another but can't) I'm out.\nPhoebe: (taking something out of the couch) Ew-eww!! Undies! \n(She throws them into the kitchen and Rachel picks them up with the handle of a large spoon. Chandler and Monica have horrified looks on their faces.)\nRachel: All right! Who's are they? Who's are they?\nRoss: Well, they're not mine!\nChandler: Well, they're Joey's! They gotta be Joey's!\n(Rachel turns and stares at him.)\nJoey: Yeah, they're mine.\nChandler: See? They're Joey's! J-J-J-J-J-Joey's!\nRoss: Why are they here?\nJoey: I don't know uhh (Pause as he thinks about it.) Well, I'm Joey. Yeah, I'm disgusting, I take my underwear off in other people's homes.\nRachel: Well, get 'em out of here! What's wrong with you?\nChandler: Yeah!\nMonica: Yeah!\nRachel: (waving them in his face) Take 'em! (Joey makes a noise and jumps out of the way.) Joey, you can touch them! They're your underwear.\nJoey: (reluctantly taking them) Chandler? A word.\n(Follows Joey into their apartment and shrugs on his way out.)\n[Cut to the guy's apartment.]\nJoey: That's it! I'm tired of covering for you two! This has got to stop! (Realizes he still has the underwear in his hand.) Ahh! (Throws them towards Chandler's room.) And tighty-whiteys! What are you, 8?\nMonica: (entering) Thank you Joey, thank you so much!\nJoey: Oh hey, no, you're not welcome. Okay, look, I hate this! You guys keep embarrassing me! (To Monica) Yesterday, Rachel found your razor in our bathroom and I didn't know what to say, so I said it was mine and-and that I was playing a woman in a play. And one thing led to another and (He puts his leg on the chair and pulls up his pants leg to reveal that he now has shaved legs.)\nMonica: (inspecting his leg) Wow! And around the ankles, y'know that is a tough spot.\nJoey: Yeah, it was! All right, listen, I can't\nChandler: (interrupting him) All this lying has been hard on us too.\nJoey: Oh-oh, yeah-yeah, I bet all the sex makes it easier!\nChandler: Well, yeah actually.\nMonica: We'll try to be more careful okay? It's just that, we don't want everyone to know because this is going really well, and maybe the reason it's going really well is because it's a secret.\nChandler: I know it sounds really weird, but we're just so bad at relationships.\nMonica: We are! Help us!\nChandler: Help!\nJoey: All right! But, (To Monica) you do it with me once.\nMonica: Joey!\nJoey: Didn't think so.\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, the entire gang is there, eating breakfast. Phoebe is on the couch, fidgeting.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "What am I sitting on?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Top of the world? Dock of the bay? (He tries to think of another but can't) I'm out."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "(taking something out of the couch) Ew-eww!! Undies! "}, {"line_number": 5, "type": "action", "text": "(She throws them into the kitchen and Rachel picks them up with the handle of a large spoon. Chandler and Monica have horrified looks on their faces.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "All right! Who's are they? Who's are they?"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Well, they're not mine!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Well, they're Joey's! They gotta be Joey's!"}, {"line_number": 9, "type": "action", "text": "(Rachel turns and stares at him.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Yeah, they're mine."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "See? They're Joey's! J-J-J-J-J-Joey's!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Why are they here?"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "I don't know uhh (Pause as he thinks about it.) Well, I'm Joey. Yeah, I'm disgusting, I take my underwear off in other people's homes."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Well, get 'em out of here! What's wrong with you?"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Yeah!"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Yeah!"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "(waving them in his face) Take 'em! (Joey makes a noise and jumps out of the way.) Joey, you can touch them! They're your underwear."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "(reluctantly taking them) Chandler? A word."}, {"line_number": 19, "type": "action", "text": "(Follows Joey into their apartment and shrugs on his way out.)"}, {"line_number": 20, "type": "narration", "text": "[Cut to the guy's apartment.]"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "That's it! I'm tired of covering for you two! This has got to stop! (Realizes he still has the underwear in his hand.) Ahh! (Throws them towards Chandler's room.) And tighty-whiteys! What are you, 8?"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "(entering) Thank you Joey, thank you so much!"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Oh hey, no, you're not welcome. Okay, look, I hate this! You guys keep embarrassing me! (To Monica) Yesterday, Rachel found your razor in our bathroom and I didn't know what to say, so I said it was mine and-and that I was playing a woman in a play. And one thing led to another and (He puts his leg on the chair and pulls up his pants leg to reveal that he now has shaved legs.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "(inspecting his leg) Wow! And around the ankles, y'know that is a tough spot."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Yeah, it was! All right, listen, I can't"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "(interrupting him) All this lying has been hard on us too."}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Oh-oh, yeah-yeah, I bet all the sex makes it easier!"}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "Well, yeah actually."}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "We'll try to be more careful okay? It's just that, we don't want everyone to know because this is going really well, and maybe the reason it's going really well is because it's a secret."}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "I know it sounds really weird, but we're just so bad at relationships."}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "We are! Help us!"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Help!"}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "All right! But, (To Monica) you do it with me once."}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "Joey!"}, {"line_number": 35, "type": "dialogue", "speaker": "Joey", "text": "Didn't think so."}, {"line_number": 36, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 3, "scene_id": "S05E09_003", "location": "Central Perk", "scene_description": "Joey, Chandler, Monica, and Rachel are there as Phoebe enters with her nose stuck in a book.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_003", "raw_text": "[Scene: Central Perk, Joey, Chandler, Monica, and Rachel are there as Phoebe enters with her nose stuck in a book.]\nMonica: Hey, Phoebe!\nChandler: Hi, Pheebs!\nRachel: Hey, Pheebs!\nJoey: Hey, Pheebs!\nRachel: What are you reading?\nPhoebe: Umm, Wethering Heights. I'm taking a literature class at the New School and I have to finish it for the first session tomorrow.\nChandler: I didn't know you were taking a class. That is so cool.\nPhoebe: Yeah! Well, I really liked that Lamaze class I took! Y'know and this time I thought I'd go for something, y'know a little more intellectual, with a less painful final exam.\nRachel: Honey that sounds like fun.\nPhoebe: Yeah! Ooh, you should come with me! Oh yeah, then I'd have someone to sit with!\nRachel: Okay.\nPhoebe: Yeah! Okayooh, but are you going to have time to read it?\nRachel: Oh, I read that in high school.\nPhoebe: This is going to be so much fun! Okay-shhh, I have to finish.\nRoss: (entering, depressed) Hi.\nJoey: What's wrong buddy?\nRoss: Someone at work ate my sandwich!\nChandler: Well, what did the police say?\nRoss: My Thanksgiving leftover sandwich. I can't believe someone ate it!\nChandler: Ross, it's just a sandwich!\nRoss: Just a sandwich? Look, I am 30 years old, I'm about to be divorced twice and I just got evicted! That sandwich was the only good thing going on in my life! Someone ate the only good thing going on in my life!\nMonica: Okay, look, I-I have enough stuff for one more sandwich, I mean I was going to eat it myself, but (motions that he can have it.)\nRoss: (quietly) That-that would be incredible. Thank you so much. I-I still can't believe someone ate it!! I mean, look, I left a note and everything. \n(Shows the note to Chandler who reads it aloud.)\nChandler: (reading) Knock-knock. Who's there? Ross Geller's lunch. Ross Geller's lunch, who? Ross Geller's lunch, please don't take me. Okay?\nJoey: I'm surprised you didn't go home wearing your lunch.\nPhoebe: Okay, look you wanna hold onto your food? You gotta scare people off. I learned that living on the street.\nRoss: Really?! So what would you say Pheebs? Stuff like uh, \"Keep your mitts off my grub?\"\nChandler: Say Ross, when you picture Phoebe living on the street, is she surrounded by the entire cast of Annie?\nPhoebe: Okay, this will keep them away from your stuff. (Writes him a note and the gang reads it.)\nAll: Whoa! Ohh!!\nMonica: Phoebe, you are a bad ass!\nPhoebe: Someday I'll, tell you about the time I stabbed the cop.\nMonica: Phoebe?\nPhoebe: Well, he stabbed me first!!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey, Chandler, Monica, and Rachel are there as Phoebe enters with her nose stuck in a book.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Hey, Phoebe!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Hi, Pheebs!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Hey, Pheebs!"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Hey, Pheebs!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "What are you reading?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, Wethering Heights. I'm taking a literature class at the New School and I have to finish it for the first session tomorrow."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "I didn't know you were taking a class. That is so cool."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! Well, I really liked that Lamaze class I took! Y'know and this time I thought I'd go for something, y'know a little more intellectual, with a less painful final exam."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Honey that sounds like fun."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! Ooh, you should come with me! Oh yeah, then I'd have someone to sit with!"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! Okayooh, but are you going to have time to read it?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I read that in high school."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "This is going to be so much fun! Okay-shhh, I have to finish."}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "(entering, depressed) Hi."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "What's wrong buddy?"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Someone at work ate my sandwich!"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Well, what did the police say?"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "My Thanksgiving leftover sandwich. I can't believe someone ate it!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Ross, it's just a sandwich!"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Just a sandwich? Look, I am 30 years old, I'm about to be divorced twice and I just got evicted! That sandwich was the only good thing going on in my life! Someone ate the only good thing going on in my life!"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Okay, look, I-I have enough stuff for one more sandwich, I mean I was going to eat it myself, but (motions that he can have it.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "(quietly) That-that would be incredible. Thank you so much. I-I still can't believe someone ate it!! I mean, look, I left a note and everything. "}, {"line_number": 25, "type": "action", "text": "(Shows the note to Chandler who reads it aloud.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "(reading) Knock-knock. Who's there? Ross Geller's lunch. Ross Geller's lunch, who? Ross Geller's lunch, please don't take me. Okay?"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "I'm surprised you didn't go home wearing your lunch."}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, look you wanna hold onto your food? You gotta scare people off. I learned that living on the street."}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Really?! So what would you say Pheebs? Stuff like uh, \"Keep your mitts off my grub?\""}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "Say Ross, when you picture Phoebe living on the street, is she surrounded by the entire cast of Annie?"}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, this will keep them away from your stuff. (Writes him a note and the gang reads it.)"}, {"line_number": 32, "type": "dialogue", "speaker": "All", "text": "Whoa! Ohh!!"}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, you are a bad ass!"}, {"line_number": 34, "type": "dialogue", "speaker": "Phoebe", "text": "Someday I'll, tell you about the time I stabbed the cop."}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Phoebe?"}, {"line_number": 36, "type": "dialogue", "speaker": "Phoebe", "text": "Well, he stabbed me first!!"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 4, "scene_id": "S05E09_004", "location": "Phoebe's class", "scene_description": "the class has already started and Rachel walks in late.", "characters": ["Phoebe", "Rachel", "The Teacher"], "firestore_path": "/episodes/S05E09/scenes/S05E09_004", "raw_text": "[Scene: Phoebe's class, the class has already started and Rachel walks in late.]\nRachel: (To Phoebe) Sorry I'm late, but I left late.\nPhoebe: Okay.\nRachel: So Pheebs, what is the book about?\nPhoebe: I thought you said you read it in high school.\nRachel: Well yeah, but then I remembered I started it and there was this pep rally and I was, I was on top of the pyramid but anywayumm, what is this book about?\nPhoebe: Okay, umm, it's this tragic love story between Cathy and Heathcliff and umm, it takes place on like these really creepy mores in England. Which I think represents the wildness of Heathcliff's character. I totally get symbolism.\nThe Teacher: How would you characterize the theme of this book, uh let's see here (looks at his attendance sheet), Rachel Green?\nRachel: Umm, well I would have to say that it's a, it's tragic love story.\nThe Teacher: Well, that's sort of a given, but yes. Anyone else?\nRachel: Oh-oh-oh, symbolism! And uh, the-the uh, wildness of the mores, which I think is-is mirrored in the wildness of Heathcliff's character.\nThe Teacher: Excellent! What Rachel has shrewdly observed here\nPhoebe: (To Rachel) You completely stole my answer!\nRachel: Well, honey that was pretty obvious.\nPhoebe: Well how would you know?! You didn't even read it!\nThe Teacher: What do you think? You in the blue shirt.\nPhoebe: I think that uh, yours is a question with many answers.\nThe Teacher: Would ya care to venture one?\nPhoebe: Would you care to venture one?\nThe Teacher: Are you just repeating what I'm saying?\nPhoebe: Are you just repeating what I'm saying?\nThe Teacher: All right, let's move on.\nPhoebe: Okay then.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebe's class, the class has already started and Rachel walks in late.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(To Phoebe) Sorry I'm late, but I left late."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "So Pheebs, what is the book about?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "I thought you said you read it in high school."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Well yeah, but then I remembered I started it and there was this pep rally and I was, I was on top of the pyramid but anywayumm, what is this book about?"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, umm, it's this tragic love story between Cathy and Heathcliff and umm, it takes place on like these really creepy mores in England. Which I think represents the wildness of Heathcliff's character. I totally get symbolism."}, {"line_number": 8, "type": "dialogue", "speaker": "The Teacher", "text": "How would you characterize the theme of this book, uh let's see here (looks at his attendance sheet), Rachel Green?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Umm, well I would have to say that it's a, it's tragic love story."}, {"line_number": 10, "type": "dialogue", "speaker": "The Teacher", "text": "Well, that's sort of a given, but yes. Anyone else?"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Oh-oh-oh, symbolism! And uh, the-the uh, wildness of the mores, which I think is-is mirrored in the wildness of Heathcliff's character."}, {"line_number": 12, "type": "dialogue", "speaker": "The Teacher", "text": "Excellent! What Rachel has shrewdly observed here"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "(To Rachel) You completely stole my answer!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Well, honey that was pretty obvious."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Well how would you know?! You didn't even read it!"}, {"line_number": 16, "type": "dialogue", "speaker": "The Teacher", "text": "What do you think? You in the blue shirt."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "I think that uh, yours is a question with many answers."}, {"line_number": 18, "type": "dialogue", "speaker": "The Teacher", "text": "Would ya care to venture one?"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Would you care to venture one?"}, {"line_number": 20, "type": "dialogue", "speaker": "The Teacher", "text": "Are you just repeating what I'm saying?"}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "Are you just repeating what I'm saying?"}, {"line_number": 22, "type": "dialogue", "speaker": "The Teacher", "text": "All right, let's move on."}, {"line_number": 23, "type": "dialogue", "speaker": "Phoebe", "text": "Okay then."}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 5, "scene_id": "S05E09_005", "location": "Central Perk", "scene_description": "Monica is there as Phoebe and Rachel return from the class.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_005", "raw_text": "[Scene: Central Perk, Monica is there as Phoebe and Rachel return from the class.]\nPhoebe: Yeah but why didn't you just say that you didn't read the book?!\nRachel: Be-because I didn't want him to think I was stupid! I mean, that was really embarrassing what happened to you!\nRoss: (entering) Phoebe! \nPhoebe: Yeah?\nRoss: Phoebe! You're note, amazing! Not only did no one touch my sandwich, but people at work are actually afraid of me. Yeah, a guy called me mental! Mental Geller, yeah, I always wanted a cool nickname like that.\nMonica: Yeah, the best you got in high school was Wet Pants Geller.\nRoss: That was the water fountain! Okay?! Anyway, people are writing reports for me, uh pushing back deadlines to meet my schedule, I'm telling you, you get tough with people you can get anything you want. (Joey walks by with a cup of coffee.) Hey Tribbiani, give me that coffee! Now!\n(Joey casually pushes Ross over the back of the couch and sits down proud of himself.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Monica is there as Phoebe and Rachel return from the class.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah but why didn't you just say that you didn't read the book?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Be-because I didn't want him to think I was stupid! I mean, that was really embarrassing what happened to you!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "(entering) Phoebe! "}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Phoebe! You're note, amazing! Not only did no one touch my sandwich, but people at work are actually afraid of me. Yeah, a guy called me mental! Mental Geller, yeah, I always wanted a cool nickname like that."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Yeah, the best you got in high school was Wet Pants Geller."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "That was the water fountain! Okay?! Anyway, people are writing reports for me, uh pushing back deadlines to meet my schedule, I'm telling you, you get tough with people you can get anything you want. (Joey walks by with a cup of coffee.) Hey Tribbiani, give me that coffee! Now!"}, {"line_number": 9, "type": "action", "text": "(Joey casually pushes Ross over the back of the couch and sits down proud of himself.)"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 6, "scene_id": "S05E09_006", "location": "The hallway", "scene_description": "Joey is returning from a date with Cynthia.", "characters": ["Chandler", "Cynthia", "Joey", "Rachel"], "firestore_path": "/episodes/S05E09/scenes/S05E09_006", "raw_text": "[Scene: The hallway, Joey is returning from a date with Cynthia.]\nCynthia: God, this was really fun! I've been wondering if you were going to ask me out.\nJoey: So you uh, still wondering?\nCynthia: No, we just went out.\nJoey: You're smart. I like that.\n(He goes to open the door to his apartment, but finds it locked. As he's getting out his keys, Chandler and Monica quickly jump up from making out in the living room and run to Chandler's bedroom. The apartment has about 20 candles burning all over the place. Joey opens the door and ushers Cynthia in.)\nCynthia: Oh, candles! (Notices something.) What is that? A blanket? A video camera? Oh my God! (As she storms out, Rachel returns and overhears the conversation.)\nJoey: Oh no-no-no-no, wait-wait-wait!!\nCynthia: I can't believe you thought that you were going to video tape us having sex on the first date! (She storms away and Rachel enters to confront Joey.)\nJoey: Hiya.\nRachel: Joey, is what she just said ummOh my God. (Looks around the room.) You were actually gonna (Chandler picks this moment to return to the living room.) (Rachel stares in shock.)\nChandler: What is going on here?\nRachel: And with Chandler in the next room. What are you, what are you sick?\n(Chandler silently pleads with Joey to cover for them.)\nJoey: I'm Joey. I mean, I'm disgusting. I make low-budget adult films. (Points at Chandler, angrily.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The hallway, Joey is returning from a date with Cynthia.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Cynthia", "text": "God, this was really fun! I've been wondering if you were going to ask me out."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "So you uh, still wondering?"}, {"line_number": 4, "type": "dialogue", "speaker": "Cynthia", "text": "No, we just went out."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "You're smart. I like that."}, {"line_number": 6, "type": "action", "text": "(He goes to open the door to his apartment, but finds it locked. As he's getting out his keys, Chandler and Monica quickly jump up from making out in the living room and run to Chandler's bedroom. The apartment has about 20 candles burning all over the place. Joey opens the door and ushers Cynthia in.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Cynthia", "text": "Oh, candles! (Notices something.) What is that? A blanket? A video camera? Oh my God! (As she storms out, Rachel returns and overhears the conversation.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Oh no-no-no-no, wait-wait-wait!!"}, {"line_number": 9, "type": "dialogue", "speaker": "Cynthia", "text": "I can't believe you thought that you were going to video tape us having sex on the first date! (She storms away and Rachel enters to confront Joey.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Hiya."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Joey, is what she just said ummOh my God. (Looks around the room.) You were actually gonna (Chandler picks this moment to return to the living room.) (Rachel stares in shock.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "What is going on here?"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "And with Chandler in the next room. What are you, what are you sick?"}, {"line_number": 14, "type": "action", "text": "(Chandler silently pleads with Joey to cover for them.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "I'm Joey. I mean, I'm disgusting. I make low-budget adult films. (Points at Chandler, angrily.)"}, {"line_number": 16, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 7, "scene_id": "S05E09_007", "location": "Chandler", "scene_description": "Joey, and Ross's; continued from earlier. Joey is closing the door after Rachel leaves and is about to confront Chandler and Monica.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S05E09/scenes/S05E09_007", "raw_text": "[Scene: Chandler, Joey, and Ross's; continued from earlier. Joey is closing the door after Rachel leaves and is about to confront Chandler and Monica.]\nJoey: You guys promised you'd be more careful! I mean, come on! The good Joey name is being dragged through the mud here!\nMonica: We're so sorry.\nChandler: Yeah.\nJoey: Well, I'm telling everyone about you! That's the only way to explain the underwear and the video camera that doesn't make me look like a pig!\nChandler: No-no, wait! There's got to be a better explanation. You can tell them you had to make an adult film for your (Thinks) adult film class.\nJoey: Yeah, I like that. But no-no, how does that explain why Rachel found my underwear at your place?\nChandler: OhI don't know.\nJoey: Well, get ready to come out of the non-gay closet!\nMonica: Okay, just wait, please. I promise we'll come up with something. Just give us a little more time.\nJoey: All right. Hey, but it better make me look really, really good. (Starts for his room.) Oh, and another thing, the video camera? Nice!!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler, Joey, and Ross's; continued from earlier. Joey is closing the door after Rachel leaves and is about to confront Chandler and Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "You guys promised you'd be more careful! I mean, come on! The good Joey name is being dragged through the mud here!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "We're so sorry."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Yeah."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Well, I'm telling everyone about you! That's the only way to explain the underwear and the video camera that doesn't make me look like a pig!"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "No-no, wait! There's got to be a better explanation. You can tell them you had to make an adult film for your (Thinks) adult film class."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Yeah, I like that. But no-no, how does that explain why Rachel found my underwear at your place?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "OhI don't know."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Well, get ready to come out of the non-gay closet!"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Okay, just wait, please. I promise we'll come up with something. Just give us a little more time."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "All right. Hey, but it better make me look really, really good. (Starts for his room.) Oh, and another thing, the video camera? Nice!!"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 8, "scene_id": "S05E09_008", "location": "The Museum of Prehistoric History (Ross's work); Ross is in the break room eating lunch as his boss", "scene_description": "Dr. Leedbetter walks in.", "characters": ["Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_008", "raw_text": "[Scene: The Museum of Prehistoric History (Ross's work); Ross is in the break room eating lunch as his boss, Dr. Leedbetter walks in.]\nDr. Leedbetter: Umm, Ross. May I have a word with you?\nRoss: Yeah, of course, Donald.\nDr. Leedbetter: We've been getting reports of some very angry behavior on your part.\nRoss: What?!\nDr. Leedbetter: Threatening letters, refusal to meet deadlines, apparently people now call you mental.\nRoss: (Proudly) Yeah.\nDr. Leedbetter: We want you to speak to a psychiatrist. \nRoss: Oh no, you-you don't understand. Ugh, this is so silly. Umm, this is all because of a sandwich.\nDr. Leedbetter: (laughs) A sandwich?\nRoss: Yeah. You see my-my sister makes these amazing turkey sandwiches. Her secret is, she puts a, an extra slice of gravy soaked bread in the middle; I call it the Moist Maker. Anyway, I-I put my sandwich in the fridge over here \nDr. Leedbetter: (laughs) Oh, you know what?\nRoss: What?\nDr. Leedbetter: I-I'm sorry. I, I-I-I believe I ate that.\nRoss: You ate my sandwich?\nDr. Leedbetter: It was a simple mistake. It could happen to anyone.\nRoss: (getting upset) Oh-oh really? Did you confuse it with your own turkey sandwich with a Moist Maker?\nDr. Leedbetter: No.\nRoss: Do you perhaps seeing a note on top of it?\nDr. Leedbetter: There may have been a-a joke or a limerick of some kind.\nRoss: (getting angry) That said it was my sandwich?!\nDr. Leedbetter: Now-now calm down. Come look in my office, some of it my still be in the trash.\nRoss: (jumping to his feet in anger) What?\nDr. Leedbetter: Well, it was quite large. I-I-I-I-I had to throw most of it away.\nRoss: You-you-you-you (trying to remain in control) threw my sandwich away!\n[Cut to an outside shot of the museum.]\nRoss: (losing control, we hear him shout outside) MY SANDWICH?!!!\n[Cut to a shot of a park.]\nRoss: MY SANDWICH!!!!!! (Ross's scream scares a flight of pigeons away.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Museum of Prehistoric History (Ross's work); Ross is in the break room eating lunch as his boss, Dr. Leedbetter walks in.]"}, {"line_number": 2, "type": "narration", "text": "Dr. Leedbetter: Umm, Ross. May I have a word with you?"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Yeah, of course, Donald."}, {"line_number": 4, "type": "narration", "text": "Dr. Leedbetter: We've been getting reports of some very angry behavior on your part."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "What?!"}, {"line_number": 6, "type": "narration", "text": "Dr. Leedbetter: Threatening letters, refusal to meet deadlines, apparently people now call you mental."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "(Proudly) Yeah."}, {"line_number": 8, "type": "narration", "text": "Dr. Leedbetter: We want you to speak to a psychiatrist. "}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Oh no, you-you don't understand. Ugh, this is so silly. Umm, this is all because of a sandwich."}, {"line_number": 10, "type": "narration", "text": "Dr. Leedbetter: (laughs) A sandwich?"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Yeah. You see my-my sister makes these amazing turkey sandwiches. Her secret is, she puts a, an extra slice of gravy soaked bread in the middle; I call it the Moist Maker. Anyway, I-I put my sandwich in the fridge over here "}, {"line_number": 12, "type": "narration", "text": "Dr. Leedbetter: (laughs) Oh, you know what?"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 14, "type": "narration", "text": "Dr. Leedbetter: I-I'm sorry. I, I-I-I believe I ate that."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "You ate my sandwich?"}, {"line_number": 16, "type": "narration", "text": "Dr. Leedbetter: It was a simple mistake. It could happen to anyone."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "(getting upset) Oh-oh really? Did you confuse it with your own turkey sandwich with a Moist Maker?"}, {"line_number": 18, "type": "narration", "text": "Dr. Leedbetter: No."}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Do you perhaps seeing a note on top of it?"}, {"line_number": 20, "type": "narration", "text": "Dr. Leedbetter: There may have been a-a joke or a limerick of some kind."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "(getting angry) That said it was my sandwich?!"}, {"line_number": 22, "type": "narration", "text": "Dr. Leedbetter: Now-now calm down. Come look in my office, some of it my still be in the trash."}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "(jumping to his feet in anger) What?"}, {"line_number": 24, "type": "narration", "text": "Dr. Leedbetter: Well, it was quite large. I-I-I-I-I had to throw most of it away."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "You-you-you-you (trying to remain in control) threw my sandwich away!"}, {"line_number": 26, "type": "narration", "text": "[Cut to an outside shot of the museum.]"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "(losing control, we hear him shout outside) MY SANDWICH?!!!"}, {"line_number": 28, "type": "narration", "text": "[Cut to a shot of a park.]"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "MY SANDWICH!!!!!! (Ross's scream scares a flight of pigeons away.)"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 9, "scene_id": "S05E09_009", "location": "Phoebe and Rachel's class; Rachel walks in", "scene_description": "on time this time.", "characters": ["Phoebe", "Rachel", "The Teacher"], "firestore_path": "/episodes/S05E09/scenes/S05E09_009", "raw_text": "[Scene: Phoebe and Rachel's class; Rachel walks in, on time this time.]\nRachel: Hi!\nPhoebe: Hi!\nRachel: (sitting down) So umm, what's this book about?\nPhoebe: You didn't read this one either?!\nRachel: Well, I was gonna, but I accidentally read something else.\nPhoebe: What?\nRachel: Vogue! Hey, so tell me about this Jane Eyre woman.\nPhoebe: No! You should've read it yourself!\nRachel: Come on Phoebe! Dont be such a goodie-goodie!\nPhoebe: Fine! Okay, all right, so Jane Eyre, first of all, you'd think she's a woman, but she's not. She's a cyborg. \nRachel: A cyborg?! Isn't that like a robot?!\nPhoebe: Yeah, this book was light years ahead of its time.\nThe Teacher: (entering) Sorry I'm late. Let's get started. So, what did everybody think about Jane Eyre?\nPhoebe: Umm, Rachel and I were just discussing it and she had some very interesting insights.\nThe Teacher: Well, go ahead Rachel.\nRachel: Uh, thank you Phoebe. Umm, well, what struck me most when reading Jane Eyre was uh, how the book was so ahead of its time.\nThe Teacher: If you're talking about feminism, I think you're right.\nRachel: Yeah, well, feminism yes, but also the robots.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebe and Rachel's class; Rachel walks in, on time this time.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hi!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "(sitting down) So umm, what's this book about?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "You didn't read this one either?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Well, I was gonna, but I accidentally read something else."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Vogue! Hey, so tell me about this Jane Eyre woman."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "No! You should've read it yourself!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Come on Phoebe! Dont be such a goodie-goodie!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Fine! Okay, all right, so Jane Eyre, first of all, you'd think she's a woman, but she's not. She's a cyborg. "}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "A cyborg?! Isn't that like a robot?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, this book was light years ahead of its time."}, {"line_number": 14, "type": "dialogue", "speaker": "The Teacher", "text": "(entering) Sorry I'm late. Let's get started. So, what did everybody think about Jane Eyre?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, Rachel and I were just discussing it and she had some very interesting insights."}, {"line_number": 16, "type": "dialogue", "speaker": "The Teacher", "text": "Well, go ahead Rachel."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Uh, thank you Phoebe. Umm, well, what struck me most when reading Jane Eyre was uh, how the book was so ahead of its time."}, {"line_number": 18, "type": "dialogue", "speaker": "The Teacher", "text": "If you're talking about feminism, I think you're right."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, well, feminism yes, but also the robots."}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 10, "scene_id": "S05E09_010", "location": "Central Perk", "scene_description": "Chandler is on the couch as Monica joins him.", "characters": ["Chandler", "Monica", "Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_010", "raw_text": "[Scene: Central Perk, Chandler is on the couch as Monica joins him.]\nChandler: Hey.\nMonica: Hey. Okay, so umm, since that video camera thing didn't work out uh, I thought that I would give you just a little preview. (Hands him a Polaroid.)\nChandler: (gasps) You're naked in this picture!\nMonica: I know.\n(Ross walks in, eating cotton candy. Monica nudges Chandler who hides the picture in his magazine. Ross sits down on the chair, he seems kinda out of it.)\nChandler: Ross?\nRoss: (in a stupor) Hey Chandler. (Sees Monica.) Monica!\nMonica: Ross, are you okay?\nRoss: I'm fine! I saw a psychiatrist at work today.\nMonica: Why?!\nRoss: On account of my rage.\nChandler: Which I may say, right now, is out of control.\nRoss: He gave me a pill for it.\nMonica: A pill?\nRoss: Uh-huh. Well, when the psychiatrist told me I had to take a leave of absence because I yelled at my boss I started to get worked up again, so he offered me a tranquilizer. And I thought was a good idea so, I took it.\nMonica: Wait a minute, they're making you take time off work?\nChandler: And you're okay with that?\nRoss: I don't know. It's going to be weird not having a job for a while, but I, I definitely don't care about my sandwich.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Chandler is on the couch as Monica joins him.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Hey. Okay, so umm, since that video camera thing didn't work out uh, I thought that I would give you just a little preview. (Hands him a Polaroid.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "(gasps) You're naked in this picture!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "I know."}, {"line_number": 6, "type": "action", "text": "(Ross walks in, eating cotton candy. Monica nudges Chandler who hides the picture in his magazine. Ross sits down on the chair, he seems kinda out of it.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Ross?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "(in a stupor) Hey Chandler. (Sees Monica.) Monica!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Ross, are you okay?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "I'm fine! I saw a psychiatrist at work today."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Why?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "On account of my rage."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Which I may say, right now, is out of control."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "He gave me a pill for it."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "A pill?"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Uh-huh. Well, when the psychiatrist told me I had to take a leave of absence because I yelled at my boss I started to get worked up again, so he offered me a tranquilizer. And I thought was a good idea so, I took it."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, they're making you take time off work?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "And you're okay with that?"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "I don't know. It's going to be weird not having a job for a while, but I, I definitely don't care about my sandwich."}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 11, "scene_id": "S05E09_011", "location": "Monica and Rachel's", "scene_description": "Rachel and Phoebe are returning from class.", "characters": ["Monica", "Phoebe", "Rachel", "The Teacher"], "firestore_path": "/episodes/S05E09/scenes/S05E09_011", "raw_text": "[Scene: Monica and Rachel's, Rachel and Phoebe are returning from class.]\nRachel: (entering, angrily) Ugh, that was so embarrassing! I can't believe you let me go on and on like that!\nPhoebe: (smiling) I'm sorry. It was just so funny when you started comparing Jane Eyre to Robocop. \nRachel: That was not funny!\nPhoebe: Well, I snapped! Okay? You weren't taking the class seriously.\nRachel: Phoebe, come on! What is the big deal? I thought this was going to be something we could do together! Y'know, I thought it would be fun!\nPhoebe: Well, yeah! Fun is good, but y'know I also wanted to learn. Y'know, people are always talking about what they learned in high school and I never went to high school.\nRachel: Ohh. Oh, so you really wanted to learn. Yeah, y'know, Pheebs I just wanted to have fun. Ohh, you know who you should go with?\n[Scene: The Class; Monica has taken Rachel's spot.]\nMonica: (yelling and waving her hand in the air) I know! I know! I know!\nThe Teacher: Monica, you asked the question.\n(She sits back defeated, and Phoebe groans with disgust.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Rachel and Phoebe are returning from class.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(entering, angrily) Ugh, that was so embarrassing! I can't believe you let me go on and on like that!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "(smiling) I'm sorry. It was just so funny when you started comparing Jane Eyre to Robocop. "}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "That was not funny!"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Well, I snapped! Okay? You weren't taking the class seriously."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe, come on! What is the big deal? I thought this was going to be something we could do together! Y'know, I thought it would be fun!"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Well, yeah! Fun is good, but y'know I also wanted to learn. Y'know, people are always talking about what they learned in high school and I never went to high school."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Ohh. Oh, so you really wanted to learn. Yeah, y'know, Pheebs I just wanted to have fun. Ohh, you know who you should go with?"}, {"line_number": 9, "type": "narration", "text": "[Scene: The Class; Monica has taken Rachel's spot.]"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "(yelling and waving her hand in the air) I know! I know! I know!"}, {"line_number": 11, "type": "dialogue", "speaker": "The Teacher", "text": "Monica, you asked the question."}, {"line_number": 12, "type": "action", "text": "(She sits back defeated, and Phoebe groans with disgust.)"}]}
{"episode_id": "S05E09", "season": 5, "episode_number": 9, "episode_title": "THE ONE WITH ROSS'S SANDWICH", "scene_number": 12, "scene_id": "S05E09_012", "location": "Chandler", "scene_description": "Joey, and Ross's; Joey returns carrying a bucket of chicken, and starts going through the mail. While doing this, Monica's picture falls out. He bends over to pick it up and gasps. While he's staring at the picture, Rachel decides to come over and sees him looking at the picture.", "characters": ["A Female Student", "All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S05E09/scenes/S05E09_012", "raw_text": "[Scene: Chandler, Joey, and Ross's; Joey returns carrying a bucket of chicken, and starts going through the mail. While doing this, Monica's picture falls out. He bends over to pick it up and gasps. While he's staring at the picture, Rachel decides to come over and sees him looking at the picture.]\nRachel: (sees the picture) Oh my God! That's Monica!!\nJoey: Oh no-no-no! No-no-no-no-no-no-no!\nRachel: You get away from me!! You sick, sick, sick, sick-o!!\nRoss: (entering, with the rest of the gang) What's going on?\nRachel: Joey has got a secret peephole!\nChandler: (Sees the picture) Oh no! No! No! No! (Monica gasps as well.)\nRachel: Yes! He has a naked picture of Monica! He takes naked pictures of us! And then he eats chicken and looks at them!\n(Ross stares in shock at him as he angrily puts down the chicken and takes off his coat.)\nRachel: Look! (Shows Ross the picture.)\nRoss: (covering his eyes) Dude! That's my sister! (She shows the rest of the gang.)\nMonica: (grabbing the picture) Give me that!\nPhoebe: All right, wait! Just wait. Everybody just calm down. Okay? Let's give our friend Joey a chance to explain why he's such a big pervert!\nJoey: No! I am not a pervert! Okay? It's just I just Kinda\nChandler: All right, look! Look. I think I can explain this.\n(He walks over and stands behind Joey.)\nJoey: Thank you!\nChandler: Joey's a sex addict. \nJoey: What?!! (He turns around and stares at Chandler who's silently pleading with Joey to go along with it.) No I'm not!!\nMonica: It's okay! It's good! It's good. It's a disease!\nJoey: No! No! I am not a sex addict!\nMonica: Yes you are! That's the only way to explain all this stuff!\nJoey: No it isn't! No, it's not. Because you can also explain it with the truth!\nRachel: Well, what is the truth?\nRoss: Yeah, what's going on?\nPhoebe: What's going on?\nJoey: (thinking) I slept with Monica.\nChandler: Well let's.let's see what everybody thinks of that?\nMonica: Oh no!\nRoss: You slept with my sister?\nJoey: Uh yes, but it was, we just did it once uh, in London.\nRoss: This is not good for my rage. (Takes another pill.)\nRachel: Monica, is this true?\nJoey: Of course it's true! How else would you explain all the weird stuff that's been going on?\nMonica: Yes it's true.\nRachel: Okay, but if it only happened that one time, how come we found your underwear in our apartment the other day?\nJoey: Ahhoy! That was the underwear I was wearing that night in London. Right Monica?\nMonica: I guess I wanted to keep it (Pause) as a souvenir. \nRoss: My God Monica!!\nChandler: Are you sure Joe? Are you sure you're not just a sex addict?\nJoey: No! If anyone's a sex addict here, it's Monica! Yeah. Yeah. She has been trying to get me back in the sack ever since London!\nPhoebe: So that's why she gave you a naked picture of herself.\nJoey: That makes sense!\nRachel: And the video camera?\nJoey: Uhh, Monica?\nMonica: I guess I set up the video camera to try and entice Joey.\nJoey: But sadly I could not be enticed.\nRoss: Unbelievable! I mean you really kept Joey's underwear?! Why? Why would you do that?!\nMonica: I'm Monica. I'm disgusting. I stalk guys and keep their underpants.\nJoey: Well, I think we've all learned something about who's disgusting and who's not. Eh? All right, now, I'm going to get back to my bucket. I'm only eating the skin, so the chicken's up for grabs. (Offers it to everyone.)\nEnding Credits\n[Scene: Monica and Phoebe's class; the class has ended and Phoebe is talking to one of her classmates.]\nPhoebe: I really thought you making a good point. I mean y'know, until you got cut off.\nA Female Student: Yeah, what's up with that girl Monica?\nPhoebe: I don't know! I didn't come with her!\nMonica: (entering, happily) All right everybody! Everybody guess what? I just convinced Paul to give us a test next week!\nAll: A test?!!\nMonica: Come on! Tests make us all better learners! Oh yeah! (Running out) We should have essay questions!!\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler, Joey, and Ross's; Joey returns carrying a bucket of chicken, and starts going through the mail. While doing this, Monica's picture falls out. He bends over to pick it up and gasps. While he's staring at the picture, Rachel decides to come over and sees him looking at the picture.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(sees the picture) Oh my God! That's Monica!!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Oh no-no-no! No-no-no-no-no-no-no!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "You get away from me!! You sick, sick, sick, sick-o!!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "(entering, with the rest of the gang) What's going on?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Joey has got a secret peephole!"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "(Sees the picture) Oh no! No! No! No! (Monica gasps as well.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yes! He has a naked picture of Monica! He takes naked pictures of us! And then he eats chicken and looks at them!"}, {"line_number": 9, "type": "action", "text": "(Ross stares in shock at him as he angrily puts down the chicken and takes off his coat.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Look! (Shows Ross the picture.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "(covering his eyes) Dude! That's my sister! (She shows the rest of the gang.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "(grabbing the picture) Give me that!"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "All right, wait! Just wait. Everybody just calm down. Okay? Let's give our friend Joey a chance to explain why he's such a big pervert!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "No! I am not a pervert! Okay? It's just I just Kinda"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "All right, look! Look. I think I can explain this."}, {"line_number": 16, "type": "action", "text": "(He walks over and stands behind Joey.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Thank you!"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Joey's a sex addict. "}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "What?!! (He turns around and stares at Chandler who's silently pleading with Joey to go along with it.) No I'm not!!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "It's okay! It's good! It's good. It's a disease!"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "No! No! I am not a sex addict!"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Yes you are! That's the only way to explain all this stuff!"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "No it isn't! No, it's not. Because you can also explain it with the truth!"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Well, what is the truth?"}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Yeah, what's going on?"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "What's going on?"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "(thinking) I slept with Monica."}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "Well let's.let's see what everybody thinks of that?"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Oh no!"}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "You slept with my sister?"}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Uh yes, but it was, we just did it once uh, in London."}, {"line_number": 32, "type": "dialogue", "speaker": "Ross", "text": "This is not good for my rage. (Takes another pill.)"}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Monica, is this true?"}, {"line_number": 34, "type": "dialogue", "speaker": "Joey", "text": "Of course it's true! How else would you explain all the weird stuff that's been going on?"}, {"line_number": 35, "type": "dialogue", "speaker": "Monica", "text": "Yes it's true."}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "Okay, but if it only happened that one time, how come we found your underwear in our apartment the other day?"}, {"line_number": 37, "type": "dialogue", "speaker": "Joey", "text": "Ahhoy! That was the underwear I was wearing that night in London. Right Monica?"}, {"line_number": 38, "type": "dialogue", "speaker": "Monica", "text": "I guess I wanted to keep it (Pause) as a souvenir. "}, {"line_number": 39, "type": "dialogue", "speaker": "Ross", "text": "My God Monica!!"}, {"line_number": 40, "type": "dialogue", "speaker": "Chandler", "text": "Are you sure Joe? Are you sure you're not just a sex addict?"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "No! If anyone's a sex addict here, it's Monica! Yeah. Yeah. She has been trying to get me back in the sack ever since London!"}, {"line_number": 42, "type": "dialogue", "speaker": "Phoebe", "text": "So that's why she gave you a naked picture of herself."}, {"line_number": 43, "type": "dialogue", "speaker": "Joey", "text": "That makes sense!"}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "And the video camera?"}, {"line_number": 45, "type": "dialogue", "speaker": "Joey", "text": "Uhh, Monica?"}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "I guess I set up the video camera to try and entice Joey."}, {"line_number": 47, "type": "dialogue", "speaker": "Joey", "text": "But sadly I could not be enticed."}, {"line_number": 48, "type": "dialogue", "speaker": "Ross", "text": "Unbelievable! I mean you really kept Joey's underwear?! Why? Why would you do that?!"}, {"line_number": 49, "type": "dialogue", "speaker": "Monica", "text": "I'm Monica. I'm disgusting. I stalk guys and keep their underpants."}, {"line_number": 50, "type": "dialogue", "speaker": "Joey", "text": "Well, I think we've all learned something about who's disgusting and who's not. Eh? All right, now, I'm going to get back to my bucket. I'm only eating the skin, so the chicken's up for grabs. (Offers it to everyone.)"}, {"line_number": 51, "type": "narration", "text": "Ending Credits"}, {"line_number": 52, "type": "narration", "text": "[Scene: Monica and Phoebe's class; the class has ended and Phoebe is talking to one of her classmates.]"}, {"line_number": 53, "type": "dialogue", "speaker": "Phoebe", "text": "I really thought you making a good point. I mean y'know, until you got cut off."}, {"line_number": 54, "type": "dialogue", "speaker": "A Female Student", "text": "Yeah, what's up with that girl Monica?"}, {"line_number": 55, "type": "dialogue", "speaker": "Phoebe", "text": "I don't know! I didn't come with her!"}, {"line_number": 56, "type": "dialogue", "speaker": "Monica", "text": "(entering, happily) All right everybody! Everybody guess what? I just convinced Paul to give us a test next week!"}, {"line_number": 57, "type": "dialogue", "speaker": "All", "text": "A test?!!"}, {"line_number": 58, "type": "dialogue", "speaker": "Monica", "text": "Come on! Tests make us all better learners! Oh yeah! (Running out) We should have essay questions!!"}, {"line_number": 59, "type": "narration", "text": "End"}]}
