{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 1, "scene_id": "S06E23_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S06E23/scenes/S06E23_001", "raw_text": "THE ONE WITH THE UNAGI\nTeleplay by: Adam Chase Story by: Zachary Rosenblatt Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE UNAGI"}, {"line_number": 2, "type": "dialogue", "speaker": "Teleplay by", "text": "Adam Chase Story by: Zachary Rosenblatt Transcribed by: Eric Aasen"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 2, "scene_id": "S06E23_002", "location": "Central Perk", "scene_description": "Ross, Chandler, and Phoebe are there. Joey is working.", "characters": ["Chandler", "Gunther", "Joey", "Phoebe", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_002", "raw_text": "[Scene: Central Perk, Ross, Chandler, and Phoebe are there. Joey is working.]\nRoss: Hey, remember when I had a monkey?\nChandler: Yeah.\nRoss: Yeah, what, what was I thinking?\nJoey: (hes just picked up their bill) Hey! So, whats with the 20 percent tip? Did I do something wrong?\nChandler: Twenty percent is a pretty generous tip Joe.\nJoey: Yknow whats more generous than that?! Fifty percent! Yknow whats even more generous than that?!!\nChandler: I see where youre goin!\nRoss: Whats up with the greed Joe?\nJoey: All right, look Im sorry you guys, but its just that I gotta get these new head shots made. And theyre really expensive, yknow? Im down to like three! Well, actually two cause one of em I kinda blackened in some teethWhy did I do that?! (Hits himself in the head.)\nRoss: Well isnt there something you can do to earn a little extra money? I mean, cant-cant you pick up, I dont know, an extra shift here?\nPhoebe: Or, yknow, I used to beg for money. Of course it helps if youve got yknow a little of this (she sticks her chest out and shakes it) goin on. Wow! I still have it!\nRoss: Oh, wait! Wait! Dont you have an audition today? Yeah! Maybe youll get that job!\nJoey: Oh, ha-ha-ha! Ooh! Wait a minute, I used to get medical experiments down on me all the time!\nChandler: (reminiscing) Ah, finally an explanation.\nJoey: No-no! I used to get paid for all kinds of medical stuff, remember? Lets see uh, well I dont want to donate sperm again. (To Ross) I really prefer doing that at the home office yknow? (Ross nods his head.) Ooh-ooh, maybe they want like some of my blood or-or spit or something, huh?\nGunther: (approaching with a tray with an order on it) Joey!\nJoey: Yeah?\nGunther: What did I tell you about talking to your friends while youre working?\nJoey: Uhh do it?\nGunther: That guy (points) has been waiting for his coffee for ten minutes! Hes complained about you three times! (He hands the coffee cup to Joey, assuming that Joey will deliver it and walks away.)\nJoey: Well, where was I? (Takes a sip of the coffee.)\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross, Chandler, and Phoebe are there. Joey is working.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey, remember when I had a monkey?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Yeah."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Yeah, what, what was I thinking?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "(hes just picked up their bill) Hey! So, whats with the 20 percent tip? Did I do something wrong?"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Twenty percent is a pretty generous tip Joe."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Yknow whats more generous than that?! Fifty percent! Yknow whats even more generous than that?!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "I see where youre goin!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Whats up with the greed Joe?"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "All right, look Im sorry you guys, but its just that I gotta get these new head shots made. And theyre really expensive, yknow? Im down to like three! Well, actually two cause one of em I kinda blackened in some teethWhy did I do that?! (Hits himself in the head.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Well isnt there something you can do to earn a little extra money? I mean, cant-cant you pick up, I dont know, an extra shift here?"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Or, yknow, I used to beg for money. Of course it helps if youve got yknow a little of this (she sticks her chest out and shakes it) goin on. Wow! I still have it!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Oh, wait! Wait! Dont you have an audition today? Yeah! Maybe youll get that job!"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Oh, ha-ha-ha! Ooh! Wait a minute, I used to get medical experiments down on me all the time!"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "(reminiscing) Ah, finally an explanation."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "No-no! I used to get paid for all kinds of medical stuff, remember? Lets see uh, well I dont want to donate sperm again. (To Ross) I really prefer doing that at the home office yknow? (Ross nods his head.) Ooh-ooh, maybe they want like some of my blood or-or spit or something, huh?"}, {"line_number": 17, "type": "dialogue", "speaker": "Gunther", "text": "(approaching with a tray with an order on it) Joey!"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Yeah?"}, {"line_number": 19, "type": "dialogue", "speaker": "Gunther", "text": "What did I tell you about talking to your friends while youre working?"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Uhh do it?"}, {"line_number": 21, "type": "dialogue", "speaker": "Gunther", "text": "That guy (points) has been waiting for his coffee for ten minutes! Hes complained about you three times! (He hands the coffee cup to Joey, assuming that Joey will deliver it and walks away.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Well, where was I? (Takes a sip of the coffee.)"}, {"line_number": 23, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 3, "scene_id": "S06E23_003", "location": "Central Perk", "scene_description": "Ross is there as Phoebe and Rachel enter wearing workout clothes.", "characters": ["Chandler", "Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_003", "raw_text": "[Scene: Central Perk, Ross is there as Phoebe and Rachel enter wearing workout clothes.]\nRoss: Hi!\nPhoebe: Hey!\nRoss: Hey, what have you guys been up to?\nPhoebe: Ohh! We went to a self-defense class today!\nRoss: Wow!\nRachel: Yeah, kicking a guy in the crotch all morning really takes it out of ya!\nJoey: Takes it out of you? (Laughs.)\nPhoebe: Now, we can kick anybodys ass!\nRachel: Yeah!\nRoss: After one class? I dont think so.\nRachel: What? You wanna see me self-defend myself?! Go over there (points) and pretend youre a sexual predator! Go on! I dare ya!!\nRoss: Well, of course you can defend yourself from an attack you know is coming, thats not enough. Look, I studying kara-tay for a long time, and theres a concept you should really be familiar with. Its what the Japanese call (he holds two fingers up to his temple, and he does this every time he says this word) unagi.\nRachel: Isnt that a kind of sushi?\nRoss: No, its a concept!\nPhoebe: Yeah it is! It is! Its freshwater eel!\nRoss: All right, maybe it means that too\nRachel: Ohh! I would kill for a salmon skin roll right now!\nRoss: Yknow what? Fine! Get attacked! I dont even care! \nPhoebe: (deadpan) Come on Ross. Were sorry. Please tell us what it is.\nRoss: Unagi is a state of total awareness. Okay? Only by achieving true unagi can you be prepared for any danger that may befall you!\nPhoebe: You mean in case someone is trying to steal your bamboo sleeping mat or your kettle of fish?\n(Rachel laughs and Ross mocks her.)\nRoss: (moves closer) All Im saying is, its one thing being prepared for an attack against like each other; whole another story being prepared for an attack, I dont know, like a (turns and puts his face close to Rachels and screams) surprise!!\n(Rachel calmly wipes the spittle off her face.)\nRoss: All right, you know that one was coming, but that doesnt mean you have unagi. (Does the finger thing.)\nRachel: (To Phoebe) Ooh! Yknow what? If we made reservations, we could have unagi in about a half-hour.\nRoss: Yknow what (Moves away as Chandler enters, panicked.)\nChandler: Hey-hey, is Monica here?\nPhoebe: No.\nRoss: No.\nChandler: Okay, look I need your help, I dont know what to get her for Valentines Day.\nRachel: Well, Valentines Day was like two weeks ago, so I wouldnt get her a calendar!\nChandler: (laughs) She was working on Valentines Day so were celebrating it tonight.\nJoey: Ohh, hey! Why dont you book a date for both of you at one of those romantic spas?\nPhoebe: Ooh, Joey, thats actually a really good idea!\nJoey: And of course, crotchless panties. \nChandler: Well appealing as that does sound to her boyfriend (pause) and her brother, (the camera pans to Ross flashing Joey a very evil look; Joey gets scared) I cant do that we promised wed make each other gifts this year.\nRachel: Aw, I love that.\nPhoebe: You guys!\nJoey: You cant make crotchless panties? You take, you take a pair of scissors and you just cut\nRachel: (interrupting him) Okay-okay-okay! So, making things. That sounds like so much fun.\nChandler: Yeah, I thought so to until I paper mached one of my eyes shut.\nPhoebe: Oh, I love paper mache! What did you make?\nChandler: I made a (Does one of those gibberish words.)\nPhoebe: What is that?\nChandler: Nothing!\nRoss: So what are you gonna do?\nChandler: Well, have you guys made anything that maybe I can take credit for?\nPhoebe: Ohh! I have! I have! I started making these little sock bunnies! (She takes out a sock thats been made into a bunny with eyes, nose, mouth, whiskers, and two other socks sown onto it for ears.) Oh for crying out loud!\nRachel: Hey, wait a minute! That is my sock!\nPhoebe: Now, its you little bunny friend. (She sticks it in Rachels face and they both laugh.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross is there as Phoebe and Rachel enter wearing workout clothes.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Hey, what have you guys been up to?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh! We went to a self-defense class today!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Wow!"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, kicking a guy in the crotch all morning really takes it out of ya!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Takes it out of you? (Laughs.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Now, we can kick anybodys ass!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Yeah!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "After one class? I dont think so."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "What? You wanna see me self-defend myself?! Go over there (points) and pretend youre a sexual predator! Go on! I dare ya!!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Well, of course you can defend yourself from an attack you know is coming, thats not enough. Look, I studying kara-tay for a long time, and theres a concept you should really be familiar with. Its what the Japanese call (he holds two fingers up to his temple, and he does this every time he says this word) unagi."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Isnt that a kind of sushi?"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "No, its a concept!"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah it is! It is! Its freshwater eel!"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "All right, maybe it means that too"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Ohh! I would kill for a salmon skin roll right now!"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Yknow what? Fine! Get attacked! I dont even care! "}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "(deadpan) Come on Ross. Were sorry. Please tell us what it is."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Unagi is a state of total awareness. Okay? Only by achieving true unagi can you be prepared for any danger that may befall you!"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "You mean in case someone is trying to steal your bamboo sleeping mat or your kettle of fish?"}, {"line_number": 23, "type": "action", "text": "(Rachel laughs and Ross mocks her.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "(moves closer) All Im saying is, its one thing being prepared for an attack against like each other; whole another story being prepared for an attack, I dont know, like a (turns and puts his face close to Rachels and screams) surprise!!"}, {"line_number": 25, "type": "action", "text": "(Rachel calmly wipes the spittle off her face.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Ross", "text": "All right, you know that one was coming, but that doesnt mean you have unagi. (Does the finger thing.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Rachel", "text": "(To Phoebe) Ooh! Yknow what? If we made reservations, we could have unagi in about a half-hour."}, {"line_number": 28, "type": "dialogue", "speaker": "Ross", "text": "Yknow what (Moves away as Chandler enters, panicked.)"}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "Hey-hey, is Monica here?"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "No."}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "No."}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Okay, look I need your help, I dont know what to get her for Valentines Day."}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Well, Valentines Day was like two weeks ago, so I wouldnt get her a calendar!"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "(laughs) She was working on Valentines Day so were celebrating it tonight."}, {"line_number": 35, "type": "dialogue", "speaker": "Joey", "text": "Ohh, hey! Why dont you book a date for both of you at one of those romantic spas?"}, {"line_number": 36, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh, Joey, thats actually a really good idea!"}, {"line_number": 37, "type": "dialogue", "speaker": "Joey", "text": "And of course, crotchless panties. "}, {"line_number": 38, "type": "dialogue", "speaker": "Chandler", "text": "Well appealing as that does sound to her boyfriend (pause) and her brother, (the camera pans to Ross flashing Joey a very evil look; Joey gets scared) I cant do that we promised wed make each other gifts this year."}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Aw, I love that."}, {"line_number": 40, "type": "dialogue", "speaker": "Phoebe", "text": "You guys!"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "You cant make crotchless panties? You take, you take a pair of scissors and you just cut"}, {"line_number": 42, "type": "dialogue", "speaker": "Rachel", "text": "(interrupting him) Okay-okay-okay! So, making things. That sounds like so much fun."}, {"line_number": 43, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I thought so to until I paper mached one of my eyes shut."}, {"line_number": 44, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, I love paper mache! What did you make?"}, {"line_number": 45, "type": "dialogue", "speaker": "Chandler", "text": "I made a (Does one of those gibberish words.)"}, {"line_number": 46, "type": "dialogue", "speaker": "Phoebe", "text": "What is that?"}, {"line_number": 47, "type": "dialogue", "speaker": "Chandler", "text": "Nothing!"}, {"line_number": 48, "type": "dialogue", "speaker": "Ross", "text": "So what are you gonna do?"}, {"line_number": 49, "type": "dialogue", "speaker": "Chandler", "text": "Well, have you guys made anything that maybe I can take credit for?"}, {"line_number": 50, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh! I have! I have! I started making these little sock bunnies! (She takes out a sock thats been made into a bunny with eyes, nose, mouth, whiskers, and two other socks sown onto it for ears.) Oh for crying out loud!"}, {"line_number": 51, "type": "dialogue", "speaker": "Rachel", "text": "Hey, wait a minute! That is my sock!"}, {"line_number": 52, "type": "dialogue", "speaker": "Phoebe", "text": "Now, its you little bunny friend. (She sticks it in Rachels face and they both laugh.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 4, "scene_id": "S06E23_004", "location": "Monica and Chandler's", "scene_description": "Chandler is desperately trying to make his Valentines Day gift. He takes a paper cup, turns it upside down, sticks two pencils into the top, and hangs a coat hanger from the bottom.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E23/scenes/S06E23_004", "raw_text": "[Scene: Monica and Chandler's, Chandler is desperately trying to make his Valentines Day gift. He takes a paper cup, turns it upside down, sticks two pencils into the top, and hangs a coat hanger from the bottom.]\nChandler: (admiring his work) This, this actually is a (Does the same gibberish word from before.)\nMonica: (entering) Hey!\nChandler: Hey! Honey, can I ask you a question about the Valentines Day gifts?\nMonica: Oh, yeah.\nChandler: Do we have to make the entire thing?\nMonica: Yes! Why, did youyou forget to make yours?\nChandler: Of course, of course not. I just have to uh, go over to the place where I-I made it and pick-pick it up.\nMonica: Okay. (They kiss.) Okay, I cant wait! This is going to be the best Valentines Day ever! (Chandler giggles and exits.) I cant believe it! Make the presents! Make the presents!\nChandler: (sticking his head back in) What?\nMonica: Im just so excited to make the presents! (Chandler does another sarcastic/scared laugh and leaves.) Shoot!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is desperately trying to make his Valentines Day gift. He takes a paper cup, turns it upside down, sticks two pencils into the top, and hangs a coat hanger from the bottom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(admiring his work) This, this actually is a (Does the same gibberish word from before.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(entering) Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Honey, can I ask you a question about the Valentines Day gifts?"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Oh, yeah."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Do we have to make the entire thing?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Yes! Why, did youyou forget to make yours?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Of course, of course not. I just have to uh, go over to the place where I-I made it and pick-pick it up."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Okay. (They kiss.) Okay, I cant wait! This is going to be the best Valentines Day ever! (Chandler giggles and exits.) I cant believe it! Make the presents! Make the presents!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "(sticking his head back in) What?"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Im just so excited to make the presents! (Chandler does another sarcastic/scared laugh and leaves.) Shoot!"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 5, "scene_id": "S06E23_005", "location": "A Medical Research Office", "scene_description": "Joey is there to sign up for an experiment, any experiment.", "characters": ["Joey", "Receptionist"], "firestore_path": "/episodes/S06E23/scenes/S06E23_005", "raw_text": "[Scene: A Medical Research Office, Joey is there to sign up for an experiment, any experiment.]\nJoey: (to the receptionist) Hi uh, Im Joey Tribbiani and with all do respect Id like to donate some fluids.\nReceptionist: Were actually at the end of one of our research cycles, so were not looking for applicants right now.\nJoey: Oh thats too bad. Ive kinda been saving up. (She just looks at him in horror.) Uh, are you sure theres no studies I can participate in?\nReceptionist: Well, heres a schedule of whats coming up. (Hands it to him.)\nJoey: Thanks. (Starts to read it.) Well but this one starts now. (Points to one.)\nReceptionist: Oh that one is available now, but only identical twins are eligible. Its a twins study. \nJoey: But its $2,000.\nReceptionist: Sorry.\nJoey: Well how about this one? Testing the effects of Joey Tribbiani on attractive nurse receptionists.\nReceptionist: We already got the results back on that on, and theyre not good. (Joey beats a hasty retreat.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A Medical Research Office, Joey is there to sign up for an experiment, any experiment.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(to the receptionist) Hi uh, Im Joey Tribbiani and with all do respect Id like to donate some fluids."}, {"line_number": 3, "type": "dialogue", "speaker": "Receptionist", "text": "Were actually at the end of one of our research cycles, so were not looking for applicants right now."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Oh thats too bad. Ive kinda been saving up. (She just looks at him in horror.) Uh, are you sure theres no studies I can participate in?"}, {"line_number": 5, "type": "dialogue", "speaker": "Receptionist", "text": "Well, heres a schedule of whats coming up. (Hands it to him.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Thanks. (Starts to read it.) Well but this one starts now. (Points to one.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Receptionist", "text": "Oh that one is available now, but only identical twins are eligible. Its a twins study. "}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "But its $2,000."}, {"line_number": 9, "type": "dialogue", "speaker": "Receptionist", "text": "Sorry."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Well how about this one? Testing the effects of Joey Tribbiani on attractive nurse receptionists."}, {"line_number": 11, "type": "dialogue", "speaker": "Receptionist", "text": "We already got the results back on that on, and theyre not good. (Joey beats a hasty retreat.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 6, "scene_id": "S06E23_006", "location": "The Hallway between the Apartments", "scene_description": "Ross is hiding behind that bump out on Monicas side waiting for Phoebe and Rachel. As they come up the stairs, he jumps out and yells", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_006", "raw_text": "[Scene: The Hallway between the Apartments, Ross is hiding behind that bump out on Monicas side waiting for Phoebe and Rachel. As they come up the stairs, he jumps out and yells]\nRoss: DANGER!!! DANGER!!!!!\n(They both scream and jump away.)\nPhoebe: Ross!!!\nRachel: What the hell was that?!\nRoss: A lesson in the importance of unagi. (He starts doing the finger thing every time now.)\nPhoebe: Ohh, youre a freak!!\nRoss: Perhaps. Now Im curious, at what point during those girlish screams would you have begun to kick my ass?\nRachel: All right, so we werent prepared!\nRoss: Im sorry I had to take such drastic measures to make my point, but Ilook, I just want you guys to be safe. (Monica comes out to throw out the garbage and Ross screams) DANGER!!!!! (She completely ignores him and keeps walking.) Ahhh, huh? Unagi.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Hallway between the Apartments, Ross is hiding behind that bump out on Monicas side waiting for Phoebe and Rachel. As they come up the stairs, he jumps out and yells]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "DANGER!!! DANGER!!!!!"}, {"line_number": 3, "type": "action", "text": "(They both scream and jump away.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Ross!!!"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "What the hell was that?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "A lesson in the importance of unagi. (He starts doing the finger thing every time now.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh, youre a freak!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Perhaps. Now Im curious, at what point during those girlish screams would you have begun to kick my ass?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "All right, so we werent prepared!"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Im sorry I had to take such drastic measures to make my point, but Ilook, I just want you guys to be safe. (Monica comes out to throw out the garbage and Ross screams) DANGER!!!!! (She completely ignores him and keeps walking.) Ahhh, huh? Unagi."}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 7, "scene_id": "S06E23_007", "location": "Cole-Geddes Casting Agency", "scene_description": "Joey is there on his audition and thinking about that 2,000 bucks for the twins study.", "characters": ["Joey"], "firestore_path": "/episodes/S06E23/scenes/S06E23_007", "raw_text": "[Scene: Cole-Geddes Casting Agency, Joey is there on his audition and thinking about that 2,000 bucks for the twins study.]\nJoey: (in his head) 2,000 bucks is a lot of money. Oh, I wish I had a twin. Where could I find someone who looks exactly like me? (The camera widens its shot to reveal a room full of Joey look-a-likes. Joey looks at the guy next to him and then back at his script.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Cole-Geddes Casting Agency, Joey is there on his audition and thinking about that 2,000 bucks for the twins study.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(in his head) 2,000 bucks is a lot of money. Oh, I wish I had a twin. Where could I find someone who looks exactly like me? (The camera widens its shot to reveal a room full of Joey look-a-likes. Joey looks at the guy next to him and then back at his script.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 8, "scene_id": "S06E23_008", "location": "Ross's apartment", "scene_description": "Ross is coming in from doing his laundry. He starts folding it as Chandler enters.", "characters": ["Chandler", "Phoebe and Rachel", "Rachel", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_008", "raw_text": "[Scene: Ross's apartment, Ross is coming in from doing his laundry. He starts folding it as Chandler enters.]\nChandler: Hey.\nRoss: (not turning around) Chandler. I sensed it was you.\nChandler: What?!\nRoss: Unagi. Im always aware.\nChandler: Okay, are you aware unagi (does the finger thing) is an eel?\nRoss: Whats up?\nChandler: I cant figure out what to make Monica.\nRoss: Oh, why dont you make her one of your little jokes.\nChandler: Im going crazy! Okay? Do you have any thing around here that looks homemade?\nRoss: Yknow what? Shed-shed love this. (Picks up a model of the Saturn V rocket, thats the one that took man to the moon.) Uh, its an exact replica of Apollo 8. I made it in the sixth grade.\nChandler: Yeah, I guess I could use that. I could say that your love sends me to the moon.\nRoss: Yeah-yeah, except Apollo 8 didnt actually land on the moon. But you-you-you could write that umm, your love lets me orbit the moon twice and return safely. (Apollo 8 was the first one that orbited the moon and the one that read the Christmas Story from the orbit of the moon on Christmas Eve, 1968. They also took the famous Earthrise picture of the Earth rising over the moon.)\nChandler: Wait a minute, I cant give this to her.\nRoss: Why not?\nChandler: Because it says \"Captain Ross\" on the side and \"I hate Monica\" on the bottom.\nRoss: Oh.\n(Chandler leaves dejectedly. When the door closes Rachel and Phoebe jump out from behind the curtains and scream)\nPhoebe and Rachel: DANGER!!!!!\n(Ross screams like a little girl.)\nRachel: Ahhhhh, salmon skin roll. (She does the finger thing.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross's apartment, Ross is coming in from doing his laundry. He starts folding it as Chandler enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(not turning around) Chandler. I sensed it was you."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "What?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Unagi. Im always aware."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Okay, are you aware unagi (does the finger thing) is an eel?"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Whats up?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "I cant figure out what to make Monica."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Oh, why dont you make her one of your little jokes."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Im going crazy! Okay? Do you have any thing around here that looks homemade?"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Yknow what? Shed-shed love this. (Picks up a model of the Saturn V rocket, thats the one that took man to the moon.) Uh, its an exact replica of Apollo 8. I made it in the sixth grade."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I guess I could use that. I could say that your love sends me to the moon."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Yeah-yeah, except Apollo 8 didnt actually land on the moon. But you-you-you could write that umm, your love lets me orbit the moon twice and return safely. (Apollo 8 was the first one that orbited the moon and the one that read the Christmas Story from the orbit of the moon on Christmas Eve, 1968. They also took the famous Earthrise picture of the Earth rising over the moon.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Wait a minute, I cant give this to her."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Why not?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Because it says \"Captain Ross\" on the side and \"I hate Monica\" on the bottom."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "Oh."}, {"line_number": 18, "type": "action", "text": "(Chandler leaves dejectedly. When the door closes Rachel and Phoebe jump out from behind the curtains and scream)"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe and Rachel", "text": "DANGER!!!!!"}, {"line_number": 20, "type": "action", "text": "(Ross screams like a little girl.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Ahhhhh, salmon skin roll. (She does the finger thing.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 9, "scene_id": "S06E23_009", "location": "Monica and Chandlers bedroom", "scene_description": "hes still trying to figure out what to make Monica.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E23/scenes/S06E23_009", "raw_text": "[Scene: Monica and Chandlers bedroom, hes still trying to figure out what to make Monica.]\nChandler: Okay. Okay. (He goes to the closet, moves the clothes out of the way, and notices an empty hanger. He takes the empty hanger and bends it all out of shape. Then he holds it out as if hes giving it to her.) Yes honey, I made it myself. (He throws it down and goes to her chest, grabs something, goes to the bed table, and takes out a pair of scissors. He turns around and holds the scissors to the crotch of the panties he just removed.) I cant do it. I cant do it. (He throws them both down and continues looking. He opens another closet door and finds a tape.) Oh! Oh! A mixed tape! A mixed tape!! (He runs out into the living room.)\n[Cut to the living room, Chandler is entering as Monica finishes wrapping her present for him on the kitchen table.]\nChandler: Hey! Hi! You uh, ready to exchange gifts?\nMonica: Sure! Okay, you go first.\nChandler: Okay, come here! Come here.\nMonica: Okay! (She takes her present for him and they move over to sit on the couch.)\nChandler: Now, its not wrapped because I just, just finished it.\nMonica: Okay.\nChandler: But I made you a tape of what I think are all romantic songs.\nMonica: Oh, what a great gift! Is The Way You Look Tonight on it?!\nChandler: (momentarily terrified) Maybe well have to listen and see!\nMonica: Oh, I love it! Thank you so much!\nChandler: Okay!\nMonica: Okay, you ready to open yours?\nChandler: Yeah!\nMonica: Okay.\n(He opens his present to find Phoebes sock bunny from earlier.)\nChandler: Its a sock bunny.\nMonica: Yeah-yeah, you remember how I call you bunny?\nChandler: Not really.\nMonica: Well, I did one time, and-and I want to start doing it more. See thats what this is about.\nChandler: I see. Yknow umm, Phoebe makes sock bunnies.\nMonica: No! No, she doesnt. Uh Phoebe, what she makesthats uhtheyre sock rabbits. They are completely differentOkay! Okay! Okay! I didnt make it! Im sorry! I totally forgot about tonight and the fact that were supposed to make the presents!\nChandler: Oh, its okay. I dont\nMonica: No-no, its not okay! Its not! I mean you were just Youre so incredible! You went through all this time and effort to make this tape for me! Yknow Im just gonnaI, I am gonna make this up to you! I will! I-I am going to cook anything you want in here (points to the kitchen), and I am going to do anything you want in there! (Points to the bedroom.)\nChandler: (thinking it over) Well, I did put a lot of thought in the tape. (They both run into the bedroom.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandlers bedroom, hes still trying to figure out what to make Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Okay. Okay. (He goes to the closet, moves the clothes out of the way, and notices an empty hanger. He takes the empty hanger and bends it all out of shape. Then he holds it out as if hes giving it to her.) Yes honey, I made it myself. (He throws it down and goes to her chest, grabs something, goes to the bed table, and takes out a pair of scissors. He turns around and holds the scissors to the crotch of the panties he just removed.) I cant do it. I cant do it. (He throws them both down and continues looking. He opens another closet door and finds a tape.) Oh! Oh! A mixed tape! A mixed tape!! (He runs out into the living room.)"}, {"line_number": 3, "type": "narration", "text": "[Cut to the living room, Chandler is entering as Monica finishes wrapping her present for him on the kitchen table.]"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Hi! You uh, ready to exchange gifts?"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Sure! Okay, you go first."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Okay, come here! Come here."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Okay! (She takes her present for him and they move over to sit on the couch.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Now, its not wrapped because I just, just finished it."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "But I made you a tape of what I think are all romantic songs."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Oh, what a great gift! Is The Way You Look Tonight on it?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "(momentarily terrified) Maybe well have to listen and see!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Oh, I love it! Thank you so much!"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Okay!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Okay, you ready to open yours?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Yeah!"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 18, "type": "action", "text": "(He opens his present to find Phoebes sock bunny from earlier.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Its a sock bunny."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Yeah-yeah, you remember how I call you bunny?"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Not really."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Well, I did one time, and-and I want to start doing it more. See thats what this is about."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "I see. Yknow umm, Phoebe makes sock bunnies."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "No! No, she doesnt. Uh Phoebe, what she makesthats uhtheyre sock rabbits. They are completely differentOkay! Okay! Okay! I didnt make it! Im sorry! I totally forgot about tonight and the fact that were supposed to make the presents!"}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Oh, its okay. I dont"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "No-no, its not okay! Its not! I mean you were just Youre so incredible! You went through all this time and effort to make this tape for me! Yknow Im just gonnaI, I am gonna make this up to you! I will! I-I am going to cook anything you want in here (points to the kitchen), and I am going to do anything you want in there! (Points to the bedroom.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "(thinking it over) Well, I did put a lot of thought in the tape. (They both run into the bedroom.)"}, {"line_number": 28, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 10, "scene_id": "S06E23_010", "location": "Monica and Chandlers bedroom", "scene_description": "they are relaxing in sexual bliss.", "characters": ["Carl", "Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E23/scenes/S06E23_010", "raw_text": "[Scene: Monica and Chandlers bedroom, they are relaxing in sexual bliss.]\nChandler: Wow! (To the sock bunny still on his hand.) You are way to young to have seen that!\nMonica: Oops! (Covers its eyes.) Yknow, your birthday is in a month-and-a-half, what do you say I forget to get you a present for that too?\nChandler: You are totally and completely 100% forgiven.\nMonica: We have got to wash that! (Referring to the sock bunny.)\nChandler: Yeah! (Takes it off his hand and throws it behind the night-stand.)\nMonica: Do you remember that jacket that you love so much, that you thought was too expensive?\nChandler: You have done enough!\nMonica: I wanna wake up early and go get it for you!\nChandler: No you dontget it in black, not brown.\n(The oven dings.)\nMonica: Oop, your cake is ready!\nChandler: Oop!\n(They both get out of bed and go get some cake.)\nChandler: Well, its like that old saying, have some sex, eat some cake.\n(As they approach the kitchen, the door opens and in walks in a Joey look-a-like.)\nJoey's Look-A-Like: Hey Mon! Hey Chann! (He goes to the fridge) Just gettin a soda! (Does so.)\nMonica: Who the hell are you?!\nJoey's Look-A-Like: Im Joey! How are you doin?!\nJoey: (entering) No! No! No! No! No! How you doin?! How you doinDamnit Carl! Go wait in the hall! (Goes into the hall.)\nJoey: Look, I got to apologize on the behalf of Carl.\nChandler: Who the hell is Carl?!\nJoey: Oh, did I not mention? Carl is a guy I hired to be my identical twin for a medical research project.\nChandler: Yknow sometimes the good ideas are just right in front of you, arent they?\nJoey: Okay, I know it sounds crazy, but I think it might work. Yknow? The only problem is, Carls acting is (Does the international hand symbol for so-so.)\nMonica: The only problem!\nJoey: Yeah, hes the reason I didnt get that big Minute Maid commercial a couple of years ago remember? We were supposed to be brothers, but he messed it up.\nCarl: (sticking his head back in) Hey, uh can I get a little piece of that cake?\nJoey: (to Carl) Pizza!! We like Pizza!! Get out!!! (Carl does so.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandlers bedroom, they are relaxing in sexual bliss.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Wow! (To the sock bunny still on his hand.) You are way to young to have seen that!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Oops! (Covers its eyes.) Yknow, your birthday is in a month-and-a-half, what do you say I forget to get you a present for that too?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "You are totally and completely 100% forgiven."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "We have got to wash that! (Referring to the sock bunny.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Yeah! (Takes it off his hand and throws it behind the night-stand.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Do you remember that jacket that you love so much, that you thought was too expensive?"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "You have done enough!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "I wanna wake up early and go get it for you!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "No you dontget it in black, not brown."}, {"line_number": 11, "type": "action", "text": "(The oven dings.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Oop, your cake is ready!"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Oop!"}, {"line_number": 14, "type": "action", "text": "(They both get out of bed and go get some cake.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Well, its like that old saying, have some sex, eat some cake."}, {"line_number": 16, "type": "action", "text": "(As they approach the kitchen, the door opens and in walks in a Joey look-a-like.)"}, {"line_number": 17, "type": "narration", "text": "Joey's Look-A-Like: Hey Mon! Hey Chann! (He goes to the fridge) Just gettin a soda! (Does so.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Who the hell are you?!"}, {"line_number": 19, "type": "narration", "text": "Joey's Look-A-Like: Im Joey! How are you doin?!"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "(entering) No! No! No! No! No! How you doin?! How you doinDamnit Carl! Go wait in the hall! (Goes into the hall.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Look, I got to apologize on the behalf of Carl."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "Who the hell is Carl?!"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Oh, did I not mention? Carl is a guy I hired to be my identical twin for a medical research project."}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "Yknow sometimes the good ideas are just right in front of you, arent they?"}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Okay, I know it sounds crazy, but I think it might work. Yknow? The only problem is, Carls acting is (Does the international hand symbol for so-so.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "The only problem!"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Yeah, hes the reason I didnt get that big Minute Maid commercial a couple of years ago remember? We were supposed to be brothers, but he messed it up."}, {"line_number": 28, "type": "dialogue", "speaker": "Carl", "text": "(sticking his head back in) Hey, uh can I get a little piece of that cake?"}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "(to Carl) Pizza!! We like Pizza!! Get out!!! (Carl does so.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 11, "scene_id": "S06E23_011", "location": "Phoebe and Rachel's", "scene_description": "Phoebe and Rachel are returning.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_011", "raw_text": "[Scene: Phoebe and Rachel's, Phoebe and Rachel are returning.]\nPhoebe: Pat Sajak?\nRachel: Yep!\nPhoebe: Alex Trebek?\nRachel: Oh, of course!\nPhoebe: Chuck Woolery?\nRachel: Definitely! Phoebe, you will not find a single game show host, whos ass I cannot kick.\n(They start to walk into the living room and notice someones head sticking up from behind a chair. The camera cuts to the other side and we see its Ross.)\n[Time lapse. The girls have Ross pinned face down. Phoebe is sitting on his back and arms while holding his head down and facing Rachel. Rachel is sitting on his knees and holding his lower legs vertically, causing Ross pain.]\nRachel: Say it!\nPhoebe: Say we are unagi!\nRoss: Its not something you are! Its something you have!\nRachel: Say it!\nRoss: Yknow what? I can easily get out of this, but there is a chance you can get very, very hurt!\n(Rachel yanks on his legs again and he groans in pain.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebe and Rachel's, Phoebe and Rachel are returning.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Pat Sajak?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Yep!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Alex Trebek?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh, of course!"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Chuck Woolery?"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Definitely! Phoebe, you will not find a single game show host, whos ass I cannot kick."}, {"line_number": 8, "type": "action", "text": "(They start to walk into the living room and notice someones head sticking up from behind a chair. The camera cuts to the other side and we see its Ross.)"}, {"line_number": 9, "type": "narration", "text": "[Time lapse. The girls have Ross pinned face down. Phoebe is sitting on his back and arms while holding his head down and facing Rachel. Rachel is sitting on his knees and holding his lower legs vertically, causing Ross pain.]"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Say it!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Say we are unagi!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Its not something you are! Its something you have!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Say it!"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Yknow what? I can easily get out of this, but there is a chance you can get very, very hurt!"}, {"line_number": 15, "type": "action", "text": "(Rachel yanks on his legs again and he groans in pain.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 12, "scene_id": "S06E23_012", "location": "The Medical Research office", "scene_description": "Joey is there with Carl in the waiting room. Two identical twins come out and both wave by at the same time.", "characters": ["Carl", "Joey", "The Doctor"], "firestore_path": "/episodes/S06E23/scenes/S06E23_012", "raw_text": "[Scene: The Medical Research office, Joey is there with Carl in the waiting room. Two identical twins come out and both wave by at the same time.]\nJoey: All right Carl, were next. Now remember, what is not gonna be?\nCarl: Another Minute Maid fiasco.\nJoey: Thats right! And what are you not gonna do?\nCarl: Well, Im not gonna talk because\nJoey: (gets very angry) Damnit Carl! (Carl goes to say something more, and Joey silences him with a grunt.)\nThe Doctor: (entering) (To the receptionist) Can I have the next one please? (Takes the form.) Joey and Tony Tribbiani. (Joey and Carl stand up.)\nJoey: Thats us.\nThe Doctor: (seeing theyre not identical) But uh, this is a study for identical twins.\nJoey: Thats right, $2,000.\nThe Doctor: But, youre not identical twins.\nJoey: Damnit Carl!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Medical Research office, Joey is there with Carl in the waiting room. Two identical twins come out and both wave by at the same time.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "All right Carl, were next. Now remember, what is not gonna be?"}, {"line_number": 3, "type": "dialogue", "speaker": "Carl", "text": "Another Minute Maid fiasco."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Thats right! And what are you not gonna do?"}, {"line_number": 5, "type": "dialogue", "speaker": "Carl", "text": "Well, Im not gonna talk because"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(gets very angry) Damnit Carl! (Carl goes to say something more, and Joey silences him with a grunt.)"}, {"line_number": 7, "type": "dialogue", "speaker": "The Doctor", "text": "(entering) (To the receptionist) Can I have the next one please? (Takes the form.) Joey and Tony Tribbiani. (Joey and Carl stand up.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Thats us."}, {"line_number": 9, "type": "dialogue", "speaker": "The Doctor", "text": "(seeing theyre not identical) But uh, this is a study for identical twins."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Thats right, $2,000."}, {"line_number": 11, "type": "dialogue", "speaker": "The Doctor", "text": "But, youre not identical twins."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Damnit Carl!"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 13, "scene_id": "S06E23_013", "location": "Monica and Chandler's", "scene_description": "Monica is getting ready for Chandlers arrival. He enters and finds the place lit with candles and dinner on the table.", "characters": ["Chandler", "Janice", "Monica"], "firestore_path": "/episodes/S06E23/scenes/S06E23_013", "raw_text": "[Scene: Monica and Chandler's, Monica is getting ready for Chandlers arrival. He enters and finds the place lit with candles and dinner on the table.]\nChandler: Oh my good God.\nMonica: Hey! Continuing the countdown of your favorite meals. Tonight, No. 3, macaroni and cheese with cut up hot dogs.\nChandler: Look, you have done enough! Okay? You have to stop this now.\nMonica: I will! But not tonight. For dinner music, I thought we could listen to that tape you made me.\nChandler: Oh, the mixed tape.\n(Monica pushes play and The Way You Look Tonight starts to play.)\nMonica: The Way You Look Tonight is on here! Dance with me?\n(He hesitates, then goes over to dance with her.)\nMonica: You are just the sweetest. (They kiss.)\n(Suddenly, a strange and familiar voice comes out of the tape player. Heres a hint, OHMYGAWD!! Thats right, its Janice!)\nJanice: I love the way you look every night Chandler! (Monica breaks the kiss and Chandler freezes in terror.) Thats why I made you this tape! Happy Birthday! Love Janice!\nChandler: No! Youre the sweetest! (He tries to kiss her but Monica backs away with a look that could kill on her face.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica is getting ready for Chandlers arrival. He enters and finds the place lit with candles and dinner on the table.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Oh my good God."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Hey! Continuing the countdown of your favorite meals. Tonight, No. 3, macaroni and cheese with cut up hot dogs."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Look, you have done enough! Okay? You have to stop this now."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "I will! But not tonight. For dinner music, I thought we could listen to that tape you made me."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Oh, the mixed tape."}, {"line_number": 7, "type": "action", "text": "(Monica pushes play and The Way You Look Tonight starts to play.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "The Way You Look Tonight is on here! Dance with me?"}, {"line_number": 9, "type": "action", "text": "(He hesitates, then goes over to dance with her.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "You are just the sweetest. (They kiss.)"}, {"line_number": 11, "type": "action", "text": "(Suddenly, a strange and familiar voice comes out of the tape player. Heres a hint, OHMYGAWD!! Thats right, its Janice!)"}, {"line_number": 12, "type": "dialogue", "speaker": "Janice", "text": "I love the way you look every night Chandler! (Monica breaks the kiss and Chandler freezes in terror.) Thats why I made you this tape! Happy Birthday! Love Janice!"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "No! Youre the sweetest! (He tries to kiss her but Monica backs away with a look that could kill on her face.)"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 14, "scene_id": "S06E23_014", "location": "A womens self-defense class", "scene_description": "the instructor is just finishing a class.", "characters": ["Ross", "The Instructor"], "firestore_path": "/episodes/S06E23/scenes/S06E23_014", "raw_text": "[Scene: A womens self-defense class, the instructor is just finishing a class.]\nThe Instructor: Okay ladies, that ends todays class, and lets remember, lets be safe out there. \n(The women all clap and start to leave as Ross comes up to the instructor. Apparently he was hiding in the back.)\nRoss: Its a great class.\nThe Instructor: Thanks.\nRoss: Yeah, yeah, I was watching. (The instructor just nods and walks away.) Umm, hey, a couple of questions though. Umm, about that-that-that last move where the woman tripped you and then pinned you to the floor, what-what-what-what would you do next?\nThe Instructor: Well, she would take her keys and try to jam them\nRoss: No. No-no. No. What would you do next?\nThe Instructor: Who? Me the attacker?\nRoss: Yes thats right.\nThe Instructor: Why?\nRoss: I tired attacking two women, did not work.\nThe Instructor: What?!\nRoss: No, I mean its okay, I mean, theyre-theyre my friends. In fact, I-I-I was married to one of them.\nThe Instructor: Let me get this straight man, you attacked your ex-wife?!\nRoss: Oh, no! No-no! No, I tired! But I couldnt. Thats why Im here. Maybe we could attack them together? (He glares at him.) That-thats a no.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A womens self-defense class, the instructor is just finishing a class.]"}, {"line_number": 2, "type": "dialogue", "speaker": "The Instructor", "text": "Okay ladies, that ends todays class, and lets remember, lets be safe out there. "}, {"line_number": 3, "type": "action", "text": "(The women all clap and start to leave as Ross comes up to the instructor. Apparently he was hiding in the back.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Its a great class."}, {"line_number": 5, "type": "dialogue", "speaker": "The Instructor", "text": "Thanks."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Yeah, yeah, I was watching. (The instructor just nods and walks away.) Umm, hey, a couple of questions though. Umm, about that-that-that last move where the woman tripped you and then pinned you to the floor, what-what-what-what would you do next?"}, {"line_number": 7, "type": "dialogue", "speaker": "The Instructor", "text": "Well, she would take her keys and try to jam them"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "No. No-no. No. What would you do next?"}, {"line_number": 9, "type": "dialogue", "speaker": "The Instructor", "text": "Who? Me the attacker?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Yes thats right."}, {"line_number": 11, "type": "dialogue", "speaker": "The Instructor", "text": "Why?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "I tired attacking two women, did not work."}, {"line_number": 13, "type": "dialogue", "speaker": "The Instructor", "text": "What?!"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "No, I mean its okay, I mean, theyre-theyre my friends. In fact, I-I-I was married to one of them."}, {"line_number": 15, "type": "dialogue", "speaker": "The Instructor", "text": "Let me get this straight man, you attacked your ex-wife?!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Oh, no! No-no! No, I tired! But I couldnt. Thats why Im here. Maybe we could attack them together? (He glares at him.) That-thats a no."}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 15, "scene_id": "S06E23_015", "location": "Monica and Chandler's", "scene_description": "Chandler is trying to explain himself to Monica.", "characters": ["Chandler", "Janices Voice", "Monica"], "firestore_path": "/episodes/S06E23/scenes/S06E23_015", "raw_text": "[Scene: Monica and Chandler's, Chandler is trying to explain himself to Monica.]\nChandler: I am so, so, so, so sorry!\nMonica: (not buying it) Uh-huh.\nChandler: And I will cook anything you want in here (points to the kitchen), and do anything in there! (Points to the bedroom.)\nMonica: (pointing to the kitchen) Yeah you will! (Points to the bedroom) And, are you kiddin me?!\nChandler: Come on Monica, its our Valentines Day. Please? Please-please, please?\nMonica: Okay.\nChandler: Okay. (They hug.)\nJanices Voice: (singing) My funny valentine, sweet comic valentine! You make me high over my heart!\n(Monica breaks the hug and starts for the bedroom.)\nChandler: So, are we going in there?\nMonica: I am!! (Enter her room and closes the door behind her.)\nJanices Voice: (singing) Youre look for laughable(She does the now patented Janice laugh.)\nEnding Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is trying to explain himself to Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "I am so, so, so, so sorry!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(not buying it) Uh-huh."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "And I will cook anything you want in here (points to the kitchen), and do anything in there! (Points to the bedroom.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(pointing to the kitchen) Yeah you will! (Points to the bedroom) And, are you kiddin me?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Come on Monica, its our Valentines Day. Please? Please-please, please?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Okay. (They hug.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Janices Voice", "text": "(singing) My funny valentine, sweet comic valentine! You make me high over my heart!"}, {"line_number": 10, "type": "action", "text": "(Monica breaks the hug and starts for the bedroom.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "So, are we going in there?"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "I am!! (Enter her room and closes the door behind her.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Janices Voice", "text": "(singing) Youre look for laughable(She does the now patented Janice laugh.)"}, {"line_number": 14, "type": "narration", "text": "Ending Credits"}]}
{"episode_id": "S06E23", "season": 6, "episode_number": 23, "episode_title": "THE ONE WITH THE UNAGI", "scene_number": 16, "scene_id": "S06E23_016", "location": "The street in front of Central Perk", "scene_description": "Ross is walking up and sees two women that look like Phoebe and Rachel from behind.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E23/scenes/S06E23_016", "raw_text": "[Scene: The street in front of Central Perk, Ross is walking up and sees two women that look like Phoebe and Rachel from behind.]\nRoss: Ah-ha, nowhere to run! (He starts to run towards them.)\n[Cut to Central Perk, Phoebe and Rachel are sitting up by the window because two guys have their couch.]\nRachel: I dont like sitting up here! Im just gonna over (She starts to get up.)\nPhoebe: (stopping her) No Rachel! They got here first!\n(Ross appears at the window behind them crouched behind a garbage can and ready to spring his attack on who he thinks are Phoebe and Rachel. The camera cuts to the exterior view and Phoebe and Rachel call the shots from inside.)\nPhoebe: Why is Ross doing that?\nRoss: DANGER!!!!\nRachel: Oh my God! Why is he jumping on those women!\nPhoebe: We should help him!\nRachel: I Well, I dont think they need any help.\n(Ross starts to scream and run away. He stops in front of the window of Central Perk to check the pursuit and notices Phoebe and Rachel inside looking at him. He mouths, \"What?\" Then realizes that the women he attacked are closing in so he screams and runs away.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The street in front of Central Perk, Ross is walking up and sees two women that look like Phoebe and Rachel from behind.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Ah-ha, nowhere to run! (He starts to run towards them.)"}, {"line_number": 3, "type": "narration", "text": "[Cut to Central Perk, Phoebe and Rachel are sitting up by the window because two guys have their couch.]"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "I dont like sitting up here! Im just gonna over (She starts to get up.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "(stopping her) No Rachel! They got here first!"}, {"line_number": 6, "type": "action", "text": "(Ross appears at the window behind them crouched behind a garbage can and ready to spring his attack on who he thinks are Phoebe and Rachel. The camera cuts to the exterior view and Phoebe and Rachel call the shots from inside.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Why is Ross doing that?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "DANGER!!!!"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God! Why is he jumping on those women!"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "We should help him!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "I Well, I dont think they need any help."}, {"line_number": 12, "type": "action", "text": "(Ross starts to scream and run away. He stops in front of the window of Central Perk to check the pursuit and notices Phoebe and Rachel inside looking at him. He mouths, \"What?\" Then realizes that the women he attacked are closing in so he screams and runs away.)"}, {"line_number": 13, "type": "narration", "text": "End"}]}
