{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 1, "scene_id": "S06E03_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S06E03/scenes/S06E03_001", "raw_text": "THE ONE WITH ROSSS DENIAL\nWritten by: Seth Kurland Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH ROSSS DENIAL"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Seth Kurland Transcribed by: Eric Aasen"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 2, "scene_id": "S06E03_002", "location": "Monica and Rachel's", "scene_description": "Joey, Monica, and Phoebe are there as Chandler enters.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S06E03/scenes/S06E03_002", "raw_text": "[Scene: Monica and Rachel's, Joey, Monica, and Phoebe are there as Chandler enters.]\nChandler: (entering) Hey!\nPhoebe: Hey! Check it out! This is unbelievable! Joey has been holding his breath for almost four minutes! \n(We see Joey who has puffed up his cheeks and Chandler nonchalantly reaches down and pinches Joeys nose shut. In a few seconds, Joey has to move because hes now forced to actually hold his breath.) \nJoey: (To Chandler) Dude! What are yoyou trying to kill me?!\nRachel: (entering from her room) Pheebs, I wanna ask you something.\nPhoebe: Uh-huh, what?\nRachel: Well since Im movin out and-and youre so beautiful\nPhoebe: Oh!\nRachel: how about I move in with you?\nPhoebe: Well, that would be great but then what do we do about Denise?\nMonica: Whos Denise?\nPhoebe: My roommate.\nRachel: You have a roommate?!\nPhoebe: Yes, Denise. Denise! \nJoey: Hey, what is with the secrecy Phoebe? Huh? And what about this Denise, is she cute?\nChandler: Pheebs, I dont understand. How can you have a roommate that none of us know anything about?\nPhoebe: Maybe because you never listen to anything that I say. I talk about her all the time! DENISE!!!!!\nJoey: Hey Rach, listen I was thinkin uh, Im gonna have an extra room over at my place\nRachel: Oh, thats true.\nJoey: Yeah, why dont you move in with me? Itll be great! We could stay up late, watch movies, and you know about Naked Thursdays right?\nRachel: Yeah, yeah I think Im gonna find my own place.\nChandler: Hey-hey! I thought Naked Thursdays was just our thing man!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Joey, Monica, and Phoebe are there as Chandler enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(entering) Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey! Check it out! This is unbelievable! Joey has been holding his breath for almost four minutes! "}, {"line_number": 4, "type": "narration", "text": "(We see Joey who has puffed up his cheeks and Chandler nonchalantly reaches down and pinches Joeys nose shut. In a few seconds, Joey has to move because hes now forced to actually hold his breath.) "}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "(To Chandler) Dude! What are yoyou trying to kill me?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "(entering from her room) Pheebs, I wanna ask you something."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-huh, what?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Well since Im movin out and-and youre so beautiful"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "how about I move in with you?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Well, that would be great but then what do we do about Denise?"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Whos Denise?"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "My roommate."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "You have a roommate?!"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, Denise. Denise! "}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Hey, what is with the secrecy Phoebe? Huh? And what about this Denise, is she cute?"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Pheebs, I dont understand. How can you have a roommate that none of us know anything about?"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Maybe because you never listen to anything that I say. I talk about her all the time! DENISE!!!!!"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Hey Rach, listen I was thinkin uh, Im gonna have an extra room over at my place"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Oh, thats true."}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Yeah, why dont you move in with me? Itll be great! We could stay up late, watch movies, and you know about Naked Thursdays right?"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, yeah I think Im gonna find my own place."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Hey-hey! I thought Naked Thursdays was just our thing man!"}, {"line_number": 24, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 3, "scene_id": "S06E03_003", "location": "Central Perk", "scene_description": "Ross is reading a magazine, eating a cookie, and drinking some coffee as Phoebe enters.", "characters": ["Phoebe", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_003", "raw_text": "[Scene: Central Perk, Ross is reading a magazine, eating a cookie, and drinking some coffee as Phoebe enters.]\nPhoebe: Hey.\nRoss: Hey!\nPhoebe: So, what did Rachel say when you told her you were still married to her?\nRoss: Oh, that. Umm, she took it really well.\nPhoebe: You didnt tell her did you?\nRoss: No. \nPhoebe: Of course not, because youre in love with her.\nRoss: I am not in love with her. She was very upset about having to move out so I eh, didnt tell her we were still married because she would only get more upset. I-I just comforted her, as a friend.\nPhoebe: What do you mean, comforted her?\nRoss: Its nothing, I just gave her a hug.\nPhoebe: Ah-ha! A classic sign of love, the hug!\nRoss: Its also a sign of friendship.\nPhoebe: Yeah, not in your case Lovey Loverson. (Tries to take a bite out of Rosss cookie.)\nRoss: (grabs back his cookie) It was a hug!\nPhoebe: Okay, just tell me this, did you or did you not smell her hair?\nRoss: S-s-smell her hair? What if I did?\nPhoebe: Ninety percent of a womens pheromones come out the top of her head! Thats why, thats why women are shorter. So that men will fall in love when they hug them! (Ross is staring at her dumbfounded.) Oh come on Ross, youre a scientist. \nRoss: I was hugging her as a friend. Its not my fault her-her hair got in my face, shes got a lot of it and it smells all-all uhcoconutty. (Phoebe raises her eyebrows.) What?! Oh, that doesnt mean I have feelings for Rachel! Maybe it means I have feelings for coconuts!\nPhoebe: (taking his coffee) Okay, whatever you say. But just be careful, all right? Rachels not in the same place you are.\nRoss: (grabbing back his coffee) If the place you are referring too is being in love, then she is in the same place as me because I am not in that place!\nPhoebe: Okay, I didnt understand that, but yknow, maybe thats cause you were speaking the secret language of love! \n(She goes for his magazine and he grabs it away before she reaches it. But she was only using the magazine as a decoy because she grabs his cookie and coffee, takes a bite out of the cookie and drinks some of the coffee.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross is reading a magazine, eating a cookie, and drinking some coffee as Phoebe enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Hey."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "So, what did Rachel say when you told her you were still married to her?"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Oh, that. Umm, she took it really well."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "You didnt tell her did you?"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "No. "}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Of course not, because youre in love with her."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "I am not in love with her. She was very upset about having to move out so I eh, didnt tell her we were still married because she would only get more upset. I-I just comforted her, as a friend."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "What do you mean, comforted her?"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Its nothing, I just gave her a hug."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Ah-ha! A classic sign of love, the hug!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Its also a sign of friendship."}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, not in your case Lovey Loverson. (Tries to take a bite out of Rosss cookie.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "(grabs back his cookie) It was a hug!"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, just tell me this, did you or did you not smell her hair?"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "S-s-smell her hair? What if I did?"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Ninety percent of a womens pheromones come out the top of her head! Thats why, thats why women are shorter. So that men will fall in love when they hug them! (Ross is staring at her dumbfounded.) Oh come on Ross, youre a scientist. "}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "I was hugging her as a friend. Its not my fault her-her hair got in my face, shes got a lot of it and it smells all-all uhcoconutty. (Phoebe raises her eyebrows.) What?! Oh, that doesnt mean I have feelings for Rachel! Maybe it means I have feelings for coconuts!"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "(taking his coffee) Okay, whatever you say. But just be careful, all right? Rachels not in the same place you are."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "(grabbing back his coffee) If the place you are referring too is being in love, then she is in the same place as me because I am not in that place!"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, I didnt understand that, but yknow, maybe thats cause you were speaking the secret language of love! "}, {"line_number": 23, "type": "action", "text": "(She goes for his magazine and he grabs it away before she reaches it. But she was only using the magazine as a decoy because she grabs his cookie and coffee, takes a bite out of the cookie and drinks some of the coffee.)"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 4, "scene_id": "S06E03_004", "location": "Monica and Rachel's", "scene_description": "Chandler and Monica are there as Joey enters.", "characters": ["Chandler", "Joey", "Monica"], "firestore_path": "/episodes/S06E03/scenes/S06E03_004", "raw_text": "[Scene: Monica and Rachel's, Chandler and Monica are there as Joey enters.]\nJoey: Hey! (To Chandler) Dude, some guy just called for you.\nChandler: Who was it?\nJoey: I dont know! How about, \"Thanks for taking the message.\" Jeez! (Exits.)\nMonica: Okay listen, yknow when you move in Rachels room is gonna be empty, you wanna talk about what we want to do with it?\nChandler: Sure!\nMonica: Okay, I was thinking we should have a beautiful guest room, right? With a mahogany sleigh bed and bedside tables with flowers on them all the time! And we could have a roll top desk with comment cards on them so people could say how much they loved staying here!! Okay, whatever, I really havent thought about it that much.\nChandler: Well, I like that idea. Obviously! I was thinking maybe-maybe-maybe it could be a game room, yknow? I mean you can buy old arcade games like uh, like Space Invaders and Asteroids for $200, the real ones! The big-big ones!\nMonica: No.\nChandler: Okay so you mean no as in, \"Gee Chandler, what an interesting idea. Lets discuss it before we reject it completely.\"\nMonica: Oh, Im sorry. Of course I mean that. Interesting idea, umm, talk about it, but no.\nChandler: So, thats it?\nMonica: I just dont think arcade games go in the beautiful guest room. The beautiful guest room is gonna be filled with antiques.\nChandler: Which is why Asteroids is perfect! Its the oldest game!\nMonica: What do you have against the beautiful guest room?\nChandler: I dont have anything against the beautiful guest room, especially since everybody we know lives about 30 seconds away!\nMonica: Are you mocking me?\nChandler: No, Im not mocking you, (in a mocking voice) or you beautiful guest room. (Exits.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Chandler and Monica are there as Joey enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey! (To Chandler) Dude, some guy just called for you."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Who was it?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "I dont know! How about, \"Thanks for taking the message.\" Jeez! (Exits.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Okay listen, yknow when you move in Rachels room is gonna be empty, you wanna talk about what we want to do with it?"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Sure!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Okay, I was thinking we should have a beautiful guest room, right? With a mahogany sleigh bed and bedside tables with flowers on them all the time! And we could have a roll top desk with comment cards on them so people could say how much they loved staying here!! Okay, whatever, I really havent thought about it that much."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Well, I like that idea. Obviously! I was thinking maybe-maybe-maybe it could be a game room, yknow? I mean you can buy old arcade games like uh, like Space Invaders and Asteroids for $200, the real ones! The big-big ones!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "No."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Okay so you mean no as in, \"Gee Chandler, what an interesting idea. Lets discuss it before we reject it completely.\""}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Oh, Im sorry. Of course I mean that. Interesting idea, umm, talk about it, but no."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "So, thats it?"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "I just dont think arcade games go in the beautiful guest room. The beautiful guest room is gonna be filled with antiques."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Which is why Asteroids is perfect! Its the oldest game!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "What do you have against the beautiful guest room?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "I dont have anything against the beautiful guest room, especially since everybody we know lives about 30 seconds away!"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Are you mocking me?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "No, Im not mocking you, (in a mocking voice) or you beautiful guest room. (Exits.)"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 5, "scene_id": "S06E03_005", "location": "Chandler and Joey's", "scene_description": "Chandler is coming from across the hall.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S06E03/scenes/S06E03_005", "raw_text": "[Scene: Chandler and Joey's, Chandler is coming from across the hall.]\nJoey: Hey, whats up?\nChandler: Nothing, Monica and I had a stupid fight.\nJoey: But youre still moving in together, right? Because my ad came out today. (Shows him the paper.)\nChandler: (reading the ad) \"Wanted. Female roommate, non-smoker, non-ugly.\" Nice!\nJoey: Yeah? I just figured yknow, after living with you itd be an interesting change of pace to have a female roommate, yknow? Someone I can learn from, someone-someone whos different than me. And whats more different than me; a guy whos not 19 than say a girl who is 19? Enh? (Points to his head.) Not just a hat rack my friend!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Chandler is coming from across the hall.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey, whats up?"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Nothing, Monica and I had a stupid fight."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "But youre still moving in together, right? Because my ad came out today. (Shows him the paper.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(reading the ad) \"Wanted. Female roommate, non-smoker, non-ugly.\" Nice!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Yeah? I just figured yknow, after living with you itd be an interesting change of pace to have a female roommate, yknow? Someone I can learn from, someone-someone whos different than me. And whats more different than me; a guy whos not 19 than say a girl who is 19? Enh? (Points to his head.) Not just a hat rack my friend!"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 6, "scene_id": "S06E03_006", "location": "Central Perk", "scene_description": "Phoebe is on the couch staring off into space as Rachel enters.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_006", "raw_text": "[Scene: Central Perk, Phoebe is on the couch staring off into space as Rachel enters.]\nRachel: Pheebs, I have to ask you\nPhoebe: Shhhhhh! Im swamped right now.\nRachel: Youre just staring into space.\nPhoebe: Umm, Im trying to move that pencil. (Theres a pencil lying on the table.)\nRachel: This one? (Picks it up.)\nPhoebe: It worked!\nRachel: Pheebs, this whole apartment thing is just a nightmare! Every place I can afford comes with a roommate who is a freak. I mean, look at this; (Points to one and starts to read it.) \"Wanted. Female roommate, non-smoker, non-ugly.\" Its just, there is nothing! The citys full!\nPhoebe: Wait, no, look at this! (Points to one.) (Reading) \"Two bedroom, two bath, must be non-smoker, Satan worshipers okay\" Oh, yeah, but its on the ground floor.\nRoss: (entering) Hey!\nRachel: Hey.\nRoss: Rach, uh, you still looking for a place?\nRachel: Yeah! Why?\nRoss: Okay, theres this guy, Warren, from the museum and hes going on a dig for like two years and hes got this great place he needs to sublet. So uh, you interested?\nRachel: That sounds great! Id love to live at Warrens!! I love Warren! Thank you!\nRoss: Dont thank me! If you wanna thank something, thank the volcano that erupted thousands of years ago, killing but perfectly preserving an entire civilization. (Rachel just looks at him.) Heres Warrens number.\nRachel: Oh, this is great! I am gonna call him right now! (Jumps up.) Oh, thank you! \n(She hugs him and he starts to hug her back but notices the look Phoebe is giving him and pushes her away.)\nRoss: Okay, you go grab it!\nPhoebe: I saw it.\nRoss: I dont know what youre talking about.\nPhoebe: Umm, Im talking about that which you already know but wont admit. You love her again; you re-love her!\nRoss: Look, I do not re-love her.\nPhoebe: I cant believe you wont just admit it! (Pause) Okay, just promise me that you wont do anything stupid.\nRoss: Look, were just friends now! Okay? Why would I do anything stupid?\nRachel: (returning from calling Warren) Ugh!!! Well, the apartment is already subletted! I mean, this is just hopeless. Im never gonna find anything.\nRoss: You can live with me.\nRachel: What?!\nPhoebe: What?!\nRoss: What?\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Phoebe is on the couch staring off into space as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Pheebs, I have to ask you"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Shhhhhh! Im swamped right now."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Youre just staring into space."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, Im trying to move that pencil. (Theres a pencil lying on the table.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "This one? (Picks it up.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "It worked!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Pheebs, this whole apartment thing is just a nightmare! Every place I can afford comes with a roommate who is a freak. I mean, look at this; (Points to one and starts to read it.) \"Wanted. Female roommate, non-smoker, non-ugly.\" Its just, there is nothing! The citys full!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Wait, no, look at this! (Points to one.) (Reading) \"Two bedroom, two bath, must be non-smoker, Satan worshipers okay\" Oh, yeah, but its on the ground floor."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Hey."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Rach, uh, you still looking for a place?"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Yeah! Why?"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Okay, theres this guy, Warren, from the museum and hes going on a dig for like two years and hes got this great place he needs to sublet. So uh, you interested?"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "That sounds great! Id love to live at Warrens!! I love Warren! Thank you!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Dont thank me! If you wanna thank something, thank the volcano that erupted thousands of years ago, killing but perfectly preserving an entire civilization. (Rachel just looks at him.) Heres Warrens number."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Oh, this is great! I am gonna call him right now! (Jumps up.) Oh, thank you! "}, {"line_number": 18, "type": "action", "text": "(She hugs him and he starts to hug her back but notices the look Phoebe is giving him and pushes her away.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Okay, you go grab it!"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "I saw it."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "I dont know what youre talking about."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, Im talking about that which you already know but wont admit. You love her again; you re-love her!"}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "Look, I do not re-love her."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "I cant believe you wont just admit it! (Pause) Okay, just promise me that you wont do anything stupid."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Look, were just friends now! Okay? Why would I do anything stupid?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "(returning from calling Warren) Ugh!!! Well, the apartment is already subletted! I mean, this is just hopeless. Im never gonna find anything."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "You can live with me."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "What?!"}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 31, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 7, "scene_id": "S06E03_007", "location": "Central Perk", "scene_description": "continued from earlier.", "characters": ["Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_007", "raw_text": "[Scene: Central Perk, continued from earlier.]\nRachel: Oh my God! Are you serious?!\nRoss: Uh-huh. (Phoebe grunts.)\nRachel: I would love to live with you Ross; thats-thats great! Thank you!\nRoss: Well, Im-Im just glad I could, yknow, help you out.\nPhoebe: Wow! Im-Im so happy for you guys. (To Ross) This is so-so, not stupid.\nRachel: Ross-Ross, you have no idea what this means to me! I mean, I mean I was gonna be homeless. You just saved me! Youre my hero!\nRoss: Hero, I uh, I dont knowwell, all right.\nRachel: Oh, I have to go tell Monica what a wonderful brother she has! (Kisses him on the cheek and exits.) \nRoss: Oh please! (He sits down.) (To Phoebe) Youre gonna say things now, arent ya?\nPhoebe: No. No, I wont. But I should tell you this, this exact same thing happened to my roommate Denise. She moved in with a guy who was secretly married to her and he said he didnt love her, but he really did, and it just blew up! And thats how she ended up living with me! (Ross looks at her.) (Pause) Okay, thats a lie.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, continued from earlier.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God! Are you serious?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Uh-huh. (Phoebe grunts.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "I would love to live with you Ross; thats-thats great! Thank you!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Well, Im-Im just glad I could, yknow, help you out."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Wow! Im-Im so happy for you guys. (To Ross) This is so-so, not stupid."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Ross-Ross, you have no idea what this means to me! I mean, I mean I was gonna be homeless. You just saved me! Youre my hero!"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Hero, I uh, I dont knowwell, all right."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I have to go tell Monica what a wonderful brother she has! (Kisses him on the cheek and exits.) "}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Oh please! (He sits down.) (To Phoebe) Youre gonna say things now, arent ya?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "No. No, I wont. But I should tell you this, this exact same thing happened to my roommate Denise. She moved in with a guy who was secretly married to her and he said he didnt love her, but he really did, and it just blew up! And thats how she ended up living with me! (Ross looks at her.) (Pause) Okay, thats a lie."}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 8, "scene_id": "S06E03_008", "location": "Monica and Rachel's", "scene_description": "Monica is in the kitchen as Chandler enters.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E03/scenes/S06E03_008", "raw_text": "[Scene: Monica and Rachel's, Monica is in the kitchen as Chandler enters.]\nChandler: Hi.\nMonica: Hi.\nChandler: Hi, listen, Im sorry about before. I dont need to have a game room. I mean when I was a kid I only played those games because I couldnt get girls, and now I can emNow, I have you. (Monica glares at him.) Not-not that I think that I have you or think of you as property in any sort of way, I see women\nMonica: Stop it Chandler. (Chandler is relieved) Im sorry too.\nChandler: Really?\nMonica: Yeah! Oh yes!\nChandler: Ohh.\nMonica: Listen, we dont have to make that a guest room, we can think of something to do with the room together.\nChandler: Thats a great idea! We can easily think of a way for us both to enjoy the room.\nMonica: Totally!\n(They start thinking.)\nChandler: We dont have to come up with this now.\nMonica: Oh good.\nChandler: Hey, yknow what? Why dont we think about changes we can make in the living room?\nMonica: Changes?\nChandler: Yeah, I mean were gonna have to move around some furniture to make room for my chair. (Kisses her and heads into the living room.)\nMonica: Youre-youre-youre gonna bring the Barca Lounger over here?\nChandler: Is that a problem?\nMonica: Well, its a set and they should probably stay together.\nChandler: Oh, thats cool. Then Ill just bring them both over.\nMonica: See now-now youre taking them away from their home.\nChandler: Okay, I get it. So, I get nothing! Nothing here is mine! Everything here is yours! Ill get up in the morning put on your clothes, and head off to work!\nMonica: Yeah-yeah, yknow what? Yeah, thats it-thats it, everything will be mine! Nothing will be yours! Thats-thats what I said! Oh come on, Chandler! Im talking about the barca lounger! It just, it doesnt match! Where is it gonna go?!\nChandler: In the game room!\nMonica: Look it is not my fault that your chairs are incredibly ugly!\nChandler: All right! Thats fine! Thats fine! I wont bring over the chairs! I wont bring anything over! I wouldnt want to ruin the ambiance over here at Grandmas place!! (Storms out.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Monica is in the kitchen as Chandler enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hi."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Hi."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Hi, listen, Im sorry about before. I dont need to have a game room. I mean when I was a kid I only played those games because I couldnt get girls, and now I can emNow, I have you. (Monica glares at him.) Not-not that I think that I have you or think of you as property in any sort of way, I see women"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Stop it Chandler. (Chandler is relieved) Im sorry too."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Really?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Yeah! Oh yes!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Ohh."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Listen, we dont have to make that a guest room, we can think of something to do with the room together."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Thats a great idea! We can easily think of a way for us both to enjoy the room."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Totally!"}, {"line_number": 12, "type": "action", "text": "(They start thinking.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "We dont have to come up with this now."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Oh good."}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Hey, yknow what? Why dont we think about changes we can make in the living room?"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Changes?"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I mean were gonna have to move around some furniture to make room for my chair. (Kisses her and heads into the living room.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Youre-youre-youre gonna bring the Barca Lounger over here?"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Is that a problem?"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Well, its a set and they should probably stay together."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Oh, thats cool. Then Ill just bring them both over."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "See now-now youre taking them away from their home."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Okay, I get it. So, I get nothing! Nothing here is mine! Everything here is yours! Ill get up in the morning put on your clothes, and head off to work!"}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "Yeah-yeah, yknow what? Yeah, thats it-thats it, everything will be mine! Nothing will be yours! Thats-thats what I said! Oh come on, Chandler! Im talking about the barca lounger! It just, it doesnt match! Where is it gonna go?!"}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "In the game room!"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "Look it is not my fault that your chairs are incredibly ugly!"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "All right! Thats fine! Thats fine! I wont bring over the chairs! I wont bring anything over! I wouldnt want to ruin the ambiance over here at Grandmas place!! (Storms out.)"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 9, "scene_id": "S06E03_009", "location": "Chandler and Joey's", "scene_description": "Joey is interviewing a potential roommate. And yes, shes a female, non-smoker and very non-ugly.", "characters": ["Chandler", "Joey", "The Potential Roommate"], "firestore_path": "/episodes/S06E03/scenes/S06E03_009", "raw_text": "[Scene: Chandler and Joey's, Joey is interviewing a potential roommate. And yes, shes a female, non-smoker and very non-ugly.]\nJoey: (exiting from Chandlers room with the new roommate) Everything on your application looks really goodOhh! Just one last question umm, are you and your friends gonna be over here all the time like partying and hanging out?\nThe Potential Roommate: Oh dont worry, Im not really a party girl.\nJoey: Whoa!! Now look, dont be just blurtin stuff out. I want you to really think about your answers. Okay?\nChandler: (entering) You can call off the roommate search! (To the potential roommate) Hi! Ill be living here. (Heads for the bathroom.)\nJoey: Oh dont listen to him, hes just some guy who really wants the apartment, but I dont think hes gonna get it.\nChandler: Why did you take the shower curtain down?\nJoey: That thing was a hazard! (To the potential roommate) Im very safety conscious.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey is interviewing a potential roommate. And yes, shes a female, non-smoker and very non-ugly.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(exiting from Chandlers room with the new roommate) Everything on your application looks really goodOhh! Just one last question umm, are you and your friends gonna be over here all the time like partying and hanging out?"}, {"line_number": 3, "type": "dialogue", "speaker": "The Potential Roommate", "text": "Oh dont worry, Im not really a party girl."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Whoa!! Now look, dont be just blurtin stuff out. I want you to really think about your answers. Okay?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(entering) You can call off the roommate search! (To the potential roommate) Hi! Ill be living here. (Heads for the bathroom.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Oh dont listen to him, hes just some guy who really wants the apartment, but I dont think hes gonna get it."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Why did you take the shower curtain down?"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "That thing was a hazard! (To the potential roommate) Im very safety conscious."}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 10, "scene_id": "S06E03_010", "location": "Rosss Apartment", "scene_description": "Rachel is entering and Ross is making some room on the shelves for his stuff.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_010", "raw_text": "[Scene: Rosss Apartment, Rachel is entering and Ross is making some room on the shelves for his stuff.]\nRachel: Hey!\nRoss: Hey! Oh listen, I was just clearing some space for your stuff.\nRachel: Oh thanks, but listen, I was just at Monicas and she and Chandler had a big fight and theyre not moving in.\nRoss: What do you mean, theyre not moving in? They-theyre still moving in right?\nRachel: No-no, they just had a big blowout over what to do with my room.\nRoss: What?! Over a stupid room!\nRachel: Yeah, I feel kinda bad for them, but Im also really psyched cause I dont have to move in here!\nRoss: Oh no, yeah no, that parts great!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rosss Apartment, Rachel is entering and Ross is making some room on the shelves for his stuff.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Hey! Oh listen, I was just clearing some space for your stuff."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Oh thanks, but listen, I was just at Monicas and she and Chandler had a big fight and theyre not moving in."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "What do you mean, theyre not moving in? They-theyre still moving in right?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "No-no, they just had a big blowout over what to do with my room."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "What?! Over a stupid room!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I feel kinda bad for them, but Im also really psyched cause I dont have to move in here!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Oh no, yeah no, that parts great!"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 11, "scene_id": "S06E03_011", "location": "Monica and Rachel's", "scene_description": "Ross is entering, dragging Chandler, to mediate the argument between Chandler and Monica.", "characters": ["Chandler", "Monica", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_011", "raw_text": "[Scene: Monica and Rachel's, Ross is entering, dragging Chandler, to mediate the argument between Chandler and Monica.]\nRoss: Whats all this about you guys fighting?! Is this really over a room?! I mean, that is so silly!\nMonica: Ross, we can handle this.\nRoss: Well, apparently not, and I cant just stand by and watch two people I care about very much be hurt over something that is so silly. I mean, enough of the silliness!\nChandler: Well, why dont you tell her to stop being silly! (Monica mocks him and he joins in.)\nRoss: (stopping them) Okay-okay! Two very good points, look Ive known you both a long time, and Ive never seen either of you one/millionth as happy as youve been since youve got together. Do you really want to throw that all away over a room? That is so silly. Now wh-what is more important, love or silliness?\nChandler: Well, we are fond of the silliness, but we also have a soft spot for the love.\nMonica: Love is the best medicine.\nChandler: Thats laughter.\nMonica: Why do you do it?\nChandler: I dont know.\nRoss: Okay! All right! Now, Chandler you-you wanna live with Monica, right?\nChandler: Yeah, I do.\nRoss: And Mon, you wanna live with Chandler, dont ya?\nMonica: Yes.\nRoss: (jumping up) Good! A verbal contract is binding in the state of New York! (Storms out.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Ross is entering, dragging Chandler, to mediate the argument between Chandler and Monica.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Whats all this about you guys fighting?! Is this really over a room?! I mean, that is so silly!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Ross, we can handle this."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Well, apparently not, and I cant just stand by and watch two people I care about very much be hurt over something that is so silly. I mean, enough of the silliness!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Well, why dont you tell her to stop being silly! (Monica mocks him and he joins in.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "(stopping them) Okay-okay! Two very good points, look Ive known you both a long time, and Ive never seen either of you one/millionth as happy as youve been since youve got together. Do you really want to throw that all away over a room? That is so silly. Now wh-what is more important, love or silliness?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Well, we are fond of the silliness, but we also have a soft spot for the love."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Love is the best medicine."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Thats laughter."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Why do you do it?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "I dont know."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Okay! All right! Now, Chandler you-you wanna live with Monica, right?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I do."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "And Mon, you wanna live with Chandler, dont ya?"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Yes."}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "(jumping up) Good! A verbal contract is binding in the state of New York! (Storms out.)"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 12, "scene_id": "S06E03_012", "location": "Central Perk", "scene_description": "Rachel is sitting at the counter waiting for Gunther, yep Gunthers back, to refill her coffee.", "characters": ["Gunther", "Rachel", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_012", "raw_text": "[Scene: Central Perk, Rachel is sitting at the counter waiting for Gunther, yep Gunthers back, to refill her coffee.]\nGunther: So I understand youre looking for a place.\nRachel: No-no, Im staying put.\nGunther: Oh, I was going to offer you my apartment.\nRachel: Why, where are you going?\nGunther: I dont know.\nRoss: (entering) Hey Rach!\nRachel: Hi!\nRoss: Youre never gonna believe it uh, Monica and Chandler are moving in again. Thats great news rightI mean for them. Right?\nRachel: Oh wow.\nRoss: Yeah but, on the bright side, we get to be roommates again.\nRachel: Yeah. Yknow umm, uh, umm, about that, umm, Ross I really appreciate your offer to let me move in and everything, but dont you think its gonna be weird?\nRoss: Wh-why?! Why-why-why would it, why would it be weird?\nRachel: Well, because of us! Because of our history.\nRoss: No!\nRachel: No?\nRoss: No! No! It would be weird if we were still in that place, I mean are you still in that place?\nRachel: No! Not at all!\nRoss: Good! Me neither! So its not a problem. Were just two friends who happen to be roommates.\nRachel: Okay, but Ross, eventually you and I are gonna be dating.\nRoss: Really?! We are?\nRachel: Yeah! Im gonna have a boyfriend, youre gonna have a girlfriend\nRoss: Ohh! That would be great.\nRachel: But yknow what, if you think its gonna be okay well just work out a system. Yknow, itll be like college, Ill hang a hanger on the door and put a sign, \"Come back later, Im gettin lucky.\" (Laughs.)\nRoss: (laughs as well, but for a different reason) Yeah, I didnt think of that.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Rachel is sitting at the counter waiting for Gunther, yep Gunthers back, to refill her coffee.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Gunther", "text": "So I understand youre looking for a place."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "No-no, Im staying put."}, {"line_number": 4, "type": "dialogue", "speaker": "Gunther", "text": "Oh, I was going to offer you my apartment."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Why, where are you going?"}, {"line_number": 6, "type": "dialogue", "speaker": "Gunther", "text": "I dont know."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey Rach!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Youre never gonna believe it uh, Monica and Chandler are moving in again. Thats great news rightI mean for them. Right?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Oh wow."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Yeah but, on the bright side, we get to be roommates again."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Yeah. Yknow umm, uh, umm, about that, umm, Ross I really appreciate your offer to let me move in and everything, but dont you think its gonna be weird?"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Wh-why?! Why-why-why would it, why would it be weird?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Well, because of us! Because of our history."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "No!"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "No?"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "No! No! It would be weird if we were still in that place, I mean are you still in that place?"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "No! Not at all!"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Good! Me neither! So its not a problem. Were just two friends who happen to be roommates."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Okay, but Ross, eventually you and I are gonna be dating."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Really?! We are?"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Yeah! Im gonna have a boyfriend, youre gonna have a girlfriend"}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "Ohh! That would be great."}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "But yknow what, if you think its gonna be okay well just work out a system. Yknow, itll be like college, Ill hang a hanger on the door and put a sign, \"Come back later, Im gettin lucky.\" (Laughs.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "(laughs as well, but for a different reason) Yeah, I didnt think of that."}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 13, "scene_id": "S06E03_013", "location": "Monica and Rachel's", "scene_description": "Chandler is once again being dragged in by Ross so he that he can try to manipulate the situation so that its best for Ross, not necessarily whats best for Monica and Chandler.", "characters": ["Chandler", "Monica", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_013", "raw_text": "[Scene: Monica and Rachel's, Chandler is once again being dragged in by Ross so he that he can try to manipulate the situation so that its best for Ross, not necessarily whats best for Monica and Chandler.]\nRoss: So are you sure about this whole moving in thing?! I mean its a really big step! And-and whats the rush?!\n(They both start laughing at him.)\nMonica: Thats very funny!\nChandler: Hes being silly, because he knows that we enjoy the silliness!\nRoss: No, I-I-Im serious, okay? I mean, think about it. You move in, you start fighting over stupid game rooms, next thing yknow you break up!\nMonica: Ross, you were right before, it was just a stupid fight about a room.\nRoss: Okay, there are no stupid fights!! This isnt about the room, this is about what the roomrepresents! And unfortunately, this room (Points to Rachels room) could destroy you!!\nChandler: Yeah, I'm not so worried.\nMonica: Yeah, no, me neither.\nRoss: Fine! Its your life! (Starts to storm out mad about his failed attempt at the manipulation of his best friend and sister, but stops and tries one last time.) I just dont want to see you guys break up! Which you will do if you move in together, (Monica and Chandler just stare at him.) but thats what you want, theres nothing I can do. (Opens the door and tries one more time.) DONT DO IT!!!!! (Finally leaves.)\nMonica: You still want to move in together right?\nChandler: Of course!\nMonica: Ross didnt scare you?\nChandler: Scared me out of ever wanting to live with him.\nMonica: Come here, I want to show you something!\nChandler: Okay!\n(They run to the living room where Monica has moved the chair back (Towards the step), the coffee table forward (Towards the TV), and taped a square outline on the floor.)\nChandler: Oh my God! Someones killed Square Man!\nMonica: This is where I thought the barca lounger could go! You see you could see the TV and its still walking distance to the kitchen.\nChandler: Oh thats so sweet! I want to show you something too!\nMonica: Okay!\nChandler: Yknow those big-big uh, road signs that say \"Merge?\"\nMonica: Uh-hmm.\nChandler: Yknow? So I was thinking that we could get one of those signs and hang it over our bed. Because, thats you and I together! Merge!\nMonica: Oh my God! I love that!\nChandler: Really?!\nMonica: Uh, no!!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Chandler is once again being dragged in by Ross so he that he can try to manipulate the situation so that its best for Ross, not necessarily whats best for Monica and Chandler.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "So are you sure about this whole moving in thing?! I mean its a really big step! And-and whats the rush?!"}, {"line_number": 3, "type": "action", "text": "(They both start laughing at him.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Thats very funny!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Hes being silly, because he knows that we enjoy the silliness!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "No, I-I-Im serious, okay? I mean, think about it. You move in, you start fighting over stupid game rooms, next thing yknow you break up!"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Ross, you were right before, it was just a stupid fight about a room."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Okay, there are no stupid fights!! This isnt about the room, this is about what the roomrepresents! And unfortunately, this room (Points to Rachels room) could destroy you!!"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I'm not so worried."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Yeah, no, me neither."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Fine! Its your life! (Starts to storm out mad about his failed attempt at the manipulation of his best friend and sister, but stops and tries one last time.) I just dont want to see you guys break up! Which you will do if you move in together, (Monica and Chandler just stare at him.) but thats what you want, theres nothing I can do. (Opens the door and tries one more time.) DONT DO IT!!!!! (Finally leaves.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "You still want to move in together right?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Of course!"}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Ross didnt scare you?"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Scared me out of ever wanting to live with him."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Come here, I want to show you something!"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Okay!"}, {"line_number": 18, "type": "action", "text": "(They run to the living room where Monica has moved the chair back (Towards the step), the coffee table forward (Towards the TV), and taped a square outline on the floor.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Oh my God! Someones killed Square Man!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "This is where I thought the barca lounger could go! You see you could see the TV and its still walking distance to the kitchen."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Oh thats so sweet! I want to show you something too!"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Okay!"}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Yknow those big-big uh, road signs that say \"Merge?\""}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "Uh-hmm."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Yknow? So I was thinking that we could get one of those signs and hang it over our bed. Because, thats you and I together! Merge!"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "Oh my God! I love that!"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "Really?!"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Uh, no!!"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 14, "scene_id": "S06E03_014", "location": "Central Perk", "scene_description": "Phoebe is singing a new song. Yep, the first new Phoebe song of season six, Ross, Joey, and Rachel are also there.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S06E03/scenes/S06E03_014", "raw_text": "[Scene: Central Perk, Phoebe is singing a new song. Yep, the first new Phoebe song of season six, Ross, Joey, and Rachel are also there.]\nPhoebe: (singing) I found you in my bed!   Howd you whined up there?   You are a mystery!  Little black curly hair!  Little black curly hair!  Little black, little black, little black, little black, little black curly hair\n(Applause.)\nPhoebe: Now if you want to receive e-mails about my upcoming shows, then please give me money so I can buy a computer.\nRoss: (To Rachel) So umm, where are the other guys?\nRachel: Umm, well lets see Monica and Chandler are occupied.\nRoss: Fighting?!\nRachel: No, the other thing. I really think its great they work things out.\nRoss: Yeah. Theres no breaking them up, is there?\nRachel: Hey, can I borrow the key to your house so I can run across the street and make a copy?\nRoss: Sure! Here. (Hands her his keys.)\nRachel: Thank you. (Gets up) Now are you sure? Because once I make a copy, theres no turning back.\nRoss: Yeah, Im-Im sure. (Deadpan) Yeah, get out of here before I change my mind. (She exits)\nJoey: Umm, listen, Ross do you really think this moving in with Rachel is a good idea?\nRoss: Ive been back and forth.\nJoey: Yeah well, maybe you should go back! Okay? Rachel moves in, and before you know it youre right where you dont want to be! Back together!\nRoss: Ehh, I dont, I dont think so. Shes already talked about yknow, dating other guys.\nJoey: Thats not gonna work out! Then shes gonna come home all weepy and youll be tellin her, \"Oh thats okay. Youll find someone.\" And then, bamn! She finds you!\nRoss: Yeah, well, m-maybe youre right.\nJoey: I am telling you Ross, she is definitely gonna fall in love with you again! Now, is that what you want?\nRoss: Is that what I want?\nPhoebe: (on the microphone, accidentally) Yes.\n(Rachel enters.)\nJoey: Here she comes. Hold on, Im gonna make your life much easier.\nRachel: All right, well the place was closed. Ill just copy it later.\nJoey: Or not. Uh, Rach, why dont you just move in with me? (Rachel sighs.)\nRoss: Whoa! Whoa! Whoa, Joey!\nJoey: No-no-no-no-no-no-no-no Its okay, I mean Ilook Rach, I know I scared you off with that whole Naked Thursdays thing, but we dont have to do that!\nRachel: Well, it would be easier to move just right across the hall. Wait a minute, unless youre thinking about Naked Wednesdays.\nJoey: Thursdays clearly not good for ya, pick a day!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Phoebe is singing a new song. Yep, the first new Phoebe song of season six, Ross, Joey, and Rachel are also there.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "(singing) I found you in my bed!   Howd you whined up there?   You are a mystery!  Little black curly hair!  Little black curly hair!  Little black, little black, little black, little black, little black curly hair"}, {"line_number": 3, "type": "action", "text": "(Applause.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Now if you want to receive e-mails about my upcoming shows, then please give me money so I can buy a computer."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "(To Rachel) So umm, where are the other guys?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Umm, well lets see Monica and Chandler are occupied."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Fighting?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "No, the other thing. I really think its great they work things out."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Yeah. Theres no breaking them up, is there?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Hey, can I borrow the key to your house so I can run across the street and make a copy?"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Sure! Here. (Hands her his keys.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Thank you. (Gets up) Now are you sure? Because once I make a copy, theres no turning back."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Yeah, Im-Im sure. (Deadpan) Yeah, get out of here before I change my mind. (She exits)"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Umm, listen, Ross do you really think this moving in with Rachel is a good idea?"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Ive been back and forth."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Yeah well, maybe you should go back! Okay? Rachel moves in, and before you know it youre right where you dont want to be! Back together!"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "Ehh, I dont, I dont think so. Shes already talked about yknow, dating other guys."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Thats not gonna work out! Then shes gonna come home all weepy and youll be tellin her, \"Oh thats okay. Youll find someone.\" And then, bamn! She finds you!"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Yeah, well, m-maybe youre right."}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "I am telling you Ross, she is definitely gonna fall in love with you again! Now, is that what you want?"}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Is that what I want?"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "(on the microphone, accidentally) Yes."}, {"line_number": 23, "type": "action", "text": "(Rachel enters.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Here she comes. Hold on, Im gonna make your life much easier."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "All right, well the place was closed. Ill just copy it later."}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Or not. Uh, Rach, why dont you just move in with me? (Rachel sighs.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Whoa! Whoa! Whoa, Joey!"}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "No-no-no-no-no-no-no-no Its okay, I mean Ilook Rach, I know I scared you off with that whole Naked Thursdays thing, but we dont have to do that!"}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Well, it would be easier to move just right across the hall. Wait a minute, unless youre thinking about Naked Wednesdays."}, {"line_number": 30, "type": "dialogue", "speaker": "Joey", "text": "Thursdays clearly not good for ya, pick a day!"}, {"line_number": 31, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S06E03", "season": 6, "episode_number": 3, "episode_title": "THE ONE WITH ROSSS DENIAL", "scene_number": 15, "scene_id": "S06E03_015", "location": "Chandler and Joey's", "scene_description": "Joey has The Potential Roommate back for another interview.", "characters": ["Joey", "The Potential Roommate"], "firestore_path": "/episodes/S06E03/scenes/S06E03_015", "raw_text": "[Scene: Chandler and Joey's, Joey has The Potential Roommate back for another interview.]\nJoey: (opening the door to The Potential Roommate) Hi!\nThe Potential Roommate: Hi!\nJoey: Come in. Thanks for comin back, umm, okay there have been a lot of people interested in the room, but I have narrowed it down and you are one of the finalists!\nThe Potential Roommate: Great!\nJoey: Okay now, before I make my final decision I uh, I just want to make sure our personalities match. Okay, so I made up a little test. Now, Im gonna say a word and then you say the first thing that comes to mind.\nThe Potential Roommate: I can do that.\nJoey: Okay! Here we go. Pillow.\nThe Potential Roommate: Fight.\nJoey: Very good! Okay. G.\nThe Potential Roommate: String?\nJoey: Excellent! Okay umm, doggy.\nThe Potential Roommate: Kitten?\nJoey: Ooh, sorry! No-no-no, so close though, butbye-bye! (He ushers her out the door.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Joey's, Joey has The Potential Roommate back for another interview.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(opening the door to The Potential Roommate) Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "The Potential Roommate", "text": "Hi!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Come in. Thanks for comin back, umm, okay there have been a lot of people interested in the room, but I have narrowed it down and you are one of the finalists!"}, {"line_number": 5, "type": "dialogue", "speaker": "The Potential Roommate", "text": "Great!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Okay now, before I make my final decision I uh, I just want to make sure our personalities match. Okay, so I made up a little test. Now, Im gonna say a word and then you say the first thing that comes to mind."}, {"line_number": 7, "type": "dialogue", "speaker": "The Potential Roommate", "text": "I can do that."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Okay! Here we go. Pillow."}, {"line_number": 9, "type": "dialogue", "speaker": "The Potential Roommate", "text": "Fight."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Very good! Okay. G."}, {"line_number": 11, "type": "dialogue", "speaker": "The Potential Roommate", "text": "String?"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Excellent! Okay umm, doggy."}, {"line_number": 13, "type": "dialogue", "speaker": "The Potential Roommate", "text": "Kitten?"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Ooh, sorry! No-no-no, so close though, butbye-bye! (He ushers her out the door.)"}, {"line_number": 15, "type": "narration", "text": "End"}]}
