{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 1, "scene_id": "S06E13_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S06E13/scenes/S06E13_001", "raw_text": "THE ONE WITH RACHELS SISTER\nTeleplay by: Sherry Bilsing & Ellen Plummer Story by: Seth Kurland Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH RACHELS SISTER"}, {"line_number": 2, "type": "dialogue", "speaker": "Teleplay by", "text": "Sherry Bilsing & Ellen Plummer Story by: Seth Kurland Transcribed by: Eric Aasen"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 2, "scene_id": "S06E13_002", "location": "Central Perk", "scene_description": "Joey is giving Rachel, Chandler, Phoebe, and Ross their bills.", "characters": ["Chandler", "Joey", "Phoebe", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S06E13/scenes/S06E13_002", "raw_text": "[Scene: Central Perk, Joey is giving Rachel, Chandler, Phoebe, and Ross their bills.]\nJoey: Okay Rach, that muffin and espresso, $4.50. Ross, double latte, $2.75. Chandler, coffee and a scone, $4.25. And Pheebs, herbal tea, $1.25. So, all together thats (pauses to figure the total) $12.75.\nChandler: This coming from the man who couldnt split our 80 dollar phone bill in half.\n(A good-looking woman approaches.)\nWoman: Hi!\nJoey: Hi!\nWoman: How much do I owe you for the muffin and the latte?\nJoey: Oh thats on the house courtesy of Joey Tribbiani.\nWoman: Oh great! Well, tell him thanks. And since uh, Joey seems like such a nice guy, maybe we could go on a date sometime?\nJoey: Well, hes not used to women being so forward with him; but uh, I good check with himHe says its okay. (She hands him her card.) Great! Thanks! Bye-bye!\nRoss: Hey Joey, how come our stuff isnt free?\nJoey: It will be when you look like that in a tight skirt! This is great! Im getting more dates than ever!\nRachel: Wait a minute, youre only giving free stuff away to the pretty girls?\nPhoebe: Yeah Joey that is so gross!\nJoey: How about a scone on the house baby?\nPhoebe: (giggles) Im pretty.\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is giving Rachel, Chandler, Phoebe, and Ross their bills.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Okay Rach, that muffin and espresso, $4.50. Ross, double latte, $2.75. Chandler, coffee and a scone, $4.25. And Pheebs, herbal tea, $1.25. So, all together thats (pauses to figure the total) $12.75."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "This coming from the man who couldnt split our 80 dollar phone bill in half."}, {"line_number": 4, "type": "action", "text": "(A good-looking woman approaches.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Woman", "text": "Hi!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Hi!"}, {"line_number": 7, "type": "dialogue", "speaker": "Woman", "text": "How much do I owe you for the muffin and the latte?"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Oh thats on the house courtesy of Joey Tribbiani."}, {"line_number": 9, "type": "dialogue", "speaker": "Woman", "text": "Oh great! Well, tell him thanks. And since uh, Joey seems like such a nice guy, maybe we could go on a date sometime?"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Well, hes not used to women being so forward with him; but uh, I good check with himHe says its okay. (She hands him her card.) Great! Thanks! Bye-bye!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Hey Joey, how come our stuff isnt free?"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "It will be when you look like that in a tight skirt! This is great! Im getting more dates than ever!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Wait a minute, youre only giving free stuff away to the pretty girls?"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah Joey that is so gross!"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "How about a scone on the house baby?"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "(giggles) Im pretty."}, {"line_number": 17, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 3, "scene_id": "S06E13_003", "location": "Monica and Chandler's", "scene_description": "everyone but Monica is there playing Monopoly.", "characters": ["All", "Chandler", "Jill", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Woman"], "firestore_path": "/episodes/S06E13/scenes/S06E13_003", "raw_text": "[Scene: Monica and Chandler's, everyone but Monica is there playing Monopoly.]\nRoss: Hey does anyone have any gum?\nPhoebe: Oh I do! (She grabs her huge purse and starts rummaging through it and taking out various items in a futile search for the gum.) Oh, yknow what? No. (Pause) Wait a second. (She removes a bag filled with water that has a goldfish swimming in it.) I know its in here somewhere.\nRoss: Yknow what? Im good! Im good!\nMonica: (entering) Hey!\nRoss: Hey!\nChandler: Hey, what are you doing here? Shouldnt you be at work?\nMonica: (congested) Ugh, they sent me home. They said I cant work if Im sick.\nAll: Ohh!\nChandler: Im so sorry youre sick.\nMonica: Im not sick!! I dont get sick! Getting sick is for weaklings and for pansies! \nRachel: Honey, no one thinks youre a pansy, but we do think you need a tissue. (She notices something hanging from Monicas nose, as does Joey.)\nMonica: (wiping her nose) I have not been sick in over three years! (Sneezes.) \nChandler: Im gonna grab you some tissue.\nMonica: I dont need a tissue! Im fine-d! \nRoss: When you put a D at the end of Fine youre not fine.\nMonica: Im fine-d. Im fine-d! Yknow, its a really hard word to say.\n(Theres a knock on the door. The gang is stunned and Phoebe counts to make sure that everyone is there. Out of curiosity Chandler goes and answers the door.)\nChandler: Yes?\n(A woman enters.)\nWoman: Hi, is Rachel here? Im her sister.\nRachel: Oh my God, Jill!\nJill: Oh my God, Rachel!\n(They run and hug each other.)\nChandler: Oh my God, introduce us!\nRachel: This is Chandler. (Points at him.)\nJill: Hi!\nRachel: And you know Monica and Ross!\nRoss: Hi Jill.\nRachel: And thats Phoebe (points), and thats Joey.\nJoey: Hey, (in the Joey voice) how you doin?\nRachel: Dont!! (Joey backs away frightened.) (To Jill) Honey, what are you doing here?!\nPhoebe: (To Ross) Which-which sister is this? Is this the spoiled one or thats bitter?\nJill: (To Rachel) Daddy cut me off.\nPhoebe: Never mind, I got it.\nJill: And yknow what I said to him? \"Im gonna hire a lawyer and Im gonna sue you and take all your money. Then Im gonna cut you off!\"\nRachel: Wow! What did he say?\nJill: That he wouldnt pay for my lawyer! Then he told me to come here and learn about the value of money from the one daughter hes actually proud off.\nRachel: Oh! Did you hear that?! My dads proud of me! My dads proud of me.\nMonica: Rach? (Points to Jill.)\nRachel: Oh yeah, sorry. Wait honey, so what did you do that made dad cut you off?\nJill: Okay, I bought a boat.\nMonica: You bought a boat?\nJill: Yeah but it wasnt for me, it was for a friend.\nChandler: Boy did we make friends with the wrong sister! (Rachel glares at him.)\nRachel: Jill, honey, I think this is the best thing that couldve ever happened to you. I mean you needed to get out on your own anyway! And you know when I did it, I-I-I at first I was scared, and look at me now! Im the only daughter dad is proud of! Okay, well this is, this is what youre gonna do. Youre gonna get a job, youre gonna get an apartment, and then Ill help you and you can stay with us. Right Pheebs, she can stay with us?\nPhoebe: Of course, yeah!\nJill: Oh, thats so great! Okay, Im really gonna do this! I dont know how to thank you guys.\nPhoebe: Ooh, I like cards.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, everyone but Monica is there playing Monopoly.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey does anyone have any gum?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Oh I do! (She grabs her huge purse and starts rummaging through it and taking out various items in a futile search for the gum.) Oh, yknow what? No. (Pause) Wait a second. (She removes a bag filled with water that has a goldfish swimming in it.) I know its in here somewhere."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Yknow what? Im good! Im good!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(entering) Hey!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Hey!"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Hey, what are you doing here? Shouldnt you be at work?"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "(congested) Ugh, they sent me home. They said I cant work if Im sick."}, {"line_number": 9, "type": "dialogue", "speaker": "All", "text": "Ohh!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Im so sorry youre sick."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Im not sick!! I dont get sick! Getting sick is for weaklings and for pansies! "}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Honey, no one thinks youre a pansy, but we do think you need a tissue. (She notices something hanging from Monicas nose, as does Joey.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "(wiping her nose) I have not been sick in over three years! (Sneezes.) "}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Im gonna grab you some tissue."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "I dont need a tissue! Im fine-d! "}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "When you put a D at the end of Fine youre not fine."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Im fine-d. Im fine-d! Yknow, its a really hard word to say."}, {"line_number": 18, "type": "action", "text": "(Theres a knock on the door. The gang is stunned and Phoebe counts to make sure that everyone is there. Out of curiosity Chandler goes and answers the door.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Yes?"}, {"line_number": 20, "type": "action", "text": "(A woman enters.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Woman", "text": "Hi, is Rachel here? Im her sister."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God, Jill!"}, {"line_number": 23, "type": "dialogue", "speaker": "Jill", "text": "Oh my God, Rachel!"}, {"line_number": 24, "type": "action", "text": "(They run and hug each other.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Oh my God, introduce us!"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "This is Chandler. (Points at him.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Jill", "text": "Hi!"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "And you know Monica and Ross!"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Hi Jill."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "And thats Phoebe (points), and thats Joey."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Hey, (in the Joey voice) how you doin?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Dont!! (Joey backs away frightened.) (To Jill) Honey, what are you doing here?!"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "(To Ross) Which-which sister is this? Is this the spoiled one or thats bitter?"}, {"line_number": 34, "type": "dialogue", "speaker": "Jill", "text": "(To Rachel) Daddy cut me off."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Never mind, I got it."}, {"line_number": 36, "type": "dialogue", "speaker": "Jill", "text": "And yknow what I said to him? \"Im gonna hire a lawyer and Im gonna sue you and take all your money. Then Im gonna cut you off!\""}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Wow! What did he say?"}, {"line_number": 38, "type": "dialogue", "speaker": "Jill", "text": "That he wouldnt pay for my lawyer! Then he told me to come here and learn about the value of money from the one daughter hes actually proud off."}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Oh! Did you hear that?! My dads proud of me! My dads proud of me."}, {"line_number": 40, "type": "dialogue", "speaker": "Monica", "text": "Rach? (Points to Jill.)"}, {"line_number": 41, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah, sorry. Wait honey, so what did you do that made dad cut you off?"}, {"line_number": 42, "type": "dialogue", "speaker": "Jill", "text": "Okay, I bought a boat."}, {"line_number": 43, "type": "dialogue", "speaker": "Monica", "text": "You bought a boat?"}, {"line_number": 44, "type": "dialogue", "speaker": "Jill", "text": "Yeah but it wasnt for me, it was for a friend."}, {"line_number": 45, "type": "dialogue", "speaker": "Chandler", "text": "Boy did we make friends with the wrong sister! (Rachel glares at him.)"}, {"line_number": 46, "type": "dialogue", "speaker": "Rachel", "text": "Jill, honey, I think this is the best thing that couldve ever happened to you. I mean you needed to get out on your own anyway! And you know when I did it, I-I-I at first I was scared, and look at me now! Im the only daughter dad is proud of! Okay, well this is, this is what youre gonna do. Youre gonna get a job, youre gonna get an apartment, and then Ill help you and you can stay with us. Right Pheebs, she can stay with us?"}, {"line_number": 47, "type": "dialogue", "speaker": "Phoebe", "text": "Of course, yeah!"}, {"line_number": 48, "type": "dialogue", "speaker": "Jill", "text": "Oh, thats so great! Okay, Im really gonna do this! I dont know how to thank you guys."}, {"line_number": 49, "type": "dialogue", "speaker": "Phoebe", "text": "Ooh, I like cards."}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 4, "scene_id": "S06E13_004", "location": "Central Perk", "scene_description": "Joey is working as Phoebe and Ross are sitting on the couch.", "characters": ["Customer", "Gunther", "Jill", "Joey", "Phoebe", "Phoebe and Ross", "Rachel", "Ross"], "firestore_path": "/episodes/S06E13/scenes/S06E13_004", "raw_text": "[Scene: Central Perk, Joey is working as Phoebe and Ross are sitting on the couch.]\nJoey: (to a customer) Are you all finished here?\nCustomer: Yes.\nJoey: Great! (Joey takes his cookie and finishes it.)\nGunther: Okay, here are the tips for this morning. Jen gets 50, 50 for me, and Joey owes eight dollars.\nJoey: What?!\nGunther: For all the free food you gave away.\nJoey: Well if its free food, how come youre charging me for it?\nGunther: We dont give anything away unless its someones birthday.\nJoey: Well, what if they came in third in a modeling contest?\nGunther: No!\nJoey: (to a woman who came in third in a modeling contest) Sorry! (He grabs her muffin away and returns it to the serving tray.)\nJill: (entering, carrying a bunch of shopping bags) I just had the hardest day. Those bags are so heavy. (Sets them down.)\nRoss: Jill, how did you pay for all this? I thought your dad took away your credit card.\nJill: Oh please, I memorized those numbers when I was 15. But look at all the cool make-it-on-my-own stuff I got! (Holds up a red sweater) This is my \"Please, hire me\" sweater. (Holds up a pair of black pants) And these are my, \"Dont you want to rent me this apartment?\" pants. \nRoss: I dont think charging new clothes too your dad qualifies as making it on your own.\nJill: Oh, Mr. Scientist has to get all technical!\nPhoebe: Seriously, I dont Rachels gonna think its a good idea.\nJill: So who made her queen of the world?\nPhoebe: I would love that job!\nRachel: (entering) Hey! Whats goin on?\nJill: Hey!\nRachel: (notices Jills bags) Jill! Did you shop?!\nJill: No! They did! (Points to Phoebe and Ross)\nPhoebe and Ross: Yeah, we went shopping!\nRachel: You went shopping?! What, and then you just came in here and paraded it right under Jills nose when you know shes trying to quit. Wow, you guys are terrible!\nPhoebe: Sorry Jill.\nRoss: Sorry-sorry Jill.\nRachel: Whatd you get?\nPhoebe: Oh well, all right, I got (Ross hands her a bag) (To Ross) thank you, I got uh, this yknow \"I want a job sweater.\" (Holds up the same sweater.)\nRachel: Oh.\nPhoebe: And, and then I got uh, these are apartment pants.\nRachel: Apartment pants?\nPhoebe: Yeah, you never heard of them?\nRachel: No, of course, of course Ive heard of them! Ross, what did you get?\nRoss: Huh? Oh, I got this(Holds up this pink frilly thing)this!\nRachel: A pajmena?\nRoss: Yeah! Oh, I-I love this babies!\nRachel: Really?\nRoss: Ross, wants a pajmena?\nRoss: Its a rug. (Jill winces.)\nRachel: Jill?\nJill: (covers her eyes and starts crying) Im sorry Rachel, Im sorry\nRachel: Oh, come on! You think thats gonna work on me?! I invented that!\nJill: Right! But, I am sorry.\nRachel: All right, its okay. One little setback is okay, just dont let it happen again, all right? Now since daddy paid for all this stuff, I should take it all away. But Im just gonna take the-the pajmena. (Ross hands it to her.) And the uh, and the uh pants. Yknow what, Im just gonna take it all away, cause that way youll just really learn the lesson. Okay? All righty, Im gonna run a couple of errands and I will see you at dinner. (Leaves with all of Jills stuff.)\nJill: She took all my stuff.\nRoss: Yeah. Everything but, the little blue one. (Holds it up for her.)\nJill: (gasps) Thats the best one! Oh my God, (hugs him) thank you so much!\nRoss: Well. Hey\nJill: Oh my gosh, that was so lame. Like a pajmena could be a rug!\nRoss: Oh yeah, how about you and the, (mimics her fake cry) \"Im sorry!\"\nJill: (hits him) Shut up! I did not sound like that at all!\nPhoebe: What about, what about when I said yknow about the apartment pants, how dumb was I?\n(They both look at her.)\nJill: Were you this cute in high school?\nRoss: Oh stop.\nJill: No you stop!\nRoss: No, you stop!\nJill: You stop!\nPhoebe: (gets up and sits between them) Okay-okay, why dont I sit here and youll both stop it!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is working as Phoebe and Ross are sitting on the couch.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(to a customer) Are you all finished here?"}, {"line_number": 3, "type": "dialogue", "speaker": "Customer", "text": "Yes."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Great! (Joey takes his cookie and finishes it.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Gunther", "text": "Okay, here are the tips for this morning. Jen gets 50, 50 for me, and Joey owes eight dollars."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "What?!"}, {"line_number": 7, "type": "dialogue", "speaker": "Gunther", "text": "For all the free food you gave away."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Well if its free food, how come youre charging me for it?"}, {"line_number": 9, "type": "dialogue", "speaker": "Gunther", "text": "We dont give anything away unless its someones birthday."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Well, what if they came in third in a modeling contest?"}, {"line_number": 11, "type": "dialogue", "speaker": "Gunther", "text": "No!"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "(to a woman who came in third in a modeling contest) Sorry! (He grabs her muffin away and returns it to the serving tray.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Jill", "text": "(entering, carrying a bunch of shopping bags) I just had the hardest day. Those bags are so heavy. (Sets them down.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Jill, how did you pay for all this? I thought your dad took away your credit card."}, {"line_number": 15, "type": "dialogue", "speaker": "Jill", "text": "Oh please, I memorized those numbers when I was 15. But look at all the cool make-it-on-my-own stuff I got! (Holds up a red sweater) This is my \"Please, hire me\" sweater. (Holds up a pair of black pants) And these are my, \"Dont you want to rent me this apartment?\" pants. "}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "I dont think charging new clothes too your dad qualifies as making it on your own."}, {"line_number": 17, "type": "dialogue", "speaker": "Jill", "text": "Oh, Mr. Scientist has to get all technical!"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Seriously, I dont Rachels gonna think its a good idea."}, {"line_number": 19, "type": "dialogue", "speaker": "Jill", "text": "So who made her queen of the world?"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "I would love that job!"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "(entering) Hey! Whats goin on?"}, {"line_number": 22, "type": "dialogue", "speaker": "Jill", "text": "Hey!"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "(notices Jills bags) Jill! Did you shop?!"}, {"line_number": 24, "type": "dialogue", "speaker": "Jill", "text": "No! They did! (Points to Phoebe and Ross)"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe and Ross", "text": "Yeah, we went shopping!"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "You went shopping?! What, and then you just came in here and paraded it right under Jills nose when you know shes trying to quit. Wow, you guys are terrible!"}, {"line_number": 27, "type": "dialogue", "speaker": "Phoebe", "text": "Sorry Jill."}, {"line_number": 28, "type": "dialogue", "speaker": "Ross", "text": "Sorry-sorry Jill."}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Whatd you get?"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Oh well, all right, I got (Ross hands her a bag) (To Ross) thank you, I got uh, this yknow \"I want a job sweater.\" (Holds up the same sweater.)"}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Oh."}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "And, and then I got uh, these are apartment pants."}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Apartment pants?"}, {"line_number": 34, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, you never heard of them?"}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "No, of course, of course Ive heard of them! Ross, what did you get?"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Huh? Oh, I got this(Holds up this pink frilly thing)this!"}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "A pajmena?"}, {"line_number": 38, "type": "dialogue", "speaker": "Ross", "text": "Yeah! Oh, I-I love this babies!"}, {"line_number": 39, "type": "dialogue", "speaker": "Rachel", "text": "Really?"}, {"line_number": 40, "type": "dialogue", "speaker": "Ross", "text": "Ross, wants a pajmena?"}, {"line_number": 41, "type": "dialogue", "speaker": "Ross", "text": "Its a rug. (Jill winces.)"}, {"line_number": 42, "type": "dialogue", "speaker": "Rachel", "text": "Jill?"}, {"line_number": 43, "type": "dialogue", "speaker": "Jill", "text": "(covers her eyes and starts crying) Im sorry Rachel, Im sorry"}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Oh, come on! You think thats gonna work on me?! I invented that!"}, {"line_number": 45, "type": "dialogue", "speaker": "Jill", "text": "Right! But, I am sorry."}, {"line_number": 46, "type": "dialogue", "speaker": "Rachel", "text": "All right, its okay. One little setback is okay, just dont let it happen again, all right? Now since daddy paid for all this stuff, I should take it all away. But Im just gonna take the-the pajmena. (Ross hands it to her.) And the uh, and the uh pants. Yknow what, Im just gonna take it all away, cause that way youll just really learn the lesson. Okay? All righty, Im gonna run a couple of errands and I will see you at dinner. (Leaves with all of Jills stuff.)"}, {"line_number": 47, "type": "dialogue", "speaker": "Jill", "text": "She took all my stuff."}, {"line_number": 48, "type": "dialogue", "speaker": "Ross", "text": "Yeah. Everything but, the little blue one. (Holds it up for her.)"}, {"line_number": 49, "type": "dialogue", "speaker": "Jill", "text": "(gasps) Thats the best one! Oh my God, (hugs him) thank you so much!"}, {"line_number": 50, "type": "dialogue", "speaker": "Ross", "text": "Well. Hey"}, {"line_number": 51, "type": "dialogue", "speaker": "Jill", "text": "Oh my gosh, that was so lame. Like a pajmena could be a rug!"}, {"line_number": 52, "type": "dialogue", "speaker": "Ross", "text": "Oh yeah, how about you and the, (mimics her fake cry) \"Im sorry!\""}, {"line_number": 53, "type": "dialogue", "speaker": "Jill", "text": "(hits him) Shut up! I did not sound like that at all!"}, {"line_number": 54, "type": "dialogue", "speaker": "Phoebe", "text": "What about, what about when I said yknow about the apartment pants, how dumb was I?"}, {"line_number": 55, "type": "action", "text": "(They both look at her.)"}, {"line_number": 56, "type": "dialogue", "speaker": "Jill", "text": "Were you this cute in high school?"}, {"line_number": 57, "type": "dialogue", "speaker": "Ross", "text": "Oh stop."}, {"line_number": 58, "type": "dialogue", "speaker": "Jill", "text": "No you stop!"}, {"line_number": 59, "type": "dialogue", "speaker": "Ross", "text": "No, you stop!"}, {"line_number": 60, "type": "dialogue", "speaker": "Jill", "text": "You stop!"}, {"line_number": 61, "type": "dialogue", "speaker": "Phoebe", "text": "(gets up and sits between them) Okay-okay, why dont I sit here and youll both stop it!"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 5, "scene_id": "S06E13_005", "location": "Monica and Chandler's", "scene_description": "Monica is still very sick and is entering the living room from the bathroom wearing a robe. Chandler is reading a magazine.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E13/scenes/S06E13_005", "raw_text": "[Scene: Monica and Chandler's, Monica is still very sick and is entering the living room from the bathroom wearing a robe. Chandler is reading a magazine.]\nMonica: Okay, so what do you, what do you want to do? Lets do something crazy!\nChandler: I know, lets rest and drink lots of fluids. (Holds up a glass of orange juice.)\nMonica: Okay, Ill rest. But yknow if Im going to bed, then youre coming with me.\nChandler: That would be impossible to resist if you werent all drippy here. (Points to his nose.)\nMonica: (wiping her nose) Are you saying that you dont wanna get with this? (Tries to do a little sexy body rub, but it doesnt work all that well with the big robe.)\nChandler: Yeah, I dont you should say that even when youre healthy.\nMonica: (in a sexy voice) Come on. (Coughs loudly.)\nChandler: Dont take this personally okay? Its just that I just cant have sex with a sick person.\nMonica: Im with you Chandler! I mean I cant have sex with a sick person either, thats disgusting! But Im not sick! Let me prove it to you. We are two healthy people in the pribe of libe.\nChandler: Thats the thing, see I would like to stay in the pribe of mwha-ah-libe.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica is still very sick and is entering the living room from the bathroom wearing a robe. Chandler is reading a magazine.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Okay, so what do you, what do you want to do? Lets do something crazy!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "I know, lets rest and drink lots of fluids. (Holds up a glass of orange juice.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Okay, Ill rest. But yknow if Im going to bed, then youre coming with me."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "That would be impossible to resist if you werent all drippy here. (Points to his nose.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "(wiping her nose) Are you saying that you dont wanna get with this? (Tries to do a little sexy body rub, but it doesnt work all that well with the big robe.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I dont you should say that even when youre healthy."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "(in a sexy voice) Come on. (Coughs loudly.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Dont take this personally okay? Its just that I just cant have sex with a sick person."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Im with you Chandler! I mean I cant have sex with a sick person either, thats disgusting! But Im not sick! Let me prove it to you. We are two healthy people in the pribe of libe."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Thats the thing, see I would like to stay in the pribe of mwha-ah-libe."}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 6, "scene_id": "S06E13_006", "location": "Phoebe and Rachel's", "scene_description": "Rachel is putting away her new clothes as Phoebe enters.", "characters": ["Phoebe", "Rachel"], "firestore_path": "/episodes/S06E13/scenes/S06E13_006", "raw_text": "[Scene: Phoebe and Rachel's, Rachel is putting away her new clothes as Phoebe enters.]\nRachel: Hey!\nPhoebe: Hey.\nRachel: Whats up?!\nPhoebe: Umm, I think theres something you should maybe know.\nRachel: Well, itd better not be about the apartment pants, because I just pitched the idea to my boss at Ralph Lauren and she loved it.\nPhoebe: No. No. Its just I was umm, I was with Ross and Jill after you left and umm, Im pretty sure I saw a little spark between them.\nRachel: What?!\nPhoebe: Yeah I mean its probably nothing, but I just wanted to warn you that there might be something there.\nRachel: With Ross and Jill?\nPhoebe: Yeah!\nRachel: With Ross and my sister?\nPhoebe: Yeah.\nRachel: With my sister Jill and my ex-boyfriend Ross?\nPhoebe: Yeah.\nRachel: Oh there is no way.\nPhoebe: Okay then.\nRachel: Oh my God! I can not believe that! I mean I dont really like it when Ross goes out with anyone, but my sister isnt that like incest or something?! Oh my God, and theyre gonna have sex! Oh! Oh no what if he marries her too?! Oh this is just terrible, this is just terrible. And I cant stop it! I cantI dont own Ross! Yknow? And Jill, she should be able to do whatever it is that she wants to do! And oh my God, I cant believe Ross is marrying my little sister, this terrible. Oh my God, this is just the worst thing that could have ever happened to me.\nPhoebe: But great news about the apartment pants, huh?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebe and Rachel's, Rachel is putting away her new clothes as Phoebe enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Whats up?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, I think theres something you should maybe know."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Well, itd better not be about the apartment pants, because I just pitched the idea to my boss at Ralph Lauren and she loved it."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "No. No. Its just I was umm, I was with Ross and Jill after you left and umm, Im pretty sure I saw a little spark between them."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah I mean its probably nothing, but I just wanted to warn you that there might be something there."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "With Ross and Jill?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah!"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "With Ross and my sister?"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "With my sister Jill and my ex-boyfriend Ross?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Oh there is no way."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Okay then."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God! I can not believe that! I mean I dont really like it when Ross goes out with anyone, but my sister isnt that like incest or something?! Oh my God, and theyre gonna have sex! Oh! Oh no what if he marries her too?! Oh this is just terrible, this is just terrible. And I cant stop it! I cantI dont own Ross! Yknow? And Jill, she should be able to do whatever it is that she wants to do! And oh my God, I cant believe Ross is marrying my little sister, this terrible. Oh my God, this is just the worst thing that could have ever happened to me."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "But great news about the apartment pants, huh?"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 7, "scene_id": "S06E13_007", "location": "Central Perk", "scene_description": "Joey is giving the bill to the same beautiful woman from before.", "characters": ["A Male Customer", "Jill", "Joey", "Rachel", "Woman"], "firestore_path": "/episodes/S06E13/scenes/S06E13_007", "raw_text": "[Scene: Central Perk, Joey is giving the bill to the same beautiful woman from before.]\nJoey: Thatll be $3.85.\nWoman: What do you mean? Yesterday you said I was too pretty to pay for stuff!\nJoey: Its just I cant because my manager said I (Gets an idea) (Starts singing) \"Happy birthday to you, happy birthday to you. Happy birthday dear Annie\nWoman: Amy!\nJoey: (still singing) \"Amy! Happy birthday to you!\"\nA Male Customer: Hey, thats weird, todays my birthday too!\nJoey: Yeah, not it here it isnt.\nJill: (entering) Sorry Im late, whats up?\nRachel: (on the couch) Oh hi! Yknow, I just wanted to see if there were any leads on the old job front.\nJill: Oh no! But I just walked past three sales and I didnt go in. How strong am I?\nRachel: That is great. Hey, yknow who doesnt have to job hunt? Ross. He works at the university. \nJill: Yeah.\nRachel: Oh so you know that, you guys talked about that, so you get along, so you think youre gonna go out?\nJill: Me go out with Ross?! No! God no! What would make you think that?\nRachel: I just, Phoebe, said yknow thought she saw something between you guys.\nJill: No! I mean hes nice.\nRachel: Yeah.\nJill: Hes the kind of guy youre friends with, yknow? But hes not the kind of guy you date. Hes the kind of guy youd date because you did. Me, not so much.\nRachel: Oh not-not so much. Umm, what-what do you, what do you mean is there something wrong with Ross?\nJill: Oh no-no-no, hes just I dont know, hes just a little bookish.\nRachel: Are-are you saying hes a geek?\nJill: You think so too?\nRachel: No! No I, no Ross is not a geek!\nJill: Fine, then lets just say hes not my type.\nRachel: What handsome is not your type? Smart? Kind? Good kisser? What those things arent on your list? Ross is a great guy! You would be lucky to be with him!\nJill: Well okay, if it means that much to you, then Ill ask him out.\nRachel: Oh no-no-no, no-no-no, thats not what I meant.\nJill: No! Yknow what Rachel? Youre right, yknow he has been really nice to me.\nRachel: Yeah but, hes not your type.\nJill: Yeah but maybe thats a good thing. Yknow Im doing all these different sorts of things, and maybe I should try dating a geek too!\nRachel: Yeah but, you dont, you dont, you dont want to try to much too fast. Yknow? I mean, you do remember what happened to the little girl that tried to much too fast dont you?\nJill: What?\nRachel: She-she died Jill.\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is giving the bill to the same beautiful woman from before.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Thatll be $3.85."}, {"line_number": 3, "type": "dialogue", "speaker": "Woman", "text": "What do you mean? Yesterday you said I was too pretty to pay for stuff!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Its just I cant because my manager said I (Gets an idea) (Starts singing) \"Happy birthday to you, happy birthday to you. Happy birthday dear Annie"}, {"line_number": 5, "type": "dialogue", "speaker": "Woman", "text": "Amy!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(still singing) \"Amy! Happy birthday to you!\""}, {"line_number": 7, "type": "dialogue", "speaker": "A Male Customer", "text": "Hey, thats weird, todays my birthday too!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Yeah, not it here it isnt."}, {"line_number": 9, "type": "dialogue", "speaker": "Jill", "text": "(entering) Sorry Im late, whats up?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "(on the couch) Oh hi! Yknow, I just wanted to see if there were any leads on the old job front."}, {"line_number": 11, "type": "dialogue", "speaker": "Jill", "text": "Oh no! But I just walked past three sales and I didnt go in. How strong am I?"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "That is great. Hey, yknow who doesnt have to job hunt? Ross. He works at the university. "}, {"line_number": 13, "type": "dialogue", "speaker": "Jill", "text": "Yeah."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Oh so you know that, you guys talked about that, so you get along, so you think youre gonna go out?"}, {"line_number": 15, "type": "dialogue", "speaker": "Jill", "text": "Me go out with Ross?! No! God no! What would make you think that?"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "I just, Phoebe, said yknow thought she saw something between you guys."}, {"line_number": 17, "type": "dialogue", "speaker": "Jill", "text": "No! I mean hes nice."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 19, "type": "dialogue", "speaker": "Jill", "text": "Hes the kind of guy youre friends with, yknow? But hes not the kind of guy you date. Hes the kind of guy youd date because you did. Me, not so much."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Oh not-not so much. Umm, what-what do you, what do you mean is there something wrong with Ross?"}, {"line_number": 21, "type": "dialogue", "speaker": "Jill", "text": "Oh no-no-no, hes just I dont know, hes just a little bookish."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Are-are you saying hes a geek?"}, {"line_number": 23, "type": "dialogue", "speaker": "Jill", "text": "You think so too?"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "No! No I, no Ross is not a geek!"}, {"line_number": 25, "type": "dialogue", "speaker": "Jill", "text": "Fine, then lets just say hes not my type."}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "What handsome is not your type? Smart? Kind? Good kisser? What those things arent on your list? Ross is a great guy! You would be lucky to be with him!"}, {"line_number": 27, "type": "dialogue", "speaker": "Jill", "text": "Well okay, if it means that much to you, then Ill ask him out."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Oh no-no-no, no-no-no, thats not what I meant."}, {"line_number": 29, "type": "dialogue", "speaker": "Jill", "text": "No! Yknow what Rachel? Youre right, yknow he has been really nice to me."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Yeah but, hes not your type."}, {"line_number": 31, "type": "dialogue", "speaker": "Jill", "text": "Yeah but maybe thats a good thing. Yknow Im doing all these different sorts of things, and maybe I should try dating a geek too!"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Yeah but, you dont, you dont, you dont want to try to much too fast. Yknow? I mean, you do remember what happened to the little girl that tried to much too fast dont you?"}, {"line_number": 33, "type": "dialogue", "speaker": "Jill", "text": "What?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "She-she died Jill."}, {"line_number": 35, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 8, "scene_id": "S06E13_008", "location": "Monica and Chandler's", "scene_description": "Chandler has fallen asleep reading a book. Monica calls from the bedroom and wakes him up.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E13/scenes/S06E13_008", "raw_text": "[Scene: Monica and Chandler's, Chandler has fallen asleep reading a book. Monica calls from the bedroom and wakes him up.]\nMonica: (still sick) Chandler!\nChandler: Oh what is it honey, you need some tea? Some soup? (He gets up from the couch and goes into the bedroom to find Monica, still in the robe, lying seductively on the bed. Or at least shes trying too and as he enters the room, she takes the robe off on of her legs.) Oh-ohhhh!\nMonica: (trying to be seductive) Calling Dr. Big, Dr. Big to the bed.\nChandler: Oh Jeez honey, I thought, I thought you were asleep.\nMonica: How could I be asleep knowing that you were in the next room.\nChandler: I was asleep. (She takes off her robe and starts to shiver) Oh no! No-no honey! Yknow whats sexy? Layers. Layers are sexy. And blankets are sexy. And oh! Hot water bottles are sexy.\nMonica: Come on, get into bed! I want to prove to you that Im not sick! I wanna make you feel, as good as I feel. (Sneezes.) \nChandler: Would you please get some rest!\nMonica: Im fine. (She goes into one of those half sneezing, half-coughing fits that you get with a bad cold or flu.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler has fallen asleep reading a book. Monica calls from the bedroom and wakes him up.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "(still sick) Chandler!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Oh what is it honey, you need some tea? Some soup? (He gets up from the couch and goes into the bedroom to find Monica, still in the robe, lying seductively on the bed. Or at least shes trying too and as he enters the room, she takes the robe off on of her legs.) Oh-ohhhh!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "(trying to be seductive) Calling Dr. Big, Dr. Big to the bed."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Oh Jeez honey, I thought, I thought you were asleep."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "How could I be asleep knowing that you were in the next room."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "I was asleep. (She takes off her robe and starts to shiver) Oh no! No-no honey! Yknow whats sexy? Layers. Layers are sexy. And blankets are sexy. And oh! Hot water bottles are sexy."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Come on, get into bed! I want to prove to you that Im not sick! I wanna make you feel, as good as I feel. (Sneezes.) "}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Would you please get some rest!"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Im fine. (She goes into one of those half sneezing, half-coughing fits that you get with a bad cold or flu.)"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 9, "scene_id": "S06E13_009", "location": "Central Perk", "scene_description": "Joey is singing Happy Birthday to yet another good-looking woman. Gunther is watching and is not very happy.", "characters": ["Gunther", "Joey", "Rachel", "Ross"], "firestore_path": "/episodes/S06E13/scenes/S06E13_009", "raw_text": "[Scene: Central Perk, Joey is singing Happy Birthday to yet another good-looking woman. Gunther is watching and is not very happy.]\nJoey: (singing) \"Happy birthday to you!\"\nGunther: Youre paying for that.\nJoey: What? No-no its her birthday!\nGunther: Youve sung Happy Birthday to 20 different women today!\nJoey: But it really\nGunther: You are no longer authorized to distribute birthday muffins.\nJoey: Damnit! (Storms off.)\nRoss: (entering) Rach? Hi!\nRachel: Hi!\nRoss: Did you tell your sister to ask me out?\nRachel: Well yeah\nRoss: Oh wow! I mean, wow! I mean, I-I-I think shes cute but I-I would never have thought of going out with her, never!\nRachel: Really?!\nRoss: Yeah but after you said it was okay, I figured, \"Why not?!\"\nRachel: Oh so-so not really never.\nRoss: I have to say you are a much bigger person than I am. I mean after all weve been through, I justyknow I wish I had a brother to reciprocate. Hey, if you ever want to go out with Monica, you have my blessing.\nJoey: (overhearing them) Oh-ho, and mine!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is singing Happy Birthday to yet another good-looking woman. Gunther is watching and is not very happy.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(singing) \"Happy birthday to you!\""}, {"line_number": 3, "type": "dialogue", "speaker": "Gunther", "text": "Youre paying for that."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "What? No-no its her birthday!"}, {"line_number": 5, "type": "dialogue", "speaker": "Gunther", "text": "Youve sung Happy Birthday to 20 different women today!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "But it really"}, {"line_number": 7, "type": "dialogue", "speaker": "Gunther", "text": "You are no longer authorized to distribute birthday muffins."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Damnit! (Storms off.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "(entering) Rach? Hi!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Did you tell your sister to ask me out?"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Well yeah"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Oh wow! I mean, wow! I mean, I-I-I think shes cute but I-I would never have thought of going out with her, never!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Really?!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Yeah but after you said it was okay, I figured, \"Why not?!\""}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Oh so-so not really never."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "I have to say you are a much bigger person than I am. I mean after all weve been through, I justyknow I wish I had a brother to reciprocate. Hey, if you ever want to go out with Monica, you have my blessing."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "(overhearing them) Oh-ho, and mine!"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 10, "scene_id": "S06E13_010", "location": "Monica and Chandler's", "scene_description": "Monica is still sick and is hobbling out into the living room for some help from Chandler whos on the couch reading.", "characters": ["Chandler", "Monica"], "firestore_path": "/episodes/S06E13/scenes/S06E13_010", "raw_text": "[Scene: Monica and Chandler's, Monica is still sick and is hobbling out into the living room for some help from Chandler whos on the couch reading.]\nMonica: (entering) Chandler, I think Im sick.\nChandler: Really? Struck down in the pribe of libe!\nMonica: Okay, fine I admit it! I feel terrible! Would you please rub this on my chest? (She hands him some of that Vicks Vap-O-Rub to put on.)\nChandler: No-no-no-no-no-no-no, you are not getting me this way.\nMonica: Come on! I really need your help!\nChandler: No-no-no-no-no!\nMonica: Fine, Ill rub it on myself.\nChandler: Okay.\n(To start this task, she lowers the top of her robe to reveal that she is naked from the waist up, well at least her back is, and starts to rub on the gunk. Chandler notices this, and has something start happening. Ill let you fill in the blank here.)\nChandler: So youre just, kinda rubbing it on yourself?\nMonica: Yeah?\nChandler: Its nice.\nMonica: Are you kidding me?! Is this; is this turning you on?\nChandler: Yes! (Hangs his head in shame.)\nMonica: I cant believe it! What is it? Is it the rubbing or the smell?\nChandler: Its all very, very good. (She covers up and sits down.) So you wanna go uh, mix it up?\nMonica: Not now, Im sick!\nChandler: Oh come on you big faker!\nMonica: What happened to your rule about never sleeping with sick people?\nChandler: Well that was before all the vaporizing action.\nMonica: Okay, if you really wanna have sex\nChandler: Okay! (Runs into the bedroom.)\nMonica: Worked like a charm.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica is still sick and is hobbling out into the living room for some help from Chandler whos on the couch reading.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "(entering) Chandler, I think Im sick."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Really? Struck down in the pribe of libe!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Okay, fine I admit it! I feel terrible! Would you please rub this on my chest? (She hands him some of that Vicks Vap-O-Rub to put on.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no-no-no-no-no, you are not getting me this way."}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Come on! I really need your help!"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no-no-no!"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Fine, Ill rub it on myself."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Okay."}, {"line_number": 10, "type": "action", "text": "(To start this task, she lowers the top of her robe to reveal that she is naked from the waist up, well at least her back is, and starts to rub on the gunk. Chandler notices this, and has something start happening. Ill let you fill in the blank here.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "So youre just, kinda rubbing it on yourself?"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Yeah?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Its nice."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Are you kidding me?! Is this; is this turning you on?"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Yes! (Hangs his head in shame.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "I cant believe it! What is it? Is it the rubbing or the smell?"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Its all very, very good. (She covers up and sits down.) So you wanna go uh, mix it up?"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Not now, Im sick!"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Oh come on you big faker!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "What happened to your rule about never sleeping with sick people?"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Well that was before all the vaporizing action."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Okay, if you really wanna have sex"}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Okay! (Runs into the bedroom.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "Worked like a charm."}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 11, "scene_id": "S06E13_011", "location": "Central Perk", "scene_description": "Rachel is there as Jill enters to start her date with Ross.", "characters": ["Jill", "Rachel", "Ross"], "firestore_path": "/episodes/S06E13/scenes/S06E13_011", "raw_text": "[Scene: Central Perk, Rachel is there as Jill enters to start her date with Ross.]\nJill: (entering) Hi!\nRachel: Hi! Wh-what are you doing here?\nJill: This is where Ross and I are meeting for our date. So, what do you think? (She spins to show Rachel the outfit shes wearing.)\nRachel: Well, I-I dont like it.\nJill: Really?!\nRachel: Its kinda slutty.\nJill: Its yours!\nRachel: Yeah well, Im-Im a slut.\nJill: (laughs) Me too.\nRoss: (entering) Hi Jill!\nJill: Hey!\nRoss: Hi (sees Rachel and forgets her name for a moment).\nRachel: Rachel.\nRoss: Rachel! Well, you-youre not at home, youre-youre-youre right here.\nRachel: Yeah I know, and I bet you thought it would be weird. But its not!\n(Theres an awkward silence.)\nRoss: Okay. So well Ill umm, (To Rachel) Ill have her home by midnight.\n(Rachel laughs a little too hard as Ross and Jill leave for their date. After they have left, Rachel starts to break down.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Rachel is there as Jill enters to start her date with Ross.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Jill", "text": "(entering) Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Hi! Wh-what are you doing here?"}, {"line_number": 4, "type": "dialogue", "speaker": "Jill", "text": "This is where Ross and I are meeting for our date. So, what do you think? (She spins to show Rachel the outfit shes wearing.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Well, I-I dont like it."}, {"line_number": 6, "type": "dialogue", "speaker": "Jill", "text": "Really?!"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Its kinda slutty."}, {"line_number": 8, "type": "dialogue", "speaker": "Jill", "text": "Its yours!"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Yeah well, Im-Im a slut."}, {"line_number": 10, "type": "dialogue", "speaker": "Jill", "text": "(laughs) Me too."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hi Jill!"}, {"line_number": 12, "type": "dialogue", "speaker": "Jill", "text": "Hey!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Hi (sees Rachel and forgets her name for a moment)."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Rachel."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Rachel! Well, you-youre not at home, youre-youre-youre right here."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Yeah I know, and I bet you thought it would be weird. But its not!"}, {"line_number": 17, "type": "action", "text": "(Theres an awkward silence.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Okay. So well Ill umm, (To Rachel) Ill have her home by midnight."}, {"line_number": 19, "type": "action", "text": "(Rachel laughs a little too hard as Ross and Jill leave for their date. After they have left, Rachel starts to break down.)"}]}
{"episode_id": "S06E13", "season": 6, "episode_number": 13, "episode_title": "THE ONE WITH RACHELS SISTER", "scene_number": 12, "scene_id": "S06E13_012", "location": "Monica and Chandler's", "scene_description": "Rachel enters and walks quickly over to the window to watch Rosss apartment. We see that Rosss apartment is empty.", "characters": ["Chandler", "Monica", "Rachel"], "firestore_path": "/episodes/S06E13/scenes/S06E13_012", "raw_text": "[Scene: Monica and Chandler's, Rachel enters and walks quickly over to the window to watch Rosss apartment. We see that Rosss apartment is empty.]\nRachel: Why arent you home yet?!\nMonica: (calling from the bathroom) Is someone there?\nRachel: Oh yes, its me! Sorry!\nChandler: (calling from the bathroom) What are you doing here?\nRachel: Uh, Im just, Im just looking out your window. At-at the view. What are you guys doing?\nChandler: We got some Vap-O-Rub in some places.\n(We see that Ross is returning to his apartment with Jill.)\nRachel: (gasps) Oh, he brought her back to his apartment.\nMonica: (entering with Chandler) Who? (She looks out the window at Rosss apartment) Is that your sister?\nRachel: Ugh, she is a slut!\nMonica: God, Ross is on a date with your sister! How weird is that?!\nRachel: Oh my God, look-look hes taking off her clothes!\nChandler: Hes taking off her coat!\n(We see that Ross is taking off Jills coat.)\nRachel: Oh, this is just terrible. \nMonica: Oh no its not, no its not. Its a first date. Im sure that nothing is gonna(as she is talking we see Ross close his drapes.)\nRachel: Oh. (Squeaks again.)\nChandler: Ho-oh, hes gonna get some! (Rachel looks at him.) Of the glare from the streetlight out of his apartment. Yknow so umm, hes closed the drapes there so he can have a nice, pleasant conversation with your little sister. (Pause) Well, Im off to bed! (Goes to bed.)\nTo Be Continued\nEnding Credits\n(There is no credits scene, just a preview of the next couple of episodes.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Rachel enters and walks quickly over to the window to watch Rosss apartment. We see that Rosss apartment is empty.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Why arent you home yet?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "(calling from the bathroom) Is someone there?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Oh yes, its me! Sorry!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(calling from the bathroom) What are you doing here?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Uh, Im just, Im just looking out your window. At-at the view. What are you guys doing?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "We got some Vap-O-Rub in some places."}, {"line_number": 8, "type": "action", "text": "(We see that Ross is returning to his apartment with Jill.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "(gasps) Oh, he brought her back to his apartment."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "(entering with Chandler) Who? (She looks out the window at Rosss apartment) Is that your sister?"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Ugh, she is a slut!"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "God, Ross is on a date with your sister! How weird is that?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God, look-look hes taking off her clothes!"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Hes taking off her coat!"}, {"line_number": 15, "type": "action", "text": "(We see that Ross is taking off Jills coat.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Oh, this is just terrible. "}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Oh no its not, no its not. Its a first date. Im sure that nothing is gonna(as she is talking we see Ross close his drapes.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Oh. (Squeaks again.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Ho-oh, hes gonna get some! (Rachel looks at him.) Of the glare from the streetlight out of his apartment. Yknow so umm, hes closed the drapes there so he can have a nice, pleasant conversation with your little sister. (Pause) Well, Im off to bed! (Goes to bed.)"}, {"line_number": 20, "type": "narration", "text": "To Be Continued"}, {"line_number": 21, "type": "narration", "text": "Ending Credits"}, {"line_number": 22, "type": "action", "text": "(There is no credits scene, just a preview of the next couple of episodes.)"}, {"line_number": 23, "type": "narration", "text": "End"}]}
