{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 1, "scene_id": "S07E11_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S07E11/scenes/S07E11_001", "raw_text": "THE ONE WITH ALL THE CHEESECAKE \nWritten by: Shana Goldberg-Meehan Transcribed by: Eric Aasen With Help from: Aaron Howard-Miller", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH ALL THE CHEESECAKE "}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Shana Goldberg-Meehan Transcribed by: Eric Aasen With Help from: Aaron Howard-Miller"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 2, "scene_id": "S07E11_002", "location": "Chandler and Monicas", "scene_description": "Chandler is sitting at the kitchen table eating cheesecake. The box it came in is also on the table.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_002", "raw_text": "[Scene: Chandler and Monicas, Chandler is sitting at the kitchen table eating cheesecake. The box it came in is also on the table.]\nChandler: Ohh. Mmm.\nRachel: (Comes in the front door and walks towards the kitchen.) Hi.\nChandler: Hey, you have got to try this cheesecake.\nRachel: Oh, yknow I'm not that much of a sweet tooth. I(Chandler puts a forkful of the cheesecake in her mouth.)Wow. My God, so creamy. Oh my God, this is the best cheesecake I have ever had. Where did you get this? (She reaches over to look at the label on the box.)\nChandler: (nervously) It was at the front door. When I got home. Somebody sent it to us.\nRachel: Chandler, this is not addressed to you. This is addressed to Mrs. Braverman downstairs. (Gasping) Thief.\nChandler: Ino! I didn't read the box before I opened it. And you can't return a box after you've opened the box.\nRachel: Why, why not?\nChandler: Because it's too delicious.\nRachel: Chandler, you stole this cheesecake. That is wrong.\nChandler: No-no-no! It is going to be okay, because Mrs. Braverman is gonna send away for a free one and that way we all win! The only losers are the big cheesecake conglomerate, (Reading the label) Mommas Little Bakery. (Pause) I feel terrible, Im a horrible, horrible, horrible person.\nRachel: (taking a bite) Oh, Im sorry what?\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Chandler and Monicas, Chandler is sitting at the kitchen table eating cheesecake. The box it came in is also on the table.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Ohh. Mmm."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "(Comes in the front door and walks towards the kitchen.) Hi."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Hey, you have got to try this cheesecake."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh, yknow I'm not that much of a sweet tooth. I(Chandler puts a forkful of the cheesecake in her mouth.)Wow. My God, so creamy. Oh my God, this is the best cheesecake I have ever had. Where did you get this? (She reaches over to look at the label on the box.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "(nervously) It was at the front door. When I got home. Somebody sent it to us."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Chandler, this is not addressed to you. This is addressed to Mrs. Braverman downstairs. (Gasping) Thief."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Ino! I didn't read the box before I opened it. And you can't return a box after you've opened the box."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Why, why not?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Because it's too delicious."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Chandler, you stole this cheesecake. That is wrong."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no! It is going to be okay, because Mrs. Braverman is gonna send away for a free one and that way we all win! The only losers are the big cheesecake conglomerate, (Reading the label) Mommas Little Bakery. (Pause) I feel terrible, Im a horrible, horrible, horrible person."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "(taking a bite) Oh, Im sorry what?"}, {"line_number": 14, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 3, "scene_id": "S07E11_003", "location": "Central Perk", "scene_description": "everyone except Rachel is there as Joey gets up and starts putting on his coat.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Ross"], "firestore_path": "/episodes/S07E11/scenes/S07E11_003", "raw_text": "[Scene: Central Perk, everyone except Rachel is there as Joey gets up and starts putting on his coat.]\nJoey: All right, I should get going, big day a work. Yknow Im in a coma? Today, they do this test on me and it turns out Im not brain dead.\nChandler: So\nJoey: Ah-ah-ah Mr. Smartie Pants, its just not my character thats not brain dead. Hey, so Pheebs, we still on for tonight?\nPhoebe: Absolutely!\nJoey: Ill see you at 8:00.\nPhoebe: Okay. (Joey exits.) \nChandler: Oh, whats at 8:00?\nPhoebe: Oh, I have dinner plans with Joey. We get together about once a month to discuss the rest of you guys.\nRoss: Wow, did not know that! May I say how lovely you look today?\nPhoebe: Duly noted.\nRoss: Thanks. (Phoebe gets up to get a refill.) (To Monica) Oh! So for tomorrow, do you want to rent a car and drive down together or what?\nMonica: What are you talking about?\nRoss: Cousin Frannies wedding, its tomorrow night.\nMonica: You were invited?!\nRoss: No.\nMonica: My God, I cant believe this! I mean I knew that mom and dad were invited, but I thought that was it! I mean from the ages 7 to 9 Frannie and I were inseparable!\nChandler: Well, maybe since the age of 9, Frannies made some new friends.\nRoss: Well l-look okay, its probably just a mistake. Let me call Aunt Sheryl okay? Maybe you are invited and the invitation just got lost in the mail.\nMonica: Yeah, well you call her and tell her that yknow when we were kids her precious little Frannie tried to undress me several times, okay? And if I hadnt have stopped her, there probably wouldnt even be a wedding to go too.\nRoss: Yknow, she tried to undress me too.\nChandler: I used to undress my cousin Glenn. (Monica looks at him then sushes him.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, everyone except Rachel is there as Joey gets up and starts putting on his coat.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "All right, I should get going, big day a work. Yknow Im in a coma? Today, they do this test on me and it turns out Im not brain dead."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "So"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Ah-ah-ah Mr. Smartie Pants, its just not my character thats not brain dead. Hey, so Pheebs, we still on for tonight?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Absolutely!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Ill see you at 8:00."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (Joey exits.) "}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Oh, whats at 8:00?"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, I have dinner plans with Joey. We get together about once a month to discuss the rest of you guys."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Wow, did not know that! May I say how lovely you look today?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Duly noted."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Thanks. (Phoebe gets up to get a refill.) (To Monica) Oh! So for tomorrow, do you want to rent a car and drive down together or what?"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "What are you talking about?"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Cousin Frannies wedding, its tomorrow night."}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "You were invited?!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "No."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "My God, I cant believe this! I mean I knew that mom and dad were invited, but I thought that was it! I mean from the ages 7 to 9 Frannie and I were inseparable!"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Well, maybe since the age of 9, Frannies made some new friends."}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Well l-look okay, its probably just a mistake. Let me call Aunt Sheryl okay? Maybe you are invited and the invitation just got lost in the mail."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Yeah, well you call her and tell her that yknow when we were kids her precious little Frannie tried to undress me several times, okay? And if I hadnt have stopped her, there probably wouldnt even be a wedding to go too."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Yknow, she tried to undress me too."}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "I used to undress my cousin Glenn. (Monica looks at him then sushes him.)"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 4, "scene_id": "S07E11_004", "location": "Joey and Rachel's", "scene_description": "Monica, Chandler, Rachel, and Ross are playing Monopoly as Phoebe enters angrily.", "characters": ["Joey", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E11/scenes/S07E11_004", "raw_text": "[Scene: Joey and Rachel's, Monica, Chandler, Rachel, and Ross are playing Monopoly as Phoebe enters angrily.]\nPhoebe: Joseph Francis Tribbiani are you home yet?!!\nRachel: Umm, I think hes still out. Whats wrong?\nPhoebe: Well, Ill tell you Rachel Karen Green, I had plans with Joey tonight and he left me this note. (Hands it to Rachel.)\nRachel: (reading the note) \"Pheebs, cant make it, got a date. Talk to you later. Big Daddy.\" (Laughs) Big Daddy?\nPhoebe: Oh thats a nickname we were trying out.\nRoss: Hey, yknow what nickname never caught on? The Ross-A-Tron! (Monica shakes her head in disgust.)\nJoey: (entering) Hey!\nPhoebe: Oh! Heres Joseph Francis!\nJoey: Oh-Wha-Ho! What are you middle naming me for?! I left you a note!\nPhoebe: So what?! That doesnt give you the right to ditch me!\nJoey: Hey, you can cancel plans with friends if there is the possibility for sex!\nRoss: Phoebe hes right, that is the rule.\nPhoebe: I dont accept this rule. When me make plans, I expect you to show up. Okay, I cant just be a way to kill time til you meet someone better! Yknow boyfriends and girlfriends come and go, but this (Motions that their friendship) is for life!\nJoey: Wow! Im so sorry; I had no idea it would bother you this much.\nPhoebe: Well, it does.\nJoey: Okay, can I-can I make it up to you? Huh? Im sorry. (They hug.) How about uh, dinner tomorrow night?! Ill pay for myself!\nPhoebe: Okay, you wore me down.\nRoss: Hey Joe, while youre over there how about another beer for the Ross-A-Tron?\nJoey: The RossIs that back?!! (Chandler motions no.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Monica, Chandler, Rachel, and Ross are playing Monopoly as Phoebe enters angrily.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Joseph Francis Tribbiani are you home yet?!!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Umm, I think hes still out. Whats wrong?"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Well, Ill tell you Rachel Karen Green, I had plans with Joey tonight and he left me this note. (Hands it to Rachel.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "(reading the note) \"Pheebs, cant make it, got a date. Talk to you later. Big Daddy.\" (Laughs) Big Daddy?"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh thats a nickname we were trying out."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Hey, yknow what nickname never caught on? The Ross-A-Tron! (Monica shakes her head in disgust.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! Heres Joseph Francis!"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Oh-Wha-Ho! What are you middle naming me for?! I left you a note!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "So what?! That doesnt give you the right to ditch me!"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Hey, you can cancel plans with friends if there is the possibility for sex!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Phoebe hes right, that is the rule."}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "I dont accept this rule. When me make plans, I expect you to show up. Okay, I cant just be a way to kill time til you meet someone better! Yknow boyfriends and girlfriends come and go, but this (Motions that their friendship) is for life!"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Wow! Im so sorry; I had no idea it would bother you this much."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Well, it does."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Okay, can I-can I make it up to you? Huh? Im sorry. (They hug.) How about uh, dinner tomorrow night?! Ill pay for myself!"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, you wore me down."}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "Hey Joe, while youre over there how about another beer for the Ross-A-Tron?"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "The RossIs that back?!! (Chandler motions no.)"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 5, "scene_id": "S07E11_005", "location": "Monica and Chandler's", "scene_description": "Rachel enters to find Chandler staring at another cheesecake box.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_005", "raw_text": "[Scene: Monica and Chandler's, Rachel enters to find Chandler staring at another cheesecake box.]\nRachel: Hi!\nChandler: Another cheesecake came! They delivered it to the wrong address again!\nRachel: So just bring it back downstairs, whats the problem?\nChandler: I cant seem to say goodbye.\nRachel: Are you serious?! Chandler, we ate an entire cheesecake two days ago and you want more?\nChandler: Well Ive forgotten what it tastes like okay?!\nRachel: It was cheesecake. It was fine. It had a buttery, crumbly, graham cracker crust, with a very rich yet light, cream cheese filling (Pause) Wow! My whole mouth just filled with saliva! \nChandler: (closing the box) Yknow what? Forget it! We are just hungry! We have not had lunch! We are just light-headed! So let us go out and have lunch and forget about the cheesecake.\nRachel: Yeah and well drop it off downstairs so that were not tempted.\nChandler: Good idea. Where do you want to go to lunch?\nRachel: Mommas Little Bakery, Chicago, Illinois. (They exit with the cheesecake.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Rachel enters to find Chandler staring at another cheesecake box.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Another cheesecake came! They delivered it to the wrong address again!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "So just bring it back downstairs, whats the problem?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "I cant seem to say goodbye."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Are you serious?! Chandler, we ate an entire cheesecake two days ago and you want more?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Well Ive forgotten what it tastes like okay?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "It was cheesecake. It was fine. It had a buttery, crumbly, graham cracker crust, with a very rich yet light, cream cheese filling (Pause) Wow! My whole mouth just filled with saliva! "}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "(closing the box) Yknow what? Forget it! We are just hungry! We have not had lunch! We are just light-headed! So let us go out and have lunch and forget about the cheesecake."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Yeah and well drop it off downstairs so that were not tempted."}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Good idea. Where do you want to go to lunch?"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Mommas Little Bakery, Chicago, Illinois. (They exit with the cheesecake.)"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 6, "scene_id": "S07E11_006", "location": "Central Perk", "scene_description": "Monica and Joey are there. Joey is reading a newspaper.", "characters": ["Joey", "Monica", "Ross"], "firestore_path": "/episodes/S07E11/scenes/S07E11_006", "raw_text": "[Scene: Central Perk, Monica and Joey are there. Joey is reading a newspaper.]\nJoey: Awww! Mel Torme died.\nMonica: Joey, that papers like a year old!\nJoey: Aw! Does that mean the Sam Goodys sale is over?!\nRoss: (entering) Hey.\nJoey: Hey.\nMonica: Hey.\nRoss: So I finally heard back from Aunt Sheryl and apparently it wasnt a mistake. Ahh, theres-theres limited seating in the hall.\nMonica: Limited seating?! (Screechingly) I am just one tiny person!\nRoss: Well yeah, but she doesnt know that. I mean, the last time she saw you-you wouldve turned one of those little wedding chairs into kindling. \nMonica: (disgusted) Limited seating! Oh, that is such a lame excuse! Thats not the reason shes not inviting me!\nRoss: Oh whats the big deal?! I wasnt even invited to the ceremony, just the reception. And-and yknow what? If it makes you feel any better, Joan and I will just make an appearance and then, and then well-well leave early as a sign of protest.\nMonica: Joan?\nRoss: Yeah, Joan Tedeski my date. Shes an assistant professor in the Linguistics department. Tall, very beautiful, and despite what some people say, not broad backed!\nMonica: Wait a minute, you got Ross Gellar and guest?! I wasnt invited and you got \"and guest?!\"\nJoey: Uh-uh, excuse me, I do have to interrupt on Rosss behalf. I-I think the rule applies here yknow, since she has a chance to get on broad back\nRoss: (interrupting) Not broad backed!\nMonica: Wait a minute, yknow, youre bringing me!\nRoss: What? I cant cancel on Joan!\nMonica: Why not?!\nRoss: BecDid you not hear me?! Shes an assistant professor in the Linguistics department, okay? Theyre wild! Why do you want to come anyway?\nMonica: Because! Shes my cousin. I mean, we grew up together! Were family yknow? Well thats important to me.\nRoss: Okay, all right, Ill take you. Ill go call Joan. (Does so.)\nJoey: Aww thats nice. Family should be there, huh? This is her wedding, happiest day of her life.\nMonica: (laughs) Well see.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Monica and Joey are there. Joey is reading a newspaper.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Awww! Mel Torme died."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Joey, that papers like a year old!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "Aw! Does that mean the Sam Goodys sale is over?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Hey."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Hey."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "So I finally heard back from Aunt Sheryl and apparently it wasnt a mistake. Ahh, theres-theres limited seating in the hall."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Limited seating?! (Screechingly) I am just one tiny person!"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Well yeah, but she doesnt know that. I mean, the last time she saw you-you wouldve turned one of those little wedding chairs into kindling. "}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "(disgusted) Limited seating! Oh, that is such a lame excuse! Thats not the reason shes not inviting me!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Oh whats the big deal?! I wasnt even invited to the ceremony, just the reception. And-and yknow what? If it makes you feel any better, Joan and I will just make an appearance and then, and then well-well leave early as a sign of protest."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Joan?"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Yeah, Joan Tedeski my date. Shes an assistant professor in the Linguistics department. Tall, very beautiful, and despite what some people say, not broad backed!"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, you got Ross Gellar and guest?! I wasnt invited and you got \"and guest?!\""}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Uh-uh, excuse me, I do have to interrupt on Rosss behalf. I-I think the rule applies here yknow, since she has a chance to get on broad back"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "(interrupting) Not broad backed!"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, yknow, youre bringing me!"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "What? I cant cancel on Joan!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Why not?!"}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "BecDid you not hear me?! Shes an assistant professor in the Linguistics department, okay? Theyre wild! Why do you want to come anyway?"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Because! Shes my cousin. I mean, we grew up together! Were family yknow? Well thats important to me."}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "Okay, all right, Ill take you. Ill go call Joan. (Does so.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Aww thats nice. Family should be there, huh? This is her wedding, happiest day of her life."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "(laughs) Well see."}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 7, "scene_id": "S07E11_007", "location": "The Lobby of Chandler and Rachels building", "scene_description": "Chandler and Rachel are returning from lunch.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_007", "raw_text": "[Scene: The Lobby of Chandler and Rachels building, Chandler and Rachel are returning from lunch.]\nChandler: Well, thank you for lunch.\nRachel: What? Wait a minute, I didnt pay, I thought you paid!\nChandler: So apparently we just dont pay for food anymore. (Rachel laughs then Chandler notices something.) Do you see what I see?\nRachel: (gasps) Its still there! (The cheesecake they returned to Mrs. Braverman is still lying in front of her door.)\nChandler: Mrs. Braverman must be out. (They move closer to it.)\nRachel: She could be out of town. Maybe shell be gone for months.\nChandler: By then, the cheesecake may have gone bad. We dont want her to come back to bad cheesecake.\nRachel: No that could kill her.\nChandler: Well, we dont want that.\nRachel: No so were protecting her.\nChandler: But we should take it.\nRachel: But we should move quick.\nChandler: Why?\nRachel: Because I think I just heard her moving around in there.\nChandler: Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! (Rachel grabs the cheesecake and they take off upstairs.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Lobby of Chandler and Rachels building, Chandler and Rachel are returning from lunch.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Well, thank you for lunch."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "What? Wait a minute, I didnt pay, I thought you paid!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "So apparently we just dont pay for food anymore. (Rachel laughs then Chandler notices something.) Do you see what I see?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "(gasps) Its still there! (The cheesecake they returned to Mrs. Braverman is still lying in front of her door.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Mrs. Braverman must be out. (They move closer to it.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "She could be out of town. Maybe shell be gone for months."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "By then, the cheesecake may have gone bad. We dont want her to come back to bad cheesecake."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "No that could kill her."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Well, we dont want that."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "No so were protecting her."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "But we should take it."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "But we should move quick."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Why?"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Because I think I just heard her moving around in there."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Go! Go! Go! Go! Go! Go! Go! Go! Go! Go! (Rachel grabs the cheesecake and they take off upstairs.)"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 8, "scene_id": "S07E11_008", "location": "Central Perk", "scene_description": "Monica and Phoebe are entering. As Phoebe is sitting down, she recognizes someone sitting at the counter.", "characters": ["David", "Monica", "Phoebe"], "firestore_path": "/episodes/S07E11/scenes/S07E11_008", "raw_text": "[Scene: Central Perk, Monica and Phoebe are entering. As Phoebe is sitting down, she recognizes someone sitting at the counter.]\nPhoebe: (gasps) (whispering) Oh my God! Thats David!\nMonica: David who?\nPhoebe: David the scientist guy, David that I was in love with, David who went to Russia and broke my heart David!\nDavid: (noticing Phoebe) Oh my God!\nPhoebe: Oh, you say someones name enough, they turn around.\nDavid: Phoebe?\nPhoebe: David! (He kisses her cheek) What-what are you doing here? Arent you supposed to be in Russia?\nDavid: Yeah, Im just, Im just in town for a conference. Umm, God you look phenomenal!\nPhoebe: Well Yeah. You look great too. Did you get a haircut?\nDavid: Yeah. Well I-I got like thirty of them.\nPhoebe: Yeah.\nDavid: Umm, look I-I-I got a confession to make\nPhoebe: Uh-huh.\nDavid: Uh, I-I-I was hoping to run into you here. I didnt know whether I should call or not, yknow I-I was only in town for a few days. And yknow, I didnt want to intrude on your life or-or anything like that, but I-I really wanted to see you andbut I didnt know if you wanted to see me.\nPhoebe: Well, of course I would want to see you. II think about you all the time.\nDavid: Really? Because I think about you all the time. \nPhoebe: Really?\nDavid: I mean, theres a statue in Minsk\nPhoebe: Uh-huh.\nDavid: That reminds me of you so much, I mean umm, it-its actually of Lenin. But, yknow at certain angles\nPhoebe: Yeah.\nDavid: Umm, anywayDo you want to have dinner tonight?\nPhoebe: (excited) Yes! Oh no! \nDavid: (disappointed) Oh. Uh, what?\nPhoebe: I cant. I cant believe I have plans, I cant. Can you do it tomorrow night though?\nDavid: Uh no, I have to go in a few hours. I have to be on the red-eye. Well listen, yknow, next time youre in Minsk umm\nMonica: Phoebe, can I talk to you for a second?\nPhoebe: Uh-huh. (They go over and talk.)\nMonica: What are you doing?\nPhoebe: Well, I have plans with Joey tonight.\nMonica: So! Hell understand!\nPhoebe: No he wont. And thats not even the point! Monica, I made a whole speech about you do not cancel plans with friends! And now yknow what? Just because, potentially, the love of my life comes back from Russia just for one night, I-I should change my beliefs?! I should change beliefs! No! No! No, if I dont have my principles, I dont have anything!\nMonica: God, you are so strong.\nPhoebe: Or! I should rush through dinner with Joey and I can meet David at 9:00!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Monica and Phoebe are entering. As Phoebe is sitting down, she recognizes someone sitting at the counter.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "(gasps) (whispering) Oh my God! Thats David!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "David who?"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "David the scientist guy, David that I was in love with, David who went to Russia and broke my heart David!"}, {"line_number": 5, "type": "dialogue", "speaker": "David", "text": "(noticing Phoebe) Oh my God!"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, you say someones name enough, they turn around."}, {"line_number": 7, "type": "dialogue", "speaker": "David", "text": "Phoebe?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "David! (He kisses her cheek) What-what are you doing here? Arent you supposed to be in Russia?"}, {"line_number": 9, "type": "dialogue", "speaker": "David", "text": "Yeah, Im just, Im just in town for a conference. Umm, God you look phenomenal!"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Well Yeah. You look great too. Did you get a haircut?"}, {"line_number": 11, "type": "dialogue", "speaker": "David", "text": "Yeah. Well I-I got like thirty of them."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 13, "type": "dialogue", "speaker": "David", "text": "Umm, look I-I-I got a confession to make"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-huh."}, {"line_number": 15, "type": "dialogue", "speaker": "David", "text": "Uh, I-I-I was hoping to run into you here. I didnt know whether I should call or not, yknow I-I was only in town for a few days. And yknow, I didnt want to intrude on your life or-or anything like that, but I-I really wanted to see you andbut I didnt know if you wanted to see me."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Well, of course I would want to see you. II think about you all the time."}, {"line_number": 17, "type": "dialogue", "speaker": "David", "text": "Really? Because I think about you all the time. "}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Really?"}, {"line_number": 19, "type": "dialogue", "speaker": "David", "text": "I mean, theres a statue in Minsk"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-huh."}, {"line_number": 21, "type": "dialogue", "speaker": "David", "text": "That reminds me of you so much, I mean umm, it-its actually of Lenin. But, yknow at certain angles"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 23, "type": "dialogue", "speaker": "David", "text": "Umm, anywayDo you want to have dinner tonight?"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "(excited) Yes! Oh no! "}, {"line_number": 25, "type": "dialogue", "speaker": "David", "text": "(disappointed) Oh. Uh, what?"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "I cant. I cant believe I have plans, I cant. Can you do it tomorrow night though?"}, {"line_number": 27, "type": "dialogue", "speaker": "David", "text": "Uh no, I have to go in a few hours. I have to be on the red-eye. Well listen, yknow, next time youre in Minsk umm"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, can I talk to you for a second?"}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-huh. (They go over and talk.)"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica", "text": "What are you doing?"}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "Well, I have plans with Joey tonight."}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "So! Hell understand!"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "No he wont. And thats not even the point! Monica, I made a whole speech about you do not cancel plans with friends! And now yknow what? Just because, potentially, the love of my life comes back from Russia just for one night, I-I should change my beliefs?! I should change beliefs! No! No! No, if I dont have my principles, I dont have anything!"}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "God, you are so strong."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Or! I should rush through dinner with Joey and I can meet David at 9:00!"}, {"line_number": 36, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 9, "scene_id": "S07E11_009", "location": "Joey and Rachel's", "scene_description": "Rachel and Chandler are eating the cheesecake right out of the box.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_009", "raw_text": "[Scene: Joey and Rachel's, Rachel and Chandler are eating the cheesecake right out of the box.]\nRachel: (taking a bite) Oh my God! That is so good!\nChandler: Im full, and yet I know if I stop eating this, Ill regret it.\nJoey: (entering) Hey!\nRachel: Hey!\nJoey: (seeing what theyre doing) What do you got there?\nRachel: Oh its umm, its tofu cake. Do you want some? (He makes a disgusted noise and heads for his room, Chandler follows him in.)\nChandler: What are you doing tonight?\nJoey: Huh? Uh (He starts taking off his pants.)\nChandler: Dude! Dude! (Motions that Joey should pull up his pants.)\nJoey: Oh! (Pulls up his pants.) Sorry. Uh, Ive got those plans with Phoebe, why?\nChandler: Oh really? Uh, Monica said she had a date at 9:00.\nJoey: What?! Tonight?!\nChandler: Thats what Monica said.\nJoey: After she gave me that big speech?! She goes and makes a date with a guy on the same night she has plans with me? I think shes trying to pull a fast one on Big Daddy!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Rachel and Chandler are eating the cheesecake right out of the box.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(taking a bite) Oh my God! That is so good!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Im full, and yet I know if I stop eating this, Ill regret it."}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey!"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Hey!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(seeing what theyre doing) What do you got there?"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Oh its umm, its tofu cake. Do you want some? (He makes a disgusted noise and heads for his room, Chandler follows him in.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "What are you doing tonight?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Huh? Uh (He starts taking off his pants.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Dude! Dude! (Motions that Joey should pull up his pants.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Oh! (Pulls up his pants.) Sorry. Uh, Ive got those plans with Phoebe, why?"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Oh really? Uh, Monica said she had a date at 9:00."}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "What?! Tonight?!"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Thats what Monica said."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "After she gave me that big speech?! She goes and makes a date with a guy on the same night she has plans with me? I think shes trying to pull a fast one on Big Daddy!"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 10, "scene_id": "S07E11_010", "location": "Cousin Frannies Wedding Reception", "scene_description": "Monica and Ross are entering and finding their table.", "characters": ["Monica", "Ross", "The Second Guest", "The Wedding Guest"], "firestore_path": "/episodes/S07E11/scenes/S07E11_010", "raw_text": "[Scene: Cousin Frannies Wedding Reception, Monica and Ross are entering and finding their table.]\nRoss: Oh here, I think this is us. (Reading the name cards.) Yeah.\nMonica: Limited seating my ass. Lets see who made the cut. (To the couple sitting to her right.) Hi!\nThe Wedding Guest: Hi!\nMonica: Im Monica Gellar. Who do you know the bride and groom?\nThe Wedding Guest: Oh, I used to work with Frannie.\nMonica: Used to work with her. Used to! Im a relative and I didnt get invited! A blood relative! Blood!!\nRoss: (To Monica) Stop saying, \"Blood\" to strangers.\nMonica: (to the couple on her left) So, how about you huh? How do you know the happy couple?\nThe Second Guest: We went to college with both of them and now we live next door.\nMonica: Okay, youre fine.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Cousin Frannies Wedding Reception, Monica and Ross are entering and finding their table.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Oh here, I think this is us. (Reading the name cards.) Yeah."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Limited seating my ass. Lets see who made the cut. (To the couple sitting to her right.) Hi!"}, {"line_number": 4, "type": "dialogue", "speaker": "The Wedding Guest", "text": "Hi!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Im Monica Gellar. Who do you know the bride and groom?"}, {"line_number": 6, "type": "dialogue", "speaker": "The Wedding Guest", "text": "Oh, I used to work with Frannie."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Used to work with her. Used to! Im a relative and I didnt get invited! A blood relative! Blood!!"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "(To Monica) Stop saying, \"Blood\" to strangers."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "(to the couple on her left) So, how about you huh? How do you know the happy couple?"}, {"line_number": 10, "type": "dialogue", "speaker": "The Second Guest", "text": "We went to college with both of them and now we live next door."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Okay, youre fine."}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 11, "scene_id": "S07E11_011", "location": "Iridium Restaurant", "scene_description": "Phoebe and Joey are looking at the menus as the waiter comes to take their order.", "characters": ["Joey", "Phoebe", "The Waiter"], "firestore_path": "/episodes/S07E11/scenes/S07E11_011", "raw_text": "[Scene: Iridium Restaurant, Phoebe and Joey are looking at the menus as the waiter comes to take their order.]\nThe Waiter: Hey!\nPhoebe: Hey!\nThe Waiter: Are you guys ready?\nPhoebe: Yes! I will have the green salad, umm the house salad, and waters fine.\nThe Waiter: Okay.\nPhoebe: Okay. \nThe Waiter: (To Joey) And for you sir?\nJoey: Yeah, this slow roasted salmon, just how slow are we talkin here?\nThe Waiter: Its uh, its already been roasted.\nJoey: Ohh, then no. Maybe I should hear those specials again.\nPhoebe: Oh Joey, weve heard the specials three times! Okay? Theres prime rib, mahi mahi, and a very special lobster ravioli. (She grabs his menu and hands it to the waiter.)\nThe Waiter: Actually were out of the lobster ravioli. (Putting Joeys menu under his arm.)\nJoey: Oh well, that changes everything! (Grabs his menu and starts looking at it again. The waiter leaves.) Yknow what Pheebs?\nPhoebe: Huh?\nJoey: You were right before. I mean, friends are so important.\nPhoebe: (checking her watch) Yeah, Im very wise. I know.\nJoey: Yknow-yknow what I really want?\nPhoebe: What?\nJoey: Is to have a long, long talk. Yknow? Get Joey out on the open road and really open him up.\nThe Waiter: (returning) Any progress?\nJoey: Yes! I will have the lobster ravioli.\nPhoebe: God Joey, this is taking forever!\nJoey: Whats the rush? What?\nPhoebe: W-wI justits thatI haveyknow I have-I have an appointment. And its very important.\nJoey: Whoa-whoa, what is it?\nPhoebe: Well Its a date.\nJoey: A date?! No, no Pheebs you-you must be mistaken, because I know you wouldnt schedule a date on the same night you have plans with a friend!\nPhoebe: Come on Joey, dont make me feel badly about this.\nJoey: No, Im gonna!! Thats right! Yeah, you made me feel really guilty about goin out with that girl! Like-like-like I did something terrible to you! And now Pheebs, youre doing the same thing!\nPhoebe: ThatIts not the same thing! This is totally different! This is with David! Remember David, the scientist guy? Okay, hes very special to me.\nJoey: Okay, well my girl from the other night was special. She was a scientist too!\nPhoebe: She was?\nJoey: Well, she graduated from high school!\nPhoebe: Okay, whatever. Yknow what? I dont have time have time to convince you because hes only here for four hours, and Im gonna go see him! (Gets up and leaves.)\nJoey: Fine!\nPhoebe: Yeah!\nJoey: Fine!\nPhoebe: Yeah! (She exits.)\nJoey: (to the waiter) What are you still doin here?! I told you, lobster ravioli!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Iridium Restaurant, Phoebe and Joey are looking at the menus as the waiter comes to take their order.]"}, {"line_number": 2, "type": "dialogue", "speaker": "The Waiter", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "The Waiter", "text": "Are you guys ready?"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Yes! I will have the green salad, umm the house salad, and waters fine."}, {"line_number": 6, "type": "dialogue", "speaker": "The Waiter", "text": "Okay."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. "}, {"line_number": 8, "type": "dialogue", "speaker": "The Waiter", "text": "(To Joey) And for you sir?"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Yeah, this slow roasted salmon, just how slow are we talkin here?"}, {"line_number": 10, "type": "dialogue", "speaker": "The Waiter", "text": "Its uh, its already been roasted."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Ohh, then no. Maybe I should hear those specials again."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Oh Joey, weve heard the specials three times! Okay? Theres prime rib, mahi mahi, and a very special lobster ravioli. (She grabs his menu and hands it to the waiter.)"}, {"line_number": 13, "type": "dialogue", "speaker": "The Waiter", "text": "Actually were out of the lobster ravioli. (Putting Joeys menu under his arm.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Oh well, that changes everything! (Grabs his menu and starts looking at it again. The waiter leaves.) Yknow what Pheebs?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Huh?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "You were right before. I mean, friends are so important."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "(checking her watch) Yeah, Im very wise. I know."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Yknow-yknow what I really want?"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Is to have a long, long talk. Yknow? Get Joey out on the open road and really open him up."}, {"line_number": 21, "type": "dialogue", "speaker": "The Waiter", "text": "(returning) Any progress?"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Yes! I will have the lobster ravioli."}, {"line_number": 23, "type": "dialogue", "speaker": "Phoebe", "text": "God Joey, this is taking forever!"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Whats the rush? What?"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "W-wI justits thatI haveyknow I have-I have an appointment. And its very important."}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Whoa-whoa, what is it?"}, {"line_number": 27, "type": "dialogue", "speaker": "Phoebe", "text": "Well Its a date."}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "A date?! No, no Pheebs you-you must be mistaken, because I know you wouldnt schedule a date on the same night you have plans with a friend!"}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "Come on Joey, dont make me feel badly about this."}, {"line_number": 30, "type": "dialogue", "speaker": "Joey", "text": "No, Im gonna!! Thats right! Yeah, you made me feel really guilty about goin out with that girl! Like-like-like I did something terrible to you! And now Pheebs, youre doing the same thing!"}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "ThatIts not the same thing! This is totally different! This is with David! Remember David, the scientist guy? Okay, hes very special to me."}, {"line_number": 32, "type": "dialogue", "speaker": "Joey", "text": "Okay, well my girl from the other night was special. She was a scientist too!"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "She was?"}, {"line_number": 34, "type": "dialogue", "speaker": "Joey", "text": "Well, she graduated from high school!"}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, whatever. Yknow what? I dont have time have time to convince you because hes only here for four hours, and Im gonna go see him! (Gets up and leaves.)"}, {"line_number": 36, "type": "dialogue", "speaker": "Joey", "text": "Fine!"}, {"line_number": 37, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah!"}, {"line_number": 38, "type": "dialogue", "speaker": "Joey", "text": "Fine!"}, {"line_number": 39, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! (She exits.)"}, {"line_number": 40, "type": "dialogue", "speaker": "Joey", "text": "(to the waiter) What are you still doin here?! I told you, lobster ravioli!"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 12, "scene_id": "S07E11_012", "location": "Outside Central Perk", "scene_description": "Phoebe is running up to meet David.", "characters": ["David", "Phoebe"], "firestore_path": "/episodes/S07E11/scenes/S07E11_012", "raw_text": "[Scene: Outside Central Perk, Phoebe is running up to meet David.]\nPhoebe: Hey!\nDavid: Hey! Oh, I was just about to leave. I-I-I-I didnt think you were coming.\nPhoebe: Oh, I wouldnt miss this.\nDavid: Well, Im very glad youre here. (Kisses her hand.)\nPhoebe: Oh, youre such a gentleman. (Grabs his arm.) Come on! Were going to my place! (Drags him off to her place.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Outside Central Perk, Phoebe is running up to meet David.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "David", "text": "Hey! Oh, I was just about to leave. I-I-I-I didnt think you were coming."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, I wouldnt miss this."}, {"line_number": 5, "type": "dialogue", "speaker": "David", "text": "Well, Im very glad youre here. (Kisses her hand.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, youre such a gentleman. (Grabs his arm.) Come on! Were going to my place! (Drags him off to her place.)"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 13, "scene_id": "S07E11_013", "location": "Joey and Rachel's", "scene_description": "Rachel is eating the cheesecake and Chandler enters and catches her in the act.", "characters": ["Chandler", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_013", "raw_text": "[Scene: Joey and Rachel's, Rachel is eating the cheesecake and Chandler enters and catches her in the act.]\nChandler: Are you eating the cheesecake without me?!\nRachel: (with a mouthful) Mm-mmm. (Nods no.)\nChandler: I will give you a hundred dollars to whistle right now. (She tries to whistle and blows little chunks of cheesecake out of her mouth.) How can you eat the cheesecake without me?!\nRachel: Oh, what are you going to do?! Are you gonna go run tell Monica?! Are you gonna tell Joey?! No! Because then you will have to tell them what we did! We are desert stealers! We are living outside the law!\nChandler: Yknow what? I dont trust you with this cake anymore! And I got it first, and Im takin it back! (Grabs the cheesecake and heads for his apartment.)\nRachel: What?! What?!\nChandler: Oh yes! \nRachel: Wait a minute!\nChandler: Oh yes!\nRachel: Oh no-no-no-no-no, no you dont!\n[Cut to Chandler and Monicas as they enter.]\nChandler: Oh yes! Oh yes!\nRachel: You think I trust you with it?! No! Were gonna split it! You take half and I take half!\nChandler: Well thats not fair, youve already had some!\nRachel: What? Oh, well then yknow what? I think Monica would be very interested to know that you called her cheesecake dry and mealy.\nChandler: What do we use to split it?\nRachel: Okay! (Grabs a knife and cuts it in half.) All right, pick a half.\nChandler: (examining the cake) Okay well, this side looks bigger. Uh Theres more crust on this side. Yknow? So, maybe if I measured\nRachel: Oh for God sake just pick a piece!\nChandler: All right, Ill pick that one. (Points.)\nRachel: Thats also the smaller piece. (Puts the piece onto a plate.) Okay, there you go. Enjoy your half my friend, but that is it. No sharing. No switching, and dont come crying to me if you eat your piece to fast. (As shes saying that she is backing out the door, when she finishes she turns around to return to her place, stumbles and drops the cheesecake on the floor.) Oh!!!!\nChandler: (gloatingly and holding his piece) Ohhh!\nRachel: Okay, you gotta give me some of your piece.\nChandler: Oh-ho-ho-ho-no! No! No switching! No sharing, and dont come crying to me! Ha-ha-ha! I may just sit here and have my cake all day! Just sit here in the hallway and eat my (Rachel knocks the plate from his hand and it falls on the floor. That process leaves just the forkful Chandler has, Rachel starts to go after that little bit and Chandler retreats into his apartment.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Rachel is eating the cheesecake and Chandler enters and catches her in the act.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Are you eating the cheesecake without me?!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "(with a mouthful) Mm-mmm. (Nods no.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "I will give you a hundred dollars to whistle right now. (She tries to whistle and blows little chunks of cheesecake out of her mouth.) How can you eat the cheesecake without me?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh, what are you going to do?! Are you gonna go run tell Monica?! Are you gonna tell Joey?! No! Because then you will have to tell them what we did! We are desert stealers! We are living outside the law!"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Yknow what? I dont trust you with this cake anymore! And I got it first, and Im takin it back! (Grabs the cheesecake and heads for his apartment.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "What?! What?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Oh yes! "}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Wait a minute!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Oh yes!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Oh no-no-no-no-no, no you dont!"}, {"line_number": 12, "type": "narration", "text": "[Cut to Chandler and Monicas as they enter.]"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Oh yes! Oh yes!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "You think I trust you with it?! No! Were gonna split it! You take half and I take half!"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Well thats not fair, youve already had some!"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "What? Oh, well then yknow what? I think Monica would be very interested to know that you called her cheesecake dry and mealy."}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "What do we use to split it?"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Okay! (Grabs a knife and cuts it in half.) All right, pick a half."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "(examining the cake) Okay well, this side looks bigger. Uh Theres more crust on this side. Yknow? So, maybe if I measured"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Oh for God sake just pick a piece!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "All right, Ill pick that one. (Points.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Thats also the smaller piece. (Puts the piece onto a plate.) Okay, there you go. Enjoy your half my friend, but that is it. No sharing. No switching, and dont come crying to me if you eat your piece to fast. (As shes saying that she is backing out the door, when she finishes she turns around to return to her place, stumbles and drops the cheesecake on the floor.) Oh!!!!"}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "(gloatingly and holding his piece) Ohhh!"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Okay, you gotta give me some of your piece."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Oh-ho-ho-ho-no! No! No switching! No sharing, and dont come crying to me! Ha-ha-ha! I may just sit here and have my cake all day! Just sit here in the hallway and eat my (Rachel knocks the plate from his hand and it falls on the floor. That process leaves just the forkful Chandler has, Rachel starts to go after that little bit and Chandler retreats into his apartment.) "}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 14, "scene_id": "S07E11_014", "location": "Cousin Frannies Wedding Reception", "scene_description": "Monica and Ross are sitting at the table, alone as a woman approaches.", "characters": ["Aunt Millie", "Frannie", "Monica", "Ross", "The Woman"], "firestore_path": "/episodes/S07E11/scenes/S07E11_014", "raw_text": "[Scene: Cousin Frannies Wedding Reception, Monica and Ross are sitting at the table, alone as a woman approaches.]\nThe Woman: Ross, sweetheart!\nRoss: Oh, hey Aunt Millie.\nAunt Millie: Isnt it a beautiful wedding?!\nRoss: Yes, yes it is. Its uh (Aunt Millie uses this opportunity to grab Ross and kiss him on the lips. After she leaves Ross quickly wipes his mouth with a napkin.) Every time on the lips! Why?! Why on lips?!\n(Cousin Frannie and her husband enter.)\nMonica: Heres Frannie. Hmm, wont she be happy to see me? (Starts to get up and great Frannie.)\nRoss: Now wait a minute, you be nice! All right? I didnt bring you here so you can ambush her.\nMonica: Frannie was the one who found your Playboys and showed them to mom.\nRoss: That bitch! (He gets up and they go over to ambush Frannie. Monica taps on Frannies shoulder.)\nFrannie: (turning around) Monica! What\nMonica: Am I doing here? Why? Surprised to see me? Ross brought me. How do you like that?!\nRoss: (to Frannie) Hi Frannie, congratulations.\nMonica: You invite my brother, you invite my whole family, and not me?! Why?! WhatWhy wouldnt you want me at your wedding? What could I have possibly done?! (Frannies husband walks up.) Stuart!\nFrannie: I believe you know my husband.\n(Monica is shocked into silence.)\nRoss: So its really a question of who could you have possibly done.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Cousin Frannies Wedding Reception, Monica and Ross are sitting at the table, alone as a woman approaches.]"}, {"line_number": 2, "type": "dialogue", "speaker": "The Woman", "text": "Ross, sweetheart!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Oh, hey Aunt Millie."}, {"line_number": 4, "type": "dialogue", "speaker": "Aunt Millie", "text": "Isnt it a beautiful wedding?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Yes, yes it is. Its uh (Aunt Millie uses this opportunity to grab Ross and kiss him on the lips. After she leaves Ross quickly wipes his mouth with a napkin.) Every time on the lips! Why?! Why on lips?!"}, {"line_number": 6, "type": "action", "text": "(Cousin Frannie and her husband enter.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Heres Frannie. Hmm, wont she be happy to see me? (Starts to get up and great Frannie.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Now wait a minute, you be nice! All right? I didnt bring you here so you can ambush her."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Frannie was the one who found your Playboys and showed them to mom."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "That bitch! (He gets up and they go over to ambush Frannie. Monica taps on Frannies shoulder.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Frannie", "text": "(turning around) Monica! What"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Am I doing here? Why? Surprised to see me? Ross brought me. How do you like that?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "(to Frannie) Hi Frannie, congratulations."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "You invite my brother, you invite my whole family, and not me?! Why?! WhatWhy wouldnt you want me at your wedding? What could I have possibly done?! (Frannies husband walks up.) Stuart!"}, {"line_number": 15, "type": "dialogue", "speaker": "Frannie", "text": "I believe you know my husband."}, {"line_number": 16, "type": "action", "text": "(Monica is shocked into silence.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "So its really a question of who could you have possibly done."}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 15, "scene_id": "S07E11_015", "location": "Outside Central Perk", "scene_description": "David has a cab waiting to take him to the airport and hes saying goodbye to Phoebe.", "characters": ["David", "Joey", "Phoebe"], "firestore_path": "/episodes/S07E11/scenes/S07E11_015", "raw_text": "[Scene: Outside Central Perk, David has a cab waiting to take him to the airport and hes saying goodbye to Phoebe.]\nDavid: Oh, I hate this but I-I-I have to go. I-I cant miss my flight.\nPhoebe: Are you sure? Ill bet theres another flight to Minsk in like\nDavid: July. Umm, (He speaks Russian.) \nPhoebe: Thats really beautiful. What does it mean?\nDavid: Please, clean my beakers. I dont get out of the lab much.\nPhoebe: Thats good. I got to admit, I thought it was something else.\nDavid: Yeah, I Well I really actually wanted to say umm, that, but um, I figured I probably shouldnt because yknow, Ihave to leave.\nPhoebe: Youre right! Youre right. Dont say it. \nDavid: I-I do though.\nPhoebe: I do too. (They kiss.)\nDavid: Bye Phoebe. (He gets in and the cab drives off. Joey walks up and witnesses that event.)\nPhoebe: (seeing him) Okay, nows not the time Joey. All right? You can yell at me tomorrow.\nJoey: No! No! No Pheebs, Im not gonna yell at you. I just yknow, started thinking about you and David and Iremember how bummed you were the first time he left. And I just Oh Pheebs, come here. (He hugs her.) Are you okay?\nPhoebe: No Im not okay. The only guy Ive ever been crazy about has gone to Minsk and I may neverI may never see him again. (Crying.)\nJoey: Hey, yknow you could always visit him.\nPhoebe: Oh right, like theyre gonna let me have a passport.\nJoey: Anything I can do? Whatever you need.\nPhoebe: WellButNow, if-if you can achieve positronic distillation of sub-atomic particles yknow before he does, then he can come back. (They hug again.)\nJoey: I can give it a shot.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Outside Central Perk, David has a cab waiting to take him to the airport and hes saying goodbye to Phoebe.]"}, {"line_number": 2, "type": "dialogue", "speaker": "David", "text": "Oh, I hate this but I-I-I have to go. I-I cant miss my flight."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Are you sure? Ill bet theres another flight to Minsk in like"}, {"line_number": 4, "type": "dialogue", "speaker": "David", "text": "July. Umm, (He speaks Russian.) "}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Thats really beautiful. What does it mean?"}, {"line_number": 6, "type": "dialogue", "speaker": "David", "text": "Please, clean my beakers. I dont get out of the lab much."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Thats good. I got to admit, I thought it was something else."}, {"line_number": 8, "type": "dialogue", "speaker": "David", "text": "Yeah, I Well I really actually wanted to say umm, that, but um, I figured I probably shouldnt because yknow, Ihave to leave."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Youre right! Youre right. Dont say it. "}, {"line_number": 10, "type": "dialogue", "speaker": "David", "text": "I-I do though."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "I do too. (They kiss.)"}, {"line_number": 12, "type": "dialogue", "speaker": "David", "text": "Bye Phoebe. (He gets in and the cab drives off. Joey walks up and witnesses that event.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "(seeing him) Okay, nows not the time Joey. All right? You can yell at me tomorrow."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "No! No! No Pheebs, Im not gonna yell at you. I just yknow, started thinking about you and David and Iremember how bummed you were the first time he left. And I just Oh Pheebs, come here. (He hugs her.) Are you okay?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "No Im not okay. The only guy Ive ever been crazy about has gone to Minsk and I may neverI may never see him again. (Crying.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Hey, yknow you could always visit him."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Oh right, like theyre gonna let me have a passport."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Anything I can do? Whatever you need."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "WellButNow, if-if you can achieve positronic distillation of sub-atomic particles yknow before he does, then he can come back. (They hug again.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "I can give it a shot."}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 16, "scene_id": "S07E11_016", "location": "The Hallway", "scene_description": "Chandler and Rachel are on their knees with forks trying to salvage what they can of the cheesecake off of the floor.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S07E11/scenes/S07E11_016", "raw_text": "[Scene: The Hallway, Chandler and Rachel are on their knees with forks trying to salvage what they can of the cheesecake off of the floor.]\nRachel: Oh! Yay! Look! Theres a piece that doesnt have floor on it!\nChandler: Stick to your side!\nRachel: Hey, come on now!\n(Joey finishes climbing the stairs and sees them. Chandler and Rachel both stop and look up at him. Joey sits down on the step.)\nJoey: (pulls out a fork) All right, what are we havin? (Starts digging in.)\nEnding Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Hallway, Chandler and Rachel are on their knees with forks trying to salvage what they can of the cheesecake off of the floor.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Oh! Yay! Look! Theres a piece that doesnt have floor on it!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Stick to your side!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Hey, come on now!"}, {"line_number": 5, "type": "action", "text": "(Joey finishes climbing the stairs and sees them. Chandler and Rachel both stop and look up at him. Joey sits down on the step.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(pulls out a fork) All right, what are we havin? (Starts digging in.)"}, {"line_number": 7, "type": "narration", "text": "Ending Credits"}]}
{"episode_id": "S07E11", "season": 7, "episode_number": 11, "episode_title": "THE ONE WITH ALL THE CHEESECAKE", "scene_number": 17, "scene_id": "S07E11_017", "location": "Cousin Frannies Wedding Reception", "scene_description": "Ross and Monica are at the door and about to leave.", "characters": ["Aunt Millie", "Monica", "Ross"], "firestore_path": "/episodes/S07E11/scenes/S07E11_017", "raw_text": "[Scene: Cousin Frannies Wedding Reception, Ross and Monica are at the door and about to leave.]\nMonica: Oh wait I forgot my wrap.\nRoss: What? Oh, okay. Wait here. (Goes to get it, but before he gets there Aunt Millie sits down on it forcing him to pull it out from behind her which gets her attention.)\nAunt Millie: Hi sweetie! Are you leaving?\nRoss: Well\nAunt Millie: Give us a kiss. Come on! Come on! \n(Ross hesitates then leans down trying to get her to kiss his cheek, but she moves his head around and kisses him on the lips again.)\nRoss: Why?! Why on the lips?! (He wipes his mouth on Monicas wrap and walks off, leaving Aunt Millie stunned.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Cousin Frannies Wedding Reception, Ross and Monica are at the door and about to leave.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Oh wait I forgot my wrap."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "What? Oh, okay. Wait here. (Goes to get it, but before he gets there Aunt Millie sits down on it forcing him to pull it out from behind her which gets her attention.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Aunt Millie", "text": "Hi sweetie! Are you leaving?"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Well"}, {"line_number": 6, "type": "dialogue", "speaker": "Aunt Millie", "text": "Give us a kiss. Come on! Come on! "}, {"line_number": 7, "type": "action", "text": "(Ross hesitates then leans down trying to get her to kiss his cheek, but she moves his head around and kisses him on the lips again.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Why?! Why on the lips?! (He wipes his mouth on Monicas wrap and walks off, leaving Aunt Millie stunned.)"}, {"line_number": 9, "type": "narration", "text": "End"}]}
