{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 1, "scene_id": "S07E14_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S07E14/scenes/S07E14_001", "raw_text": "THE ONE WHERE THEY ALL TURN THIRTY\nTeleplay by: Sherry Bilsing & Ellen Plummer Story by: Vanessa McCarthy  Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WHERE THEY ALL TURN THIRTY"}, {"line_number": 2, "type": "dialogue", "speaker": "Teleplay by", "text": "Sherry Bilsing & Ellen Plummer Story by: Vanessa McCarthy  Transcribed by: Eric Aasen"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 2, "scene_id": "S07E14_002", "location": "Joey and Rachel's", "scene_description": "Joey is knocking on Rachels door, whose door frame is decorated with balloons. The rest of the gang is there as well. Rachel opens the door and the gang blow on noisemakers.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Tag"], "firestore_path": "/episodes/S07E14/scenes/S07E14_002", "raw_text": "[Scene: Joey and Rachel's, Joey is knocking on Rachels door, whose door frame is decorated with balloons. The rest of the gang is there as well. Rachel opens the door and the gang blow on noisemakers.]\nRoss: Happy birthday!!!\nMonica: Happy birthday!!!\n(Rachel glares at them and goes back into her room, closing her door.)\nAll: Rach! Come on! Rach!\nMonica: Its your birthday!\nTag: (entering from her room) Hey.\nChandler: (To Monica) Shes not as pretty as she was when she was 29.\nTag: Ms. Green would like to establish some ground rules before she comes out. She would appreciate it if you dont use the words old or downhill or (To Joey) they still look pretty damn good. (Joey smiles and everyone glares at him.)\nJoey: They do!\nPhoebe: Rachel! Come on out! Monica made breakfast!\nMonica: Chocolate-chip pancakes!\n(There is no response from Rachel.)\nRoss: Weve got presents!\n(She opens the door.)\nRachel: Good ones?\nMonica: They all came from the list you handed out to us two weeks ago.\nRachel: Well, can I keep the presents and still be 29?\nJoey: Come on Rach! Look, turning thirty is not that big a deal.\nRoss: Oh really. Is that how you felt when you turned thirty?\n[Flashback to Joeys thirtieth birthday party. It is being held in Monica and Chandlers apartment.]\nJoey: (screaming) Why God?!! Why?!! We had a deal!! Let the others grow old! Not me!! (He buries his head in Phoebes lap for comfort.)\n[Cut back to Rachels party, everyone is now eating breakfast, except Rachel.]\nRachel: Yknow, Im still 29 in Guam.\nRoss: Hey, 30 is not that old! Do you know how old the Earth is?\nRachel: Late thirties? Oh come on you guys! Is it just me? Am I overreacting to this?\nChandler: No Rach, its not just you. My thirtieth birthday certainly wasnt that much fun.\n[Flashback to Chandlers thirtieth birthday party. It is also being held in Monica and his apartment. He is about to blow out the candles on his birthday cake.]\nJoey: (screaming) And now Chandler! Were all gettin so old! (Looking up) Why are you doing this to us?! (Turns away crying.)\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Joey is knocking on Rachels door, whose door frame is decorated with balloons. The rest of the gang is there as well. Rachel opens the door and the gang blow on noisemakers.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Happy birthday!!!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Happy birthday!!!"}, {"line_number": 4, "type": "action", "text": "(Rachel glares at them and goes back into her room, closing her door.)"}, {"line_number": 5, "type": "dialogue", "speaker": "All", "text": "Rach! Come on! Rach!"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Its your birthday!"}, {"line_number": 7, "type": "dialogue", "speaker": "Tag", "text": "(entering from her room) Hey."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "(To Monica) Shes not as pretty as she was when she was 29."}, {"line_number": 9, "type": "dialogue", "speaker": "Tag", "text": "Ms. Green would like to establish some ground rules before she comes out. She would appreciate it if you dont use the words old or downhill or (To Joey) they still look pretty damn good. (Joey smiles and everyone glares at him.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "They do!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Rachel! Come on out! Monica made breakfast!"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Chocolate-chip pancakes!"}, {"line_number": 13, "type": "action", "text": "(There is no response from Rachel.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Weve got presents!"}, {"line_number": 15, "type": "action", "text": "(She opens the door.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Good ones?"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "They all came from the list you handed out to us two weeks ago."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Well, can I keep the presents and still be 29?"}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "Come on Rach! Look, turning thirty is not that big a deal."}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Oh really. Is that how you felt when you turned thirty?"}, {"line_number": 21, "type": "narration", "text": "[Flashback to Joeys thirtieth birthday party. It is being held in Monica and Chandlers apartment.]"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "(screaming) Why God?!! Why?!! We had a deal!! Let the others grow old! Not me!! (He buries his head in Phoebes lap for comfort.)"}, {"line_number": 23, "type": "narration", "text": "[Cut back to Rachels party, everyone is now eating breakfast, except Rachel.]"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Yknow, Im still 29 in Guam."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Hey, 30 is not that old! Do you know how old the Earth is?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Late thirties? Oh come on you guys! Is it just me? Am I overreacting to this?"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "No Rach, its not just you. My thirtieth birthday certainly wasnt that much fun."}, {"line_number": 28, "type": "narration", "text": "[Flashback to Chandlers thirtieth birthday party. It is also being held in Monica and his apartment. He is about to blow out the candles on his birthday cake.]"}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "(screaming) And now Chandler! Were all gettin so old! (Looking up) Why are you doing this to us?! (Turns away crying.)"}, {"line_number": 30, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 3, "scene_id": "S07E14_003", "location": "Joey and Rachel's", "scene_description": "breakfast is finished but Rachels still down.", "characters": ["All", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E14/scenes/S07E14_003", "raw_text": "[Scene: Joey and Rachel's, breakfast is finished but Rachels still down.]\nMonica: Rach, youre in a great place in your life. Come on, youve got a great job! Good friends\nJoey: Yeah, youre roommate is a soap opera star.\nRachel: Look, yknow I know my lifes going pretty well, but I look around and I just see so many people whove accomplished so many other goals by the time theyre thirty.\nPhoebe: Yeah, but you shouldnt compare yourself to me.\n[Flashback to: The Street in front of Central Perk, Ross and Joey are holding a yellow tape across the road and everyone is cheering Phoebe as she bounces around the corner on a hippity-hop.]\nAll: Come on Phoebe! You can do it Phoebe! Come on!\nRachel: There you go!\n(She crosses the line and they all cheer again.)\nPhoebe: I did it! One mile on a hippity-hop! Thats it!! Thats everything I wanted to do before I was thirty. Oh, except I wanted to patch things up with my sister. But oh well. Yay!! (They all cheer again.) And-and girls this thing is a Godsend if you know what I mean. (Rachel and Monica look intrigued and as they all head into Central Perk, Rachel picks up the hippity-hop that Phoebe left behind.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, breakfast is finished but Rachels still down.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Rach, youre in a great place in your life. Come on, youve got a great job! Good friends"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Yeah, youre roommate is a soap opera star."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Look, yknow I know my lifes going pretty well, but I look around and I just see so many people whove accomplished so many other goals by the time theyre thirty."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, but you shouldnt compare yourself to me."}, {"line_number": 6, "type": "narration", "text": "[Flashback to: The Street in front of Central Perk, Ross and Joey are holding a yellow tape across the road and everyone is cheering Phoebe as she bounces around the corner on a hippity-hop.]"}, {"line_number": 7, "type": "dialogue", "speaker": "All", "text": "Come on Phoebe! You can do it Phoebe! Come on!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "There you go!"}, {"line_number": 9, "type": "action", "text": "(She crosses the line and they all cheer again.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "I did it! One mile on a hippity-hop! Thats it!! Thats everything I wanted to do before I was thirty. Oh, except I wanted to patch things up with my sister. But oh well. Yay!! (They all cheer again.) And-and girls this thing is a Godsend if you know what I mean. (Rachel and Monica look intrigued and as they all head into Central Perk, Rachel picks up the hippity-hop that Phoebe left behind.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 4, "scene_id": "S07E14_004", "location": "Joey and Rachel's", "scene_description": "continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Tag"], "firestore_path": "/episodes/S07E14/scenes/S07E14_004", "raw_text": "[Scene: Joey and Rachel's, continued from earlier.]\nRachel: Thirty. Ugh, I mean thirty! Monica, do you remember mean, old Mrs. Kreeger in the fifth grade? She was thirty!\nTag: Come on, lets have some fun. Huh? (To Rachel) What do you want to do today?\nRachel: Nothing. I dont want to do anything.\nMonica: Well, doing nothing on your thirtieth is better than doing something stupid, like Ross.\nRoss: Hey! That was a practical purchase! I needed that car for transportation! Okay? I-I have a child!\n[Flashback to: A street, Ross is sitting in his newly purchased MGB. Which is one of the better British sports cars ever made. Of course, better is a relative term. Which reminds me of a joke. Why dont the British make computers? Because they couldnt figure out how to make them leak oil. Anyway, the gang is all staring at his new purchase.]\nRoss: How hot do I look in this, huh?!\nChandler: Ross, a sports car? Wouldnt it have been cheaper to just stuff a sock down there?\nRoss: Thats not what this is about okay? I-I am a sports car enthusiast. I have always been into cars.\nJoey: Hey, whats the horsepower on this thing?\nRoss: (giddy) I dont know, but-but look how shiny!\nMonica: I cant believe you bought this.\nRachel: Really! God Ross, what were you thinking? (To Phoebe, quietly) I know its really shallow, but a part of me wants him again.\nPhoebe: Oh, well get in line missy. (To Ross) So, can I have a ride stud?\nRoss: Hop in. (Phoebe hops in.) Get ready for the smoothest ride of your life. \n(He starts the car and surprisingly in fires right up and comes to a nice idle. (Both can be rarities with British sports cars with their lovely Lucas ignition systems, which tend not to work especially in the rain.) Anyway, this being New York he is parallel parked on a street with the car in front of him only inches ahead of his bumper, likewise with the car behind him. Hes completely boxed in and cant move more than two inches. He tries to get out several times by bumping the bumpers of both cars to no avail.)\nRoss: Damnit! (Shuts the car off.)\nPhoebe: (getting out) Okay, whos next?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, continued from earlier.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Thirty. Ugh, I mean thirty! Monica, do you remember mean, old Mrs. Kreeger in the fifth grade? She was thirty!"}, {"line_number": 3, "type": "dialogue", "speaker": "Tag", "text": "Come on, lets have some fun. Huh? (To Rachel) What do you want to do today?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Nothing. I dont want to do anything."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Well, doing nothing on your thirtieth is better than doing something stupid, like Ross."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Hey! That was a practical purchase! I needed that car for transportation! Okay? I-I have a child!"}, {"line_number": 7, "type": "narration", "text": "[Flashback to: A street, Ross is sitting in his newly purchased MGB. Which is one of the better British sports cars ever made. Of course, better is a relative term. Which reminds me of a joke. Why dont the British make computers? Because they couldnt figure out how to make them leak oil. Anyway, the gang is all staring at his new purchase.]"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "How hot do I look in this, huh?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Ross, a sports car? Wouldnt it have been cheaper to just stuff a sock down there?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Thats not what this is about okay? I-I am a sports car enthusiast. I have always been into cars."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Hey, whats the horsepower on this thing?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "(giddy) I dont know, but-but look how shiny!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "I cant believe you bought this."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Really! God Ross, what were you thinking? (To Phoebe, quietly) I know its really shallow, but a part of me wants him again."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, well get in line missy. (To Ross) So, can I have a ride stud?"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Hop in. (Phoebe hops in.) Get ready for the smoothest ride of your life. "}, {"line_number": 17, "type": "action", "text": "(He starts the car and surprisingly in fires right up and comes to a nice idle. (Both can be rarities with British sports cars with their lovely Lucas ignition systems, which tend not to work especially in the rain.) Anyway, this being New York he is parallel parked on a street with the car in front of him only inches ahead of his bumper, likewise with the car behind him. Hes completely boxed in and cant move more than two inches. He tries to get out several times by bumping the bumpers of both cars to no avail.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Damnit! (Shuts the car off.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "(getting out) Okay, whos next?"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 5, "scene_id": "S07E14_005", "location": "Joey and Rachel's", "scene_description": "Phoebe is pouring Rachel some coffee.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Tag"], "firestore_path": "/episodes/S07E14/scenes/S07E14_005", "raw_text": "[Scene: Joey and Rachel's, Phoebe is pouring Rachel some coffee.]\nRachel: Yknow what? I am going to do something today. Im not just gonna sit around like some old lady. Im gonna get something pierced. Like my uh, like my nose or my tongue or something.\nPhoebe: Really?! Cause yknow that hurts.\nRachel: So what?! Yknow what? The way I see it(Phoebe pulls out a hair from the back of her head)Ow! Son of a bitch!!\nTag: Look Rachel, I know what youre going through. Im totally freaked about turning 25.\nRachel: (glares at him) Get out, get out of my apartment. \nMonica: All right Rach, for what its worth, I think that youre doing great. I mean yknow lets face it, no one handles this well.\nPhoebe: Least of all you.\nTag: Why? What youd do?\nMonica: Werent you asked to leave sonny?\n[Flashback to Monica and Chandlers apartment. Chandler has a bunch of people over in formal wear to give Monica a surprise birthday party. Joey is coming out of the bathroom and removing his tie.]\nChandler: (To Joey) Would you put that back on?! Monicas gonna be here any minute!\nJoey: But it hurts my Joeys Apple.\nChandler: (frustrated) Okay, for the last time. Its not named for each individual man.\n(Joey walks away and Mr. and Mrs. Geller walk up. Mr. Geller is wearing this ancient velvet tuxedo.)\nMrs. Geller: (To Chandler) Youve done a wonderful job with this party Chandler. Everything looks so lovely.\nChandler: Oh well, not as lovely as you. I mean, I cant believe that you would have a thirty-year-old daughter! (To Mr. Geller) And you! I cant believe that you would have a tux thats thirty years old! (Puts his hand on Mr. Gellers shoulder.)\nMr. Geller: Its older than that. Ross was actually conceived right near this tuxedo.\nChandler: Ohh! (He quickly removes his hand and looks at it.)\nRachel: (entering) Hey! Everybody hide! Hide! I saw her! Shes coming!\nChandler: Okay! Okay! Everybody down! Everybody down! (Rachel turns off the lights and everyone crouches. As everyone crouches, a ripping noise erupts from the assemblage.)\nMr. Geller: Crap.\n(We hear some fumbling at the door, then silence.)\nChandler: (getting up to investigate) Okay, everybody stay here. I will find out whats going on.\n(He goes out into the hall and finds a very drunk Monica lying up against Joey and Rachels door.)\nMonica: Heyyy!! You got the door open!! (Giggles.)\nChandler: Hey-hey are you drunk?\nMonica: Nooo! (Giggles) Okay. (She tries to pull herself up by Rachel and Joeys doorknob, but the door opens and she almost falls into the their apartment. She manages to catch herself.) Whoa! (Stands up, unsteadily) Okay. See I was, I was a little nervous about turning (whispering) thirty. (Giggles.) So the bus boys took me out for some drinks. (Pause) I wanna puke on you later!\nChandler: Okay, here is the thing. We have thrown a very formal surprise party for you in there! All of your friends are in there and your parents!\nMonica: Noo!!!\nChandler: Yes!\nMonica: Noo!!\nChandler: Yes!!\nMonica: Oh no! My parents have never seen me drunk! (Pause) That they know of.\nChandler: Okay, heres the thing. Were gonna get you some coffee and they will never know that youre drunk.\nMonica: Really?! You promise?\nChandler: Yeah, Ill take care of it.\nMonica: Okay. I love you so much. (Kisses him.)\nChandler: (laughing) Okay we have to do something about your breath.\nMonica: What about your breath?! (Breathes on him.)\nChandler: Thats still yours. Okay, now remember its a surprise party. So, when you go in, act surprised.\nMonica: Okay. I can do that.\nChandler: Okay.\n(Chandler opens the door and Monica sneaks up on it. They go inside.)\nAll: Surprise!!!\n(Monica screams and they all stare at her.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Phoebe is pouring Rachel some coffee.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Yknow what? I am going to do something today. Im not just gonna sit around like some old lady. Im gonna get something pierced. Like my uh, like my nose or my tongue or something."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Really?! Cause yknow that hurts."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "So what?! Yknow what? The way I see it(Phoebe pulls out a hair from the back of her head)Ow! Son of a bitch!!"}, {"line_number": 5, "type": "dialogue", "speaker": "Tag", "text": "Look Rachel, I know what youre going through. Im totally freaked about turning 25."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "(glares at him) Get out, get out of my apartment. "}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "All right Rach, for what its worth, I think that youre doing great. I mean yknow lets face it, no one handles this well."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Least of all you."}, {"line_number": 9, "type": "dialogue", "speaker": "Tag", "text": "Why? What youd do?"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Werent you asked to leave sonny?"}, {"line_number": 11, "type": "narration", "text": "[Flashback to Monica and Chandlers apartment. Chandler has a bunch of people over in formal wear to give Monica a surprise birthday party. Joey is coming out of the bathroom and removing his tie.]"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "(To Joey) Would you put that back on?! Monicas gonna be here any minute!"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "But it hurts my Joeys Apple."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "(frustrated) Okay, for the last time. Its not named for each individual man."}, {"line_number": 15, "type": "action", "text": "(Joey walks away and Mr. and Mrs. Geller walk up. Mr. Geller is wearing this ancient velvet tuxedo.)"}, {"line_number": 16, "type": "narration", "text": "Mrs. Geller: (To Chandler) Youve done a wonderful job with this party Chandler. Everything looks so lovely."}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Oh well, not as lovely as you. I mean, I cant believe that you would have a thirty-year-old daughter! (To Mr. Geller) And you! I cant believe that you would have a tux thats thirty years old! (Puts his hand on Mr. Gellers shoulder.)"}, {"line_number": 18, "type": "narration", "text": "Mr. Geller: Its older than that. Ross was actually conceived right near this tuxedo."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Ohh! (He quickly removes his hand and looks at it.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "(entering) Hey! Everybody hide! Hide! I saw her! Shes coming!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Okay! Okay! Everybody down! Everybody down! (Rachel turns off the lights and everyone crouches. As everyone crouches, a ripping noise erupts from the assemblage.)"}, {"line_number": 22, "type": "narration", "text": "Mr. Geller: Crap."}, {"line_number": 23, "type": "action", "text": "(We hear some fumbling at the door, then silence.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Chandler", "text": "(getting up to investigate) Okay, everybody stay here. I will find out whats going on."}, {"line_number": 25, "type": "action", "text": "(He goes out into the hall and finds a very drunk Monica lying up against Joey and Rachels door.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "Heyyy!! You got the door open!! (Giggles.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "Hey-hey are you drunk?"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Nooo! (Giggles) Okay. (She tries to pull herself up by Rachel and Joeys doorknob, but the door opens and she almost falls into the their apartment. She manages to catch herself.) Whoa! (Stands up, unsteadily) Okay. See I was, I was a little nervous about turning (whispering) thirty. (Giggles.) So the bus boys took me out for some drinks. (Pause) I wanna puke on you later!"}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "Okay, here is the thing. We have thrown a very formal surprise party for you in there! All of your friends are in there and your parents!"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica", "text": "Noo!!!"}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "Yes!"}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "Noo!!"}, {"line_number": 33, "type": "dialogue", "speaker": "Chandler", "text": "Yes!!"}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "Oh no! My parents have never seen me drunk! (Pause) That they know of."}, {"line_number": 35, "type": "dialogue", "speaker": "Chandler", "text": "Okay, heres the thing. Were gonna get you some coffee and they will never know that youre drunk."}, {"line_number": 36, "type": "dialogue", "speaker": "Monica", "text": "Really?! You promise?"}, {"line_number": 37, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, Ill take care of it."}, {"line_number": 38, "type": "dialogue", "speaker": "Monica", "text": "Okay. I love you so much. (Kisses him.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Chandler", "text": "(laughing) Okay we have to do something about your breath."}, {"line_number": 40, "type": "dialogue", "speaker": "Monica", "text": "What about your breath?! (Breathes on him.)"}, {"line_number": 41, "type": "dialogue", "speaker": "Chandler", "text": "Thats still yours. Okay, now remember its a surprise party. So, when you go in, act surprised."}, {"line_number": 42, "type": "dialogue", "speaker": "Monica", "text": "Okay. I can do that."}, {"line_number": 43, "type": "dialogue", "speaker": "Chandler", "text": "Okay."}, {"line_number": 44, "type": "action", "text": "(Chandler opens the door and Monica sneaks up on it. They go inside.)"}, {"line_number": 45, "type": "dialogue", "speaker": "All", "text": "Surprise!!!"}, {"line_number": 46, "type": "action", "text": "(Monica screams and they all stare at her.)"}, {"line_number": 47, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 6, "scene_id": "S07E14_006", "location": "Rosss birthday", "scene_description": "Joey is now trying to get his car out while Ross is directing him.", "characters": ["Joey", "Monica", "Phoebe", "Ross", "Woman"], "firestore_path": "/episodes/S07E14/scenes/S07E14_006", "raw_text": "[Scene: Rosss birthday, Joey is now trying to get his car out while Ross is directing him.]\nRoss: Okay, forward. ForwardStop! (The car moves an inch and Ross runs to the back of the car.) Okay, backStop! (The car barely moves and Ross runs back to the front.) Okay, forwardStop! Stop! Stop!\nMonica: Ross, just forget about it. This guys got you totally wedged in.\n(A beautiful woman approaches.)\nWoman: (To Joey) Is this yours?\nJoey: Well actually\nRoss: No-no-no! Its mine! Its-its mine. (The woman walks away.)\nJoey: Dude, you soooo need this car.\nPhoebe: (running up) Okay. Okay, heres what were gonna do. Okay, Im gonna break into this mini-van and put it in neutral. You guys push it forward so Ross can drive out of his spot. Okay? All right, here we go. (She opens her coat and reveals that thing car thieves use to break into cars as Ross jumps in behind the wheel. She inserts the device, unlocks the door, opens it, and the alarm goes off.) Haul ass!!!! (Runs off.)\n(The rest of the gang runs away, except for Ross whos tramped inside his car. To hide he puts the top up as Monica, Rachel, and Joey come running past.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rosss birthday, Joey is now trying to get his car out while Ross is directing him.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Okay, forward. ForwardStop! (The car moves an inch and Ross runs to the back of the car.) Okay, backStop! (The car barely moves and Ross runs back to the front.) Okay, forwardStop! Stop! Stop!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Ross, just forget about it. This guys got you totally wedged in."}, {"line_number": 4, "type": "action", "text": "(A beautiful woman approaches.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Woman", "text": "(To Joey) Is this yours?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Well actually"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "No-no-no! Its mine! Its-its mine. (The woman walks away.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Dude, you soooo need this car."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "(running up) Okay. Okay, heres what were gonna do. Okay, Im gonna break into this mini-van and put it in neutral. You guys push it forward so Ross can drive out of his spot. Okay? All right, here we go. (She opens her coat and reveals that thing car thieves use to break into cars as Ross jumps in behind the wheel. She inserts the device, unlocks the door, opens it, and the alarm goes off.) Haul ass!!!! (Runs off.)"}, {"line_number": 10, "type": "action", "text": "(The rest of the gang runs away, except for Ross whos tramped inside his car. To hide he puts the top up as Monica, Rachel, and Joey come running past.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 7, "scene_id": "S07E14_007", "location": "Phoebes birthday", "scene_description": "shes taking the hippity-hop to Ursulas apartment as a gift. She knocks on the door and Ursula answers it.", "characters": ["Phoebe", "Ursula"], "firestore_path": "/episodes/S07E14/scenes/S07E14_007", "raw_text": "[Scene: Phoebes birthday, shes taking the hippity-hop to Ursulas apartment as a gift. She knocks on the door and Ursula answers it.]\nPhoebe: Happy thirtieth birthday! Here! (Hands her the hippity-hop.) Its for the child in you, and the woman. Happy thirtieth!\nUrsula: Right, why do you keep saying that?\nPhoebe: Because its our thirtieth birthday.\nUrsula: Yeah, no were not thirty. Were 31. Okay. (She closes the door.)\nPhoebe: Wait! (Knocks on the door and Ursula opens it.)\nUrsula: Oh, its you.\nPhoebe: Yeah. What?!\nUrsula: Yeah, were not thirty, were 31.\nPhoebe: Nu-uh!\nUrsula: Yea-huh! Thats what is says on my birth certificate.\nPhoebe: You have your birth certificate?\nUrsula: Yeah, I got a big box of family stuff when my mom died.\nPhoebe: Our mom.\nUrsula: (sarcastic) Right! Okay. (Hands Phoebe her births certificate.)\nPhoebe: Do you have my birth certificate?\nUrsula: No, I sold it to a Swedish runaway.\nPhoebe: (reading the certificate) Oh my God! Oh my God, we are 31.\nUrsula: Yeah.\nPhoebe: I just lost a whole year of my life.\nUrsula: (sarcastic) Okay.\nPhoebe: Your middle name is Pamela?\nUrsula: Yes.\nPhoebe: Well, I never knew mine. Do you remember what it is?\nUrsula: Yes! Phoebe.\nPhoebe: Thats my first name.\nUrsula: Right, okay, then no.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebes birthday, shes taking the hippity-hop to Ursulas apartment as a gift. She knocks on the door and Ursula answers it.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Happy thirtieth birthday! Here! (Hands her the hippity-hop.) Its for the child in you, and the woman. Happy thirtieth!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ursula", "text": "Right, why do you keep saying that?"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Because its our thirtieth birthday."}, {"line_number": 5, "type": "dialogue", "speaker": "Ursula", "text": "Yeah, no were not thirty. Were 31. Okay. (She closes the door.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Wait! (Knocks on the door and Ursula opens it.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Ursula", "text": "Oh, its you."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah. What?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ursula", "text": "Yeah, were not thirty, were 31."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Nu-uh!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ursula", "text": "Yea-huh! Thats what is says on my birth certificate."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "You have your birth certificate?"}, {"line_number": 13, "type": "dialogue", "speaker": "Ursula", "text": "Yeah, I got a big box of family stuff when my mom died."}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Our mom."}, {"line_number": 15, "type": "dialogue", "speaker": "Ursula", "text": "(sarcastic) Right! Okay. (Hands Phoebe her births certificate.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Do you have my birth certificate?"}, {"line_number": 17, "type": "dialogue", "speaker": "Ursula", "text": "No, I sold it to a Swedish runaway."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "(reading the certificate) Oh my God! Oh my God, we are 31."}, {"line_number": 19, "type": "dialogue", "speaker": "Ursula", "text": "Yeah."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "I just lost a whole year of my life."}, {"line_number": 21, "type": "dialogue", "speaker": "Ursula", "text": "(sarcastic) Okay."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Your middle name is Pamela?"}, {"line_number": 23, "type": "dialogue", "speaker": "Ursula", "text": "Yes."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Well, I never knew mine. Do you remember what it is?"}, {"line_number": 25, "type": "dialogue", "speaker": "Ursula", "text": "Yes! Phoebe."}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Thats my first name."}, {"line_number": 27, "type": "dialogue", "speaker": "Ursula", "text": "Right, okay, then no."}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 8, "scene_id": "S07E14_008", "location": "Monicas birthday", "scene_description": "its just after the surprise.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E14/scenes/S07E14_008", "raw_text": "[Scene: Monicas birthday, its just after the surprise.]\nChandler: Okay before we start the celebration, Monica has to go put on her party dress.\nMonica: Yay!\nChandler: See? (Does his laugh.) Here we go. (Starts walking her to their room, and has to pass in front of Mr. Geller whos sitting at the table and Mrs. Geller whos standing next to him.)\nMr. Geller: Happy birthday, sweetie! Give us a hug! (Starts to get up.)\nMrs. Geller: (stopping him) Dont get up Jack! The safety pins are about to blow.\n(They continue their trek.)\nMonica: (sees someone) Paul!\nChandler: (correcting her) Phil.\nMonica: Phil!\nChandler: Now, there is a dress laid out on your bed. (Monica stumbles on the steps.) Okay, (catches her) youre doing great. Youre doing great. Youre doing fine.\n(Phoebe approaches as they almost get to their room.)\nPhoebe: Hey, whats going on?\nChandler: Monicas a little drunk.\nPhoebe: Yay! I love drunk Monica!\nMonica: Awwwww (Giggles.)\nChandler: (To Monica) Go change! (To Phoebe) She doesnt want her parents to know shes drunk.\nPhoebe: Ohh! All right! All right. Heres what well do, Ill get twice as drunk as Monica and then no ones will even notice her.\n(Chandler walks over to where the rest of the gang is.)\nRachel: Whats-whats going on? Phils really pissed!\nChandler: Monicas wasted.\nRoss: Maybe that will liven up this party.\nChandler: (To Rachel) Okay, will you just go help her change please!\nRachel: Okay, but taking care of a drunk, naked woman seems like a job for Joey.\nJoey: Yep. (Starts for Monicas room, but Chandler stops him.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas birthday, its just after the surprise.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Okay before we start the celebration, Monica has to go put on her party dress."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Yay!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "See? (Does his laugh.) Here we go. (Starts walking her to their room, and has to pass in front of Mr. Geller whos sitting at the table and Mrs. Geller whos standing next to him.)"}, {"line_number": 5, "type": "narration", "text": "Mr. Geller: Happy birthday, sweetie! Give us a hug! (Starts to get up.)"}, {"line_number": 6, "type": "narration", "text": "Mrs. Geller: (stopping him) Dont get up Jack! The safety pins are about to blow."}, {"line_number": 7, "type": "action", "text": "(They continue their trek.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "(sees someone) Paul!"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "(correcting her) Phil."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Phil!"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Now, there is a dress laid out on your bed. (Monica stumbles on the steps.) Okay, (catches her) youre doing great. Youre doing great. Youre doing fine."}, {"line_number": 12, "type": "action", "text": "(Phoebe approaches as they almost get to their room.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Hey, whats going on?"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "Monicas a little drunk."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Yay! I love drunk Monica!"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Awwwww (Giggles.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "(To Monica) Go change! (To Phoebe) She doesnt want her parents to know shes drunk."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Ohh! All right! All right. Heres what well do, Ill get twice as drunk as Monica and then no ones will even notice her."}, {"line_number": 19, "type": "action", "text": "(Chandler walks over to where the rest of the gang is.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Whats-whats going on? Phils really pissed!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Monicas wasted."}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Maybe that will liven up this party."}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "(To Rachel) Okay, will you just go help her change please!"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Okay, but taking care of a drunk, naked woman seems like a job for Joey."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Yep. (Starts for Monicas room, but Chandler stops him.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 9, "scene_id": "S07E14_009", "location": "Rachels birthday", "scene_description": "everyone is presenting their presents to Rachel.", "characters": ["Chandler", "Joey", "Monica", "Rachel", "Ross", "Tag"], "firestore_path": "/episodes/S07E14/scenes/S07E14_009", "raw_text": "[Scene: Rachels birthday, everyone is presenting their presents to Rachel.]\nTag: (handing his to her) This ones from me.\nRachel: Ahh!\nTag: It wasnt on your list, but hopefully youll think its really fun.\nRachel: (opening it) A scooter! (Shes not happy.)\nRoss: (to Tag) Stick to the list. Always stick to the list.\nRachel: No! No-no, I love it. Thank you. (Kisses him.) \nChandler: Okay, open ours next. Open ours next!\nRachel: Okay.\nJoey: Now that youre a couple, we dont get two presents from you guys?\nChandler: For my last birthday you gave me a hug! (To Rachel) Okay, read the card! Read the card!\nRachel: Okay. (Opens the card and reads it.) Happy birthday Grandma! Its better to be over the hill (starting to cry) then buried under it. (Breaks down as everyone glares at them.) All our love Monica and Chandler. (Crying) Thats funny, yeah!\nChandler: No-no-no-no! That was the joke!\nRachel: (crying) No, I know! I get it! Its funny!\nChandler: No, because youre not a grandmother!\nRachel: No I know, because to be a grandmother you have to be married and have children and I dont have any of those things. Thats why its so funny. (Runs into her room crying.)\nMonica: All you had to do was buy the card!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rachels birthday, everyone is presenting their presents to Rachel.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Tag", "text": "(handing his to her) This ones from me."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Ahh!"}, {"line_number": 4, "type": "dialogue", "speaker": "Tag", "text": "It wasnt on your list, but hopefully youll think its really fun."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "(opening it) A scooter! (Shes not happy.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "(to Tag) Stick to the list. Always stick to the list."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "No! No-no, I love it. Thank you. (Kisses him.) "}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Okay, open ours next. Open ours next!"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Now that youre a couple, we dont get two presents from you guys?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "For my last birthday you gave me a hug! (To Rachel) Okay, read the card! Read the card!"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Okay. (Opens the card and reads it.) Happy birthday Grandma! Its better to be over the hill (starting to cry) then buried under it. (Breaks down as everyone glares at them.) All our love Monica and Chandler. (Crying) Thats funny, yeah!"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "No-no-no-no! That was the joke!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "(crying) No, I know! I get it! Its funny!"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "No, because youre not a grandmother!"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "No I know, because to be a grandmother you have to be married and have children and I dont have any of those things. Thats why its so funny. (Runs into her room crying.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "All you had to do was buy the card!"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 10, "scene_id": "S07E14_010", "location": "Rachels birthday", "scene_description": "a time lapse has occurred. Rachel is coming back into the living room carrying a notepad.", "characters": ["Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E14/scenes/S07E14_010", "raw_text": "[Scene: Rachels birthday, a time lapse has occurred. Rachel is coming back into the living room carrying a notepad.]\nRoss: Hey! Look whos back! Its the birthday girl! Hows the birthday girl feeling?\nRachel: Well, I feel fine, but I think youre bumming out the rest of the kids.\nRoss: What? (Glances over and sees the faces of the rest of the group, then goes and sits down.)\nRachel: Okay! Yknow what? I realized it was stupid to get upset about not having a husband and kids. All I really needed was a plan. See I wanna have three kids\nPhoebe: Oh let me guess, and you wanna have them all at the same time and you wanna have them for your brother.\nRachel: As I was saying I should probably have the first of the three kids by the time Im 35 which gives me five years. I love this plan! I wanna marry this plan!\nPhoebe: If you could do that, Id marry the hippity-hop.\nRachel: So, if I wanna have my kid when Im 35, I dont have to get pregnant until Im 34. Which gives Prada four years to start making maternity clothes! Oh wait, but I do want to be married for a year before I get pregnant\nMonica: Really! That long?! (Chandler slowly turns and looks at her.) (To Chandler) Look all you want, its happening!\nRachel: No, so I dont have to get married until Im 33! Thats three years, thats three whole yearsOh, wait a minute though. Ill need a year and a half to plan the wedding, and Id like to know the guy for a year, year and a half before we get engaged Which means I need to meet the guy by the time Im thirty.\nRoss: Which is fine! Because you just turned(Removes two candles from the cake)twenty-eight!\nRachel: No! Ross, no! It is not fine! Eh-eh-according to my plan I should already be with the guy I wanna marry!\n(We hear Tag scream out in the hallway and jump into view of the open door on the scooter. He gives a hearty thumbs up to the group and rides off, with Joey following breathlessly behind.)\nJoey: Will you quit hoggin it!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rachels birthday, a time lapse has occurred. Rachel is coming back into the living room carrying a notepad.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey! Look whos back! Its the birthday girl! Hows the birthday girl feeling?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Well, I feel fine, but I think youre bumming out the rest of the kids."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "What? (Glances over and sees the faces of the rest of the group, then goes and sits down.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Okay! Yknow what? I realized it was stupid to get upset about not having a husband and kids. All I really needed was a plan. See I wanna have three kids"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh let me guess, and you wanna have them all at the same time and you wanna have them for your brother."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "As I was saying I should probably have the first of the three kids by the time Im 35 which gives me five years. I love this plan! I wanna marry this plan!"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "If you could do that, Id marry the hippity-hop."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "So, if I wanna have my kid when Im 35, I dont have to get pregnant until Im 34. Which gives Prada four years to start making maternity clothes! Oh wait, but I do want to be married for a year before I get pregnant"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Really! That long?! (Chandler slowly turns and looks at her.) (To Chandler) Look all you want, its happening!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "No, so I dont have to get married until Im 33! Thats three years, thats three whole yearsOh, wait a minute though. Ill need a year and a half to plan the wedding, and Id like to know the guy for a year, year and a half before we get engaged Which means I need to meet the guy by the time Im thirty."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Which is fine! Because you just turned(Removes two candles from the cake)twenty-eight!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "No! Ross, no! It is not fine! Eh-eh-according to my plan I should already be with the guy I wanna marry!"}, {"line_number": 14, "type": "action", "text": "(We hear Tag scream out in the hallway and jump into view of the open door on the scooter. He gives a hearty thumbs up to the group and rides off, with Joey following breathlessly behind.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Will you quit hoggin it!"}, {"line_number": 16, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 11, "scene_id": "S07E14_011", "location": "Monicas birthday", "scene_description": "Monica is now dressed and is being helped out by Chandler and Rachel.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S07E14/scenes/S07E14_011", "raw_text": "[Scene: Monicas birthday, Monica is now dressed and is being helped out by Chandler and Rachel.]\nRachel: (To Chandler) Im telling you its like watching Bambi learn how to walk.\nRoss: (To Monica) Youre drunk! Mom and dad are gonna be maaaaadd! Maybe Im a little drunk.\n(Monica sits down on the barca lounger.)\nChandler: (to a waiter) Oh thats great! Right there! Can we get some of that over here please? (The waiter comes over) There we go.\nJoey: (to the waiter) Hey! Are those crab cakes? (The waiter nods) Did I not tell ya to come straight to me when more crab cakes were ready?\nChandler: (To Monica) How are you feeling?\nMonica: You are so handsome! I wanna make love to you right here, right now! (Growls and pulls him into a kiss.)\nRoss: I really wish that you wouldnt.\nChandler: (To Monica) Now all you have to do is just get through a little bit more, okay? Then we can put you in bed, okay? Just smile and dont talk to anyone.\nPhoebe: (clinking two glasses together) Speech! Speech! Lets hear from the birthday girl! Huh?\nChandler: Pheebs!!\nPhoebe: Dont you see? Everyones looking at me! The plans working! I didnt even have to take off my top yet!\nMrs. Geller: Speech! Come on Monica!\nRoss: Come on!\nAll: Come on! Speech!\n(Monica stands up and wobbles slightly and Chandler runs over to catch her.)\nMr. Geller: (filming this) Hey Chandler, you cant keep your hands off her for one second!\nMrs. Geller: Oh-ho, I think its nice.\nChandler: I think its necessary. (Backs away anyhow.)\nMonica: I-I-I wanna thank you all for coming. My family and my friends\nPhoebe: (screaming) Wooo!! Hoo!!\nMonica: I really like to say that Im-um (Pause) Yknow what Id really like to say? Im drunk!! (Mrs. Geller pulls the camera down.) Thats right mom and dad your little Harmonica is hammered!! (Ross grabs the camera out of his dads hands.) And guess what! Ive been drunk before! And Ive smoked a cigarette! And I got a box of Ding-Dongs hidden in my underwear drawer! Its all okay. Its okay because I turned thirty today. And, and I can do anything I want! Because I am a grown up. (Falls over sideways with Ross filming the fall.)\nPhoebe: (To Joey) Okay quick, help me get this off! (Motions to her top.)\nJoey: Yeah!!\n(Ross pans the camera over to Phoebe.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monicas birthday, Monica is now dressed and is being helped out by Chandler and Rachel.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(To Chandler) Im telling you its like watching Bambi learn how to walk."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(To Monica) Youre drunk! Mom and dad are gonna be maaaaadd! Maybe Im a little drunk."}, {"line_number": 4, "type": "action", "text": "(Monica sits down on the barca lounger.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "(to a waiter) Oh thats great! Right there! Can we get some of that over here please? (The waiter comes over) There we go."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(to the waiter) Hey! Are those crab cakes? (The waiter nods) Did I not tell ya to come straight to me when more crab cakes were ready?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "(To Monica) How are you feeling?"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "You are so handsome! I wanna make love to you right here, right now! (Growls and pulls him into a kiss.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "I really wish that you wouldnt."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "(To Monica) Now all you have to do is just get through a little bit more, okay? Then we can put you in bed, okay? Just smile and dont talk to anyone."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "(clinking two glasses together) Speech! Speech! Lets hear from the birthday girl! Huh?"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Pheebs!!"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Dont you see? Everyones looking at me! The plans working! I didnt even have to take off my top yet!"}, {"line_number": 14, "type": "narration", "text": "Mrs. Geller: Speech! Come on Monica!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Come on!"}, {"line_number": 16, "type": "dialogue", "speaker": "All", "text": "Come on! Speech!"}, {"line_number": 17, "type": "action", "text": "(Monica stands up and wobbles slightly and Chandler runs over to catch her.)"}, {"line_number": 18, "type": "narration", "text": "Mr. Geller: (filming this) Hey Chandler, you cant keep your hands off her for one second!"}, {"line_number": 19, "type": "narration", "text": "Mrs. Geller: Oh-ho, I think its nice."}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "I think its necessary. (Backs away anyhow.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "I-I-I wanna thank you all for coming. My family and my friends"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "(screaming) Wooo!! Hoo!!"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "I really like to say that Im-um (Pause) Yknow what Id really like to say? Im drunk!! (Mrs. Geller pulls the camera down.) Thats right mom and dad your little Harmonica is hammered!! (Ross grabs the camera out of his dads hands.) And guess what! Ive been drunk before! And Ive smoked a cigarette! And I got a box of Ding-Dongs hidden in my underwear drawer! Its all okay. Its okay because I turned thirty today. And, and I can do anything I want! Because I am a grown up. (Falls over sideways with Ross filming the fall.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "(To Joey) Okay quick, help me get this off! (Motions to her top.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Yeah!!"}, {"line_number": 26, "type": "action", "text": "(Ross pans the camera over to Phoebe.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 12, "scene_id": "S07E14_012", "location": "Phoebes birthday", "scene_description": "shes telling everyone what she found out at Ursulas while sitting in Central Perk.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S07E14/scenes/S07E14_012", "raw_text": "[Scene: Phoebes birthday, shes telling everyone what she found out at Ursulas while sitting in Central Perk.]\nPhoebe: I lost a whole year! I cant believe it! This is so unfair!\nJoey: Oh, I dont know Pheebs. Itll be okay.\nPhoebe: Will it? Will it?! I mean, how would you feel if you found out you were 31?\nJoey: Thats not gonna happen. No. (Looks up) Because we have a new deal!\nPhoebe: Plus, it totally ruined my schedule! II havent done any of the things I wanted to do by the time I was 31!\nJoey: Like what?\nPhoebe: Like okay I-I-I, I havent met any Portuguese people! I, I havent had the perfect kiss! And I havent been to snipers school!\nMonica: Phoebe, yknow why dont we just go upstairs and have some birthday cake?\nPhoebe: No, I just feel like being by myself for a while. All right? Ill see you guys later. Thanks. (Gets up and exits.)\nRachel: Hey. (After she leaves.) Oh, poor Pheebs.\nJoey: Hey, yknow what you guys? I think Im gonna go walk her home. (Gets up and runs out.) \nMonica: Oh man!\nChandler: What?\nMonica: Hes gonna eat the cake!\n[Cut outside, Joey is catching up with Phoebe.]\nJoey: Pheebs! Wait up! (She stops.) Listen uh, close your eyes. (She does so and Joey passionately kisses her.) Maybe thats one thing you can cross off your list.\nPhoebe: Oh yeah.\n(Joey starts to walk away, but stops.)\nJoey: Oh, and plus Im 1/16th Portuguese.\nPhoebe: Oh! (Phoebe walks away smiling.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Phoebes birthday, shes telling everyone what she found out at Ursulas while sitting in Central Perk.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "I lost a whole year! I cant believe it! This is so unfair!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Oh, I dont know Pheebs. Itll be okay."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Will it? Will it?! I mean, how would you feel if you found out you were 31?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Thats not gonna happen. No. (Looks up) Because we have a new deal!"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Plus, it totally ruined my schedule! II havent done any of the things I wanted to do by the time I was 31!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Like what?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Like okay I-I-I, I havent met any Portuguese people! I, I havent had the perfect kiss! And I havent been to snipers school!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, yknow why dont we just go upstairs and have some birthday cake?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "No, I just feel like being by myself for a while. All right? Ill see you guys later. Thanks. (Gets up and exits.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Hey. (After she leaves.) Oh, poor Pheebs."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Hey, yknow what you guys? I think Im gonna go walk her home. (Gets up and runs out.) "}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Oh man!"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Hes gonna eat the cake!"}, {"line_number": 16, "type": "narration", "text": "[Cut outside, Joey is catching up with Phoebe.]"}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "Pheebs! Wait up! (She stops.) Listen uh, close your eyes. (She does so and Joey passionately kisses her.) Maybe thats one thing you can cross off your list."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Oh yeah."}, {"line_number": 19, "type": "action", "text": "(Joey starts to walk away, but stops.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Oh, and plus Im 1/16th Portuguese."}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! (Phoebe walks away smiling.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 13, "scene_id": "S07E14_013", "location": "Rosss birthday", "scene_description": "his car is still trapped in its spot. Now Joey, Phoebe, and Ross are at the front of the car with Monica, Rachel, and Chandler at the rear of the car.", "characters": ["Chandler", "Rachel", "Ross"], "firestore_path": "/episodes/S07E14/scenes/S07E14_013", "raw_text": "[Scene: Rosss birthday, his car is still trapped in its spot. Now Joey, Phoebe, and Ross are at the front of the car with Monica, Rachel, and Chandler at the rear of the car.]\nRoss: Okay, is everybody clear? Were gonna pick it upand move it. Now all we need is teamwork, okay? Were gonna lift the carand slide it out. Lift and slide!\nRachel: Ross, I really dont think\nRoss: (interrupting her) Lift!! And slide!\nChandler: Okay, here we go.\nRoss: All right everyone, lift! (They and try to lift the car, of course it doesnt raise up) And slide!! (Everyone leans over, but the car still does not move.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rosss birthday, his car is still trapped in its spot. Now Joey, Phoebe, and Ross are at the front of the car with Monica, Rachel, and Chandler at the rear of the car.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Okay, is everybody clear? Were gonna pick it upand move it. Now all we need is teamwork, okay? Were gonna lift the carand slide it out. Lift and slide!"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Ross, I really dont think"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "(interrupting her) Lift!! And slide!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Okay, here we go."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "All right everyone, lift! (They and try to lift the car, of course it doesnt raise up) And slide!! (Everyone leans over, but the car still does not move.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 14, "scene_id": "S07E14_014", "location": "Rachels birthday", "scene_description": "she is coming into the hallway where Joey and Tag are playing with the scooter.", "characters": ["Chandler", "Joey", "Phoebe", "Rachel", "Ross", "Tag"], "firestore_path": "/episodes/S07E14/scenes/S07E14_014", "raw_text": "[Scene: Rachels birthday, she is coming into the hallway where Joey and Tag are playing with the scooter.]\nRachel: Hey Joey, can I\nJoey: Oh, come on Rach! My turn just started!\nRachel: Actually, I just wanna talk to Tag.\nJoey: Oh. Okay. Hey, can I ride this outside?\nRachel: Whatever! Okay, Im not your mother.\nJoey: Okay! (Runs off downstairs.)\nRachel: Not in the street!!\nJoey: Yes!\nRachel: (to Tag) Hi.\nTag: Hey.\nRachel: Hey.\nTag: How are you doing? Are you feeling any better?\nRachel: Yeah, Im doing okay. Im umlets talk.\nTag: Okay. (They sit on the step.)\nRachel: Umm\nTag: Whats up?\nRachel: Ohh Tag, ummyoure such a great guy and we have sooo much fun together but I dont-I dont\nTag: Wait! I think I see where youre going, but before you say anything else, can I just say one more thing? (Kisses her.)\nRachel: Well said. And a uh good example of the fun I was referring to uhh, but I just think Im past the point where I think I can yknow, just have fun.\nTag: Rachel, dont do this. This is just because youre turning thirty.\nRachel: Yeah, it is! But youre just a kid! I mean youre 25!\nTag: Twenty-four actually.\nRachel: Oh God! Yknow what I wish? I wish you were six years older. Well actually, if Im wishin for stuff, I actually wish I was six years younger.\nTag: Me too.\nRachel: Yeah, Im sorry. (They hug.)\n[Time lapse, Rachel is entering her apartment after breaking up with Tag.]\nChandler: Hey! Howd it go?\nRachel: Oh, if I only want two kids, can I keep him for another year?\nPhoebe: You did the right thing.\nJoey: (entering, limping, and holding his arm) I dont like this anymore. (He sits down with them in pain.)\nChandler: Well, here we are, just a bunch of thirty year olds.\nRoss: God, do you realize in ten years were gonna be 40?\nJoey: (crying) Why God?! Why are you doing this to us?! (He buries his head in Rosss shoulder.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rachels birthday, she is coming into the hallway where Joey and Tag are playing with the scooter.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hey Joey, can I"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Oh, come on Rach! My turn just started!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Actually, I just wanna talk to Tag."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Oh. Okay. Hey, can I ride this outside?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Whatever! Okay, Im not your mother."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Okay! (Runs off downstairs.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Not in the street!!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Yes!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "(to Tag) Hi."}, {"line_number": 11, "type": "dialogue", "speaker": "Tag", "text": "Hey."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Hey."}, {"line_number": 13, "type": "dialogue", "speaker": "Tag", "text": "How are you doing? Are you feeling any better?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, Im doing okay. Im umlets talk."}, {"line_number": 15, "type": "dialogue", "speaker": "Tag", "text": "Okay. (They sit on the step.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Umm"}, {"line_number": 17, "type": "dialogue", "speaker": "Tag", "text": "Whats up?"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Ohh Tag, ummyoure such a great guy and we have sooo much fun together but I dont-I dont"}, {"line_number": 19, "type": "dialogue", "speaker": "Tag", "text": "Wait! I think I see where youre going, but before you say anything else, can I just say one more thing? (Kisses her.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Well said. And a uh good example of the fun I was referring to uhh, but I just think Im past the point where I think I can yknow, just have fun."}, {"line_number": 21, "type": "dialogue", "speaker": "Tag", "text": "Rachel, dont do this. This is just because youre turning thirty."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, it is! But youre just a kid! I mean youre 25!"}, {"line_number": 23, "type": "dialogue", "speaker": "Tag", "text": "Twenty-four actually."}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "Oh God! Yknow what I wish? I wish you were six years older. Well actually, if Im wishin for stuff, I actually wish I was six years younger."}, {"line_number": 25, "type": "dialogue", "speaker": "Tag", "text": "Me too."}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, Im sorry. (They hug.)"}, {"line_number": 27, "type": "narration", "text": "[Time lapse, Rachel is entering her apartment after breaking up with Tag.]"}, {"line_number": 28, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Howd it go?"}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Oh, if I only want two kids, can I keep him for another year?"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "You did the right thing."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "(entering, limping, and holding his arm) I dont like this anymore. (He sits down with them in pain.)"}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "Well, here we are, just a bunch of thirty year olds."}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "God, do you realize in ten years were gonna be 40?"}, {"line_number": 34, "type": "dialogue", "speaker": "Joey", "text": "(crying) Why God?! Why are you doing this to us?! (He buries his head in Rosss shoulder.)"}]}
{"episode_id": "S07E14", "season": 7, "episode_number": 14, "episode_title": "THE ONE WHERE THEY ALL TURN THIRTY", "scene_number": 15, "scene_id": "S07E14_015", "location": "Rosss birthday", "scene_description": "night has fallen and Joey and Ross are walking by where his car is parked to find that both cars blocking him in have left.", "characters": ["Joey", "Ross", "The Man In The Sportscar"], "firestore_path": "/episodes/S07E14/scenes/S07E14_015", "raw_text": "[Scene: Rosss birthday, night has fallen and Joey and Ross are walking by where his car is parked to find that both cars blocking him in have left.]\nRoss: Yes! My babys finally free! \nJoey: All-all right! (They run and jump in the car.) Start it up! Lets go!\nRoss: (starting it) Woohoo!\n(Just as they are about to pull away, a big, fat, bald guy pulls up in the exact same car as Ross and stops next to him.)\nThe Man In The Sportscar: How hot are we? (He drives off.)\nRoss: You wanna buy a car?\nJoey: No.\n(Ross shuts it off and they get out.)\nEnding Credits\n{Transcribers Note: There was no credits scene with this episode.}\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rosss birthday, night has fallen and Joey and Ross are walking by where his car is parked to find that both cars blocking him in have left.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Yes! My babys finally free! "}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "All-all right! (They run and jump in the car.) Start it up! Lets go!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "(starting it) Woohoo!"}, {"line_number": 5, "type": "action", "text": "(Just as they are about to pull away, a big, fat, bald guy pulls up in the exact same car as Ross and stops next to him.)"}, {"line_number": 6, "type": "dialogue", "speaker": "The Man In The Sportscar", "text": "How hot are we? (He drives off.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "You wanna buy a car?"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "No."}, {"line_number": 9, "type": "action", "text": "(Ross shuts it off and they get out.)"}, {"line_number": 10, "type": "narration", "text": "Ending Credits"}, {"line_number": 11, "type": "narration", "text": "{Transcribers Note: There was no credits scene with this episode.}"}, {"line_number": 12, "type": "narration", "text": "End"}]}
