{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 1, "scene_id": "S08E01_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E01/scenes/S08E01_001", "raw_text": "THE ONE AFTER \"I DO\"\nWritten by: David Crane & Marta Kauffman Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE AFTER \"I DO\""}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "David Crane & Marta Kauffman Transcribed by: Eric Aasen"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 2, "scene_id": "S08E01_002", "location": "The Wedding Hall", "scene_description": "Monica and Chandler have just said \"I do,\" and the photographer is taking the required pictures. First of Monica, Chandler, Ross and Joey.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Photographer", "Rachel", "Ross"], "firestore_path": "/episodes/S08E01/scenes/S08E01_002", "raw_text": "[Scene: The Wedding Hall, Monica and Chandler have just said \"I do,\" and the photographer is taking the required pictures. First of Monica, Chandler, Ross and Joey.]\nPhotographer: Great. (Takes a picture.) Great! Just give me a sec to change film.\nMonica: Okay.\nRoss: (To Monica) Okay, I know Im not supposed to know, but I do. And Im so excited for you!\nJoey: What? Whats going on?\nRoss: Monicas pregnant!\nJoey: Oh my God! Is that why you guys had to get married?!\nMonica: Guys! Im not pregnant.\nJoey: Ah. (To Chandler) Slow swimmers? (Chandler looks at him.)\nRoss: What?! What do you mean? You-you-youre not pregnant?\nMonica: You didnt tell anybody I was did you?!\nRoss: No! (Pause) Ill be right back. (Exits.)\nPhotographer: Now why dont we get a shot of just Monica and the bloody soldier.\nMonica: (To Joey) Oh, about that. Joey, you have to change before the party.\nJoey: I cant! I-I dont have any other clothes here.\nMonica: Find some! Please! Anything that doesnt say I-I died tragically in France. (Joey leaves to find clothes.)\nPhotographer: Well then why dont we see the bride and the groom and the bridemaids.\nPhoebe: Okay. (Phoebe and Rachel join Monica and Chandler on the altar.) Hey Mon, why did you tell the guys you werent pregnant?\nMonica: Because Im not.\nPhoebe: We found your test in the trash, if youre not pregnant(She sees Rachel shaking her head)Its because I am.\n(Flash, the photographer takes a picture of Monica and Chandlers stunned faces.)\nChandler: What?! What are you talking about?\nMonica: What are you talking about?\nPhoebe: Yes, II am with child. (Flash) And I didnt want to say anything because its your day; I didnt want to steal your thunder.\nMonica: Wait a minute! So you told people I was pregnant?! (Flash) Does this look like a conversation that I want to remember?!\nChandler: Whos the father?\nMonica: Yeah!\nPhoebe: I cant say.\nMonica: Why?!\nChandler: Why not?\nPhoebe: I cant say because hes famous.\nRachel: Oh my God, who is it?! (Phoebe rolls her eyes.)\nMonica: Phoebe, come on, you have to tell us.\nPhoebe: Okay, okay. Its James Brolin. James Brolin is the father of my baby.\nChandler: As in Barbara Streisands husband James Brolin?\nPhoebe: What?! Well he never said that to me!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Wedding Hall, Monica and Chandler have just said \"I do,\" and the photographer is taking the required pictures. First of Monica, Chandler, Ross and Joey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Photographer", "text": "Great. (Takes a picture.) Great! Just give me a sec to change film."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "(To Monica) Okay, I know Im not supposed to know, but I do. And Im so excited for you!"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "What? Whats going on?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Monicas pregnant!"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Oh my God! Is that why you guys had to get married?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Guys! Im not pregnant."}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Ah. (To Chandler) Slow swimmers? (Chandler looks at him.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "What?! What do you mean? You-you-youre not pregnant?"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "You didnt tell anybody I was did you?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "No! (Pause) Ill be right back. (Exits.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Photographer", "text": "Now why dont we get a shot of just Monica and the bloody soldier."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "(To Joey) Oh, about that. Joey, you have to change before the party."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "I cant! I-I dont have any other clothes here."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Find some! Please! Anything that doesnt say I-I died tragically in France. (Joey leaves to find clothes.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Photographer", "text": "Well then why dont we see the bride and the groom and the bridemaids."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (Phoebe and Rachel join Monica and Chandler on the altar.) Hey Mon, why did you tell the guys you werent pregnant?"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "Because Im not."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "We found your test in the trash, if youre not pregnant(She sees Rachel shaking her head)Its because I am."}, {"line_number": 21, "type": "action", "text": "(Flash, the photographer takes a picture of Monica and Chandlers stunned faces.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "What?! What are you talking about?"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "What are you talking about?"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, II am with child. (Flash) And I didnt want to say anything because its your day; I didnt want to steal your thunder."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute! So you told people I was pregnant?! (Flash) Does this look like a conversation that I want to remember?!"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Whos the father?"}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Yeah!"}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "I cant say."}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "Why?!"}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "Why not?"}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "I cant say because hes famous."}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God, who is it?! (Phoebe rolls her eyes.)"}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Phoebe, come on, you have to tell us."}, {"line_number": 34, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, okay. Its James Brolin. James Brolin is the father of my baby."}, {"line_number": 35, "type": "dialogue", "speaker": "Chandler", "text": "As in Barbara Streisands husband James Brolin?"}, {"line_number": 36, "type": "dialogue", "speaker": "Phoebe", "text": "What?! Well he never said that to me!"}, {"line_number": 37, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 3, "scene_id": "S08E01_003", "location": "The Wedding Hall", "scene_description": "continued from earlier.", "characters": ["Chandler", "Phoebe", "Photographer", "Rachel"], "firestore_path": "/episodes/S08E01/scenes/S08E01_003", "raw_text": "[Scene: The Wedding Hall, continued from earlier.]\nPhotographer: Why dont we have Monica step away and well get Chandler and the bridemaids.\nPhoebe: How about just the bridemaids?\nChandler: Yknow I am the groom right? I was told it was kinda big deal.\nPhoebe: It is.\nRachel: For you. (Chandler leaves.)\nPhoebe: Oh my God!\nRachel: Oh, thank you for doing that. I just cant deal with this just quite yet.\nPhoebe: So instead you told me Monica was pregnant.\nRachel: You said that she was, I just didnt disagree with you.\nPhoebe: Sneaky.\nRachel: Oh yeah.\nPhotographer: Smile ladies.\nRachel: Oh! (They smile and the picture is taken.) Oh by the way?\nPhoebe: Uh-hmm.\nRachel: James Brolin?\nPhoebe: Oh, I know. I could only think of two names, him and Ed Begley Jr. and then I remembered hes gay.\nRachel: Ed Begley Jr. is not gay.\nPhoebe: (intrigued) Really?!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Wedding Hall, continued from earlier.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Photographer", "text": "Why dont we have Monica step away and well get Chandler and the bridemaids."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "How about just the bridemaids?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Yknow I am the groom right? I was told it was kinda big deal."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "It is."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "For you. (Chandler leaves.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh, thank you for doing that. I just cant deal with this just quite yet."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "So instead you told me Monica was pregnant."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "You said that she was, I just didnt disagree with you."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Sneaky."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah."}, {"line_number": 13, "type": "dialogue", "speaker": "Photographer", "text": "Smile ladies."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Oh! (They smile and the picture is taken.) Oh by the way?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-hmm."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "James Brolin?"}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, I know. I could only think of two names, him and Ed Begley Jr. and then I remembered hes gay."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Ed Begley Jr. is not gay."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "(intrigued) Really?!"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 4, "scene_id": "S08E01_004", "location": "The Reception Hall", "scene_description": "the party is in full swing.", "characters": ["Bandleader", "Chandler", "Dennis Phillips", "Joey", "Mona", "Monica", "Phoebe", "Rachel", "Ross", "Waiter", "Woman"], "firestore_path": "/episodes/S08E01/scenes/S08E01_004", "raw_text": "[Scene: The Reception Hall, the party is in full swing.]\nBandleader: Thank you very much! Ladies and gentlemen, it gives me great pleasure to introduce to you for the very first time, Mr. and Mrs. Chandler Bing!\n(They enter.)\nChandler: Before we go out there Ive got a present for ya.\nMonica: Honey, Im going to put my hand in your pocket!\nChandler: No?\nMonica: No.\nChandler: Ive been taking dancing lessons.\nMonica: What?!\nChandler: Yeah, the last six weeks. I wanted this to be a moment you will never forget.\nMonica: Oh that is so sweet!\nChandler: So? Would you care to join me in our first dance as husband and wife?\nMonica: Yes.\n(They walk onto the dance floor and Chandler slips and almost falls.)\nMonica: Whats the matter?\nChandler: I dont know, its these new shoes, theyre all slippery.\nMonica: Well, are you going to be able to do this?\nChandler: Not well.\n(They start dancing and Chandler starts slipping around.)\nMonica: Well, the good news is, I dont think anyones looking at us.\n[Cut to Phoebe and Rachel at their table.]\nPhoebe: So, are you ready to talk about it?\nRachel: No.\n(Pause)\nPhoebe: Now?\nRachel: No!\nPhoebe: Okay, well talk about something else then.\nRachel: Thank you.\nPhoebe: Whos the father?!\nRachel: Ugh! Look honey yknow what? I havent told him yet, so until I do I dont think I should tell anybody else.\nPhoebe: Yeah. Thats fine. Thats fair. Is it Tag?\nRachel: Phoebe!!\nPhoebe: Okay, Im sorry. Ill stop.\nRachel: Okay.\nPhoebe: Is it Ross? Its Ross isnt itOh my God, its Joey!\nRachel: Honey, stop it! I am not going to tell you until I tell him.\nPhoebe: Ah-hah! At least we know its a him.\n[Cut to Joey entering wearing a preppy tennis outfit.]\nMonica: (seeing him) Oh sweet Lord.\nJoey: Im sorry! Okay? I went down to the gift shop and its either this or a bathrobe! Look, whats more important, the way Im dressed or me being with you on your special day?\nMonica: Honey, Im not even going to pretend I was listening. (Sees someone else.) Hey! Hey! (Goes over to that person.)\n[Cut to the hallway outside the room, Ross is going to see which table hes at and sees a beautiful woman doing the same thing.]\nRoss: Hi. Im uh, Im Ross. I dont, I dont believe weve met. Im Monicas older brother.\nWoman: Oh hi, Im, Im Mona from her restaurant.\nRoss: Oh! Hello uh, Mona from her restaurant. (He uses his card to mouth those words.) (Pause) Mona, wow what a, what a beautiful name.\nMona: You think so? Ive always kinda hated it.\nRoss: Aw come on, Mona Lisa?\nMona: Uh-huh.\nRoss: Mona ummClickclocken. The famous botanist? Huh? Oh no shes uhwell shes dead now. No, supposedly she was once quite the hottie of the plant world.\nMona: Really?! Well see? I never knew about her.\nRoss: Linda Clickclocken. (Pause) So what uh, what-what table are you at? (She shows him.) Oh, uh me too.\nMona: Oh good. Now therell be someone there who likes my name.\nRoss: (sexily) Yes there will. (Mona leaves and Ross tries to find the same table.) Oh guess what, Molly Gilbert youve just been bumped up to table one. And if its all right with you Im gonna take your place at table sixMartin Clickclocken.\n[Cut back inside to Joey giving a beautiful woman a tennis lesson by standing behind her.]\nJoey: Thats better, now just bend your arms a little more. There you go. Okay, look straight ahead. Now this time I want you to really put your ass into it. (They do a practice swing and she really puts her ass into it.)\n[Cut to Chandler sitting down near Joey as his mom walks over. His birth mother, not the mother who recently visited one of those clinics in Sweden.]\nMrs. Bing: Chandler darling! Look, my date has finally arrived. Id like you to meet Dennis Phillips.\nDennis Phillips: Congratulations.\nChandler: Thank you.\nMrs. Bing: Dennis is a dear old friend and a fantastic lover.\nChandler: Bravo Dennis thanks for pleasing my mother so.\nDennis Phillips: Oh, Im so sorry I missed the ceremony, I was stuck at auditions.\nMrs. Bing: Oh yes, Dennis is directing a new Broadway show.\nJoey: I dont believe weve met, Joey Tribbiani.\nDennis Phillips: Dennis Phillips\nJoey: Wow, Ive admired your work for years. You-youve done some really amazing stuff.\nDennis Phillips: Oh, thank you. Well if youll excuse me, Im gonna go get myself a drink. Be back in a moment. (Walks away.)\nJoey: Wow Dennis Phillips! Thats great! How did you guys meet?\nMrs. Bing: Well, its a funny story.\nChandler: Funny: ha-ha or funny: (Mimes blowing his brain out.)\n[Time lapse. The band is finishing another song.]\nBandleader: Thank you, thank you very much. If everyone will please take your seats, dinner will be served.\n(Ross starts looking for table six and finds out that its the kids table. He sees Mona sitting at another table.)\nRoss: Hey! Uh, I thought, I thought you were at table six.\nMona: No, nine. (Shows him the card again.)\nRoss: Oh see, before you uh, when you showed it to me you-you held it that way (he turns her hand upside down) which uh, which was misleading. Well Im (He goes at sits down at his new table and the kids stare at him.) Hello.\n[Cut to the hallway, Chandler is putting tape on the bottom of his shoes.]\nJoey: Chandler. Will you see if your mom can give my resume to Dennis Phillips? Cause if I can get in a Broadway show then I wouldve done it all, film, television, and theater. The only think left would be radio, and thats just for ugly people.\nChandler: What size shoes do you wear?\nJoey: Uh, eleven, eleven and a half.\nChandler: Great, because my shoes are giving me a little problem on the dance floor, can I borrow the boots from your costume?\nJoey: Uh, I dont even really know where I left those. Sorry.\nChandler: (looking at Joeys feet) Those arent eleven and a half.\nJoey: Okay fine! Im a seven! All right, I have surprisingly small feet. But the rest of me is good, Ill show ya!\n[Cut to Monica and Rachel at their table.]\nMonica: Can you believe Phoebe got pregnant?!\nRachel: Oh yknow what honey? Lets not talk about that right now?\nMonica: This is so huge.\nRachel: Sure, but come on, as big as your wedding?\nMonica: Of course not nothing is. Between me and you\nRachel: Yeah.\nMonica: in this day and age how dumb do you have to be to get pregnant?\nRachel: Hey! Yknow, sometimes you can do everything right, everyone can wear everything theyre supposed to wear, and one of those little guys just gets through!\nMonica: How?\nRachel: I dont know! Maybe they have tools.\nMonica: Well I-I talked to and uh, shes definitely going to have this baby. Yknow, she said she was gonna raise it on her own.\nRachel: Well, maybe thats, maybe thats really brave.\nMonica: Maybe. I just hope she realizes how hard its gonna be.\nRachel: Maybe she hasnt really thought it through that well.\nMonica: Well, theres a lot to think about. I mean, how is she, how is she going to handle this financially? How is she going to juggle work? Does she realize shes not going to have a date again for the next eighteen years?\nRachel: (starting to cry) I dont know.\nMonica: Are you okay?\nRachel: Uh-hmm. Im just thinking about Phoebe; poor knocked up Phoebe.\nWaiter: Champagne?\nRachel: Oh yes! Thank you very much! (She grabs a glass, takes a sip, and realizes what she just did. She then tries to spit the champagne back into the glass without Monica noticing. It doesnt work.) Oh thats-thats actually how the French drink it.\n(Monica gasps.)\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Reception Hall, the party is in full swing.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Bandleader", "text": "Thank you very much! Ladies and gentlemen, it gives me great pleasure to introduce to you for the very first time, Mr. and Mrs. Chandler Bing!"}, {"line_number": 3, "type": "action", "text": "(They enter.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Before we go out there Ive got a present for ya."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Honey, Im going to put my hand in your pocket!"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "No?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "No."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Ive been taking dancing lessons."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "What?!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, the last six weeks. I wanted this to be a moment you will never forget."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Oh that is so sweet!"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "So? Would you care to join me in our first dance as husband and wife?"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Yes."}, {"line_number": 14, "type": "action", "text": "(They walk onto the dance floor and Chandler slips and almost falls.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "Whats the matter?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "I dont know, its these new shoes, theyre all slippery."}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Well, are you going to be able to do this?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Not well."}, {"line_number": 19, "type": "action", "text": "(They start dancing and Chandler starts slipping around.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Well, the good news is, I dont think anyones looking at us."}, {"line_number": 21, "type": "narration", "text": "[Cut to Phoebe and Rachel at their table.]"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "So, are you ready to talk about it?"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "No."}, {"line_number": 24, "type": "action", "text": "(Pause)"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "Now?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "No!"}, {"line_number": 27, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, well talk about something else then."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Thank you."}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "Whos the father?!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Ugh! Look honey yknow what? I havent told him yet, so until I do I dont think I should tell anybody else."}, {"line_number": 31, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah. Thats fine. Thats fair. Is it Tag?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Phoebe!!"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, Im sorry. Ill stop."}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Is it Ross? Its Ross isnt itOh my God, its Joey!"}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "Honey, stop it! I am not going to tell you until I tell him."}, {"line_number": 37, "type": "dialogue", "speaker": "Phoebe", "text": "Ah-hah! At least we know its a him."}, {"line_number": 38, "type": "narration", "text": "[Cut to Joey entering wearing a preppy tennis outfit.]"}, {"line_number": 39, "type": "dialogue", "speaker": "Monica", "text": "(seeing him) Oh sweet Lord."}, {"line_number": 40, "type": "dialogue", "speaker": "Joey", "text": "Im sorry! Okay? I went down to the gift shop and its either this or a bathrobe! Look, whats more important, the way Im dressed or me being with you on your special day?"}, {"line_number": 41, "type": "dialogue", "speaker": "Monica", "text": "Honey, Im not even going to pretend I was listening. (Sees someone else.) Hey! Hey! (Goes over to that person.)"}, {"line_number": 42, "type": "narration", "text": "[Cut to the hallway outside the room, Ross is going to see which table hes at and sees a beautiful woman doing the same thing.]"}, {"line_number": 43, "type": "dialogue", "speaker": "Ross", "text": "Hi. Im uh, Im Ross. I dont, I dont believe weve met. Im Monicas older brother."}, {"line_number": 44, "type": "dialogue", "speaker": "Woman", "text": "Oh hi, Im, Im Mona from her restaurant."}, {"line_number": 45, "type": "dialogue", "speaker": "Ross", "text": "Oh! Hello uh, Mona from her restaurant. (He uses his card to mouth those words.) (Pause) Mona, wow what a, what a beautiful name."}, {"line_number": 46, "type": "dialogue", "speaker": "Mona", "text": "You think so? Ive always kinda hated it."}, {"line_number": 47, "type": "dialogue", "speaker": "Ross", "text": "Aw come on, Mona Lisa?"}, {"line_number": 48, "type": "dialogue", "speaker": "Mona", "text": "Uh-huh."}, {"line_number": 49, "type": "dialogue", "speaker": "Ross", "text": "Mona ummClickclocken. The famous botanist? Huh? Oh no shes uhwell shes dead now. No, supposedly she was once quite the hottie of the plant world."}, {"line_number": 50, "type": "dialogue", "speaker": "Mona", "text": "Really?! Well see? I never knew about her."}, {"line_number": 51, "type": "dialogue", "speaker": "Ross", "text": "Linda Clickclocken. (Pause) So what uh, what-what table are you at? (She shows him.) Oh, uh me too."}, {"line_number": 52, "type": "dialogue", "speaker": "Mona", "text": "Oh good. Now therell be someone there who likes my name."}, {"line_number": 53, "type": "dialogue", "speaker": "Ross", "text": "(sexily) Yes there will. (Mona leaves and Ross tries to find the same table.) Oh guess what, Molly Gilbert youve just been bumped up to table one. And if its all right with you Im gonna take your place at table sixMartin Clickclocken."}, {"line_number": 54, "type": "narration", "text": "[Cut back inside to Joey giving a beautiful woman a tennis lesson by standing behind her.]"}, {"line_number": 55, "type": "dialogue", "speaker": "Joey", "text": "Thats better, now just bend your arms a little more. There you go. Okay, look straight ahead. Now this time I want you to really put your ass into it. (They do a practice swing and she really puts her ass into it.)"}, {"line_number": 56, "type": "narration", "text": "[Cut to Chandler sitting down near Joey as his mom walks over. His birth mother, not the mother who recently visited one of those clinics in Sweden.]"}, {"line_number": 57, "type": "narration", "text": "Mrs. Bing: Chandler darling! Look, my date has finally arrived. Id like you to meet Dennis Phillips."}, {"line_number": 58, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Congratulations."}, {"line_number": 59, "type": "dialogue", "speaker": "Chandler", "text": "Thank you."}, {"line_number": 60, "type": "narration", "text": "Mrs. Bing: Dennis is a dear old friend and a fantastic lover."}, {"line_number": 61, "type": "dialogue", "speaker": "Chandler", "text": "Bravo Dennis thanks for pleasing my mother so."}, {"line_number": 62, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Oh, Im so sorry I missed the ceremony, I was stuck at auditions."}, {"line_number": 63, "type": "narration", "text": "Mrs. Bing: Oh yes, Dennis is directing a new Broadway show."}, {"line_number": 64, "type": "dialogue", "speaker": "Joey", "text": "I dont believe weve met, Joey Tribbiani."}, {"line_number": 65, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Dennis Phillips"}, {"line_number": 66, "type": "dialogue", "speaker": "Joey", "text": "Wow, Ive admired your work for years. You-youve done some really amazing stuff."}, {"line_number": 67, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Oh, thank you. Well if youll excuse me, Im gonna go get myself a drink. Be back in a moment. (Walks away.)"}, {"line_number": 68, "type": "dialogue", "speaker": "Joey", "text": "Wow Dennis Phillips! Thats great! How did you guys meet?"}, {"line_number": 69, "type": "narration", "text": "Mrs. Bing: Well, its a funny story."}, {"line_number": 70, "type": "dialogue", "speaker": "Chandler", "text": "Funny: ha-ha or funny: (Mimes blowing his brain out.)"}, {"line_number": 71, "type": "narration", "text": "[Time lapse. The band is finishing another song.]"}, {"line_number": 72, "type": "dialogue", "speaker": "Bandleader", "text": "Thank you, thank you very much. If everyone will please take your seats, dinner will be served."}, {"line_number": 73, "type": "action", "text": "(Ross starts looking for table six and finds out that its the kids table. He sees Mona sitting at another table.)"}, {"line_number": 74, "type": "dialogue", "speaker": "Ross", "text": "Hey! Uh, I thought, I thought you were at table six."}, {"line_number": 75, "type": "dialogue", "speaker": "Mona", "text": "No, nine. (Shows him the card again.)"}, {"line_number": 76, "type": "dialogue", "speaker": "Ross", "text": "Oh see, before you uh, when you showed it to me you-you held it that way (he turns her hand upside down) which uh, which was misleading. Well Im (He goes at sits down at his new table and the kids stare at him.) Hello."}, {"line_number": 77, "type": "narration", "text": "[Cut to the hallway, Chandler is putting tape on the bottom of his shoes.]"}, {"line_number": 78, "type": "dialogue", "speaker": "Joey", "text": "Chandler. Will you see if your mom can give my resume to Dennis Phillips? Cause if I can get in a Broadway show then I wouldve done it all, film, television, and theater. The only think left would be radio, and thats just for ugly people."}, {"line_number": 79, "type": "dialogue", "speaker": "Chandler", "text": "What size shoes do you wear?"}, {"line_number": 80, "type": "dialogue", "speaker": "Joey", "text": "Uh, eleven, eleven and a half."}, {"line_number": 81, "type": "dialogue", "speaker": "Chandler", "text": "Great, because my shoes are giving me a little problem on the dance floor, can I borrow the boots from your costume?"}, {"line_number": 82, "type": "dialogue", "speaker": "Joey", "text": "Uh, I dont even really know where I left those. Sorry."}, {"line_number": 83, "type": "dialogue", "speaker": "Chandler", "text": "(looking at Joeys feet) Those arent eleven and a half."}, {"line_number": 84, "type": "dialogue", "speaker": "Joey", "text": "Okay fine! Im a seven! All right, I have surprisingly small feet. But the rest of me is good, Ill show ya!"}, {"line_number": 85, "type": "narration", "text": "[Cut to Monica and Rachel at their table.]"}, {"line_number": 86, "type": "dialogue", "speaker": "Monica", "text": "Can you believe Phoebe got pregnant?!"}, {"line_number": 87, "type": "dialogue", "speaker": "Rachel", "text": "Oh yknow what honey? Lets not talk about that right now?"}, {"line_number": 88, "type": "dialogue", "speaker": "Monica", "text": "This is so huge."}, {"line_number": 89, "type": "dialogue", "speaker": "Rachel", "text": "Sure, but come on, as big as your wedding?"}, {"line_number": 90, "type": "dialogue", "speaker": "Monica", "text": "Of course not nothing is. Between me and you"}, {"line_number": 91, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 92, "type": "dialogue", "speaker": "Monica", "text": "in this day and age how dumb do you have to be to get pregnant?"}, {"line_number": 93, "type": "dialogue", "speaker": "Rachel", "text": "Hey! Yknow, sometimes you can do everything right, everyone can wear everything theyre supposed to wear, and one of those little guys just gets through!"}, {"line_number": 94, "type": "dialogue", "speaker": "Monica", "text": "How?"}, {"line_number": 95, "type": "dialogue", "speaker": "Rachel", "text": "I dont know! Maybe they have tools."}, {"line_number": 96, "type": "dialogue", "speaker": "Monica", "text": "Well I-I talked to and uh, shes definitely going to have this baby. Yknow, she said she was gonna raise it on her own."}, {"line_number": 97, "type": "dialogue", "speaker": "Rachel", "text": "Well, maybe thats, maybe thats really brave."}, {"line_number": 98, "type": "dialogue", "speaker": "Monica", "text": "Maybe. I just hope she realizes how hard its gonna be."}, {"line_number": 99, "type": "dialogue", "speaker": "Rachel", "text": "Maybe she hasnt really thought it through that well."}, {"line_number": 100, "type": "dialogue", "speaker": "Monica", "text": "Well, theres a lot to think about. I mean, how is she, how is she going to handle this financially? How is she going to juggle work? Does she realize shes not going to have a date again for the next eighteen years?"}, {"line_number": 101, "type": "dialogue", "speaker": "Rachel", "text": "(starting to cry) I dont know."}, {"line_number": 102, "type": "dialogue", "speaker": "Monica", "text": "Are you okay?"}, {"line_number": 103, "type": "dialogue", "speaker": "Rachel", "text": "Uh-hmm. Im just thinking about Phoebe; poor knocked up Phoebe."}, {"line_number": 104, "type": "dialogue", "speaker": "Waiter", "text": "Champagne?"}, {"line_number": 105, "type": "dialogue", "speaker": "Rachel", "text": "Oh yes! Thank you very much! (She grabs a glass, takes a sip, and realizes what she just did. She then tries to spit the champagne back into the glass without Monica noticing. It doesnt work.) Oh thats-thats actually how the French drink it."}, {"line_number": 106, "type": "action", "text": "(Monica gasps.)"}, {"line_number": 107, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 5, "scene_id": "S08E01_005", "location": "continued from earlier", "scene_description": "only now Phoebe joins them.", "characters": ["Ashley", "Bandleader", "Chandler", "Dennis Phillips", "Fat Girl", "Gert", "Joey", "Little Girl", "Mona", "Monica", "Phoebe", "Rachel", "Ross", "Second Girl"], "firestore_path": "/episodes/S08E01/scenes/S08E01_005", "raw_text": "[Scene: continued from earlier, only now Phoebe joins them.]\nPhoebe: Well, I just got off the phone with my lover, James Brolin\nMonica: Oh really?!\nPhoebe: Yes, and apparently he is married to some singer, but he said he would leave her for me. And I said, \"James, James Brolin, are you sure?\" James Brolin said\nMonica: (interrupting) Rachels really the one whos pregnant.\nPhoebe: (shocked) What?! (deadpan) Why bother?\nMonica: How do you feel?\nRachel: I dont know. I dont know how I feel. This is all happening so fast. I have to make all these decisions that I dont want to make. (Takes another sip of champagne and spits it back out) Somebody just take this away from me!!\nPhoebe: Calm down. Maybe youre not pregnant.\nRachel: What?!\nPhoebe: When I got pregnant with the triplets, I took that test like three times just to make sure.\nMonica: Yes! Maybe its a false positive. Are you sure you peed on the stick right?\nRachel: How many ways are there to do that?\nPhoebe: Im-Im just saying, dont freak out until youre a hundred percent sure.\nRachel: All right, Ill-Ill take it again when I get home.\nMonica: You-you gotta take it now. Come on, do it as a present to me.\nRachel: Okay. Thank you.\nMonica: Okay.\nPhoebe: Ill run out and get you one.\nRachel: Oh, you guys are so great.\nMonica: Oh, wait a minute! Whos is the father?!\nPhoebe: Oh no, she wont tell us.\nMonica: Oh, come on its my wedding! That can be my present.\nRachel: WhHey, I just gave you peeing on a stick.\nPhoebe: See? This is why you register.\n[Cut to Ross at the kiddie table. He reaches for something and a fart noise emanates which causes the kids to laugh.]\nRoss: It was the chair again! Okay? Im not doing it! It whatlook, I dontyknow whateh-eh (He walks away and goes over to Mona.) Hi.\nMona: Hi!\nRoss: Umm, would you like to dance?\nMona: Sure.\nRoss: Yeah?\nMona: Yeah.\nRoss: Oh great! (They get up to dance and Ross is interrupted by a little girl.)\nLittle Girl: Dr. Geller?\nRoss: I wasnt farting! (To Mona) Uh, a little game from our table. (To the little girl) Yes?\nLittle Girl: Dr. Geller, will you dance with me?\nRoss: Oh umm, well uh, maybe-maybe later. Right now, Im about to dance with this lady. \nLittle Girl: Okay. (She drops her head in disappointment and walks away.)\nMona: Ohhhh!\nRoss: Uh, unless! Unless, uh this lady wouldnt mind letting you go first.\nMona: Id be happy to. (To Ross) You are very sweet.\nRoss: Yes I-I am. In fact umm hey, why dont we try it my special way? You can dance on my feet.\nLittle Girl: Sure!\nRoss: Yeah? Hop on. (They start dancing and Mona sits down.) Is the pretty lady looking?\nLittle Girl: Uh-huh.\nRoss: Keep dancing.\n[Cut to Chandler in the hallway practicing dancing and is doing it very well.]\nChandler: And the world will never know.\nJoey: Hey! Did you talk to Dennis about me yet?\nChandler: Yes, I told him how talented you were. I told him all about Days Of Our Lives.\nJoey: No-no! No! No! You dont tell a Broadway guy that! Now he just thinks Im a soap actor.\nChandler: But youre not just a soap actor. You are a soap actor with freakishly tiny feet.\nJoey: Hey!\n[Joey walks back inside just as Rosss dance is finishing.]\nLittle Girl: Thank you.\nRoss: No-no, thank you Miranda.\nLittle Girl: Melinda!\nRoss: All right. (Walks over to Mona.)\nMona: How cute was that?\nRoss: Oh-oh, were you, were you watching?\n(Another little girl walks over to him.)\nSecond Girl: Can I go next?\nRoss: What? Of course you can! Hop on!\nMona: Okay, but I get to hop on after her. (Ross bites the air in response.)\nRoss: I am so gonna score.\nSecond Girl: What?\nRoss: I like your bow.\n[Behind them, Joey goes up to the bandleader and interrupts the song.]\nJoey: (clinks his glass) Id like to propose a toast. To Monica and Chandler, the greatest couple in the world. And my best friends. Now, my when I first found out they were getting married I was, I was a little angry. I was like, (overly angry) \"Why God? Why? How can you take them away from me?!\" But then I thought back over all our memories together, some happy memories. (Does a fake laugh.) And-and there was some sad memories. (Starts to break down and cry.) Im sorry. And-and some scared memoriesWhoa! (He jumps back, startled.) Eh? And then, and then I realized Ill always be their friend, their friend who can speak in many dialects and has training in stage combat and is willing to do partial nudity. (Starts to walk away, but realizes something.) Oh! To the happy couple!\n[Time Lapse, the interrupted song is finishing.]\nBandleader: Thank you.\nRoss: (to the second girl) That was very nice Ashley.\nAshley: Can we do it again?\nRoss: No-no. (Walks over to Mona again.) \nMona: So, is it my turn now?\n(A large little fat girl walks over.)\nFat Girl: Im next!\nRoss: Oh! (Recoils in horror.)\nMona: Uh, thats okay. You can dance with her first.\nRoss: Oh, you-you sure? (She nods yes.) Okay. (To the girl) Okay. So whats uh, whats your name.\nFat Girl: Gert!\nRoss: Thats, thats pretty. (They start to dance and Gert tries to step on Rosss feet, but he pulls them out of harms way.) Whoa! Whoa! Whoa! What are you doing there Gert?\nGert: Dancing on your feet! Like the other girls did it.\nRoss: Okay. (Swallows hard.) Hop on Gert. (She does and Ross winces in pain.)\nGert: Why arent you moving your feet?\nRoss: Im trying. (He strains to move his feet.)\nGert: Faster! Youre not going fast enough!\nRoss: Maybe I should stand on your feet! (Gerts shocked and Ross realizes what he said and tries to brush it off.)\n[Cut to Joey going over to talk to Dennis Phillips.]\nJoey: So did you uh, happen to catch my toast up there?\nDennis Phillips: Oh my God, that was for my benefit?\nJoey: Well, Id like to think there was something for everyone. Look, I know youre casting for this new show\nDennis Phillips: Look umm Joey, I-I dont think youre quite right for this project.\nJoey: Oh, see thats where youre wrong. Whatever it is I can do it. And if didnt see it up there, just-just try me.\nDennis Phillips: Its an all Chinese cast. Can you be Chinese?\nJoey: Well Im not proud of this, but (He turns around and starts to mess with his eyelids.)\nDennis Phillips: Oh my God! No-no-no! Please! Please! Dont-dont-dont!\n[Cut to Monica walking up to Chandler.]\nMonica: Hey, are you ready to get back on the dance floor?\nChandler: Did it turn into sand?\nMonica: Ohh come on, I love this song! Come on, youll be fine. (She starts to walk towards the floor.)\nChandler: (sliding up behind her) No. No, I wont. Do you know why I took all those lessons? See, for the first time I didnt want you to be embarrassed to be seen on the dance floor with some clumsy idiot.\nMonica: Oh sweetie, you can never embarrass me. (Chandler grunts.) Okay, you can easily embarrass me. But come on, it doesnt matter. All right? I married you! So I want to dance on my wedding night with my husband. Come on. (They go onto the floor.) Just try not to move your feet at all. (Chandler starts to get into the groove and bust a move.) There you go.\n(Mr. Geller dances over.)\nMr. Geller: Chandler, Im gonna have you arrested.\nChandler: Why?\nMr. Geller: You stole my moves. (He starts to dance like Chandler was and Chandler stops.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: continued from earlier, only now Phoebe joins them.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Well, I just got off the phone with my lover, James Brolin"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Oh really?!"}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, and apparently he is married to some singer, but he said he would leave her for me. And I said, \"James, James Brolin, are you sure?\" James Brolin said"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(interrupting) Rachels really the one whos pregnant."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "(shocked) What?! (deadpan) Why bother?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "How do you feel?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "I dont know. I dont know how I feel. This is all happening so fast. I have to make all these decisions that I dont want to make. (Takes another sip of champagne and spits it back out) Somebody just take this away from me!!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Calm down. Maybe youre not pregnant."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "When I got pregnant with the triplets, I took that test like three times just to make sure."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Yes! Maybe its a false positive. Are you sure you peed on the stick right?"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "How many ways are there to do that?"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Im-Im just saying, dont freak out until youre a hundred percent sure."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "All right, Ill-Ill take it again when I get home."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "You-you gotta take it now. Come on, do it as a present to me."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Okay. Thank you."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Ill run out and get you one."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Oh, you guys are so great."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Oh, wait a minute! Whos is the father?!"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Oh no, she wont tell us."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Oh, come on its my wedding! That can be my present."}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "WhHey, I just gave you peeing on a stick."}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "See? This is why you register."}, {"line_number": 26, "type": "narration", "text": "[Cut to Ross at the kiddie table. He reaches for something and a fart noise emanates which causes the kids to laugh.]"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "It was the chair again! Okay? Im not doing it! It whatlook, I dontyknow whateh-eh (He walks away and goes over to Mona.) Hi."}, {"line_number": 28, "type": "dialogue", "speaker": "Mona", "text": "Hi!"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Umm, would you like to dance?"}, {"line_number": 30, "type": "dialogue", "speaker": "Mona", "text": "Sure."}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "Yeah?"}, {"line_number": 32, "type": "dialogue", "speaker": "Mona", "text": "Yeah."}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "Oh great! (They get up to dance and Ross is interrupted by a little girl.)"}, {"line_number": 34, "type": "dialogue", "speaker": "Little Girl", "text": "Dr. Geller?"}, {"line_number": 35, "type": "dialogue", "speaker": "Ross", "text": "I wasnt farting! (To Mona) Uh, a little game from our table. (To the little girl) Yes?"}, {"line_number": 36, "type": "dialogue", "speaker": "Little Girl", "text": "Dr. Geller, will you dance with me?"}, {"line_number": 37, "type": "dialogue", "speaker": "Ross", "text": "Oh umm, well uh, maybe-maybe later. Right now, Im about to dance with this lady. "}, {"line_number": 38, "type": "dialogue", "speaker": "Little Girl", "text": "Okay. (She drops her head in disappointment and walks away.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Mona", "text": "Ohhhh!"}, {"line_number": 40, "type": "dialogue", "speaker": "Ross", "text": "Uh, unless! Unless, uh this lady wouldnt mind letting you go first."}, {"line_number": 41, "type": "dialogue", "speaker": "Mona", "text": "Id be happy to. (To Ross) You are very sweet."}, {"line_number": 42, "type": "dialogue", "speaker": "Ross", "text": "Yes I-I am. In fact umm hey, why dont we try it my special way? You can dance on my feet."}, {"line_number": 43, "type": "dialogue", "speaker": "Little Girl", "text": "Sure!"}, {"line_number": 44, "type": "dialogue", "speaker": "Ross", "text": "Yeah? Hop on. (They start dancing and Mona sits down.) Is the pretty lady looking?"}, {"line_number": 45, "type": "dialogue", "speaker": "Little Girl", "text": "Uh-huh."}, {"line_number": 46, "type": "dialogue", "speaker": "Ross", "text": "Keep dancing."}, {"line_number": 47, "type": "narration", "text": "[Cut to Chandler in the hallway practicing dancing and is doing it very well.]"}, {"line_number": 48, "type": "dialogue", "speaker": "Chandler", "text": "And the world will never know."}, {"line_number": 49, "type": "dialogue", "speaker": "Joey", "text": "Hey! Did you talk to Dennis about me yet?"}, {"line_number": 50, "type": "dialogue", "speaker": "Chandler", "text": "Yes, I told him how talented you were. I told him all about Days Of Our Lives."}, {"line_number": 51, "type": "dialogue", "speaker": "Joey", "text": "No-no! No! No! You dont tell a Broadway guy that! Now he just thinks Im a soap actor."}, {"line_number": 52, "type": "dialogue", "speaker": "Chandler", "text": "But youre not just a soap actor. You are a soap actor with freakishly tiny feet."}, {"line_number": 53, "type": "dialogue", "speaker": "Joey", "text": "Hey!"}, {"line_number": 54, "type": "narration", "text": "[Joey walks back inside just as Rosss dance is finishing.]"}, {"line_number": 55, "type": "dialogue", "speaker": "Little Girl", "text": "Thank you."}, {"line_number": 56, "type": "dialogue", "speaker": "Ross", "text": "No-no, thank you Miranda."}, {"line_number": 57, "type": "dialogue", "speaker": "Little Girl", "text": "Melinda!"}, {"line_number": 58, "type": "dialogue", "speaker": "Ross", "text": "All right. (Walks over to Mona.)"}, {"line_number": 59, "type": "dialogue", "speaker": "Mona", "text": "How cute was that?"}, {"line_number": 60, "type": "dialogue", "speaker": "Ross", "text": "Oh-oh, were you, were you watching?"}, {"line_number": 61, "type": "action", "text": "(Another little girl walks over to him.)"}, {"line_number": 62, "type": "dialogue", "speaker": "Second Girl", "text": "Can I go next?"}, {"line_number": 63, "type": "dialogue", "speaker": "Ross", "text": "What? Of course you can! Hop on!"}, {"line_number": 64, "type": "dialogue", "speaker": "Mona", "text": "Okay, but I get to hop on after her. (Ross bites the air in response.)"}, {"line_number": 65, "type": "dialogue", "speaker": "Ross", "text": "I am so gonna score."}, {"line_number": 66, "type": "dialogue", "speaker": "Second Girl", "text": "What?"}, {"line_number": 67, "type": "dialogue", "speaker": "Ross", "text": "I like your bow."}, {"line_number": 68, "type": "narration", "text": "[Behind them, Joey goes up to the bandleader and interrupts the song.]"}, {"line_number": 69, "type": "dialogue", "speaker": "Joey", "text": "(clinks his glass) Id like to propose a toast. To Monica and Chandler, the greatest couple in the world. And my best friends. Now, my when I first found out they were getting married I was, I was a little angry. I was like, (overly angry) \"Why God? Why? How can you take them away from me?!\" But then I thought back over all our memories together, some happy memories. (Does a fake laugh.) And-and there was some sad memories. (Starts to break down and cry.) Im sorry. And-and some scared memoriesWhoa! (He jumps back, startled.) Eh? And then, and then I realized Ill always be their friend, their friend who can speak in many dialects and has training in stage combat and is willing to do partial nudity. (Starts to walk away, but realizes something.) Oh! To the happy couple!"}, {"line_number": 70, "type": "narration", "text": "[Time Lapse, the interrupted song is finishing.]"}, {"line_number": 71, "type": "dialogue", "speaker": "Bandleader", "text": "Thank you."}, {"line_number": 72, "type": "dialogue", "speaker": "Ross", "text": "(to the second girl) That was very nice Ashley."}, {"line_number": 73, "type": "dialogue", "speaker": "Ashley", "text": "Can we do it again?"}, {"line_number": 74, "type": "dialogue", "speaker": "Ross", "text": "No-no. (Walks over to Mona again.) "}, {"line_number": 75, "type": "dialogue", "speaker": "Mona", "text": "So, is it my turn now?"}, {"line_number": 76, "type": "action", "text": "(A large little fat girl walks over.)"}, {"line_number": 77, "type": "dialogue", "speaker": "Fat Girl", "text": "Im next!"}, {"line_number": 78, "type": "dialogue", "speaker": "Ross", "text": "Oh! (Recoils in horror.)"}, {"line_number": 79, "type": "dialogue", "speaker": "Mona", "text": "Uh, thats okay. You can dance with her first."}, {"line_number": 80, "type": "dialogue", "speaker": "Ross", "text": "Oh, you-you sure? (She nods yes.) Okay. (To the girl) Okay. So whats uh, whats your name."}, {"line_number": 81, "type": "dialogue", "speaker": "Fat Girl", "text": "Gert!"}, {"line_number": 82, "type": "dialogue", "speaker": "Ross", "text": "Thats, thats pretty. (They start to dance and Gert tries to step on Rosss feet, but he pulls them out of harms way.) Whoa! Whoa! Whoa! What are you doing there Gert?"}, {"line_number": 83, "type": "dialogue", "speaker": "Gert", "text": "Dancing on your feet! Like the other girls did it."}, {"line_number": 84, "type": "dialogue", "speaker": "Ross", "text": "Okay. (Swallows hard.) Hop on Gert. (She does and Ross winces in pain.)"}, {"line_number": 85, "type": "dialogue", "speaker": "Gert", "text": "Why arent you moving your feet?"}, {"line_number": 86, "type": "dialogue", "speaker": "Ross", "text": "Im trying. (He strains to move his feet.)"}, {"line_number": 87, "type": "dialogue", "speaker": "Gert", "text": "Faster! Youre not going fast enough!"}, {"line_number": 88, "type": "dialogue", "speaker": "Ross", "text": "Maybe I should stand on your feet! (Gerts shocked and Ross realizes what he said and tries to brush it off.)"}, {"line_number": 89, "type": "narration", "text": "[Cut to Joey going over to talk to Dennis Phillips.]"}, {"line_number": 90, "type": "dialogue", "speaker": "Joey", "text": "So did you uh, happen to catch my toast up there?"}, {"line_number": 91, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Oh my God, that was for my benefit?"}, {"line_number": 92, "type": "dialogue", "speaker": "Joey", "text": "Well, Id like to think there was something for everyone. Look, I know youre casting for this new show"}, {"line_number": 93, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Look umm Joey, I-I dont think youre quite right for this project."}, {"line_number": 94, "type": "dialogue", "speaker": "Joey", "text": "Oh, see thats where youre wrong. Whatever it is I can do it. And if didnt see it up there, just-just try me."}, {"line_number": 95, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Its an all Chinese cast. Can you be Chinese?"}, {"line_number": 96, "type": "dialogue", "speaker": "Joey", "text": "Well Im not proud of this, but (He turns around and starts to mess with his eyelids.)"}, {"line_number": 97, "type": "dialogue", "speaker": "Dennis Phillips", "text": "Oh my God! No-no-no! Please! Please! Dont-dont-dont!"}, {"line_number": 98, "type": "narration", "text": "[Cut to Monica walking up to Chandler.]"}, {"line_number": 99, "type": "dialogue", "speaker": "Monica", "text": "Hey, are you ready to get back on the dance floor?"}, {"line_number": 100, "type": "dialogue", "speaker": "Chandler", "text": "Did it turn into sand?"}, {"line_number": 101, "type": "dialogue", "speaker": "Monica", "text": "Ohh come on, I love this song! Come on, youll be fine. (She starts to walk towards the floor.)"}, {"line_number": 102, "type": "dialogue", "speaker": "Chandler", "text": "(sliding up behind her) No. No, I wont. Do you know why I took all those lessons? See, for the first time I didnt want you to be embarrassed to be seen on the dance floor with some clumsy idiot."}, {"line_number": 103, "type": "dialogue", "speaker": "Monica", "text": "Oh sweetie, you can never embarrass me. (Chandler grunts.) Okay, you can easily embarrass me. But come on, it doesnt matter. All right? I married you! So I want to dance on my wedding night with my husband. Come on. (They go onto the floor.) Just try not to move your feet at all. (Chandler starts to get into the groove and bust a move.) There you go."}, {"line_number": 104, "type": "action", "text": "(Mr. Geller dances over.)"}, {"line_number": 105, "type": "narration", "text": "Mr. Geller: Chandler, Im gonna have you arrested."}, {"line_number": 106, "type": "dialogue", "speaker": "Chandler", "text": "Why?"}, {"line_number": 107, "type": "narration", "text": "Mr. Geller: You stole my moves. (He starts to dance like Chandler was and Chandler stops.)"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 6, "scene_id": "S08E01_006", "location": "The Womens Restroom", "scene_description": "Rachel and Phoebe are waiting for the outcome of Rachels second test.", "characters": ["Monica", "Phoebe", "Rachel", "The Girls"], "firestore_path": "/episodes/S08E01/scenes/S08E01_006", "raw_text": "[Scene: The Womens Restroom, Rachel and Phoebe are waiting for the outcome of Rachels second test.]\nRachel: How much longer?\nPhoebe: 30 seconds.\nRachel: 30 seconds, okay.\nMonica: (entering) Did I miss it? (Phoebe nods no.) Rachel, I-I want you to know that, if its positive, were gonna\nRachel: Oh I know. I know. (They hug.)\nPhoebe: Its time.\n(Another woman starts to enter.)\nThe Girls: No!! (The woman backs out.)\nMonica: Go ahead Rach.\n(She goes over to look.)\nRachel: Oh wait! Yknow what? I cant, I cant look at it. I cant. Somebody else tell me, somebody tell me.\nPhoebe: Okay.\nRachel: Okay.\nPhoebe: Umm, its negative.\nRachel: What?\nPhoebe: Its negative.\nRachel: Oh. Oh. Well there you go. Whew! (Pause) That isthats greatthat is really great-great news. (Pause) Yknow cause the whole not being ready and kinda the financial aspects, all that. Whew. Wow, this is so just the way it was supposed to be. (Starts to cry.) God.\nMonica: Well Well, great.\nPhoebe: Here. (Gives Rachel a tissue.)\nRachel: Thanks. (Crying) God this is so stupid! (Pause) How could I be upset over something I never had? Its negative?\nPhoebe: No, its positive.\nRachel: What?!\nPhoebe: Its-its not negative, its positive.\nRachel: Are you sure?\nPhoebe: Well yeah, I lied before.\nRachel: Oh!\nMonica: Oh God\nPhoebe: Now you know how you really feel about it.\nRachel: Oh-oh, thats a risky little game!\nMonica: Are you really gonna do this?\nRachel: Yeah. Im gonna have a baby. Im gonna have a baby. Im gonna have a baby! (They all hug.)\nPhoebe: With who?\nRachel: Ah, its still not the time.\nDedicated to the People of New York City\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Womens Restroom, Rachel and Phoebe are waiting for the outcome of Rachels second test.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "How much longer?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "30 seconds."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "30 seconds, okay."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "(entering) Did I miss it? (Phoebe nods no.) Rachel, I-I want you to know that, if its positive, were gonna"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Oh I know. I know. (They hug.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Its time."}, {"line_number": 8, "type": "action", "text": "(Another woman starts to enter.)"}, {"line_number": 9, "type": "dialogue", "speaker": "The Girls", "text": "No!! (The woman backs out.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Go ahead Rach."}, {"line_number": 11, "type": "action", "text": "(She goes over to look.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Oh wait! Yknow what? I cant, I cant look at it. I cant. Somebody else tell me, somebody tell me."}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Umm, its negative."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Its negative."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Oh. Oh. Well there you go. Whew! (Pause) That isthats greatthat is really great-great news. (Pause) Yknow cause the whole not being ready and kinda the financial aspects, all that. Whew. Wow, this is so just the way it was supposed to be. (Starts to cry.) God."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "Well Well, great."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Here. (Gives Rachel a tissue.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Thanks. (Crying) God this is so stupid! (Pause) How could I be upset over something I never had? Its negative?"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "No, its positive."}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Its-its not negative, its positive."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "Are you sure?"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Well yeah, I lied before."}, {"line_number": 27, "type": "dialogue", "speaker": "Rachel", "text": "Oh!"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Oh God"}, {"line_number": 29, "type": "dialogue", "speaker": "Phoebe", "text": "Now you know how you really feel about it."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Oh-oh, thats a risky little game!"}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Are you really gonna do this?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Yeah. Im gonna have a baby. Im gonna have a baby. Im gonna have a baby! (They all hug.)"}, {"line_number": 33, "type": "dialogue", "speaker": "Phoebe", "text": "With who?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "Ah, its still not the time."}, {"line_number": 35, "type": "narration", "text": "Dedicated to the People of New York City"}, {"line_number": 36, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S08E01", "season": 8, "episode_number": 1, "episode_title": "THE ONE AFTER \"I DO\"", "scene_number": 7, "scene_id": "S08E01_007", "location": "The Reception", "scene_description": "Joey is helping Ross walk after Gert got through with him and Mona is looking on concerned.", "characters": ["Joey", "Mona", "Ross"], "firestore_path": "/episodes/S08E01/scenes/S08E01_007", "raw_text": "[Scene: The Reception, Joey is helping Ross walk after Gert got through with him and Mona is looking on concerned.]\nRoss: I just didnt see the fast song coming.\nJoey: Shh. Shh. Dont try to talk, well get you up to your room, well soak your feet, youll be okay.\nRoss: Oh, thank you.\nMona: That is so sweet!\nJoey: Yeah.\nMona: No, I mean it. There are so few genuinely nice guys out there.\nJoey: Tell me about it, I feel like Im holding down the fort all by myself.\nMona: Its Joey right?\nJoey: Yeah.\nRoss: Wait a minute! No! Im the nice one! Im the one who danced with the kids all night! HowHow small are your feet?! (They all look down.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Reception, Joey is helping Ross walk after Gert got through with him and Mona is looking on concerned.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "I just didnt see the fast song coming."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Shh. Shh. Dont try to talk, well get you up to your room, well soak your feet, youll be okay."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Oh, thank you."}, {"line_number": 5, "type": "dialogue", "speaker": "Mona", "text": "That is so sweet!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Yeah."}, {"line_number": 7, "type": "dialogue", "speaker": "Mona", "text": "No, I mean it. There are so few genuinely nice guys out there."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Tell me about it, I feel like Im holding down the fort all by myself."}, {"line_number": 9, "type": "dialogue", "speaker": "Mona", "text": "Its Joey right?"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Yeah."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Wait a minute! No! Im the nice one! Im the one who danced with the kids all night! HowHow small are your feet?! (They all look down.)"}, {"line_number": 12, "type": "narration", "text": "End"}]}
