{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 1, "scene_id": "S08E21_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S08E21/scenes/S08E21_001", "raw_text": "THE ONE WITH THE COOKING CLASS\nTeleplay by: Brian Buckner & Sebastian Jones Story by: Dana Klein Borkow Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE COOKING CLASS"}, {"line_number": 2, "type": "dialogue", "speaker": "Teleplay by", "text": "Brian Buckner & Sebastian Jones Story by: Dana Klein Borkow Transcribed by: Eric Aasen"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 2, "scene_id": "S08E21_002", "location": "Central Perk", "scene_description": "everyone is there except Monica as Ross enters carrying a huge stack of newspapers.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_002", "raw_text": "[Scene: Central Perk, everyone is there except Monica as Ross enters carrying a huge stack of newspapers.]\nRoss: Hey you guys I got some bad news. (He sets the stack of papers down on the table.)\nPhoebe: Well thats no way to sell newspapers. Why dont you try, \"Extra! Extra! Read all about it!\"\nRoss: No, Monicas restaurant got a horrible review in the Post. (They all gasp.) I didnt want her to see it, so I ran around the neighborhood and bought all the copies I could find. (He hands the paper to Phoebe and they all read it.)\nJoey: Man, this is bad! And Ive had my share of bad reviews. I still remember my first good one though. (Quoting) \"Everything else in this production of Our Town was simply terrible. Joey Tribbiani was abysmal.\"\nMonica: (entering) Hey!\nChandler: Hey.\nMonica: (seeing the stack of newspapers) Oh my God! Look at all the newspapers! It must be a good review! Is it great?!\nRoss: Umm\nMonica: (reading) Oh dear God!\nRoss: But the good news is, no one in a two-block radius will ever know.\nMonica: What about the rest of Manhattan?!\nRoss: Yeah, they all know.\nMonica: Oh my God, this is horrible!\nChandler: Im so sorry.\nMonica: Im so humiliated!\nRachel: Yeah but yknow what they say Mon, \"Theres no such thing as bad press.\"\nMonica: You dont think that umm, (reading) \"The chefs Mahi Mahi was awful awful,\" is bad press?\nRachel: I didnt write it.\nMonica: Is he right? Am I reallyAm I awful?\nAll: No!\nJoey: Yeah! Yeah Monica! You listen to me, okay? And Im not just saying this because Im your friend, Im sayin it cause its the truth. Youre food is abysmal!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, everyone is there except Monica as Ross enters carrying a huge stack of newspapers.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey you guys I got some bad news. (He sets the stack of papers down on the table.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Well thats no way to sell newspapers. Why dont you try, \"Extra! Extra! Read all about it!\""}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "No, Monicas restaurant got a horrible review in the Post. (They all gasp.) I didnt want her to see it, so I ran around the neighborhood and bought all the copies I could find. (He hands the paper to Phoebe and they all read it.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Man, this is bad! And Ive had my share of bad reviews. I still remember my first good one though. (Quoting) \"Everything else in this production of Our Town was simply terrible. Joey Tribbiani was abysmal.\""}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "(entering) Hey!"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Hey."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "(seeing the stack of newspapers) Oh my God! Look at all the newspapers! It must be a good review! Is it great?!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Umm"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "(reading) Oh dear God!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "But the good news is, no one in a two-block radius will ever know."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "What about the rest of Manhattan?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Yeah, they all know."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Oh my God, this is horrible!"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Im so sorry."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Im so humiliated!"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Yeah but yknow what they say Mon, \"Theres no such thing as bad press.\""}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "You dont think that umm, (reading) \"The chefs Mahi Mahi was awful awful,\" is bad press?"}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "I didnt write it."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Is he right? Am I reallyAm I awful?"}, {"line_number": 21, "type": "dialogue", "speaker": "All", "text": "No!"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Yeah! Yeah Monica! You listen to me, okay? And Im not just saying this because Im your friend, Im sayin it cause its the truth. Youre food is abysmal!"}, {"line_number": 23, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 3, "scene_id": "S08E21_003", "location": "Ross and Rachel's", "scene_description": "its late at night, Rachel is sitting on the couch in the dark wide-awake as Ross walks to the bathroom.", "characters": ["Chandler", "Joey", "Monica", "Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_003", "raw_text": "[Scene: Ross and Rachel's, its late at night, Rachel is sitting on the couch in the dark wide-awake as Ross walks to the bathroom.]\nRachel: Ross!\nRoss: (startling him) What?! What?\nRachel: I am freaking out!\nRoss: Are ya?\nRachel: My due date is in one week! \nRoss: What are you doing up?\nRachel: That is seven days!\nRoss: Okay look, I had a lot of water before I went to bed. Can we do this after\nRachel: (interrupting him) No-no-no-no-no Ross! Please, come on we do not have any of the big stuff we need! We do not a changing table! We do not have a crib! We do not have a diaper service!\nRoss: Its funny you should mention diapers.\nRachel: Im serious.\nRoss: Okay look, theres nothing to worry about. We have plenty of time. Theres a great baby furniture store on west 10th. Tomorrow, we will go there and we will get you everything that you need. Okay?\nRachel: Okay. Thank you. Thats great. Thank you. Wait-wait! Where on west 10th? Because theres this really cute shoe store that has like this little\nRoss: (interrupting her) Okay. Okay. If uh, if youre gonna do this, then Im gonna do that. (Points to the bathroom.) So (Starts for the bathroom.)\nRachel: (stopping him) Oh, wait Ross! Im sorry, one more thing!\nRoss: (annoyed) Yeah!\nRachel: Umm, our situation. Yknow umm, what we mean to each other. And I mean we-were having this baby together, and we live together. Isnt that, isnt that weird?\nRoss: (stunned) (thinks) Well uh\nRachel: Im just kidding! You can go pee! (He does so in a hurry.)\n[Scene: Monica and Chandler's, Monica is cooking as Chandler looks on.\nJoey: (entering) Hey uh Monica, I cant remember. Did we say we were gonna meet here or at the movies?\nMonica: We said at the movies, but\nJoey: Okay, Ill see you there. (Starts to leave) \nMonica: Joey! (He returns) Now that youre here\nJoey: Sure, I can hang out til I have to meet ya. (To Chandler) What uhHow come youre not going?\nChandler: I have a job interview I have to get ready for.\nJoey: I thought you already have a job.\nChandler: And people say you dont pay attention. No, this is a much better job. Its vice-president of a company that does data reconfiguration and statistical factoring for other companies.\nJoey: Wow! How do you know how to do that?!\nChandler: Thats what I do now.\nMonica: Hey Joey, come taste this.\nJoey: What is it?\nMonica: Remember that guy that gave me a bad review? Well (Feeds him a spoonful of what shes cooking.) Im getting my revenge!\nJoey: You cooked him?\nMonica: No. He teaches a course on food criticism at the New School, so before we go to the movies I wanna go by there and make him try my bouillabaisse again. Oh, I cannot wait to read the front page of the Post tomorrow! \"Restaurant reviewer admits: I was wrong about Monica.\"\nChandler: The front page? You really do live in your own little world, dont ya?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, its late at night, Rachel is sitting on the couch in the dark wide-awake as Ross walks to the bathroom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Ross!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(startling him) What?! What?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "I am freaking out!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Are ya?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "My due date is in one week! "}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "What are you doing up?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "That is seven days!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Okay look, I had a lot of water before I went to bed. Can we do this after"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "(interrupting him) No-no-no-no-no Ross! Please, come on we do not have any of the big stuff we need! We do not a changing table! We do not have a crib! We do not have a diaper service!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Its funny you should mention diapers."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Im serious."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Okay look, theres nothing to worry about. We have plenty of time. Theres a great baby furniture store on west 10th. Tomorrow, we will go there and we will get you everything that you need. Okay?"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Okay. Thank you. Thats great. Thank you. Wait-wait! Where on west 10th? Because theres this really cute shoe store that has like this little"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "(interrupting her) Okay. Okay. If uh, if youre gonna do this, then Im gonna do that. (Points to the bathroom.) So (Starts for the bathroom.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "(stopping him) Oh, wait Ross! Im sorry, one more thing!"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "(annoyed) Yeah!"}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Umm, our situation. Yknow umm, what we mean to each other. And I mean we-were having this baby together, and we live together. Isnt that, isnt that weird?"}, {"line_number": 19, "type": "dialogue", "speaker": "Ross", "text": "(stunned) (thinks) Well uh"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Im just kidding! You can go pee! (He does so in a hurry.)"}, {"line_number": 21, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica is cooking as Chandler looks on."}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey uh Monica, I cant remember. Did we say we were gonna meet here or at the movies?"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "We said at the movies, but"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Okay, Ill see you there. (Starts to leave) "}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Joey! (He returns) Now that youre here"}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Sure, I can hang out til I have to meet ya. (To Chandler) What uhHow come youre not going?"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "I have a job interview I have to get ready for."}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "I thought you already have a job."}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "And people say you dont pay attention. No, this is a much better job. Its vice-president of a company that does data reconfiguration and statistical factoring for other companies."}, {"line_number": 30, "type": "dialogue", "speaker": "Joey", "text": "Wow! How do you know how to do that?!"}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "Thats what I do now."}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "Hey Joey, come taste this."}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "What is it?"}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "Remember that guy that gave me a bad review? Well (Feeds him a spoonful of what shes cooking.) Im getting my revenge!"}, {"line_number": 35, "type": "dialogue", "speaker": "Joey", "text": "You cooked him?"}, {"line_number": 36, "type": "dialogue", "speaker": "Monica", "text": "No. He teaches a course on food criticism at the New School, so before we go to the movies I wanna go by there and make him try my bouillabaisse again. Oh, I cannot wait to read the front page of the Post tomorrow! \"Restaurant reviewer admits: I was wrong about Monica.\""}, {"line_number": 37, "type": "dialogue", "speaker": "Chandler", "text": "The front page? You really do live in your own little world, dont ya?"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 4, "scene_id": "S08E21_004", "location": "The Baby Furniture Store", "scene_description": "Ross and Rachel are checking out.", "characters": ["Cashier", "Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_004", "raw_text": "[Scene: The Baby Furniture Store, Ross and Rachel are checking out.]\nCashier: Do you uh, want these things delivered Mr. and Mrs. Geller?\nRachel: Oh.\nRoss: Oh.\nRachel: No-no-no! No, no, no, were not married.\nRoss: We are having a baby together, but were not involved. (The cashier, a very beautiful woman, looks confused) I mean, uh we-we were seeing each other a while ago, but then we were just friends. And then there was one drunken night. (Rachel looks at him angrily) Or, yes stranger, wed like this delivered please.\nCashier: Why dont you fill out this address card. (Hands him one.)\nRoss: Oh, okay.\nCashier: I notice you picked out a lot of our dinosaur items.\nRachel: Oh yeah! Actually, thats one of the reasons why were not a couple.\nRoss: I chose those, Im a paleontologist.\nCashier: Really?! That is so cool!\nRachel: Oh. Oh yeah, dont get to worked up over it. I mean it-it sounds like hes a doctor, but hes not.\nCashier: Oh no-no, Im fascinated by paleontology. Have you read the new Walter Alvarez book?\nRoss: Yeah! I-I teach it in my class.\nRachel: Oh my God! Im standing at a cash register, holding a credit card, and Im bored.\nCashier: (looking at the completed address card) Oh, I love your neighborhood. Theres a great gym right around the corner from your building.\nRoss: Thats my gym.\nCashier: I can tell you work out. (Ross is please and Rachel looks at him confused.) A paleontologist who works out, youre like Indiana Jones. (Rachel has a disbelieving look on her face.)\nRoss: I am like Indiana Jones.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Baby Furniture Store, Ross and Rachel are checking out.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Cashier", "text": "Do you uh, want these things delivered Mr. and Mrs. Geller?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Oh."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Oh."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "No-no-no! No, no, no, were not married."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "We are having a baby together, but were not involved. (The cashier, a very beautiful woman, looks confused) I mean, uh we-we were seeing each other a while ago, but then we were just friends. And then there was one drunken night. (Rachel looks at him angrily) Or, yes stranger, wed like this delivered please."}, {"line_number": 7, "type": "dialogue", "speaker": "Cashier", "text": "Why dont you fill out this address card. (Hands him one.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Oh, okay."}, {"line_number": 9, "type": "dialogue", "speaker": "Cashier", "text": "I notice you picked out a lot of our dinosaur items."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah! Actually, thats one of the reasons why were not a couple."}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "I chose those, Im a paleontologist."}, {"line_number": 12, "type": "dialogue", "speaker": "Cashier", "text": "Really?! That is so cool!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Oh. Oh yeah, dont get to worked up over it. I mean it-it sounds like hes a doctor, but hes not."}, {"line_number": 14, "type": "dialogue", "speaker": "Cashier", "text": "Oh no-no, Im fascinated by paleontology. Have you read the new Walter Alvarez book?"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Yeah! I-I teach it in my class."}, {"line_number": 16, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God! Im standing at a cash register, holding a credit card, and Im bored."}, {"line_number": 17, "type": "dialogue", "speaker": "Cashier", "text": "(looking at the completed address card) Oh, I love your neighborhood. Theres a great gym right around the corner from your building."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Thats my gym."}, {"line_number": 19, "type": "dialogue", "speaker": "Cashier", "text": "I can tell you work out. (Ross is please and Rachel looks at him confused.) A paleontologist who works out, youre like Indiana Jones. (Rachel has a disbelieving look on her face.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "I am like Indiana Jones."}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 5, "scene_id": "S08E21_005", "location": "Central Perk", "scene_description": "Phoebe is there as Rachel enters.", "characters": ["Chandler", "Phoebe", "Rachel"], "firestore_path": "/episodes/S08E21/scenes/S08E21_005", "raw_text": "[Scene: Central Perk, Phoebe is there as Rachel enters.]\nRachel: Hi Pheebs!\nPhoebe: Hey! Oh, how did baby shopping go?\nRachel: Oh, it was great! We got everything that we needed! Oh and Ross, almost got something that wasnt on the list. A whore.\nPhoebe: What?!\nRachel: Well, we were paying for our stuff and this saleswoman just started flirting with him.\nPhoebe: Well did she know you two werent married?\nRachel: Yeah.\nPhoebe: Oh my God! Well the idea of a woman flirting with a-with a single man, we-we must alert the church elders!\nRachel: You dont understand! You didnt see how brazen she was.\nPhoebe: Sounds like youre a little jealous.\nRachel: No! Im not! I-I-I just think its wrong! Its-its that ImHere I am about to pop and hes out picking up some shop girl at Sluts R Us!\nPhoebe: Is that a real place? (Rachels stunned) Are they hiring?\nChandler: (entering) Hey Phoebe! (To Rachel) Fatty!\nPhoebe: Hey Chandler, why so fancy?\nChandler: Well, I got a job interview. Its kinda a big deal too. Its a lot more money and Id be doing data reconfiguration and statistical factoring.\nPhoebe: Wait, I think I know someone who does that.\nChandler: Me! I do that. So Seriously, do I look okay? Im little nervous.\nRachel: Oh yeah! You reallyYou look great.\nPhoebe: Yeah, just dont get your hopes up.\nChandler: Why not?\nPhoebe: Well, the interview\nChandler: What about it?\nPhoebe: Yknow! You dont make a very good first impression.\nChandler: (shocked) What?!\nPhoebe: Oh you dont know.\nChandler: Are you serious?!\nPhoebe: Yes, when I first met you, you were like, \"Blah, blah, blah.\" I was like, shhh!\nChandler: What is it that I do?\nPhoebe: Well its just like youre trying too hard. Always making jokes, yknow, you justYou come off a little needy.\nChandler: (To Rachel) Did you like me when we first met?\nRachel: Chandler, Im not gonna lie to ya, but I am gonna run away from you. (Gets up and hurries out.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Phoebe is there as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hi Pheebs!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Hey! Oh, how did baby shopping go?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Oh, it was great! We got everything that we needed! Oh and Ross, almost got something that wasnt on the list. A whore."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "What?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Well, we were paying for our stuff and this saleswoman just started flirting with him."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Well did she know you two werent married?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God! Well the idea of a woman flirting with a-with a single man, we-we must alert the church elders!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "You dont understand! You didnt see how brazen she was."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Sounds like youre a little jealous."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "No! Im not! I-I-I just think its wrong! Its-its that ImHere I am about to pop and hes out picking up some shop girl at Sluts R Us!"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Is that a real place? (Rachels stunned) Are they hiring?"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "(entering) Hey Phoebe! (To Rachel) Fatty!"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Hey Chandler, why so fancy?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Well, I got a job interview. Its kinda a big deal too. Its a lot more money and Id be doing data reconfiguration and statistical factoring."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Wait, I think I know someone who does that."}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Me! I do that. So Seriously, do I look okay? Im little nervous."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah! You reallyYou look great."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, just dont get your hopes up."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Why not?"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Well, the interview"}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "What about it?"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Yknow! You dont make a very good first impression."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "(shocked) What?!"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Oh you dont know."}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "Are you serious?!"}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "Yes, when I first met you, you were like, \"Blah, blah, blah.\" I was like, shhh!"}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "What is it that I do?"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Well its just like youre trying too hard. Always making jokes, yknow, you justYou come off a little needy."}, {"line_number": 31, "type": "dialogue", "speaker": "Chandler", "text": "(To Rachel) Did you like me when we first met?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Chandler, Im not gonna lie to ya, but I am gonna run away from you. (Gets up and hurries out.)"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 6, "scene_id": "S08E21_006", "location": "The New School", "scene_description": "Monica, carrying her dish, and Joey are confronting the food critic.", "characters": ["Joey", "Monica", "The Cooking Teacher", "The Food Critic"], "firestore_path": "/episodes/S08E21/scenes/S08E21_006", "raw_text": "[Scene: The New School, Monica, carrying her dish, and Joey are confronting the food critic.]\nMonica: Hi! Umm, Im Monica Geller, Im the chef at Alessandros.\nThe Food Critic: Still?\nMonica: I think the things that you said about me are really unfair, and I would like for you to give my bouillabaisse another chance.\nThe Food Critic: I dont see any reason why I would do that to myself again.\nJoey: Either eat it, or be in it.\nMonica: Spoon? (Hands him one and he tastes it.) So, what do you think?\nThe Food Critic: Im torn, between my integrity and my desire to avoid a beating. But I must be honest, your soap is abysmal. (Throws down the spoon and walks out.)\nJoey: Thata girl! Huh? We should get out of here; theres a new class comin in.\n(They start to leave.)\nThe Cooking Teacher: Welcome to introduction to cooking. Now, before we start, can anyone tell me the difference between a hollandaise sauce and a bearnaise sauce? (No one can.)\nMonica: I can.\nThe Cooking Teacher: Okay, go ahead.\nMonica: Well umm, they both have a egg yolk and butter base, but a bearnaise has shallots, shirvel, and most importantly tarragon. \nThe Cooking Teacher: Thats very good, whats your name?\nMonica: Monica.\nThe Cooking Teacher: Monica, you go to the head of the class.\nMonica: Okay. (Does so.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The New School, Monica, carrying her dish, and Joey are confronting the food critic.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Hi! Umm, Im Monica Geller, Im the chef at Alessandros."}, {"line_number": 3, "type": "dialogue", "speaker": "The Food Critic", "text": "Still?"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "I think the things that you said about me are really unfair, and I would like for you to give my bouillabaisse another chance."}, {"line_number": 5, "type": "dialogue", "speaker": "The Food Critic", "text": "I dont see any reason why I would do that to myself again."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Either eat it, or be in it."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Spoon? (Hands him one and he tastes it.) So, what do you think?"}, {"line_number": 8, "type": "dialogue", "speaker": "The Food Critic", "text": "Im torn, between my integrity and my desire to avoid a beating. But I must be honest, your soap is abysmal. (Throws down the spoon and walks out.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Thata girl! Huh? We should get out of here; theres a new class comin in."}, {"line_number": 10, "type": "action", "text": "(They start to leave.)"}, {"line_number": 11, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Welcome to introduction to cooking. Now, before we start, can anyone tell me the difference between a hollandaise sauce and a bearnaise sauce? (No one can.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "I can."}, {"line_number": 13, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Okay, go ahead."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Well umm, they both have a egg yolk and butter base, but a bearnaise has shallots, shirvel, and most importantly tarragon. "}, {"line_number": 15, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Thats very good, whats your name?"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Monica."}, {"line_number": 17, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Monica, you go to the head of the class."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Okay. (Does so.)"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 7, "scene_id": "S08E21_007", "location": "Ross and Rachel's", "scene_description": "Ross and Rachel are unpacking and setting up their new purchases.", "characters": ["Katie", "Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_007", "raw_text": "[Scene: Ross and Rachel's, Ross and Rachel are unpacking and setting up their new purchases.]\nRachel: All this stuff takes up a lot of room. Hey how uh, how serious are you about keeping Ben in your life?\nRoss: My son? Pretty serious. (Theres a knock on the door and Ross answers it.) Oh hey Katie! (The cashier from before) What uh, what are you doing here?\nKatie: Well, the delivery went out to you and I realized they forgot this. (A blanket.)\nRoss: Ah, mustve been fairly obvious since it was the only thing left in your store.\nKatie: Listen, to be honest, home deliveries are really a part of my job description.\nRoss: Oh. (Reaches into his pocket for some money as Rachel enters the living room and watches holding two stuffed dinosaurs.)\nKatie: Oh uhI actually came here to ask you out.\nRoss: Oh! Wow! Uh, yeah! That sounds great. Im just gonna put this (The money) back in my pocket, pretend that didnt happen. Uh yeah, actually Im free now. Do you wanna grab some coffee or\nKatie: Sure!\nRachel: Horny bitch. (They both look at her, pretending that the dinosaurs shes holding are arguing.) No! Youre a horny bitch! Noooo! Youre the horny bitch! No! Youre a horny bitch!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, Ross and Rachel are unpacking and setting up their new purchases.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "All this stuff takes up a lot of room. Hey how uh, how serious are you about keeping Ben in your life?"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "My son? Pretty serious. (Theres a knock on the door and Ross answers it.) Oh hey Katie! (The cashier from before) What uh, what are you doing here?"}, {"line_number": 4, "type": "dialogue", "speaker": "Katie", "text": "Well, the delivery went out to you and I realized they forgot this. (A blanket.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Ah, mustve been fairly obvious since it was the only thing left in your store."}, {"line_number": 6, "type": "dialogue", "speaker": "Katie", "text": "Listen, to be honest, home deliveries are really a part of my job description."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Oh. (Reaches into his pocket for some money as Rachel enters the living room and watches holding two stuffed dinosaurs.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Katie", "text": "Oh uhI actually came here to ask you out."}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Oh! Wow! Uh, yeah! That sounds great. Im just gonna put this (The money) back in my pocket, pretend that didnt happen. Uh yeah, actually Im free now. Do you wanna grab some coffee or"}, {"line_number": 10, "type": "dialogue", "speaker": "Katie", "text": "Sure!"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Horny bitch. (They both look at her, pretending that the dinosaurs shes holding are arguing.) No! Youre a horny bitch! Noooo! Youre the horny bitch! No! Youre a horny bitch!"}, {"line_number": 12, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 8, "scene_id": "S08E21_008", "location": "Ross and Rachel's", "scene_description": "continued from before.", "characters": ["Katie", "Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_008", "raw_text": "[Scene: Ross and Rachel's, continued from before.]\nRachel: So you guys go, have a really good time.\nRoss: (To Katie) Yeah, Im just gonna grab my coat. And uh, and my whip. (Katie looks worried.) Yknow because of the Indiana Jones? (Katie laughs) Not-not because Im-Im into S&M. (Katies worried again.) Im not-Im not into anything weird. Yknow? Just-just normal sex. (Katie is uncomfortable.) So, Im gonna grab my coat. (Does so, leaving Katie and Rachel alone.)\nRachel: So, you had a good day huh? Big commission; picked up a daddy.\nKatie: Are you okay with this?\nRachel: Oh yeah! Yeah please, you guys have fun.\nKatie: Okay. It was nice to see you.\nRachel: Oh and it was great to see you too. And you look fantastic, although you missed a button.\nKatie: Oh umm, actually I umm\nRachel: Oh okay, I see what youre doing there.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, continued from before.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "So you guys go, have a really good time."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "(To Katie) Yeah, Im just gonna grab my coat. And uh, and my whip. (Katie looks worried.) Yknow because of the Indiana Jones? (Katie laughs) Not-not because Im-Im into S&M. (Katies worried again.) Im not-Im not into anything weird. Yknow? Just-just normal sex. (Katie is uncomfortable.) So, Im gonna grab my coat. (Does so, leaving Katie and Rachel alone.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "So, you had a good day huh? Big commission; picked up a daddy."}, {"line_number": 5, "type": "dialogue", "speaker": "Katie", "text": "Are you okay with this?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah! Yeah please, you guys have fun."}, {"line_number": 7, "type": "dialogue", "speaker": "Katie", "text": "Okay. It was nice to see you."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh and it was great to see you too. And you look fantastic, although you missed a button."}, {"line_number": 9, "type": "dialogue", "speaker": "Katie", "text": "Oh umm, actually I umm"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Oh okay, I see what youre doing there."}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 9, "scene_id": "S08E21_009", "location": "Monica and Chandler's", "scene_description": "Chandler and Phoebe are entering.", "characters": ["Chandler", "Phoebe"], "firestore_path": "/episodes/S08E21/scenes/S08E21_009", "raw_text": "[Scene: Monica and Chandler's, Chandler and Phoebe are entering.]\nChandler: I cant even believe this! I really come off that badly?\nPhoebe: Oh! Its okay, you calm down after a while and then people can see how really sweet and wonderful you really are.\nChandler: Oh good. Good, because Im sure this interview is gonna last a couple of weeks.\nPhoebe: All right, dont freak out! Okay? I-I will help you. How long before you have to leave?\nChandler: An hour.\nPhoebe: I cant help you.\nChandler: Phoebe!\nPhoebe: All right, all right, well just do our best. Okay? So lets say Im the interviewer and Im meeting you for the first time. Okay. \"Hi! Come on in, Im uh, Regina Philange.\"\nChandler: Chandler Bing.\nPhoebe: Bing, what an unusual name.\nChandler: Well you should meet my uncle, Bada. (Pause) Ill let myself out.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler and Phoebe are entering.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "I cant even believe this! I really come off that badly?"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! Its okay, you calm down after a while and then people can see how really sweet and wonderful you really are."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Oh good. Good, because Im sure this interview is gonna last a couple of weeks."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "All right, dont freak out! Okay? I-I will help you. How long before you have to leave?"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "An hour."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "I cant help you."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Phoebe!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "All right, all right, well just do our best. Okay? So lets say Im the interviewer and Im meeting you for the first time. Okay. \"Hi! Come on in, Im uh, Regina Philange.\""}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Chandler Bing."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Bing, what an unusual name."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Well you should meet my uncle, Bada. (Pause) Ill let myself out."}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 10, "scene_id": "S08E21_010", "location": "The Cooking Class", "scene_description": "Joey is trying to cook as the teacher walks over to him.", "characters": ["Joey", "Monica", "The Cooking Teacher"], "firestore_path": "/episodes/S08E21/scenes/S08E21_010", "raw_text": "[Scene: The Cooking Class, Joey is trying to cook as the teacher walks over to him.]\nJoey: Hi.\nThe Cooking Teacher: Your Fettuccini Alfredo looks a little dry, did you use all your cheese?\nJoey: When you say used, do you mean eat as a pre-cooking snack?\nThe Cooking Teacher: And the cream?\nJoey: Cheese makes me thirsty.\nThe Cooking Teacher: Okay. Lets move on.\nJoey: All right.\nThe Cooking Teacher: (To Monica) Oh! Something smells good over at Monicas station! (She tries Monicas fettuccini.) Oh my God! This is absolutely amazing! Youve never made this before?\nMonica: Oh no! I dont know anything about cooking. I had to ask someone what its called when the, when the water makes those little bubbles.\nThe Cooking Teacher: Well, hats off to the chef.\nMonica: I-I-Im sorry, your-your mouth was full, I didnt hear what you said. Umm, hats off to who now?\nThe Cooking Teacher: The chef!\nMonica: Thats right.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Cooking Class, Joey is trying to cook as the teacher walks over to him.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hi."}, {"line_number": 3, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Your Fettuccini Alfredo looks a little dry, did you use all your cheese?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "When you say used, do you mean eat as a pre-cooking snack?"}, {"line_number": 5, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "And the cream?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Cheese makes me thirsty."}, {"line_number": 7, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Okay. Lets move on."}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "All right."}, {"line_number": 9, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "(To Monica) Oh! Something smells good over at Monicas station! (She tries Monicas fettuccini.) Oh my God! This is absolutely amazing! Youve never made this before?"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Oh no! I dont know anything about cooking. I had to ask someone what its called when the, when the water makes those little bubbles."}, {"line_number": 11, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Well, hats off to the chef."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "I-I-Im sorry, your-your mouth was full, I didnt hear what you said. Umm, hats off to who now?"}, {"line_number": 13, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "The chef!"}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Thats right."}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 11, "scene_id": "S08E21_011", "location": "Monica and Chandler's", "scene_description": "Chandler and Phoebe are still working on his interviewing techniques.", "characters": ["Chandler", "Phoebe"], "firestore_path": "/episodes/S08E21/scenes/S08E21_011", "raw_text": "[Scene: Monica and Chandler's, Chandler and Phoebe are still working on his interviewing techniques.]\nChandler: I think youll find if I come to work here, I dont micro-manage. I dont shy away from delegating.\nPhoebe: Um-hmm, thats good to know. But lets stop focusing on what you dont do, and start focusing on what you do do.\nChandler: (suppressing a smile) What I do dois manage to uh, create an atmosphere of support for the people working with me.\nPhoebe: I see. Nice sidestep on the do do thing by the way.\nChandler: Hardest thing Ive ever done in my life.\nPhoebe: You gotta go!\nChandler: Oh! (Stands up.)\nPhoebe: Okay, dont worry. Youre ready.\nChandler: Really?\nPhoebe: Absolutely! Just fight all your natural instincts and youll be great.\nChandler: Okay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler and Phoebe are still working on his interviewing techniques.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "I think youll find if I come to work here, I dont micro-manage. I dont shy away from delegating."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Um-hmm, thats good to know. But lets stop focusing on what you dont do, and start focusing on what you do do."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "(suppressing a smile) What I do dois manage to uh, create an atmosphere of support for the people working with me."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "I see. Nice sidestep on the do do thing by the way."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Hardest thing Ive ever done in my life."}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "You gotta go!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Oh! (Stands up.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, dont worry. Youre ready."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Really?"}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Absolutely! Just fight all your natural instincts and youll be great."}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Okay."}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 12, "scene_id": "S08E21_012", "location": "The Cooking Class", "scene_description": "everyone has finished baking a batch of cookies and the teacher is going around tasting them.", "characters": ["Joey", "Monica", "The Cooking Teacher"], "firestore_path": "/episodes/S08E21/scenes/S08E21_012", "raw_text": "[Scene: The Cooking Class, everyone has finished baking a batch of cookies and the teacher is going around tasting them.]\nThe Cooking Teacher: Ah Monica, my star student.\nMonica: Yknow, you called me that before so I-I took the liberty of fashioning a star out of aluminum foil. Now, no pressure, you like my cookies, you give me the star. (Hands it to her.)\nThe Cooking Teacher: (tasting the cookie and with her mouthful) Oh, yum-yum-yum. (Hands the star back.)\nMonica: Wow! A star! (The class glares at her.) I know you all hate me and-and Im sorry, but I dont care.\n(The teacher goes to Joeys station.)\nThe Cooking Teacher: Okay Joey, youre up next. (Tries one of his cookies.) This are good! This is amazing! You get an A!\nJoey: I can an A? In-in school? (To Joey) Hey, Im a dork.\nMonica: Joey! Im so proud of you!\nThe Cooking Teacher: I think you should give him your star.\nMonica: Excuse me? He doesnt even know what hes doing!\nThe Cooking Teacher: Were all beginners here. Nobody knows what theyre doing.\nMonica: I do! Im a professional chef! (The class gasps.) Oh relax! Its not a courtroom drama!\nThe Cooking Teacher: If youre a professional chef, what are you doing taking Introduction to Cooking?\nJoey: Yeah!\nMonica: Im-Im sorry, its just that umm Well I-I cook at this restaurant, Alessandros, and umm I just got a really bad review\nThe Cooking Teacher: Oh Alessandros! I love that place!\nMonica: You do?\nThe Cooking Teacher: Oh yes! Youre an excellent chef! As a person youre a little\nMonica: Oh, Im totally crazy, but you-you like the food?\nThe Cooking Teacher: Very much.\nMonica: Okay then, I dont stink. Im a good chef. Okay. (Starts to leave.)\nJoey: Whoa-whoa-whoa-whoa! I dont want to go. Im having fun.\nThe Cooking Teacher: Well actually, did either of you pay for this class?\nJoey: Hey-hey-hey, if my friend says its time to go, its time to go. (Starts to leave, but comes back for his cookies.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Cooking Class, everyone has finished baking a batch of cookies and the teacher is going around tasting them.]"}, {"line_number": 2, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Ah Monica, my star student."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Yknow, you called me that before so I-I took the liberty of fashioning a star out of aluminum foil. Now, no pressure, you like my cookies, you give me the star. (Hands it to her.)"}, {"line_number": 4, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "(tasting the cookie and with her mouthful) Oh, yum-yum-yum. (Hands the star back.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Wow! A star! (The class glares at her.) I know you all hate me and-and Im sorry, but I dont care."}, {"line_number": 6, "type": "action", "text": "(The teacher goes to Joeys station.)"}, {"line_number": 7, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Okay Joey, youre up next. (Tries one of his cookies.) This are good! This is amazing! You get an A!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "I can an A? In-in school? (To Joey) Hey, Im a dork."}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Joey! Im so proud of you!"}, {"line_number": 10, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "I think you should give him your star."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Excuse me? He doesnt even know what hes doing!"}, {"line_number": 12, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Were all beginners here. Nobody knows what theyre doing."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "I do! Im a professional chef! (The class gasps.) Oh relax! Its not a courtroom drama!"}, {"line_number": 14, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "If youre a professional chef, what are you doing taking Introduction to Cooking?"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Yeah!"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Im-Im sorry, its just that umm Well I-I cook at this restaurant, Alessandros, and umm I just got a really bad review"}, {"line_number": 17, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Oh Alessandros! I love that place!"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "You do?"}, {"line_number": 19, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Oh yes! Youre an excellent chef! As a person youre a little"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Oh, Im totally crazy, but you-you like the food?"}, {"line_number": 21, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Very much."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Okay then, I dont stink. Im a good chef. Okay. (Starts to leave.)"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "Whoa-whoa-whoa-whoa! I dont want to go. Im having fun."}, {"line_number": 24, "type": "dialogue", "speaker": "The Cooking Teacher", "text": "Well actually, did either of you pay for this class?"}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Hey-hey-hey, if my friend says its time to go, its time to go. (Starts to leave, but comes back for his cookies.)"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 13, "scene_id": "S08E21_013", "location": "An Office Building", "scene_description": "Chandler is on his interview.", "characters": ["Chandler", "The Interviewer"], "firestore_path": "/episodes/S08E21/scenes/S08E21_013", "raw_text": "[Scene: An Office Building, Chandler is on his interview.]\nChandler: also I was the point person on my companys transition from the KL-5 to GR-6 system.\nThe Interviewer: You mustve had your hands full.\nChandler: That I did. That I did.\nThe Interviewer: So lets talk a little bit about your duties.\nChandler: (nervous) My duties? (Trying not to crack a joke) All right.\nThe Interviewer: Now youll be heading a whole division, so youll have a lot of duties.\nChandler: (trying not to laugh) I see.\nThe Interviewer: But therell be perhaps 30 people under you so you can dump a certain amount on them.\nChandler: (really try not to laugh) Good to know.\nThe Interviewer: We can go into detail\nChandler: No dont I beg of you!\nThe Interviewer: All right then, well have a definite answer for you on Monday, but I think I can say with some confidence, youll fit in well here.\nChandler: (relieved) Really?!\nThe Interviewer: Absolutely. (They walk to the door.) You can relax; you did great.\nChandler: Yeah I gotta say thank you, I was really nervous. Yknow Ive been told I come on to strong, make to many jokes, and then it was really hard to sidestep that duty thing. (The interviewer doesnt understand) Duties. (Still doesnt.) Duties! (Still doesnt.) Poo. (Still doesnt.)\nThe Interviewer: Poo?\nChandler: Oh my God this doesnt count! Okay? The interview was over, that was the real Chandler Bing in there, this is just some crazy guy out in the hall! Call security! Theres a crazy guy out in the hall!\nThe Interviewer: Poo?!\nChandler: Ill look forward to your call. (Walks away.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: An Office Building, Chandler is on his interview.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "also I was the point person on my companys transition from the KL-5 to GR-6 system."}, {"line_number": 3, "type": "dialogue", "speaker": "The Interviewer", "text": "You mustve had your hands full."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "That I did. That I did."}, {"line_number": 5, "type": "dialogue", "speaker": "The Interviewer", "text": "So lets talk a little bit about your duties."}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "(nervous) My duties? (Trying not to crack a joke) All right."}, {"line_number": 7, "type": "dialogue", "speaker": "The Interviewer", "text": "Now youll be heading a whole division, so youll have a lot of duties."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "(trying not to laugh) I see."}, {"line_number": 9, "type": "dialogue", "speaker": "The Interviewer", "text": "But therell be perhaps 30 people under you so you can dump a certain amount on them."}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "(really try not to laugh) Good to know."}, {"line_number": 11, "type": "dialogue", "speaker": "The Interviewer", "text": "We can go into detail"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "No dont I beg of you!"}, {"line_number": 13, "type": "dialogue", "speaker": "The Interviewer", "text": "All right then, well have a definite answer for you on Monday, but I think I can say with some confidence, youll fit in well here."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "(relieved) Really?!"}, {"line_number": 15, "type": "dialogue", "speaker": "The Interviewer", "text": "Absolutely. (They walk to the door.) You can relax; you did great."}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Yeah I gotta say thank you, I was really nervous. Yknow Ive been told I come on to strong, make to many jokes, and then it was really hard to sidestep that duty thing. (The interviewer doesnt understand) Duties. (Still doesnt.) Duties! (Still doesnt.) Poo. (Still doesnt.)"}, {"line_number": 17, "type": "dialogue", "speaker": "The Interviewer", "text": "Poo?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Oh my God this doesnt count! Okay? The interview was over, that was the real Chandler Bing in there, this is just some crazy guy out in the hall! Call security! Theres a crazy guy out in the hall!"}, {"line_number": 19, "type": "dialogue", "speaker": "The Interviewer", "text": "Poo?!"}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "Ill look forward to your call. (Walks away.)"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 14, "scene_id": "S08E21_014", "location": "Ross and Rachel's", "scene_description": "Ross is returning from his date.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E21/scenes/S08E21_014", "raw_text": "[Scene: Ross and Rachel's, Ross is returning from his date.]\nRoss: Hey.\nRachel: Hi! Youre back from your date!\nRoss: How are you?\nRachel: Im fine, but thats not important. Whats important is how was she?\nRoss: Uhh, it was fun. We, we just had coffee.\nRachel: Oh uh-huh, uh-huh, coffee, a little rub-rub-rub under the table.\nRoss: Whats uh, whats going on? Do you not, do you not like Katie?\nRachel: No! No, shesShe was nice. I mean, shes a little slutty, but who isnt?\nRoss: I liked her.\nRachel: Of course you did Ross, you would date a gorilla if it called you Indiana Jones!\nRoss: Did you get like a fresh batch of pregnancy hormones today?!\nRachel: No! Its just that, Kate bothered me. \nRoss: Why? What was wrong with her?\nRachel: There was nothing wrong with her! All right? She was perfectly lovely!\nRoss: Okay, so whats the matter?\nRachel: I dont want you to date her!\nRoss: (laughs) Why? What, what are you jealous?\nRachel: Yes! And not because I want you to go out with me, but because I dont want you to go out with anybody! Okay? I know its a terrible thing to even think this, and its completely inappropriate, but I want you to be at my constant beck and call 24 hours a day! Im very sorry, but that is just the way that I feel.\nRoss: Okay.\nRachel: What?!\nRoss: I wont date. Ill uh, Ill be here, with you, all the time.\nRachel: Really? But Im being so unreasonable.\nRoss: True, but youre allowed to be unreasonable. Youre having our baby.\n(Pause.)\nRachel: (starting to cry) Oh Ross, thank you. Thank you. (They hug.)\nRoss: Do you feel better?\nRachel: No, not really. Youre pressing the baby into my bladder and now I have to pee. Sorry. (She gets up and starts for the bathroom.)\nRoss: Uh Rach?\nRachel: Yeah. (Stops and starts doing the I-have-to-go-to-the-bathroom dance.)\nRoss: Just one thing umm\nRachel: Uh-huh.\nRoss: We live together. Youre having our baby. Im not gonna see anybody else. Are you-are you sure you dont want something more?\nRachel: (pause) Wow! I dont know, maybe. Im\nRoss: Oh-oh, Rach! I was just messin around! (Shes stunned) Like you did last night when I had to pee?\nRachel: (laughs) I knew that! I knew that! I was just messin with you too! \nRoss: (pause) Okay. Okay. Because for a minute you said you\nRachel: Oh no-no-no-no, no!\nRoss: that you actually\nRachel: No thats just(Laughs)Thats just cause Im such a good messer!\n(They both laugh. Ross sits down, but Rachel doesnt move and is lost in thought.)\nRoss: Rach?\nRachel: Yeah?\nRoss: The bathroom?\nRachel: Right! (Heads for the bathroom.)\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, Ross is returning from his date.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Hi! Youre back from your date!"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "How are you?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Im fine, but thats not important. Whats important is how was she?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Uhh, it was fun. We, we just had coffee."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Oh uh-huh, uh-huh, coffee, a little rub-rub-rub under the table."}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Whats uh, whats going on? Do you not, do you not like Katie?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "No! No, shesShe was nice. I mean, shes a little slutty, but who isnt?"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "I liked her."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Of course you did Ross, you would date a gorilla if it called you Indiana Jones!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Did you get like a fresh batch of pregnancy hormones today?!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "No! Its just that, Kate bothered me. "}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "Why? What was wrong with her?"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "There was nothing wrong with her! All right? She was perfectly lovely!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Okay, so whats the matter?"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "I dont want you to date her!"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "(laughs) Why? What, what are you jealous?"}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Yes! And not because I want you to go out with me, but because I dont want you to go out with anybody! Okay? I know its a terrible thing to even think this, and its completely inappropriate, but I want you to be at my constant beck and call 24 hours a day! Im very sorry, but that is just the way that I feel."}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Okay."}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "I wont date. Ill uh, Ill be here, with you, all the time."}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Really? But Im being so unreasonable."}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "True, but youre allowed to be unreasonable. Youre having our baby."}, {"line_number": 25, "type": "action", "text": "(Pause.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "(starting to cry) Oh Ross, thank you. Thank you. (They hug.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Do you feel better?"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "No, not really. Youre pressing the baby into my bladder and now I have to pee. Sorry. (She gets up and starts for the bathroom.)"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Uh Rach?"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Yeah. (Stops and starts doing the I-have-to-go-to-the-bathroom dance.)"}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "Just one thing umm"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Uh-huh."}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "We live together. Youre having our baby. Im not gonna see anybody else. Are you-are you sure you dont want something more?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "(pause) Wow! I dont know, maybe. Im"}, {"line_number": 35, "type": "dialogue", "speaker": "Ross", "text": "Oh-oh, Rach! I was just messin around! (Shes stunned) Like you did last night when I had to pee?"}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "(laughs) I knew that! I knew that! I was just messin with you too! "}, {"line_number": 37, "type": "dialogue", "speaker": "Ross", "text": "(pause) Okay. Okay. Because for a minute you said you"}, {"line_number": 38, "type": "dialogue", "speaker": "Rachel", "text": "Oh no-no-no-no, no!"}, {"line_number": 39, "type": "dialogue", "speaker": "Ross", "text": "that you actually"}, {"line_number": 40, "type": "dialogue", "speaker": "Rachel", "text": "No thats just(Laughs)Thats just cause Im such a good messer!"}, {"line_number": 41, "type": "action", "text": "(They both laugh. Ross sits down, but Rachel doesnt move and is lost in thought.)"}, {"line_number": 42, "type": "dialogue", "speaker": "Ross", "text": "Rach?"}, {"line_number": 43, "type": "dialogue", "speaker": "Rachel", "text": "Yeah?"}, {"line_number": 44, "type": "dialogue", "speaker": "Ross", "text": "The bathroom?"}, {"line_number": 45, "type": "dialogue", "speaker": "Rachel", "text": "Right! (Heads for the bathroom.)"}, {"line_number": 46, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S08E21", "season": 8, "episode_number": 21, "episode_title": "THE ONE WITH THE COOKING CLASS", "scene_number": 15, "scene_id": "S08E21_015", "location": "The New School", "scene_description": "Joey and Monica are walking down a hallway.", "characters": ["Joey", "Monica", "The Acting Teacher"], "firestore_path": "/episodes/S08E21/scenes/S08E21_015", "raw_text": "[Scene: The New School, Joey and Monica are walking down a hallway.]\nJoey: Well I had a great time! Learned how to bake, ate great food, thats the first A Ive gotten since seventh grade, and I didnt have to sleep with the teacher this time.\nMonica: Oh, look! Acting for Beginners! Want to feel good about yourself?\nJoey: What the hell!\nMonica: Okay.\n(They enter.)\nThe Acting Teacher: All right, lets start with some basics. Can anybody tell me what the difference between upstage and downstage is?\n(No one can and Monica looks at Joey expectantly.)\nJoey: Yeah, this was a stupid idea. (Exits.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The New School, Joey and Monica are walking down a hallway.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Well I had a great time! Learned how to bake, ate great food, thats the first A Ive gotten since seventh grade, and I didnt have to sleep with the teacher this time."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Oh, look! Acting for Beginners! Want to feel good about yourself?"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "What the hell!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 6, "type": "action", "text": "(They enter.)"}, {"line_number": 7, "type": "dialogue", "speaker": "The Acting Teacher", "text": "All right, lets start with some basics. Can anybody tell me what the difference between upstage and downstage is?"}, {"line_number": 8, "type": "action", "text": "(No one can and Monica looks at Joey expectantly.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Yeah, this was a stupid idea. (Exits.)"}, {"line_number": 10, "type": "narration", "text": "End"}]}
