{"episode_id": "S08E09", "season": 8, "episode_number": 9, "episode_title": "THE ONE WITH THE RUMOR", "scene_number": 1, "scene_id": "S08E09_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E09/scenes/S08E09_001", "raw_text": "THE ONE WITH THE RUMOR\nWritten by: Shana Goldberg-Meehan Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE RUMOR"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Shana Goldberg-Meehan Transcribed by: Eric Aasen"}]}
{"episode_id": "S08E09", "season": 8, "episode_number": 9, "episode_title": "THE ONE WITH THE RUMOR", "scene_number": 2, "scene_id": "S08E09_002", "location": "Joey and Rachel's", "scene_description": "Joey is reading What to Expect When Youre Expecting as Rachel enters from her bedroom.", "characters": ["Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S08E09/scenes/S08E09_002", "raw_text": "[Scene: Joey and Rachel's, Joey is reading What to Expect When Youre Expecting as Rachel enters from her bedroom.]\nJoey: Hey Rach listen, did you know that during pregnancy your fingers swell up to twice their size and never go back.\nRachel: (looking at her fingers) Oh myGod! Let me see that! (Grabs the book from him.)\nJoey: (laughing) You fall for it every time!\nPhoebe: (entering) Hey!\nRachel: Hi!\nPhoebe: I brought you my old maternity clothes! (Sets a bag on the counter.)\nRachel: Oh Pheebs thats so sweet(Grabs a pair of pants)Ooh, those are so cute!\nPhoebe: Yeah! And look, (Grabs the pants) see how they expand as the baby grows? (Theres a stretchy part in front.) And then after the babys born, theyre great for shoplifting melons.\nMonica: (entering) Oh good youre all here. Thanksgiving tomorrow, four oclock. (To Rachel) Oh, guess who I invited. Remember that guy Will Colbert from high school?\nRachel: No.\nMonica: He was in Rosss classmarching bandkinda overweight? Well, really overweight. I mean I was his thin friend.\nRachel: Wow! I dont remember him. Honey, are you sure youre not talking about your imaginary boyfriend.\nMonica: No that was Jarred! Wow! I havent thought about him in a long time (Stares off into the distance lost in thought.) (Pause) Anyway, umm Wills, Wills here on business and he didnt have a place to go so I invited him here.\nRachel: Oh thats nice.\nMonica: Oh, and by the way, hes lost a bunch of weight. I mean he looks goo-ood! Okay, I mean really, really gorgeous! (Joey clears his throat.) I still love Chandler.\nJoey: I just want you to say it once in a while.\nMonica: All right okay, just so you know, Im not gonna make a turkey this year.\nJoey: What?!\nMonica: Well Phoebe doesnt eat turkey\nJoey: Phoebe!\nPhoebe: Turkeys are beautiful, intelligent animals!\nJoey: No theyre not! Theyre ugly and stupid and delicious!\nMonica: All right! Okay, its just Phoebe. Wills still on a diet, Chandler doesnt eat Thanksgiving food, and Rachels having her aversion to poultry.\nJoey: She is?\nRachel: Remember I had to leave the room the other day when you had that roast chicken?\nJoey: Yeah. But I thought that was because I put the whole thing on my hand and made it walk across the table.\nMonica: Anyway, it just doesnt seem worth it to make a whole turkey for just three people. Okay? Its a lot of work.\nJoey: But you gotta have turkey on Thanksgiving! I mean, Thanksgiving with no turkey is like-like Fourth of July with no apple pie! Or Friday with no two pizzas!\nMonica: All right fine! If it means that much to you! But justtheres gonna be a ton left over.\nJoey: No there wont! I promise I will finish that turkey!\nMonica: All right, youre telling me you can eat an entire turkey in just one sitting?\nJoey: Thats right! Cause Im a Tribbiani! (To Rachel) And this is what we do! I mean we may not be great thinkers or world leaders, we dont read a lot or run very fast, but damnit! We can eat!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joey and Rachel's, Joey is reading What to Expect When Youre Expecting as Rachel enters from her bedroom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey Rach listen, did you know that during pregnancy your fingers swell up to twice their size and never go back."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "(looking at her fingers) Oh myGod! Let me see that! (Grabs the book from him.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(laughing) You fall for it every time!"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "(entering) Hey!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "I brought you my old maternity clothes! (Sets a bag on the counter.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh Pheebs thats so sweet(Grabs a pair of pants)Ooh, those are so cute!"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah! And look, (Grabs the pants) see how they expand as the baby grows? (Theres a stretchy part in front.) And then after the babys born, theyre great for shoplifting melons."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "(entering) Oh good youre all here. Thanksgiving tomorrow, four oclock. (To Rachel) Oh, guess who I invited. Remember that guy Will Colbert from high school?"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "No."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "He was in Rosss classmarching bandkinda overweight? Well, really overweight. I mean I was his thin friend."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Wow! I dont remember him. Honey, are you sure youre not talking about your imaginary boyfriend."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "No that was Jarred! Wow! I havent thought about him in a long time (Stares off into the distance lost in thought.) (Pause) Anyway, umm Wills, Wills here on business and he didnt have a place to go so I invited him here."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Oh thats nice."}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Oh, and by the way, hes lost a bunch of weight. I mean he looks goo-ood! Okay, I mean really, really gorgeous! (Joey clears his throat.) I still love Chandler."}, {"line_number": 17, "type": "dialogue", "speaker": "Joey", "text": "I just want you to say it once in a while."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "All right okay, just so you know, Im not gonna make a turkey this year."}, {"line_number": 19, "type": "dialogue", "speaker": "Joey", "text": "What?!"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Well Phoebe doesnt eat turkey"}, {"line_number": 21, "type": "dialogue", "speaker": "Joey", "text": "Phoebe!"}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Turkeys are beautiful, intelligent animals!"}, {"line_number": 23, "type": "dialogue", "speaker": "Joey", "text": "No theyre not! Theyre ugly and stupid and delicious!"}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "All right! Okay, its just Phoebe. Wills still on a diet, Chandler doesnt eat Thanksgiving food, and Rachels having her aversion to poultry."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "She is?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Remember I had to leave the room the other day when you had that roast chicken?"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Yeah. But I thought that was because I put the whole thing on my hand and made it walk across the table."}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Anyway, it just doesnt seem worth it to make a whole turkey for just three people. Okay? Its a lot of work."}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "But you gotta have turkey on Thanksgiving! I mean, Thanksgiving with no turkey is like-like Fourth of July with no apple pie! Or Friday with no two pizzas!"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica", "text": "All right fine! If it means that much to you! But justtheres gonna be a ton left over."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "No there wont! I promise I will finish that turkey!"}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "All right, youre telling me you can eat an entire turkey in just one sitting?"}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "Thats right! Cause Im a Tribbiani! (To Rachel) And this is what we do! I mean we may not be great thinkers or world leaders, we dont read a lot or run very fast, but damnit! We can eat!"}, {"line_number": 34, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S08E09", "season": 8, "episode_number": 9, "episode_title": "THE ONE WITH THE RUMOR", "scene_number": 3, "scene_id": "S08E09_003", "location": "Monica and Chandler's", "scene_description": "Chandler is watching football, and its actually the right game Green Bay at Detroit (although not this years), as Monica is getting everything ready.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Will"], "firestore_path": "/episodes/S08E09/scenes/S08E09_003", "raw_text": "[Scene: Monica and Chandler's, Chandler is watching football, and its actually the right game Green Bay at Detroit (although not this years), as Monica is getting everything ready.]\nMonica: Hey, isnt weird to think about how next year at this time theyll be a little baby at the table? (Chandler turns around in horror.) (Seeing him) Rachels! But good to know where youre at!\nPhoebe: (entering) Hey!\nMonica: Hey!\nPhoebe: Happy Thanksgiving!\nMonica: You too!\nPhoebe: Anything I can do to help?\nMonica: Actually there is. Chandler usually helps me with this, but hes really into the game so I dont want to bother him. Could you help me fold these napkins? (Hands her a stack of them.)\nPhoebe: Sure!\nMonica: Im gonna go across the hall to check on the yams.\nPhoebe: Okay. (She starts folding the napkins in half.)\nMonica: No! No! No! No sweetie! No! Not like that! Were not at a barn dance. Youve gottayou wanna fold them like swans. Like I showed you at Christmas time, remember?\nPhoebe: Yeah, it all just came screaming back to me. (Monica exits.) (To Chandler) So hows the game?\nChandler: I have no idea.\nPhoebe: What?\nChandler: Yeah! Im just pretending to watch the game so I dont have to help out with stuff.\nPhoebe: I dont believe you! That isbrilliant! And Monica has no idea?\nChandler: Nope! Every once and a while I just scream stuff at the TV. \n(Monica enters and Chandler screams stuff at the TV.)\nMonica: Is your team winning hon?\nChandler: Yeah! Anderson just scored again! (To Phoebe) Theres no Anderson.\nPhoebe: Well I want to get in on this. Hey Mon? I dont think I can help you after all, I didnt realize this game was on.\nMonica: Oh, I didnt know you liked football.\nPhoebe: Well normally I dont, but yknow(looks at the TV)Green Bay is playing.\nMonica: You like Green Bay?\nPhoebe: Well its only like my favorite bay! {Actually, its not bad. It just gets a little cold in winter, but in Wisconsin winter only lasts from August to June. J }\n(Phoebe joins Chandler on the couch as there is a knock on the door which Monica answers.)\nMonica: Hey!\nWill: Hey!\n(Oh, I should point out that the live studio audience at this point goes absolutely wild. And I had absolutely no idea that this Will character was that popular! Maybe they should make him the seventh friend. Which would work out just fine since hes already married to one of them. Will is played by some guy named Brad Pitt, I guess hes some sort of actor.)\nWill: Happy Thanksgiving!\nMonica: Aww thanks! God Will Im so glad that you came! You look great! You mustve lost like\nWill: 150 pounds. Yeah, Im gonna be in one of those Subway sandwich commercials.\nMonica: A pie! (Will brought a pie.)\nWill: Oh right. All right, its no fat, its no sugar, its no dairyits no good. Throw it out.\nMonica: You wanna meet some people? This is uh; this is my husband Chandler. Chandler, this is Will.\nWill: Hey.\nChandler: Oh hey. Id shake your hand but uh; Im really into the game. Plus, I think itd be better for my ego if we didnt stand right next to each other.\nMonica: This is Phoebe.\nPhoebe: (nonchalantly glancing) Hey. (Turns back around.) Wow! (Looks up.) Well done.\nMonica: (to Will) Wanna give me a hand?\nWill: Sure! Monica, I cant get over how great you look! You look stunning!\nMonica: Well you look incredible too! Youre justyoure so fit!\nChandler: Im watching the game, but Im not deaf!\nMonica: Oh umm, I meant to tell you, Ross is coming.\nWill: Ross is coming. Great! I love Ross!\nMonica: Good. And Rachel Green too. (Will stops suddenly.)\nWill: Oh.\nMonica: Is there a problem?\nWill: Nope. Uh, its okay. Its just uh, God I hated her.\nMonica: What?\nWill: Yeah, I hated her. She was horrible to me in high school. But hey, it was a long time ago, Im in a good place, it might be actually fun to see her again. You got any cakes or cookies or something? (Starts looking.) No Will no!\nChandler: (To Phoebe) Yknow, its been a while since weve screamed something. Maybe we should.\nPhoebe: Oh okay.\nChandler: Oh come on!\nPhoebe: Noooo!! Damn you ref! You burn in hell!!!\n(Joey enters eating potato chips.)\nMonica: Hey, what are you doing? You gotta save room, youve got almost an entire turkey to eat.\nJoey: Let me explain to you how the human body works. I have to warm my stomach first. Eatin chips is like stretching.\nMonica: All right.\nJoey: Dont worry, Tribbianis never get full.\nWill: I actually know what youre talking about. Im here to tell you something my friend, you can eat and eat and eat but nothing will ever fill that void.\nJoey: (To Monica) Who the hell is this guy?\nMonica: Will! From high school.\nJoey: Oh hey!\nMonica: (to Will) Joey.\nWill: Hello.\nRoss: (entering) Will!\nWill: Ross!\nRoss: Hey-hey you came! Man you look incredible! Hot stuff! (They hug and Ross realizes what he said.) Hot stuff?\nWill: Its good to see you man.\nRoss: Yeah, you too. Man, so-so what are you up to?\nWill: Im a commodities broker.\nRoss: Really? Yeah that-that sounds interesting.\nWill: Yeah, its not. But Im rich and thin.\nRoss: Oh! Man I dont think Ive seen you since uh, Lance Davis graduation party.\nWill: That was such a fun night!\nRoss: Yeah. It wouldve been good if we had gotten in, but still real fun.\nWill: Yeah.\nRoss: Yeah.\nWill: God we were lame back then. Do you remember how into dinosaurs we were?\nRoss: (laughs) Yeah.\nWill: So what do you, what do you do now?\nRoss: So how long are you in town?\nRachel: (entering, carrying a baking dish) Hi! \nMonica: Hey sweetie. Oh good. (Takes the baking dish from her.)\nWill: (glaring at Rachel) Rachel Green.\nRoss: Awoh, thats right. Are-are you gonna be okay?\nWill: Oh, Ill-Ill be fine. Just God I hate her Ross! I hate her!\nRoss: Will, high school was-was a long time ago.\nWill: Look at her standing there with those yams! My two greatest enemies Ross: Rachel Green and complex carbohydrates.\nRachel: (sees Will) Oh my God Monica, who is that?\nMonica: Thats Will from high school!\nRachel: Oh! I do not remember him! Wow! He's really got that sexy, smoldering thing going on. (We see Will angrily staring at Rachel.) Oh my God, hes Look at the way hes just staring at me. I think hes trying to mouth something to me, but I cant make it out. (Will mouths, \"I hate you.\")\nMonica: Okay, dinners ready!\nChandler: Good game!\nPhoebe: Yeah.\nChandler: Yeah. Solid effort. Solid effort.\nMonica: Oh, so who won?\nPhoebe: (simultaneously) Green Bay.\nChandler: (simultaneously) Detroit.\nMonica: What?\nPhoebe: Well the Lions technically won, but it was a moral victory for the Green BayMermen.\n(They sit down at the table and Will goes to talk to Rachel.)\nRachel: Hi! Will, right?\nWill: Right.\nRachel: Hi! Im Rachel Green.\nWill: Oh I-I remember you.\nRachel: Really?! Arent you sweet! I gotta tell you though, I am, I am having the hardest time placing you. Oh-oh hang on! Did we umm, did we fool around at Lance Davis graduation party?\nWill: You are unbelievable.\nRachel: Thank you!\nMonica: (breaking it up) Uh Rachel? Rachel, why dont you sit here? (Next to Joey) And Will you sit way over there. (The other side of the table.)\n(Monica sets something on the table and removes the cover. It kinda looks like turkey.)\nJoey: Thats it?! Even if nobody helps me I can eat that no problem. At least give me a challenge!\nMonica: (laughs) This is Chandlers chicken. This is the turkey. (Sets down a huge turkey.)\nJoey: (quietly) Oh. How-how big is that?\nMonica: About nineteen pounds.\nJoey: (To Rachel) Its like me when I was born.\nRachel: All right, who would uh, like some yams? Will?\nWill: Oh, youd like that wouldnt ya?\nRachel: What? (Joey starts offering Ross some turkey.) Oh yknow what? Can we please keep the chicken and the turkey and everything on the other side of the table? The smell is just yuck!\nWill: (sneeze talks) Typical.\nRachel: Im sorry. What?\nWill: I said it was typical. Typical of you, Rachel Green, Queen Rachel does whatever she wants in little Rachel land. (Does a fake hair flip.)\nJoey: (To Monica) Seriously, who is this guy?\nRachel: Umm, Im sorry. Do you-do you have a problem with me?\nWill: I dont know? Do I? Do I?\nPhoebe: I think you do.\nMonica: (To Rachel) Apparently you were umm, a little mean to him in high school.\nWill: A little mean? You made my life miserable!\nRachel: Im-ImI had no idea. Im sorry. I\nWill: Well you should be. Screw it! Bring on the yams!\nMonica: Oh Will. But you-youve worked so hard\nWill: Yams!!!! \nMonica: Okay. (Chandler grabs the dish from Monica and hands it to Will who starts dishing out a large helping.)\nRachel: Uh Will umm, I just want to say that Im real sorry for whatever I-I did to you in high school\nWill: Oh, it wasnt just me. We had a club!\nRachel: You had a club?!\nWill: Thats right, The I Hate Rachel Green Club!\nRachel: Whoa! My God! So what, you all just joined together to hate me?! Who else was in this club?\nWill: Me and Ross. (Points at Ross.)\nRoss: No need to point, she knows who Ross is.\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is watching football, and its actually the right game Green Bay at Detroit (although not this years), as Monica is getting everything ready.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Hey, isnt weird to think about how next year at this time theyll be a little baby at the table? (Chandler turns around in horror.) (Seeing him) Rachels! But good to know where youre at!"}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "(entering) Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Hey!"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Happy Thanksgiving!"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "You too!"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Anything I can do to help?"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Actually there is. Chandler usually helps me with this, but hes really into the game so I dont want to bother him. Could you help me fold these napkins? (Hands her a stack of them.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Sure!"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Im gonna go across the hall to check on the yams."}, {"line_number": 11, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (She starts folding the napkins in half.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "No! No! No! No sweetie! No! Not like that! Were not at a barn dance. Youve gottayou wanna fold them like swans. Like I showed you at Christmas time, remember?"}, {"line_number": 13, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, it all just came screaming back to me. (Monica exits.) (To Chandler) So hows the game?"}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "I have no idea."}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Chandler", "text": "Yeah! Im just pretending to watch the game so I dont have to help out with stuff."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "I dont believe you! That isbrilliant! And Monica has no idea?"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "Nope! Every once and a while I just scream stuff at the TV. "}, {"line_number": 19, "type": "action", "text": "(Monica enters and Chandler screams stuff at the TV.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Is your team winning hon?"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Yeah! Anderson just scored again! (To Phoebe) Theres no Anderson."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Well I want to get in on this. Hey Mon? I dont think I can help you after all, I didnt realize this game was on."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Oh, I didnt know you liked football."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Well normally I dont, but yknow(looks at the TV)Green Bay is playing."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "You like Green Bay?"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Well its only like my favorite bay! {Actually, its not bad. It just gets a little cold in winter, but in Wisconsin winter only lasts from August to June. J }"}, {"line_number": 27, "type": "action", "text": "(Phoebe joins Chandler on the couch as there is a knock on the door which Monica answers.)"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "Hey!"}, {"line_number": 29, "type": "dialogue", "speaker": "Will", "text": "Hey!"}, {"line_number": 30, "type": "action", "text": "(Oh, I should point out that the live studio audience at this point goes absolutely wild. And I had absolutely no idea that this Will character was that popular! Maybe they should make him the seventh friend. Which would work out just fine since hes already married to one of them. Will is played by some guy named Brad Pitt, I guess hes some sort of actor.)"}, {"line_number": 31, "type": "dialogue", "speaker": "Will", "text": "Happy Thanksgiving!"}, {"line_number": 32, "type": "dialogue", "speaker": "Monica", "text": "Aww thanks! God Will Im so glad that you came! You look great! You mustve lost like"}, {"line_number": 33, "type": "dialogue", "speaker": "Will", "text": "150 pounds. Yeah, Im gonna be in one of those Subway sandwich commercials."}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "A pie! (Will brought a pie.)"}, {"line_number": 35, "type": "dialogue", "speaker": "Will", "text": "Oh right. All right, its no fat, its no sugar, its no dairyits no good. Throw it out."}, {"line_number": 36, "type": "dialogue", "speaker": "Monica", "text": "You wanna meet some people? This is uh; this is my husband Chandler. Chandler, this is Will."}, {"line_number": 37, "type": "dialogue", "speaker": "Will", "text": "Hey."}, {"line_number": 38, "type": "dialogue", "speaker": "Chandler", "text": "Oh hey. Id shake your hand but uh; Im really into the game. Plus, I think itd be better for my ego if we didnt stand right next to each other."}, {"line_number": 39, "type": "dialogue", "speaker": "Monica", "text": "This is Phoebe."}, {"line_number": 40, "type": "dialogue", "speaker": "Phoebe", "text": "(nonchalantly glancing) Hey. (Turns back around.) Wow! (Looks up.) Well done."}, {"line_number": 41, "type": "dialogue", "speaker": "Monica", "text": "(to Will) Wanna give me a hand?"}, {"line_number": 42, "type": "dialogue", "speaker": "Will", "text": "Sure! Monica, I cant get over how great you look! You look stunning!"}, {"line_number": 43, "type": "dialogue", "speaker": "Monica", "text": "Well you look incredible too! Youre justyoure so fit!"}, {"line_number": 44, "type": "dialogue", "speaker": "Chandler", "text": "Im watching the game, but Im not deaf!"}, {"line_number": 45, "type": "dialogue", "speaker": "Monica", "text": "Oh umm, I meant to tell you, Ross is coming."}, {"line_number": 46, "type": "dialogue", "speaker": "Will", "text": "Ross is coming. Great! I love Ross!"}, {"line_number": 47, "type": "dialogue", "speaker": "Monica", "text": "Good. And Rachel Green too. (Will stops suddenly.)"}, {"line_number": 48, "type": "dialogue", "speaker": "Will", "text": "Oh."}, {"line_number": 49, "type": "dialogue", "speaker": "Monica", "text": "Is there a problem?"}, {"line_number": 50, "type": "dialogue", "speaker": "Will", "text": "Nope. Uh, its okay. Its just uh, God I hated her."}, {"line_number": 51, "type": "dialogue", "speaker": "Monica", "text": "What?"}, {"line_number": 52, "type": "dialogue", "speaker": "Will", "text": "Yeah, I hated her. She was horrible to me in high school. But hey, it was a long time ago, Im in a good place, it might be actually fun to see her again. You got any cakes or cookies or something? (Starts looking.) No Will no!"}, {"line_number": 53, "type": "dialogue", "speaker": "Chandler", "text": "(To Phoebe) Yknow, its been a while since weve screamed something. Maybe we should."}, {"line_number": 54, "type": "dialogue", "speaker": "Phoebe", "text": "Oh okay."}, {"line_number": 55, "type": "dialogue", "speaker": "Chandler", "text": "Oh come on!"}, {"line_number": 56, "type": "dialogue", "speaker": "Phoebe", "text": "Noooo!! Damn you ref! You burn in hell!!!"}, {"line_number": 57, "type": "action", "text": "(Joey enters eating potato chips.)"}, {"line_number": 58, "type": "dialogue", "speaker": "Monica", "text": "Hey, what are you doing? You gotta save room, youve got almost an entire turkey to eat."}, {"line_number": 59, "type": "dialogue", "speaker": "Joey", "text": "Let me explain to you how the human body works. I have to warm my stomach first. Eatin chips is like stretching."}, {"line_number": 60, "type": "dialogue", "speaker": "Monica", "text": "All right."}, {"line_number": 61, "type": "dialogue", "speaker": "Joey", "text": "Dont worry, Tribbianis never get full."}, {"line_number": 62, "type": "dialogue", "speaker": "Will", "text": "I actually know what youre talking about. Im here to tell you something my friend, you can eat and eat and eat but nothing will ever fill that void."}, {"line_number": 63, "type": "dialogue", "speaker": "Joey", "text": "(To Monica) Who the hell is this guy?"}, {"line_number": 64, "type": "dialogue", "speaker": "Monica", "text": "Will! From high school."}, {"line_number": 65, "type": "dialogue", "speaker": "Joey", "text": "Oh hey!"}, {"line_number": 66, "type": "dialogue", "speaker": "Monica", "text": "(to Will) Joey."}, {"line_number": 67, "type": "dialogue", "speaker": "Will", "text": "Hello."}, {"line_number": 68, "type": "dialogue", "speaker": "Ross", "text": "(entering) Will!"}, {"line_number": 69, "type": "dialogue", "speaker": "Will", "text": "Ross!"}, {"line_number": 70, "type": "dialogue", "speaker": "Ross", "text": "Hey-hey you came! Man you look incredible! Hot stuff! (They hug and Ross realizes what he said.) Hot stuff?"}, {"line_number": 71, "type": "dialogue", "speaker": "Will", "text": "Its good to see you man."}, {"line_number": 72, "type": "dialogue", "speaker": "Ross", "text": "Yeah, you too. Man, so-so what are you up to?"}, {"line_number": 73, "type": "dialogue", "speaker": "Will", "text": "Im a commodities broker."}, {"line_number": 74, "type": "dialogue", "speaker": "Ross", "text": "Really? Yeah that-that sounds interesting."}, {"line_number": 75, "type": "dialogue", "speaker": "Will", "text": "Yeah, its not. But Im rich and thin."}, {"line_number": 76, "type": "dialogue", "speaker": "Ross", "text": "Oh! Man I dont think Ive seen you since uh, Lance Davis graduation party."}, {"line_number": 77, "type": "dialogue", "speaker": "Will", "text": "That was such a fun night!"}, {"line_number": 78, "type": "dialogue", "speaker": "Ross", "text": "Yeah. It wouldve been good if we had gotten in, but still real fun."}, {"line_number": 79, "type": "dialogue", "speaker": "Will", "text": "Yeah."}, {"line_number": 80, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 81, "type": "dialogue", "speaker": "Will", "text": "God we were lame back then. Do you remember how into dinosaurs we were?"}, {"line_number": 82, "type": "dialogue", "speaker": "Ross", "text": "(laughs) Yeah."}, {"line_number": 83, "type": "dialogue", "speaker": "Will", "text": "So what do you, what do you do now?"}, {"line_number": 84, "type": "dialogue", "speaker": "Ross", "text": "So how long are you in town?"}, {"line_number": 85, "type": "dialogue", "speaker": "Rachel", "text": "(entering, carrying a baking dish) Hi! "}, {"line_number": 86, "type": "dialogue", "speaker": "Monica", "text": "Hey sweetie. Oh good. (Takes the baking dish from her.)"}, {"line_number": 87, "type": "dialogue", "speaker": "Will", "text": "(glaring at Rachel) Rachel Green."}, {"line_number": 88, "type": "dialogue", "speaker": "Ross", "text": "Awoh, thats right. Are-are you gonna be okay?"}, {"line_number": 89, "type": "dialogue", "speaker": "Will", "text": "Oh, Ill-Ill be fine. Just God I hate her Ross! I hate her!"}, {"line_number": 90, "type": "dialogue", "speaker": "Ross", "text": "Will, high school was-was a long time ago."}, {"line_number": 91, "type": "dialogue", "speaker": "Will", "text": "Look at her standing there with those yams! My two greatest enemies Ross: Rachel Green and complex carbohydrates."}, {"line_number": 92, "type": "dialogue", "speaker": "Rachel", "text": "(sees Will) Oh my God Monica, who is that?"}, {"line_number": 93, "type": "dialogue", "speaker": "Monica", "text": "Thats Will from high school!"}, {"line_number": 94, "type": "dialogue", "speaker": "Rachel", "text": "Oh! I do not remember him! Wow! He's really got that sexy, smoldering thing going on. (We see Will angrily staring at Rachel.) Oh my God, hes Look at the way hes just staring at me. I think hes trying to mouth something to me, but I cant make it out. (Will mouths, \"I hate you.\")"}, {"line_number": 95, "type": "dialogue", "speaker": "Monica", "text": "Okay, dinners ready!"}, {"line_number": 96, "type": "dialogue", "speaker": "Chandler", "text": "Good game!"}, {"line_number": 97, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah."}, {"line_number": 98, "type": "dialogue", "speaker": "Chandler", "text": "Yeah. Solid effort. Solid effort."}, {"line_number": 99, "type": "dialogue", "speaker": "Monica", "text": "Oh, so who won?"}, {"line_number": 100, "type": "dialogue", "speaker": "Phoebe", "text": "(simultaneously) Green Bay."}, {"line_number": 101, "type": "dialogue", "speaker": "Chandler", "text": "(simultaneously) Detroit."}, {"line_number": 102, "type": "dialogue", "speaker": "Monica", "text": "What?"}, {"line_number": 103, "type": "dialogue", "speaker": "Phoebe", "text": "Well the Lions technically won, but it was a moral victory for the Green BayMermen."}, {"line_number": 104, "type": "action", "text": "(They sit down at the table and Will goes to talk to Rachel.)"}, {"line_number": 105, "type": "dialogue", "speaker": "Rachel", "text": "Hi! Will, right?"}, {"line_number": 106, "type": "dialogue", "speaker": "Will", "text": "Right."}, {"line_number": 107, "type": "dialogue", "speaker": "Rachel", "text": "Hi! Im Rachel Green."}, {"line_number": 108, "type": "dialogue", "speaker": "Will", "text": "Oh I-I remember you."}, {"line_number": 109, "type": "dialogue", "speaker": "Rachel", "text": "Really?! Arent you sweet! I gotta tell you though, I am, I am having the hardest time placing you. Oh-oh hang on! Did we umm, did we fool around at Lance Davis graduation party?"}, {"line_number": 110, "type": "dialogue", "speaker": "Will", "text": "You are unbelievable."}, {"line_number": 111, "type": "dialogue", "speaker": "Rachel", "text": "Thank you!"}, {"line_number": 112, "type": "dialogue", "speaker": "Monica", "text": "(breaking it up) Uh Rachel? Rachel, why dont you sit here? (Next to Joey) And Will you sit way over there. (The other side of the table.)"}, {"line_number": 113, "type": "action", "text": "(Monica sets something on the table and removes the cover. It kinda looks like turkey.)"}, {"line_number": 114, "type": "dialogue", "speaker": "Joey", "text": "Thats it?! Even if nobody helps me I can eat that no problem. At least give me a challenge!"}, {"line_number": 115, "type": "dialogue", "speaker": "Monica", "text": "(laughs) This is Chandlers chicken. This is the turkey. (Sets down a huge turkey.)"}, {"line_number": 116, "type": "dialogue", "speaker": "Joey", "text": "(quietly) Oh. How-how big is that?"}, {"line_number": 117, "type": "dialogue", "speaker": "Monica", "text": "About nineteen pounds."}, {"line_number": 118, "type": "dialogue", "speaker": "Joey", "text": "(To Rachel) Its like me when I was born."}, {"line_number": 119, "type": "dialogue", "speaker": "Rachel", "text": "All right, who would uh, like some yams? Will?"}, {"line_number": 120, "type": "dialogue", "speaker": "Will", "text": "Oh, youd like that wouldnt ya?"}, {"line_number": 121, "type": "dialogue", "speaker": "Rachel", "text": "What? (Joey starts offering Ross some turkey.) Oh yknow what? Can we please keep the chicken and the turkey and everything on the other side of the table? The smell is just yuck!"}, {"line_number": 122, "type": "dialogue", "speaker": "Will", "text": "(sneeze talks) Typical."}, {"line_number": 123, "type": "dialogue", "speaker": "Rachel", "text": "Im sorry. What?"}, {"line_number": 124, "type": "dialogue", "speaker": "Will", "text": "I said it was typical. Typical of you, Rachel Green, Queen Rachel does whatever she wants in little Rachel land. (Does a fake hair flip.)"}, {"line_number": 125, "type": "dialogue", "speaker": "Joey", "text": "(To Monica) Seriously, who is this guy?"}, {"line_number": 126, "type": "dialogue", "speaker": "Rachel", "text": "Umm, Im sorry. Do you-do you have a problem with me?"}, {"line_number": 127, "type": "dialogue", "speaker": "Will", "text": "I dont know? Do I? Do I?"}, {"line_number": 128, "type": "dialogue", "speaker": "Phoebe", "text": "I think you do."}, {"line_number": 129, "type": "dialogue", "speaker": "Monica", "text": "(To Rachel) Apparently you were umm, a little mean to him in high school."}, {"line_number": 130, "type": "dialogue", "speaker": "Will", "text": "A little mean? You made my life miserable!"}, {"line_number": 131, "type": "dialogue", "speaker": "Rachel", "text": "Im-ImI had no idea. Im sorry. I"}, {"line_number": 132, "type": "dialogue", "speaker": "Will", "text": "Well you should be. Screw it! Bring on the yams!"}, {"line_number": 133, "type": "dialogue", "speaker": "Monica", "text": "Oh Will. But you-youve worked so hard"}, {"line_number": 134, "type": "dialogue", "speaker": "Will", "text": "Yams!!!! "}, {"line_number": 135, "type": "dialogue", "speaker": "Monica", "text": "Okay. (Chandler grabs the dish from Monica and hands it to Will who starts dishing out a large helping.)"}, {"line_number": 136, "type": "dialogue", "speaker": "Rachel", "text": "Uh Will umm, I just want to say that Im real sorry for whatever I-I did to you in high school"}, {"line_number": 137, "type": "dialogue", "speaker": "Will", "text": "Oh, it wasnt just me. We had a club!"}, {"line_number": 138, "type": "dialogue", "speaker": "Rachel", "text": "You had a club?!"}, {"line_number": 139, "type": "dialogue", "speaker": "Will", "text": "Thats right, The I Hate Rachel Green Club!"}, {"line_number": 140, "type": "dialogue", "speaker": "Rachel", "text": "Whoa! My God! So what, you all just joined together to hate me?! Who else was in this club?"}, {"line_number": 141, "type": "dialogue", "speaker": "Will", "text": "Me and Ross. (Points at Ross.)"}, {"line_number": 142, "type": "dialogue", "speaker": "Ross", "text": "No need to point, she knows who Ross is."}, {"line_number": 143, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S08E09", "season": 8, "episode_number": 9, "episode_title": "THE ONE WITH THE RUMOR", "scene_number": 4, "scene_id": "S08E09_004", "location": "Monica and Chandler's", "scene_description": "scene continued from earlier.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross", "Ross and Will", "Will"], "firestore_path": "/episodes/S08E09/scenes/S08E09_004", "raw_text": "[Scene: Monica and Chandler's, scene continued from earlier.]\nRachel: (To Ross) So you were in an I Hate Rachel club?\nWill: Yes he was. (Holds up his hand for a high-five.)\nRoss: No. No.\nRachel: So who else was in this club?\nRoss: Uh actually, there-there was also that exchange student from Thailand but I-I dont think he-he knew what it was.\nRachel: So Ross, we went out for two years, and you never told me you were in an I Hate Rachel club.\nWill: You went out with her?! We had a pact!\nRoss: That was in high school! Its not like it was binding forever.\nWill: Then why did it have the word eternity in it?\nRachel: Okay Monica, did you know about this?!\nMonica: I swear I didnt. (To Ross and Will) Hey! Is that why you guys used to go up to your bedroom and lock the door?\nRoss and Will: Yeah.\nMonica: Hmm, a little relieved, I gotta say.\nRoss: Look Rach I-Im sorry, okay? II was a stupid kid, okay? The only reason I joined\nWill: Co-founded!\nRoss: co-founded. Co-founded the club was because I was insanely in love with you. Obviously I didnt handle it very well. But if you think about it the I Hate Rachel Club was really the I Love Rachel Club.\nWill: Uh, except that it was really the I Hate Rachel Club.\nRachel: Okay. So what? You guys would just like get together and like just say mean things about me?\nWill: Well, we did a little more than that.\nRoss: No-no! No-no. No-no.\nPhoebe: What?! What else did you do?\nWill: We started a rumor.\nRachel: What rumor?\nPhoebe: Oh, come on Will! Just take off your shirt and tell us!\nRachel: Ross!\nRoss: It was no big deal. We-wesaid that the rumor wasthat ummyou had bothmale and female reproductive parts.\nRachel: What?!\nWill: Thats right! We said your parents flipped a coin, decided to raise you as a girl, but you still had a hint of a penis.\nRachel: (shocked) Oh my God!\nMonica: You started that?!\nRachel: What?! You heard that?! (Goes and stands behind Joey.)\nMonica: Everyone at our school heard it!\nChandler: Everybody at my school heard it! You were the hermaphrodite cheerleader from Long Island?!\nRachel: Oh no!!!! Oh my God!! This is all making so much sense to me now! This is why Adam Carter wouldnt go out with me! This is why Billy Tratt would just stay in this region! (Motions to her breasts.) (Joey has turned around.)\nRoss: Actually, Billy Tratt is gay now. So-so that ones not really our fault.\nRachel: Monica, how come you never told me this?!\nMonica: I thought it might be true. And I was afraid that you were gonna cry and then show it to me.\n(Joey is now looking at Rachel, and since Rachels standing and hes sitting down and hes not looking at her face You get the picture.)\nRachel: Joey stop staring! Theres nothing there! Its not true!\nJoey: Im afraid Im gonna need proof.\nRachel: Oh! (Hits him and storms out.)\n[Time Lapse, dinner has ended for everyone except Joey who looks like to have finished the turkey, until he turns the plate around and reveals he only ate one side.]\nJoey: You are my Everest.\nMonica: Joey, you dont have to finish that.\nJoey: Oh yes I do. Otherwise whats next? Today Im just a guy who cant finish a turkey, but tomorrow Im the guy who eats half a Powerbar, wraps up the rest, and puts in the fridge? No! No, I justI justI gotta change my pants. (Gets up and heads for the door.) Jeans have no give. (Exits.)\nRachel: (entering carrying a book) Okay! Okay! Listen to what Sean McMahon wrote in my yearbook senior year, \"Dear Rach, youre such a good person.\" Not girl! Person!\nRoss: Rach, I think youre reading a little too much into it.\nRachel: (reading what he wrote again) \"Dear Rach, youre a great person. Sorry about your tiney-wienie.\" (Will laughs.)\nRoss: Look, what do you want me to do? Do you want me to call everyone in the entire school and tell them it wasnt true?!\nRachel: Yes!\nWill: Could you also tell them Im skinny now?\nMonica: Oh! Me too!\nRoss: Well look-look Im not calling anybody! Okay? It was like a million years ago!\nRachel: I dont care how long ago it was! You told people that I was half and half! Yknow what? I just want to point out I never did anything to hurt you in high school.\nMonica: Thats not totally true.\nRachel: What?\nRoss: What?\nMonica: Well you-you did start that rumor about Ross making out with Mrs. Altman, our 50-year-old librarian.\nRoss: (shocked) (To Rachel) How did you know that?!!!!\nMonica: Its true?!!\nRoss: No.\nRachel: Yes it is! I saw you guys going at it behind the card catalog!\n(Ross is at a loss for words.)\nWill: Mrs. Altman? She also made out with Takaka Ci-Kek the night before he went back to Thailand.\nChandler: Im sorry. When you were in high school you made out with a 50-year-old woman?\nRoss: Hey! She didnt look 50!\nChandler: Did she look 16?\nRachel: Ohh, theres a picture of her in the yearbook actually.\nPhoebe: Oh! (They all look.) Wow!\nRoss: She didnt photograph well!\nChandler: Well, she probably wasnt familiar with the process having spent most of her life sitting for oil paintings!\nPhoebe: So how did this happen? Did she, did she lure you to an early bird dinner?\nRoss: I was working late in the library one afternoon. It was just the two of us. She needed some help with her word jumble. And one thing led to another. If you must know, Anita was very gentle and tender. May she rest in peace\nMonica: Didnt she walk with a cane?\nRoss: Only when it was damp!! (To Rachel) I cant believe you-you told people about this?! Everybody knew?! Yknow what? (To Will) Im back in the club!\nWill: Yeah! (They high-five.)\nPhoebe: I wanna join!\nRachel: WhPhoebe!!\nPhoebe: Im sorry. Im sorry. I never got to be in a club. I-I didnt go to high school, but three of us would meet behind a dumpster to learn French. Bonjour.\nRachel: All right, yknowFine! You guys have your stupid little club, but I would just like to say is what you did to me is way worse than what I did to you! You gave me a tiney-wienie! (Will laughs.)\nMonica: All right, listen youre just being silly. Rachel, even with that rumor you were one of the most popular girls in school and everyone wanted to be like you. One girl wanted to be like you so much she stuffed her pants with a Tootsie Roll!\nRachel: Wow\nMonica: And Ross, if it werent for Rachels rumor I mean no one in high school would even know who you were. She put you on the map!\nRoss: As a romancer of the elderly.\nMonica: Hey! Mrs. Altman was the kind of woman you could tell she used to be pretty.\nRoss: The eyesdid still sparkle.\nMonica: Hey guys this stuff is just so way in the past. You-youve been through so much since then. And right now youve got so much more important stuff going on in your life. Cant you just let this go?\nRachel: Shes right.\nRoss: Yeah. I mean we are having a baby together.\nWill: Hold on! You got her pregnant?\nRoss: Yeah.\nWill: Are ya getting married?\nRoss: Nope.\nWill: So you knocked her up but youre not gonna marry her. Dude! (Wants another high-five and Ross ignores him.) Anybody?\nPhoebe: Okay. (Goes over and hugs him.) Its exactly how Id imagined it would be.\nJoey: (entering, wearing the maternity pants from earlier) All right wheres that turkey!\nPhoebe: Joey! Those are my maternity pants!\nJoey: Not now! These are my Thanksgiving pants!\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, scene continued from earlier.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(To Ross) So you were in an I Hate Rachel club?"}, {"line_number": 3, "type": "dialogue", "speaker": "Will", "text": "Yes he was. (Holds up his hand for a high-five.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "No. No."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "So who else was in this club?"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Uh actually, there-there was also that exchange student from Thailand but I-I dont think he-he knew what it was."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "So Ross, we went out for two years, and you never told me you were in an I Hate Rachel club."}, {"line_number": 8, "type": "dialogue", "speaker": "Will", "text": "You went out with her?! We had a pact!"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "That was in high school! Its not like it was binding forever."}, {"line_number": 10, "type": "dialogue", "speaker": "Will", "text": "Then why did it have the word eternity in it?"}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Okay Monica, did you know about this?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "I swear I didnt. (To Ross and Will) Hey! Is that why you guys used to go up to your bedroom and lock the door?"}, {"line_number": 13, "type": "dialogue", "speaker": "Ross and Will", "text": "Yeah."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Hmm, a little relieved, I gotta say."}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Look Rach I-Im sorry, okay? II was a stupid kid, okay? The only reason I joined"}, {"line_number": 16, "type": "dialogue", "speaker": "Will", "text": "Co-founded!"}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "co-founded. Co-founded the club was because I was insanely in love with you. Obviously I didnt handle it very well. But if you think about it the I Hate Rachel Club was really the I Love Rachel Club."}, {"line_number": 18, "type": "dialogue", "speaker": "Will", "text": "Uh, except that it was really the I Hate Rachel Club."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Okay. So what? You guys would just like get together and like just say mean things about me?"}, {"line_number": 20, "type": "dialogue", "speaker": "Will", "text": "Well, we did a little more than that."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "No-no! No-no. No-no."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "What?! What else did you do?"}, {"line_number": 23, "type": "dialogue", "speaker": "Will", "text": "We started a rumor."}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "What rumor?"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, come on Will! Just take off your shirt and tell us!"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Ross!"}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "It was no big deal. We-wesaid that the rumor wasthat ummyou had bothmale and female reproductive parts."}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 29, "type": "dialogue", "speaker": "Will", "text": "Thats right! We said your parents flipped a coin, decided to raise you as a girl, but you still had a hint of a penis."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "(shocked) Oh my God!"}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "You started that?!"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "What?! You heard that?! (Goes and stands behind Joey.)"}, {"line_number": 33, "type": "dialogue", "speaker": "Monica", "text": "Everyone at our school heard it!"}, {"line_number": 34, "type": "dialogue", "speaker": "Chandler", "text": "Everybody at my school heard it! You were the hermaphrodite cheerleader from Long Island?!"}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "Oh no!!!! Oh my God!! This is all making so much sense to me now! This is why Adam Carter wouldnt go out with me! This is why Billy Tratt would just stay in this region! (Motions to her breasts.) (Joey has turned around.)"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Actually, Billy Tratt is gay now. So-so that ones not really our fault."}, {"line_number": 37, "type": "dialogue", "speaker": "Rachel", "text": "Monica, how come you never told me this?!"}, {"line_number": 38, "type": "dialogue", "speaker": "Monica", "text": "I thought it might be true. And I was afraid that you were gonna cry and then show it to me."}, {"line_number": 39, "type": "action", "text": "(Joey is now looking at Rachel, and since Rachels standing and hes sitting down and hes not looking at her face You get the picture.)"}, {"line_number": 40, "type": "dialogue", "speaker": "Rachel", "text": "Joey stop staring! Theres nothing there! Its not true!"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "Im afraid Im gonna need proof."}, {"line_number": 42, "type": "dialogue", "speaker": "Rachel", "text": "Oh! (Hits him and storms out.)"}, {"line_number": 43, "type": "narration", "text": "[Time Lapse, dinner has ended for everyone except Joey who looks like to have finished the turkey, until he turns the plate around and reveals he only ate one side.]"}, {"line_number": 44, "type": "dialogue", "speaker": "Joey", "text": "You are my Everest."}, {"line_number": 45, "type": "dialogue", "speaker": "Monica", "text": "Joey, you dont have to finish that."}, {"line_number": 46, "type": "dialogue", "speaker": "Joey", "text": "Oh yes I do. Otherwise whats next? Today Im just a guy who cant finish a turkey, but tomorrow Im the guy who eats half a Powerbar, wraps up the rest, and puts in the fridge? No! No, I justI justI gotta change my pants. (Gets up and heads for the door.) Jeans have no give. (Exits.)"}, {"line_number": 47, "type": "dialogue", "speaker": "Rachel", "text": "(entering carrying a book) Okay! Okay! Listen to what Sean McMahon wrote in my yearbook senior year, \"Dear Rach, youre such a good person.\" Not girl! Person!"}, {"line_number": 48, "type": "dialogue", "speaker": "Ross", "text": "Rach, I think youre reading a little too much into it."}, {"line_number": 49, "type": "dialogue", "speaker": "Rachel", "text": "(reading what he wrote again) \"Dear Rach, youre a great person. Sorry about your tiney-wienie.\" (Will laughs.)"}, {"line_number": 50, "type": "dialogue", "speaker": "Ross", "text": "Look, what do you want me to do? Do you want me to call everyone in the entire school and tell them it wasnt true?!"}, {"line_number": 51, "type": "dialogue", "speaker": "Rachel", "text": "Yes!"}, {"line_number": 52, "type": "dialogue", "speaker": "Will", "text": "Could you also tell them Im skinny now?"}, {"line_number": 53, "type": "dialogue", "speaker": "Monica", "text": "Oh! Me too!"}, {"line_number": 54, "type": "dialogue", "speaker": "Ross", "text": "Well look-look Im not calling anybody! Okay? It was like a million years ago!"}, {"line_number": 55, "type": "dialogue", "speaker": "Rachel", "text": "I dont care how long ago it was! You told people that I was half and half! Yknow what? I just want to point out I never did anything to hurt you in high school."}, {"line_number": 56, "type": "dialogue", "speaker": "Monica", "text": "Thats not totally true."}, {"line_number": 57, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 58, "type": "dialogue", "speaker": "Ross", "text": "What?"}, {"line_number": 59, "type": "dialogue", "speaker": "Monica", "text": "Well you-you did start that rumor about Ross making out with Mrs. Altman, our 50-year-old librarian."}, {"line_number": 60, "type": "dialogue", "speaker": "Ross", "text": "(shocked) (To Rachel) How did you know that?!!!!"}, {"line_number": 61, "type": "dialogue", "speaker": "Monica", "text": "Its true?!!"}, {"line_number": 62, "type": "dialogue", "speaker": "Ross", "text": "No."}, {"line_number": 63, "type": "dialogue", "speaker": "Rachel", "text": "Yes it is! I saw you guys going at it behind the card catalog!"}, {"line_number": 64, "type": "action", "text": "(Ross is at a loss for words.)"}, {"line_number": 65, "type": "dialogue", "speaker": "Will", "text": "Mrs. Altman? She also made out with Takaka Ci-Kek the night before he went back to Thailand."}, {"line_number": 66, "type": "dialogue", "speaker": "Chandler", "text": "Im sorry. When you were in high school you made out with a 50-year-old woman?"}, {"line_number": 67, "type": "dialogue", "speaker": "Ross", "text": "Hey! She didnt look 50!"}, {"line_number": 68, "type": "dialogue", "speaker": "Chandler", "text": "Did she look 16?"}, {"line_number": 69, "type": "dialogue", "speaker": "Rachel", "text": "Ohh, theres a picture of her in the yearbook actually."}, {"line_number": 70, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! (They all look.) Wow!"}, {"line_number": 71, "type": "dialogue", "speaker": "Ross", "text": "She didnt photograph well!"}, {"line_number": 72, "type": "dialogue", "speaker": "Chandler", "text": "Well, she probably wasnt familiar with the process having spent most of her life sitting for oil paintings!"}, {"line_number": 73, "type": "dialogue", "speaker": "Phoebe", "text": "So how did this happen? Did she, did she lure you to an early bird dinner?"}, {"line_number": 74, "type": "dialogue", "speaker": "Ross", "text": "I was working late in the library one afternoon. It was just the two of us. She needed some help with her word jumble. And one thing led to another. If you must know, Anita was very gentle and tender. May she rest in peace"}, {"line_number": 75, "type": "dialogue", "speaker": "Monica", "text": "Didnt she walk with a cane?"}, {"line_number": 76, "type": "dialogue", "speaker": "Ross", "text": "Only when it was damp!! (To Rachel) I cant believe you-you told people about this?! Everybody knew?! Yknow what? (To Will) Im back in the club!"}, {"line_number": 77, "type": "dialogue", "speaker": "Will", "text": "Yeah! (They high-five.)"}, {"line_number": 78, "type": "dialogue", "speaker": "Phoebe", "text": "I wanna join!"}, {"line_number": 79, "type": "dialogue", "speaker": "Rachel", "text": "WhPhoebe!!"}, {"line_number": 80, "type": "dialogue", "speaker": "Phoebe", "text": "Im sorry. Im sorry. I never got to be in a club. I-I didnt go to high school, but three of us would meet behind a dumpster to learn French. Bonjour."}, {"line_number": 81, "type": "dialogue", "speaker": "Rachel", "text": "All right, yknowFine! You guys have your stupid little club, but I would just like to say is what you did to me is way worse than what I did to you! You gave me a tiney-wienie! (Will laughs.)"}, {"line_number": 82, "type": "dialogue", "speaker": "Monica", "text": "All right, listen youre just being silly. Rachel, even with that rumor you were one of the most popular girls in school and everyone wanted to be like you. One girl wanted to be like you so much she stuffed her pants with a Tootsie Roll!"}, {"line_number": 83, "type": "dialogue", "speaker": "Rachel", "text": "Wow"}, {"line_number": 84, "type": "dialogue", "speaker": "Monica", "text": "And Ross, if it werent for Rachels rumor I mean no one in high school would even know who you were. She put you on the map!"}, {"line_number": 85, "type": "dialogue", "speaker": "Ross", "text": "As a romancer of the elderly."}, {"line_number": 86, "type": "dialogue", "speaker": "Monica", "text": "Hey! Mrs. Altman was the kind of woman you could tell she used to be pretty."}, {"line_number": 87, "type": "dialogue", "speaker": "Ross", "text": "The eyesdid still sparkle."}, {"line_number": 88, "type": "dialogue", "speaker": "Monica", "text": "Hey guys this stuff is just so way in the past. You-youve been through so much since then. And right now youve got so much more important stuff going on in your life. Cant you just let this go?"}, {"line_number": 89, "type": "dialogue", "speaker": "Rachel", "text": "Shes right."}, {"line_number": 90, "type": "dialogue", "speaker": "Ross", "text": "Yeah. I mean we are having a baby together."}, {"line_number": 91, "type": "dialogue", "speaker": "Will", "text": "Hold on! You got her pregnant?"}, {"line_number": 92, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 93, "type": "dialogue", "speaker": "Will", "text": "Are ya getting married?"}, {"line_number": 94, "type": "dialogue", "speaker": "Ross", "text": "Nope."}, {"line_number": 95, "type": "dialogue", "speaker": "Will", "text": "So you knocked her up but youre not gonna marry her. Dude! (Wants another high-five and Ross ignores him.) Anybody?"}, {"line_number": 96, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (Goes over and hugs him.) Its exactly how Id imagined it would be."}, {"line_number": 97, "type": "dialogue", "speaker": "Joey", "text": "(entering, wearing the maternity pants from earlier) All right wheres that turkey!"}, {"line_number": 98, "type": "dialogue", "speaker": "Phoebe", "text": "Joey! Those are my maternity pants!"}, {"line_number": 99, "type": "dialogue", "speaker": "Joey", "text": "Not now! These are my Thanksgiving pants!"}, {"line_number": 100, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S08E09", "season": 8, "episode_number": 9, "episode_title": "THE ONE WITH THE RUMOR", "scene_number": 5, "scene_id": "S08E09_005", "location": "Monica and Chandler's", "scene_description": "Will has left and the rest of the gang is watching Joey finish the turkey.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S08E09/scenes/S08E09_005", "raw_text": "[Scene: Monica and Chandler's, Will has left and the rest of the gang is watching Joey finish the turkey.]\nJoey: Well thats it. Im done. Whew! (Wipes his forehead.) There come the meat sweats. (Chandler hands him a towel and he wipes his face.)\nMonica: Well Joey, were allwere all very proud of you.\nChandler: Yes, I believe we can expect a call from the President any moment now.\nPhoebe: Is there anything we can do for you?\nJoey: No just, nobody press on my stomach.\nRachel: You can keep those pants by the way.\n(Joey notices Monica has gotten a pie.)\nJoey: Whoaheywh-wh-what do you got there? What is that? Pie?\nMonica: Yeah, you want some?\nJoey: Ah, just cut me a little sliver. (Monica prepares to cut a little sliver.) A little bigger. (Monica prepares to cut a bigger piece.) Little bigger. (Monica moves the knife again.) What?! Are you afraid youre gonna run out?! Cut me a real piece!\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Will has left and the rest of the gang is watching Joey finish the turkey.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Well thats it. Im done. Whew! (Wipes his forehead.) There come the meat sweats. (Chandler hands him a towel and he wipes his face.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Well Joey, were allwere all very proud of you."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Yes, I believe we can expect a call from the President any moment now."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Is there anything we can do for you?"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "No just, nobody press on my stomach."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "You can keep those pants by the way."}, {"line_number": 8, "type": "action", "text": "(Joey notices Monica has gotten a pie.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Whoaheywh-wh-what do you got there? What is that? Pie?"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Yeah, you want some?"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Ah, just cut me a little sliver. (Monica prepares to cut a little sliver.) A little bigger. (Monica prepares to cut a bigger piece.) Little bigger. (Monica moves the knife again.) What?! Are you afraid youre gonna run out?! Cut me a real piece!"}, {"line_number": 12, "type": "narration", "text": "End"}]}
