{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 1, "scene_id": "S08E22_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S08E22/scenes/S08E22_001", "raw_text": "THE ONE WHERE RACHEL IS LATE\nWritten by: Shana Goldberg-Meehan Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WHERE RACHEL IS LATE"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Shana Goldberg-Meehan Transcribed by: Eric Aasen"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 2, "scene_id": "S08E22_002", "location": "Central Perk", "scene_description": "Joey is showing everyone a poster as Ross enters.", "characters": ["Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_002", "raw_text": "[Scene: Central Perk, Joey is showing everyone a poster as Ross enters.]\nRoss: Hey! What are you guys looking at?\nJoey: Oh, its a poster for that World War I movie that Im in, check it out.\nRoss: Yeah? Wow! It looks really violent!\nJoey: Uh-huh! I know. Im coming soon to a theater near you! Im in THX! Im unsuitable for children!\nRoss: Now I cannot wait to see this.\nJoey: Yeah, yeah, its already generating Oscar buzz.\nPhoebe: I started that!\nJoey: I thought I did! Oh hey guess what? The premiere is next week and youre all invited! (They all gasp.)\nMonica: Are we gonna take a limo?\nJoey: Sure! Why not?!\nMonica: Oh I love taking limos when nobody died!\nRachel: Well obviously I wont be able to come, for those of you who havent checked their calendars today is my due date. Well yknow, I just want to take a moment and thank you guys for how great youve been during this time. I really couldnt have done it without you. And I have loved these last nine months! And even though I am so looking forward to the next part, I am really gonna miss being pregnant.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey is showing everyone a poster as Ross enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Hey! What are you guys looking at?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Oh, its a poster for that World War I movie that Im in, check it out."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Yeah? Wow! It looks really violent!"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Uh-huh! I know. Im coming soon to a theater near you! Im in THX! Im unsuitable for children!"}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Now I cannot wait to see this."}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Yeah, yeah, its already generating Oscar buzz."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "I started that!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "I thought I did! Oh hey guess what? The premiere is next week and youre all invited! (They all gasp.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Are we gonna take a limo?"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Sure! Why not?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Oh I love taking limos when nobody died!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Well obviously I wont be able to come, for those of you who havent checked their calendars today is my due date. Well yknow, I just want to take a moment and thank you guys for how great youve been during this time. I really couldnt have done it without you. And I have loved these last nine months! And even though I am so looking forward to the next part, I am really gonna miss being pregnant."}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 3, "scene_id": "S08E22_003", "location": "Central Perk", "scene_description": "time lapse, and Rachel is entering still pregnant.", "characters": ["Chandler", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_003", "raw_text": "[Scene: Central Perk, time lapse, and Rachel is entering still pregnant.]\nRachel: Thats right, still no baby! (To Monica, Joey, and Chandler on the couch) Come on people! Please make some room!\nRoss: Uh sweetie, maybe youd be more comfortable here? (Gets up from the green armchair.)\nRachel: You. Like you havent done enough.\nRoss: Look, I-I know how miserable you are, I wish there was something I can do. I mean I wish I were a seahorse. (She glares at him) Because with seahorses its the male, they carry the babies. And then also umm, Id be far away in the sea. (He sits back down.)\n(Rachel turns and looks at the group on the couch and they move over. Chandler measures the room theyve made with his arm and decides its not enough and they all move over again.)\nRachel: God. (Sits down.) I have never been so uncomfortable in my entire life!\nPhoebe: Oh I know, Ive been there. I remember toward the end\nRachel: (interrupting her) Oh Phoebe, thats a great story. Can you tell it to me when youre getting me some iced tea? (Phoebe gets up and Rachel groans.) (To the baby) Oh God, get out! Get out!! Get out!! Get out!!\nChandler: Lets. (Everyone gets up and leaves Rachel.)\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, time lapse, and Rachel is entering still pregnant.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Thats right, still no baby! (To Monica, Joey, and Chandler on the couch) Come on people! Please make some room!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Uh sweetie, maybe youd be more comfortable here? (Gets up from the green armchair.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "You. Like you havent done enough."}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Look, I-I know how miserable you are, I wish there was something I can do. I mean I wish I were a seahorse. (She glares at him) Because with seahorses its the male, they carry the babies. And then also umm, Id be far away in the sea. (He sits back down.)"}, {"line_number": 6, "type": "action", "text": "(Rachel turns and looks at the group on the couch and they move over. Chandler measures the room theyve made with his arm and decides its not enough and they all move over again.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "God. (Sits down.) I have never been so uncomfortable in my entire life!"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Oh I know, Ive been there. I remember toward the end"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "(interrupting her) Oh Phoebe, thats a great story. Can you tell it to me when youre getting me some iced tea? (Phoebe gets up and Rachel groans.) (To the baby) Oh God, get out! Get out!! Get out!! Get out!!"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "Lets. (Everyone gets up and leaves Rachel.)"}, {"line_number": 11, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 4, "scene_id": "S08E22_004", "location": "Monica and Chandler's", "scene_description": "Phoebe, Chandler, Joey, and Monica are there as Rachel enters.", "characters": ["Chandler", "Estelle", "Joey", "Monica", "Phoebe", "Rachel"], "firestore_path": "/episodes/S08E22/scenes/S08E22_004", "raw_text": "[Scene: Monica and Chandler's, Phoebe, Chandler, Joey, and Monica are there as Rachel enters.]\nChandler: Hey! Did you have the baby yet?\nRachel: Do you want me to come over there and sit on you? Cause Ill do it.\nMonica: What are you doing here so early?\nRachel: They sent me home from work. They were like, \"Start your maternity leave now! Just rest, get ready for the baby.\" Well yknow what? Screw em! If they dont want me there, Ill just hang out with you guys.\nPhoebe: Or you can do volunteer work.\n(Joeys cell phone rings and he answers it.)\nJoey: Hello?\nEstelle: Joey! Its Estelle! Great news, I was able to get you and one guest tickets to your premiere.\nJoey: One guest? You told me I can have six tickets!\nEstelle: Well, I sold four of them on Ebay. Youll be sitting next to HotGuy372.\nJoey: Oh my God. So thats it?! I only get to bring one guest?\nEstelle: Yeah, what time do you wanna pick me up? (Joey hangs up on her.) Hello?\nJoey: (to Monica, Chandler, and Phoebe) Did you hear that? I only get one extra ticket to my premiere. So some how I have to pick between you three and Ross.\nRachel: (overhearing that) What-what about me?\nJoey: You said you didnt want to go.\nRachel: I dont. But I would still like to be acknowledged. What? Just because Im pregnant you think Im invisible.\nJoey: Definitely not invisible.\nMonica: Well, well Ross didnt care enough to be here, so I think hes out. You snooze you lose.\nChandler: Hes not snoozing, hes teaching a class.\nMonica: Well then somebodys snoozing. Joey, not that this uh should affect you at all, but if you were to pick me, I was planning on wearing a sequined dress, cut down to here. (Points to her stomach just above her belly button.)\nChandler: I havent seen this dress.\nMonica: Star in a movie.\nPhoebe: Joey, you pick who ever you want. Okay? You just listen to your heart. What does it tell you? (Mimicking a heartbeat and tapping her chest.) Phoebe, Phoebe.\nJoey: Well uhI think I want to take Chandler.\nPhoebe: (still mimicking a heartbeat, only faster) Phoebe-Phoebe-Phoebe-PhoebeBurrrrr! (Mimics the sound of a cardiac monitor going off.)\nChandler: You really want to take me?\nJoey: Yeah! Yeah! I mean Im sorry, I wish I can take everybody, but yknow Chandler always supported my career. Hes paid for acting classes and head shots and stuff and well this will be my way of paying you back.\nChandler: So youre never actually going to pay me back?\nMonica: Wait a minute, just because he paid for your head shots youre gonna take him? Joey, I dont think youre comprehending just how slutty this dress is!\nJoey: Its not just the stuff he paid for, I mean its-its everything. Yknow? He read lines with me. He-he went with me on auditions when I was really nervous, and then he consoled me after I didnt get parts that I really wanted. You always believed in me man. Even, even when I didnt believe in myself.\nChandler: I always knew you were gonna make it. Im so proud of you.\nJoey: Thanks. That means a lot to me.\n(They look at each other and smile for a while.)\nPhoebe: Mon, maybe one of these guys wants to wear your dress.\nJoey: (in a manly voice) Im gonna go shave. (Gets up.)\nChandler: (in a manly voice) Yeah well, Im gonna go spit. (He goes into the bedroom. On his way out, Joey gives Rachel a wide berth.)\nRachel: Oh, I have to pee. If I dont come out in five minutes its because Ive choked to death on the potpourri stink. (Goes into the bathroom.)\nPhoebe: When she comes out, you hold her nose, Ill blow in her mouth, and the kid will just (makes a popping sound) right out of her.\nMonica: Shes over a week late! She gotta have it today, right?\nPhoebe: I dont know. I-I think its still gonna be a while.\nMonica: Hmm, care to make it interesting? Ill bet you that shell have it by this time tomorrow.\nPhoebe: Youre on!\nMonica: Okay, how much?\nPhoebe: One hundred thousand dollars!\nMonica: How about fifty bucks?\nPhoebe: Fine! Ill call Zurich and move some money around.\nRachel: (calling from the bathroom) All right, whos turn is it to help me get up!\n(They both look at each other, then Phoebe gets an idea.)\nPhoebe: No ones here! (Monica looks at her.) Oh damnit!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Phoebe, Chandler, Joey, and Monica are there as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Hey! Did you have the baby yet?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Do you want me to come over there and sit on you? Cause Ill do it."}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "What are you doing here so early?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "They sent me home from work. They were like, \"Start your maternity leave now! Just rest, get ready for the baby.\" Well yknow what? Screw em! If they dont want me there, Ill just hang out with you guys."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Or you can do volunteer work."}, {"line_number": 7, "type": "action", "text": "(Joeys cell phone rings and he answers it.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Hello?"}, {"line_number": 9, "type": "dialogue", "speaker": "Estelle", "text": "Joey! Its Estelle! Great news, I was able to get you and one guest tickets to your premiere."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "One guest? You told me I can have six tickets!"}, {"line_number": 11, "type": "dialogue", "speaker": "Estelle", "text": "Well, I sold four of them on Ebay. Youll be sitting next to HotGuy372."}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Oh my God. So thats it?! I only get to bring one guest?"}, {"line_number": 13, "type": "dialogue", "speaker": "Estelle", "text": "Yeah, what time do you wanna pick me up? (Joey hangs up on her.) Hello?"}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "(to Monica, Chandler, and Phoebe) Did you hear that? I only get one extra ticket to my premiere. So some how I have to pick between you three and Ross."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "(overhearing that) What-what about me?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "You said you didnt want to go."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "I dont. But I would still like to be acknowledged. What? Just because Im pregnant you think Im invisible."}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "Definitely not invisible."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "Well, well Ross didnt care enough to be here, so I think hes out. You snooze you lose."}, {"line_number": 20, "type": "dialogue", "speaker": "Chandler", "text": "Hes not snoozing, hes teaching a class."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "Well then somebodys snoozing. Joey, not that this uh should affect you at all, but if you were to pick me, I was planning on wearing a sequined dress, cut down to here. (Points to her stomach just above her belly button.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Chandler", "text": "I havent seen this dress."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Star in a movie."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Joey, you pick who ever you want. Okay? You just listen to your heart. What does it tell you? (Mimicking a heartbeat and tapping her chest.) Phoebe, Phoebe."}, {"line_number": 25, "type": "dialogue", "speaker": "Joey", "text": "Well uhI think I want to take Chandler."}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "(still mimicking a heartbeat, only faster) Phoebe-Phoebe-Phoebe-PhoebeBurrrrr! (Mimics the sound of a cardiac monitor going off.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Chandler", "text": "You really want to take me?"}, {"line_number": 28, "type": "dialogue", "speaker": "Joey", "text": "Yeah! Yeah! I mean Im sorry, I wish I can take everybody, but yknow Chandler always supported my career. Hes paid for acting classes and head shots and stuff and well this will be my way of paying you back."}, {"line_number": 29, "type": "dialogue", "speaker": "Chandler", "text": "So youre never actually going to pay me back?"}, {"line_number": 30, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, just because he paid for your head shots youre gonna take him? Joey, I dont think youre comprehending just how slutty this dress is!"}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Its not just the stuff he paid for, I mean its-its everything. Yknow? He read lines with me. He-he went with me on auditions when I was really nervous, and then he consoled me after I didnt get parts that I really wanted. You always believed in me man. Even, even when I didnt believe in myself."}, {"line_number": 32, "type": "dialogue", "speaker": "Chandler", "text": "I always knew you were gonna make it. Im so proud of you."}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "Thanks. That means a lot to me."}, {"line_number": 34, "type": "action", "text": "(They look at each other and smile for a while.)"}, {"line_number": 35, "type": "dialogue", "speaker": "Phoebe", "text": "Mon, maybe one of these guys wants to wear your dress."}, {"line_number": 36, "type": "dialogue", "speaker": "Joey", "text": "(in a manly voice) Im gonna go shave. (Gets up.)"}, {"line_number": 37, "type": "dialogue", "speaker": "Chandler", "text": "(in a manly voice) Yeah well, Im gonna go spit. (He goes into the bedroom. On his way out, Joey gives Rachel a wide berth.)"}, {"line_number": 38, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I have to pee. If I dont come out in five minutes its because Ive choked to death on the potpourri stink. (Goes into the bathroom.)"}, {"line_number": 39, "type": "dialogue", "speaker": "Phoebe", "text": "When she comes out, you hold her nose, Ill blow in her mouth, and the kid will just (makes a popping sound) right out of her."}, {"line_number": 40, "type": "dialogue", "speaker": "Monica", "text": "Shes over a week late! She gotta have it today, right?"}, {"line_number": 41, "type": "dialogue", "speaker": "Phoebe", "text": "I dont know. I-I think its still gonna be a while."}, {"line_number": 42, "type": "dialogue", "speaker": "Monica", "text": "Hmm, care to make it interesting? Ill bet you that shell have it by this time tomorrow."}, {"line_number": 43, "type": "dialogue", "speaker": "Phoebe", "text": "Youre on!"}, {"line_number": 44, "type": "dialogue", "speaker": "Monica", "text": "Okay, how much?"}, {"line_number": 45, "type": "dialogue", "speaker": "Phoebe", "text": "One hundred thousand dollars!"}, {"line_number": 46, "type": "dialogue", "speaker": "Monica", "text": "How about fifty bucks?"}, {"line_number": 47, "type": "dialogue", "speaker": "Phoebe", "text": "Fine! Ill call Zurich and move some money around."}, {"line_number": 48, "type": "dialogue", "speaker": "Rachel", "text": "(calling from the bathroom) All right, whos turn is it to help me get up!"}, {"line_number": 49, "type": "action", "text": "(They both look at each other, then Phoebe gets an idea.)"}, {"line_number": 50, "type": "dialogue", "speaker": "Phoebe", "text": "No ones here! (Monica looks at her.) Oh damnit!"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 5, "scene_id": "S08E22_005", "location": "The World Premiere of Over There", "scene_description": "Joey and Chandler are arriving in a limo and are about to walk down the red carpet.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S08E22/scenes/S08E22_005", "raw_text": "[Scene: The World Premiere of Over There, Joey and Chandler are arriving in a limo and are about to walk down the red carpet.]\nChandler: This is so exciting! Its so glamorous! People taking our picture. How do I look?\nJoey: A little tall.\nChandler: What?\nJoey: Do you mind crouching down a little bit, so that I look taller? (Chandler does so) There you go. (And they walk down the red carpet.)\nChandler: Its just so glamorous.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The World Premiere of Over There, Joey and Chandler are arriving in a limo and are about to walk down the red carpet.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "This is so exciting! Its so glamorous! People taking our picture. How do I look?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "A little tall."}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "What?"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Do you mind crouching down a little bit, so that I look taller? (Chandler does so) There you go. (And they walk down the red carpet.)"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Its just so glamorous."}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 6, "scene_id": "S08E22_006", "location": "Monica and Chandler's", "scene_description": "Rachel is entering, still pregnant.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_006", "raw_text": "[Scene: Monica and Chandler's, Rachel is entering, still pregnant.]\nPhoebe: Oh hey Mon? Rach is here! Ohh, youre still pregnant. Oh, Im sorry. I know how uncomfortable you are. Yknow what? You look great. Yeah, like fifty bucks.\nRachel: Oh, I have to go pee. Apparently this baby thinks that my bladder is a squeeze toy. (Goes to the bathroom.)\nMonica: Damnit! Damnit!! Heres your fifty bucks! (Pays Phoebe.)\nPhoebe: Its interesting that you lost. Now, I forget, do you like to lose?\nMonica: Now stop it! Double or nothing that she has it by tomorrow!\nPhoebe: Fine! Youre on!\nMonica: Okay.\nPhoebe: Until then, General Grant, why dont you set up camp (She puts the bill in her bra) right there.\nRoss: (entering) Hey is Rachel here? We have a doctors appointment.\nMonica: Shes in the bathroom.\nRoss: Rach, we gotta go.\nRachel: In a minute!!!\nRoss: People ask me why were not together, I just dont know what to tell them.\nRachel: (entering) All right, all right. Lets go!\nRoss: Uh, do you wanna go change first? The doctors keeping the office open late for us, but if you hurry\nRachel: No, Im fine.\nRoss: Really? You dont think thats a little inappropriate. (Shes wearing a tank top and has her belly sticking out.)\nPhoebe: Good God man dont anger it.\nRachel: Ross, it is 100 degrees outside. For the first time in weeks, I am somewhat comfortable.\nRoss: Fine! Fine! Yknow what? Whatever you want. Okay? Youre the mommy.\nRachel: Oh uh-uh pal! Dont call me mommy! Its bad enough you call your own mother that. (He looks at Monica.)\nMonica: Im actually with her on this one.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Rachel is entering, still pregnant.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Oh hey Mon? Rach is here! Ohh, youre still pregnant. Oh, Im sorry. I know how uncomfortable you are. Yknow what? You look great. Yeah, like fifty bucks."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I have to go pee. Apparently this baby thinks that my bladder is a squeeze toy. (Goes to the bathroom.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Damnit! Damnit!! Heres your fifty bucks! (Pays Phoebe.)"}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Its interesting that you lost. Now, I forget, do you like to lose?"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Now stop it! Double or nothing that she has it by tomorrow!"}, {"line_number": 7, "type": "dialogue", "speaker": "Phoebe", "text": "Fine! Youre on!"}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Okay."}, {"line_number": 9, "type": "dialogue", "speaker": "Phoebe", "text": "Until then, General Grant, why dont you set up camp (She puts the bill in her bra) right there."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey is Rachel here? We have a doctors appointment."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Shes in the bathroom."}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Rach, we gotta go."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "In a minute!!!"}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "People ask me why were not together, I just dont know what to tell them."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "(entering) All right, all right. Lets go!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Uh, do you wanna go change first? The doctors keeping the office open late for us, but if you hurry"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "No, Im fine."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Really? You dont think thats a little inappropriate. (Shes wearing a tank top and has her belly sticking out.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "Good God man dont anger it."}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "Ross, it is 100 degrees outside. For the first time in weeks, I am somewhat comfortable."}, {"line_number": 21, "type": "dialogue", "speaker": "Ross", "text": "Fine! Fine! Yknow what? Whatever you want. Okay? Youre the mommy."}, {"line_number": 22, "type": "dialogue", "speaker": "Rachel", "text": "Oh uh-uh pal! Dont call me mommy! Its bad enough you call your own mother that. (He looks at Monica.)"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Im actually with her on this one."}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 7, "scene_id": "S08E22_007", "location": "Inside Joeys Premiere", "scene_description": "he is intently watching the movie.", "characters": ["Joey"], "firestore_path": "/episodes/S08E22/scenes/S08E22_007", "raw_text": "[Scene: Inside Joeys Premiere, he is intently watching the movie.]\nJoey: (onscreen) \"I thought I knew who the enemy was, but it was you all along.\" \nJoey: (To Chandler) Okay, this is it. Its my big fight scene coming up. (He looks over and Chandler and notices that hes asleep.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Inside Joeys Premiere, he is intently watching the movie.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "(onscreen) \"I thought I knew who the enemy was, but it was you all along.\" "}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "(To Chandler) Okay, this is it. Its my big fight scene coming up. (He looks over and Chandler and notices that hes asleep.)"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 8, "scene_id": "S08E22_008", "location": "Dr. Longs Office", "scene_description": "Ross and Rachel are waiting for the doctor. Ross is drumming his fingers on the bed.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_008", "raw_text": "[Scene: Dr. Longs Office, Ross and Rachel are waiting for the doctor. Ross is drumming his fingers on the bed.]\nRachel: Ross.\nRoss: Yeah?\nRachel: Can I ask you something?\nRoss: Uh-huh.\nRachel: When Carol was pregnant with Ben\nRoss: Mmm?\nRachel: were you this irritating?\nRoss: Wow!\nRachel: Excuse me?!\nRoss: Oh nothing. Nothing! Just uh, youve been a little short with me lately. Im not trying to irritate you.\nRachel: Well then you just must have a natural talent for it.\nRoss: Yknow what? The doctor will be in soon, why dont we not speak until then.\nRachel: (silently) Okay. (Pause) Seriously, breathe louder Ross! Thats great!\nRoss: Yknow we should probably ask the doctor if she even knows how to deliver a baby thats half human and half pure evil!\n(Dr. Long enters.)\nRachel: Hi Dr. Long, how are you?\nRoss: (to Rachel) Oh, youre nice to her.\nRachel: She has the drugs!\nDr. Long: Well do a quick check.\nRachel: Okay. (Rachel lies back.)\nDr. Long: So, eight days late huh?\nRachel: Yeah.\nDr. Long: You must be a little uncomfortable.\nRachel: Eh, just a tad.\nDr. Long: Youre about 80 percent effaced, so youre on your way. It still could last a little while longer. If youre anxious there are a few ways to help things along.\nRoss: Do them!!\nDr. Long: Actually, theyre things you can do. Just some home remedies, but in my experience Ive found that some of them are quite effective.\nRachel: Well, we are ready to try anything.\nDr. Long: Okay, theres an herbal tea you can drink.\nRachel: Okay.\nDr. Long: You can take some caster oil, theres eating spicy foods\nRachel: Great! We will do all of those.\nDr. Long: taking a long walk, and then theres the one thats proved most effective: sex.\n(Rachel turns and looks at Ross.)\nRoss: Youve got to be kidding me!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Dr. Longs Office, Ross and Rachel are waiting for the doctor. Ross is drumming his fingers on the bed.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Ross."}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Yeah?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Can I ask you something?"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Uh-huh."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "When Carol was pregnant with Ben"}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Mmm?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "were you this irritating?"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Wow!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Excuse me?!"}, {"line_number": 11, "type": "dialogue", "speaker": "Ross", "text": "Oh nothing. Nothing! Just uh, youve been a little short with me lately. Im not trying to irritate you."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "Well then you just must have a natural talent for it."}, {"line_number": 13, "type": "dialogue", "speaker": "Ross", "text": "Yknow what? The doctor will be in soon, why dont we not speak until then."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "(silently) Okay. (Pause) Seriously, breathe louder Ross! Thats great!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "Yknow we should probably ask the doctor if she even knows how to deliver a baby thats half human and half pure evil!"}, {"line_number": 16, "type": "action", "text": "(Dr. Long enters.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Hi Dr. Long, how are you?"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "(to Rachel) Oh, youre nice to her."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "She has the drugs!"}, {"line_number": 20, "type": "narration", "text": "Dr. Long: Well do a quick check."}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Okay. (Rachel lies back.)"}, {"line_number": 22, "type": "narration", "text": "Dr. Long: So, eight days late huh?"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 24, "type": "narration", "text": "Dr. Long: You must be a little uncomfortable."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "Eh, just a tad."}, {"line_number": 26, "type": "narration", "text": "Dr. Long: Youre about 80 percent effaced, so youre on your way. It still could last a little while longer. If youre anxious there are a few ways to help things along."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "Do them!!"}, {"line_number": 28, "type": "narration", "text": "Dr. Long: Actually, theyre things you can do. Just some home remedies, but in my experience Ive found that some of them are quite effective."}, {"line_number": 29, "type": "dialogue", "speaker": "Rachel", "text": "Well, we are ready to try anything."}, {"line_number": 30, "type": "narration", "text": "Dr. Long: Okay, theres an herbal tea you can drink."}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 32, "type": "narration", "text": "Dr. Long: You can take some caster oil, theres eating spicy foods"}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "Great! We will do all of those."}, {"line_number": 34, "type": "narration", "text": "Dr. Long: taking a long walk, and then theres the one thats proved most effective: sex."}, {"line_number": 35, "type": "action", "text": "(Rachel turns and looks at Ross.)"}, {"line_number": 36, "type": "dialogue", "speaker": "Ross", "text": "Youve got to be kidding me!"}, {"line_number": 37, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 9, "scene_id": "S08E22_009", "location": "Joeys Premiere", "scene_description": "the movie is ending and it takes the applause to wake up Chandler.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S08E22/scenes/S08E22_009", "raw_text": "[Scene: Joeys Premiere, the movie is ending and it takes the applause to wake up Chandler.]\nChandler: Good job Joe! Well done! Top notch!\nJoey: You liked it? You really liked it?\nChandler: Oh-ho-ho, yeah!\nJoey: Which part exactly?\nChandler: The whole thing! Can we go?\nJoey: Oh no-no-no, give me some specifics.\nChandler: I love the specifics, the specifics were the best part!\nJoey: Hey, what about the scene with the kangaroo? Did-did you like that part?\nChandler: I was surprised to see a kangaroo in a World War I epic.\nJoey: You fell asleep!! There was no kangaroo! They didnt take any of my suggestions! Thats for coming buddy. Ill see you later. (Starts to walk out.)\nChandler: Dont go! Im sorry. Im so sorry! (Sees another guy who is still asleep.) Look! This guy fell asleep! He fell asleep too! Be mad at him! (Looks at him more closely.) Or, call an ambulance.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Joeys Premiere, the movie is ending and it takes the applause to wake up Chandler.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Good job Joe! Well done! Top notch!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "You liked it? You really liked it?"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Oh-ho-ho, yeah!"}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Which part exactly?"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "The whole thing! Can we go?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Oh no-no-no, give me some specifics."}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "I love the specifics, the specifics were the best part!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Hey, what about the scene with the kangaroo? Did-did you like that part?"}, {"line_number": 10, "type": "dialogue", "speaker": "Chandler", "text": "I was surprised to see a kangaroo in a World War I epic."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "You fell asleep!! There was no kangaroo! They didnt take any of my suggestions! Thats for coming buddy. Ill see you later. (Starts to walk out.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Chandler", "text": "Dont go! Im sorry. Im so sorry! (Sees another guy who is still asleep.) Look! This guy fell asleep! He fell asleep too! Be mad at him! (Looks at him more closely.) Or, call an ambulance."}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 10, "scene_id": "S08E22_010", "location": "Central Perk", "scene_description": "Ross and Rachel are there as Phoebe and Monica enter.", "characters": ["Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_010", "raw_text": "[Scene: Central Perk, Ross and Rachel are there as Phoebe and Monica enter.]\nMonica: Hey!\nRoss: Hey.\nRachel: Hi!\nMonica: What did the doctor say? Any news on when the baby will come?\nRachel: No. But she did give us some ideas on how to induce labor.\nRoss: Yeah, we tried them all. We went for a walk, uh we tried a special tea, caster oil, spicy food nothing has worked.\nRachel: Well, there is one thing that we havent tried, but someone thinks that, (mimicking Ross) \"That will open up a can of worms.\"\nMonica: Well what is it? What is it? If its gonna help bring the baby here, like today. I mean, I think you should do it.\nRoss: Its sex.\nMonica: Do it!\nRoss: Monica!\nMonica: Im just saying its been a really long time for you. I mean, women have needs. Do it, get yours!\nPhoebe: Oh I-I dont know about that. No, I think that if the two of you had sex the-the-the repercussions would be catastrophic. \nMonica: All right, lets be practical, if Ross isnt willing to do it, hes not the only guy in the world you can have sex with. You can borrow ChandlerChandler is good!\nRoss: Monica, what is the matter with you?\nMonica: Nothing. I just want the baby to be born today.\nRachel: Why? Why today?\nMonica: Okay fine! I keep betting Phoebe that youre gonna have the baby and I dont want to lose again!\nRoss: What?! While shes been going through this hell, youve been making money?! Youre betting on your friend staying in this misery?! (Phoebe lowers her head and shakes it yes.)\nRachel: Ill take that bet.\nRoss: What?!\nRachel: Well, Im miserable here! I might as well make some money out it!\nRoss: Can I get some of that action?\nMonica: Wait a minute! Now Im betting against all three of you?\nRachel: Oh honey, dont worry. I really do feel like tomorrows the day.\nMonica: Oh, okay!\n(Rachel turns her head to Ross and Phoebe and mouths, \"No way.\")", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Ross and Rachel are there as Phoebe and Monica enter.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Hey!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Hey."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "What did the doctor say? Any news on when the baby will come?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "No. But she did give us some ideas on how to induce labor."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Yeah, we tried them all. We went for a walk, uh we tried a special tea, caster oil, spicy food nothing has worked."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Well, there is one thing that we havent tried, but someone thinks that, (mimicking Ross) \"That will open up a can of worms.\""}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Well what is it? What is it? If its gonna help bring the baby here, like today. I mean, I think you should do it."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Its sex."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Do it!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Monica!"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "Im just saying its been a really long time for you. I mean, women have needs. Do it, get yours!"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Oh I-I dont know about that. No, I think that if the two of you had sex the-the-the repercussions would be catastrophic. "}, {"line_number": 15, "type": "dialogue", "speaker": "Monica", "text": "All right, lets be practical, if Ross isnt willing to do it, hes not the only guy in the world you can have sex with. You can borrow ChandlerChandler is good!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Monica, what is the matter with you?"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "Nothing. I just want the baby to be born today."}, {"line_number": 18, "type": "dialogue", "speaker": "Rachel", "text": "Why? Why today?"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "Okay fine! I keep betting Phoebe that youre gonna have the baby and I dont want to lose again!"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "What?! While shes been going through this hell, youve been making money?! Youre betting on your friend staying in this misery?! (Phoebe lowers her head and shakes it yes.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Ill take that bet."}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "What?!"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Well, Im miserable here! I might as well make some money out it!"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "Can I get some of that action?"}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute! Now Im betting against all three of you?"}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Oh honey, dont worry. I really do feel like tomorrows the day."}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "Oh, okay!"}, {"line_number": 28, "type": "action", "text": "(Rachel turns her head to Ross and Phoebe and mouths, \"No way.\")"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 11, "scene_id": "S08E22_011", "location": "Monica and Chandler's", "scene_description": "Chandler is there as Joey enters.", "characters": ["Chandler", "Joey"], "firestore_path": "/episodes/S08E22/scenes/S08E22_011", "raw_text": "[Scene: Monica and Chandler's, Chandler is there as Joey enters.]\nJoey: Hey! Sleeping beauty!\nChandler: Where have you been?! I tried to call you! I want to talk to you! I still feel so bad!\nJoey: (in a baby voice) Oh no, were you upset? Did you lose sleep?\nChandler: Im so sorry.\nJoey: Uh-huh look, the only reason I can over here was to settle things between us! Okay? Youve done a lot for me and my career, I wanted to pay you back so I took you to the premiere but you missed it! Okay, so how much do I owe you?\nChandler: What?!\nJoey: Give me a number, I dont want to owe you anything!\nChandler: You dont owe me anything, I dont want you money\nJoey: Ah-ah-ah! Were doing this! Okay, now you got me my first set of head shots. Right, how much were those?\nChandler: I dont know, five hundred dollars?\nJoey: Okay, five hundred dollars. What else?\nChandler: Well then there was the second set, the infamous booger head shots.\nJoey: Okay, so thats another five hundred. Five hundred and five hundred, thats (Pauses to figure it out.)\nChandler: Do you want a calculator?\nJoey: Please! \nChandler: Here! (Hands him one. Joey adds it up and discovers that he was right.)\nJoey: All right, what else?\nChandler: Well uh, there was acting classes, stage combat classes, tap classes\nJoey: Which were still keeping under our hats!\nChandler: Uh then there was that dialect coach who helped you with that play where you needed a southern accent. Which after twenty hours of lessons still came out Jamaican. \nJoey: What the hell are you talking about, (in a Jamaican accent) \"The south will rise again man.\"\nChandler: Yes, money well spent!\nJoey: Yeah. Okay, what else? Rent!\nChandler: Okay, two, three years of rent, utilities, food\nJoey: Okay. Okay, so Im writing you a check forSo you fell asleep during my movie. Big deal right? How do you clear this thing?", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is there as Joey enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey! Sleeping beauty!"}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Where have you been?! I tried to call you! I want to talk to you! I still feel so bad!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(in a baby voice) Oh no, were you upset? Did you lose sleep?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Im so sorry."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Uh-huh look, the only reason I can over here was to settle things between us! Okay? Youve done a lot for me and my career, I wanted to pay you back so I took you to the premiere but you missed it! Okay, so how much do I owe you?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "What?!"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "Give me a number, I dont want to owe you anything!"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "You dont owe me anything, I dont want you money"}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "Ah-ah-ah! Were doing this! Okay, now you got me my first set of head shots. Right, how much were those?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "I dont know, five hundred dollars?"}, {"line_number": 12, "type": "dialogue", "speaker": "Joey", "text": "Okay, five hundred dollars. What else?"}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Well then there was the second set, the infamous booger head shots."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Okay, so thats another five hundred. Five hundred and five hundred, thats (Pauses to figure it out.)"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Do you want a calculator?"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Please! "}, {"line_number": 17, "type": "dialogue", "speaker": "Chandler", "text": "Here! (Hands him one. Joey adds it up and discovers that he was right.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "All right, what else?"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "Well uh, there was acting classes, stage combat classes, tap classes"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "Which were still keeping under our hats!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Uh then there was that dialect coach who helped you with that play where you needed a southern accent. Which after twenty hours of lessons still came out Jamaican. "}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "What the hell are you talking about, (in a Jamaican accent) \"The south will rise again man.\""}, {"line_number": 23, "type": "dialogue", "speaker": "Chandler", "text": "Yes, money well spent!"}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "Yeah. Okay, what else? Rent!"}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "Okay, two, three years of rent, utilities, food"}, {"line_number": 26, "type": "dialogue", "speaker": "Joey", "text": "Okay. Okay, so Im writing you a check forSo you fell asleep during my movie. Big deal right? How do you clear this thing?"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 12, "scene_id": "S08E22_012", "location": "Ross and Rachel's", "scene_description": "Ross and Rachel are trying the home remedies again.", "characters": ["Rachel", "Ross"], "firestore_path": "/episodes/S08E22/scenes/S08E22_012", "raw_text": "[Scene: Ross and Rachel's, Ross and Rachel are trying the home remedies again.]\nRoss: Come on, finish your enchilada.\nRachel: Ross IWe tried all the spicy food. Its not working.\nRoss: Okay here, have one of these peppers. Oh ha Oh God! Soso hot! (Rubs his eyes.) Oh my(Laughs.) By the way, you dont want to touch the pepper and then touch your eye.\nRachel: I am feeling nothing. Speaking of hot, watching you do that really makes me want to have sex with you.\nRoss: Stop it.\nRachel: Oh come on Ross, why are we wasting our time with this other stuff?! We know whats gonna work! Its doctor recommended!\nRoss: Im sorry, but we have to have some boundaries! My God, Im dying.\nRachel: Oh come on Ross, weve done it before well do it again, itll be a nice way to bookend the pregnancy.\nRoss: This is insane, Im not gonna make love to you just so that youll go into labor.\nRachel: Make love? What are you a girl?\nRoss: Always a great way to get in a mans pants.\nRachel: But you will, you will be performing a service. Okay? Just-just think of me as a ketchup bottle, yknow you sometimes you have to bang on the end of it just to get something to come out.\nRoss: I love when you talk dirty to me.\nRachel: Oh, I know it. Youre right. Thats not sexy. OhOh! (Drops a fork on the floor.) Whoops! Oh, I seem to have dropped my fork. Let me just bed over and get it. (Tries too, but cant quite seem to make it.) Oh God!\nRoss: Okay enough! This is, this is not going to happen.\nRachel: Come on Ross! Im miserable here! Come on! You started this, now you finish it! Come on wuss, make love to me.\nRoss: Yknow what?\nRachel: What?!\nRoss: Forget it.\nRachel: Oh wow! What now Ross youre not gonna talk? How on earth will you ever annoy me? Oh wait a minute, I know. (Mimics his breathing.) I mean youd think the damn jalepeno wouldve cleared up your sinuses, but no!! Thats not enough (Ross jumps over and kisses her.) What are you doing?!\nRoss: Im getting that baby out of you!\n(They kiss again.)\nRachel: (breaking the kiss) Oh God!\nRoss: Oh, I know.\nRachel: Oh no. No-no! I think my water just broke.\nRoss: I am good. Okay! Okay! Uh, I got the pillow! I got the bag! You got the keys?\nRachel: Okay! I got the keys! Okay! Okay!\nRoss: Hey!\nRachel: Yeah.\nRoss: Were having a baby.\n(They hug and then kiss one more time.)\nRachel: I didnt uh, really have time to read this part of the books, but do you think we have time to\nRoss: Not so much.\nRachel: Okay.\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, Ross and Rachel are trying the home remedies again.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Come on, finish your enchilada."}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Ross IWe tried all the spicy food. Its not working."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "Okay here, have one of these peppers. Oh ha Oh God! Soso hot! (Rubs his eyes.) Oh my(Laughs.) By the way, you dont want to touch the pepper and then touch your eye."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "I am feeling nothing. Speaking of hot, watching you do that really makes me want to have sex with you."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "Stop it."}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Oh come on Ross, why are we wasting our time with this other stuff?! We know whats gonna work! Its doctor recommended!"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "Im sorry, but we have to have some boundaries! My God, Im dying."}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Oh come on Ross, weve done it before well do it again, itll be a nice way to bookend the pregnancy."}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "This is insane, Im not gonna make love to you just so that youll go into labor."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Make love? What are you a girl?"}, {"line_number": 12, "type": "dialogue", "speaker": "Ross", "text": "Always a great way to get in a mans pants."}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "But you will, you will be performing a service. Okay? Just-just think of me as a ketchup bottle, yknow you sometimes you have to bang on the end of it just to get something to come out."}, {"line_number": 14, "type": "dialogue", "speaker": "Ross", "text": "I love when you talk dirty to me."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Oh, I know it. Youre right. Thats not sexy. OhOh! (Drops a fork on the floor.) Whoops! Oh, I seem to have dropped my fork. Let me just bed over and get it. (Tries too, but cant quite seem to make it.) Oh God!"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "Okay enough! This is, this is not going to happen."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Come on Ross! Im miserable here! Come on! You started this, now you finish it! Come on wuss, make love to me."}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Yknow what?"}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Forget it."}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Oh wow! What now Ross youre not gonna talk? How on earth will you ever annoy me? Oh wait a minute, I know. (Mimics his breathing.) I mean youd think the damn jalepeno wouldve cleared up your sinuses, but no!! Thats not enough (Ross jumps over and kisses her.) What are you doing?!"}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Im getting that baby out of you!"}, {"line_number": 23, "type": "action", "text": "(They kiss again.)"}, {"line_number": 24, "type": "dialogue", "speaker": "Rachel", "text": "(breaking the kiss) Oh God!"}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Oh, I know."}, {"line_number": 26, "type": "dialogue", "speaker": "Rachel", "text": "Oh no. No-no! I think my water just broke."}, {"line_number": 27, "type": "dialogue", "speaker": "Ross", "text": "I am good. Okay! Okay! Uh, I got the pillow! I got the bag! You got the keys?"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Okay! I got the keys! Okay! Okay!"}, {"line_number": 29, "type": "dialogue", "speaker": "Ross", "text": "Hey!"}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 31, "type": "dialogue", "speaker": "Ross", "text": "Were having a baby."}, {"line_number": 32, "type": "action", "text": "(They hug and then kiss one more time.)"}, {"line_number": 33, "type": "dialogue", "speaker": "Rachel", "text": "I didnt uh, really have time to read this part of the books, but do you think we have time to"}, {"line_number": 34, "type": "dialogue", "speaker": "Ross", "text": "Not so much."}, {"line_number": 35, "type": "dialogue", "speaker": "Rachel", "text": "Okay."}, {"line_number": 36, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S08E22", "season": 8, "episode_number": 22, "episode_title": "THE ONE WHERE RACHEL IS LATE", "scene_number": 13, "scene_id": "S08E22_013", "location": "Monica and Chandler's", "scene_description": "Monica is paying Phoebe.", "characters": ["Monica", "Phoebe"], "firestore_path": "/episodes/S08E22/scenes/S08E22_013", "raw_text": "[Scene: Monica and Chandler's, Monica is paying Phoebe.]\nMonica: Two hundred.\nPhoebe: Thank you!\nMonica: Thats it. Im done. I dont care when the baby comes, no more betting.\nPhoebe: Okay.\n(The phone rings and Monica answers it.)\nMonica: Hello? (Listens) Uh-huh. (Listens) Uh-huh. (Listens) Okay. (Hangs up.) I guess we can bet one more time.\nPhoebe: Is Rachel having the baby?\nMonica: How did you know that?! (Runs to yell at Joeys apartment.) Joey! Chandler!! Its time!\nPhoebe: Theyre at the coffeehouse.\nMonica: You know everything!! Oh wait, double or nothing. I bet you the baby is over seven pounds. (Phoebe isnt interested.) I bet you it has hair. (Shes still not interested.) I bet you its a girl.\nPhoebe: We know its a girl! (Exits.)\nMonica: (following her) Ill give you really good odds.\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica is paying Phoebe.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Monica", "text": "Two hundred."}, {"line_number": 3, "type": "dialogue", "speaker": "Phoebe", "text": "Thank you!"}, {"line_number": 4, "type": "dialogue", "speaker": "Monica", "text": "Thats it. Im done. I dont care when the baby comes, no more betting."}, {"line_number": 5, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 6, "type": "action", "text": "(The phone rings and Monica answers it.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Hello? (Listens) Uh-huh. (Listens) Uh-huh. (Listens) Okay. (Hangs up.) I guess we can bet one more time."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Is Rachel having the baby?"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "How did you know that?! (Runs to yell at Joeys apartment.) Joey! Chandler!! Its time!"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Theyre at the coffeehouse."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "You know everything!! Oh wait, double or nothing. I bet you the baby is over seven pounds. (Phoebe isnt interested.) I bet you it has hair. (Shes still not interested.) I bet you its a girl."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "We know its a girl! (Exits.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "(following her) Ill give you really good odds."}, {"line_number": 14, "type": "narration", "text": "End"}]}
