{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 1, "scene_id": "S08E17_001", "location": "", "scene_description": "", "characters": ["Teleplay by"], "firestore_path": "/episodes/S08E17/scenes/S08E17_001", "raw_text": "THE ONE WITH THE TEA LEAVES\nTeleplay by: Steven Rosenhaus Story by: R. Lee Flemming, Jr. Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "THE ONE WITH THE TEA LEAVES"}, {"line_number": 2, "type": "dialogue", "speaker": "Teleplay by", "text": "Steven Rosenhaus Story by: R. Lee Flemming, Jr. Transcribed by: Eric Aasen"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 2, "scene_id": "S08E17_002", "location": "The Hallway", "scene_description": "Rachel walks up the stairs and knocks on Joeys door.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_002", "raw_text": "[Scene: The Hallway, Rachel walks up the stairs and knocks on Joeys door.]\nRachel: Joey? Are you in there?\n[Cut to inside Monica and Chandlers, Monica, Chandler and Joey are eating breakfast.]\nJoey: (hearing Rachel and jumping up with his plate) Oh God! Thats Rachel!\nMonica: Joey, you have to talk to her!\nJoey: No-no, I cant! I cant! Not after the other night, its just itstoo weird, okay? Dont tell her Im here! (Turns to run to the bathroom and his bagel falls off the plate onto the floor.) Dont eat that! (Runs to the bathroom as Rachel enters.)\nRachel: Hey!\nChandler: Hey!\nMonica: Hey Rachel!\nRachel: Is Joey here?\nChandler: I dont see him. (To Monica) Do you see him?\nMonica: I dont see him. Hey! Maybe hes in the sugar bowl! (Opens the sugar bowl) Joey? Nope! (Closes the sugar bowl and they both laugh.)\nRachel: Well, at least you make each other laugh.\nMonica: Whats up?\nRachel: Well, I havent seen him since that night that he told me how he yknow I dont know, I think hes avoiding me. Why is that bagel on the floor?\nMonica: We were playing a game.\nRachel: Ew, was Chandler naked? Sort of like a, like a ring toss kind of situation?\nMonica: Sure.\nChandler: What?! No! No!\nRachel: All right. Well listen, if you see Joey will you just tell him uhtell him I miss him. (Exits and Joey enters.)\nMonica: (To Joey) Okay, did you hear that?\nJoey: Yeah, a naked bagel game? (Picks up his dropped bagel.) (To Chandler) Dude, I dont know. Thats a pretty small hole.\nMonica: Honey, you gotta talk to her.\nJoey: I cant! Yknow? You guys dont know what its like to put yourself out there like that and just get shot down.\nChandler: (incredulous) I dont know what thats like?! Up until I was 25 I thought the only response to, \"I love you,\" was, \"Oh crap!\"\nMonica: Hello? No rejection? I got shot down at fat camp! Boy, kids are mean when theyre hungry.\nJoey: All right so, so what do I do?\nMonica: This is Rachel. I mean, what are you gonna do, never going to talk to her again? I mean I know its weird, its awkward, but you gotta at least try.\nJoey: Yeah. Okay. (Goes to take a bite out of the previously mentioned bagel.) Whoa! (Stops.) I almost forgot this was on your\nChandler: (interrupting him) We didnt play it!!\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The Hallway, Rachel walks up the stairs and knocks on Joeys door.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Joey? Are you in there?"}, {"line_number": 3, "type": "narration", "text": "[Cut to inside Monica and Chandlers, Monica, Chandler and Joey are eating breakfast.]"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "(hearing Rachel and jumping up with his plate) Oh God! Thats Rachel!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Joey, you have to talk to her!"}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "No-no, I cant! I cant! Not after the other night, its just itstoo weird, okay? Dont tell her Im here! (Turns to run to the bathroom and his bagel falls off the plate onto the floor.) Dont eat that! (Runs to the bathroom as Rachel enters.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Rachel", "text": "Hey!"}, {"line_number": 8, "type": "dialogue", "speaker": "Chandler", "text": "Hey!"}, {"line_number": 9, "type": "dialogue", "speaker": "Monica", "text": "Hey Rachel!"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Is Joey here?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "I dont see him. (To Monica) Do you see him?"}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "I dont see him. Hey! Maybe hes in the sugar bowl! (Opens the sugar bowl) Joey? Nope! (Closes the sugar bowl and they both laugh.)"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Well, at least you make each other laugh."}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Whats up?"}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Well, I havent seen him since that night that he told me how he yknow I dont know, I think hes avoiding me. Why is that bagel on the floor?"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "We were playing a game."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Ew, was Chandler naked? Sort of like a, like a ring toss kind of situation?"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Sure."}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "What?! No! No!"}, {"line_number": 20, "type": "dialogue", "speaker": "Rachel", "text": "All right. Well listen, if you see Joey will you just tell him uhtell him I miss him. (Exits and Joey enters.)"}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "(To Joey) Okay, did you hear that?"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "Yeah, a naked bagel game? (Picks up his dropped bagel.) (To Chandler) Dude, I dont know. Thats a pretty small hole."}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Honey, you gotta talk to her."}, {"line_number": 24, "type": "dialogue", "speaker": "Joey", "text": "I cant! Yknow? You guys dont know what its like to put yourself out there like that and just get shot down."}, {"line_number": 25, "type": "dialogue", "speaker": "Chandler", "text": "(incredulous) I dont know what thats like?! Up until I was 25 I thought the only response to, \"I love you,\" was, \"Oh crap!\""}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "Hello? No rejection? I got shot down at fat camp! Boy, kids are mean when theyre hungry."}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "All right so, so what do I do?"}, {"line_number": 28, "type": "dialogue", "speaker": "Monica", "text": "This is Rachel. I mean, what are you gonna do, never going to talk to her again? I mean I know its weird, its awkward, but you gotta at least try."}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "Yeah. Okay. (Goes to take a bite out of the previously mentioned bagel.) Whoa! (Stops.) I almost forgot this was on your"}, {"line_number": 30, "type": "dialogue", "speaker": "Chandler", "text": "(interrupting him) We didnt play it!!"}, {"line_number": 31, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 3, "scene_id": "S08E17_003", "location": "Central Perk", "scene_description": "Phoebe is holding a book as she, Rachel, and Monica drink some tea as Chandler looks on.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S08E17/scenes/S08E17_003", "raw_text": "[Scene: Central Perk, Phoebe is holding a book as she, Rachel, and Monica drink some tea as Chandler looks on.]\nPhoebe: Okay, so when youre done with your tea Ill look at your leaves and tell you your fortune.\nChandler: I didnt know you read tea leaves.\nPhoebe: Oh yeah, Ive done it for years. I actually stopped because I was so accurate. Yknow, and-and yknow, one of the great joys of life is its-its wondrous unpredictability. Yknow? And also tea tends to give me the trots.\nMonica: Okay, Im done. Read mine.\nPhoebe: Okay. (Looks at the leaves.) Ooh, I see a ladder. (Checks the book) Which can mean either a promotion or a violent death.\nMonica: (stunned) I-Im the head chef. I-I cant get promoted.\nPhoebe: Uh-hmm. Uh-hmm, whos next?\nRachel: Okay, Im done. Do mine.\nPhoebe: Okay. (Reads the leaves) Umm, oh! Okay, I see a circle.\nRachel: Ah.\nPhoebe: Oh! (Checking the book) Which can either mean youre having a baby or youre gonna make a scientific discovery!\nRachel: Well, I have been spending a lot of time in the lab.\nChandler: What does yours say Pheebs?\nPhoebe: Umm Wow, all right. (Checks the book.) Wow! Yay! Ooh, Im gonna meet a guy! And really soon! And hes gonna be the man of my dreams. Probably not the guy I had a dream about last night. (Points at Chandler.)\nRoss: (entering) Hey! Has anyone seen my shirt? Its a button down, like a, like a faded salmon?\nMonica: You mean your pink shirt?\nRoss: Faded salmon color.\nMonica: No, I-I havent seen your pink shirt.\nRoss: Great! Great. Then I mustve left it at Monas. I knew it!\nChandler: Well, Im sure you get another one at Ann Taylors.\nRoss: Thats my favorite shirt! Okay? I love that shirt!\nRachel: Well just ask Mona to give it back!\nRoss: I dont know. I mean I-I guess I could. Its just that we didnt really end things such good terms. And if I go over there Id be ignoring the one thing she asked me to do when we broke up, jump up my own ass and die. (Walks away.)\nPhoebe: (noticing a guy sitting by the green post looking at her) Oh wait a second you guysfor the last couple weeks Ive been that guy everywhere I go. We take the same bus. We go to the same bookstore, the same dry cleaners; maybe hes the tea guy. (He gets up to leave, and smiles at Phoebe.)\nChandler: Phoebe, did you see that?! He totally checked you out! He is so cute! (Looking at his tea.) Mine has a picture of The Village People, what does that mean?\n(Joey enters.)\nRachel: Hi!\nJoey: Hey.\n(He slowly walks to the other side of the couch and sits down at the table, an awkward silence follows.)\nRachel: Hi.\nJoey: Hi.\n(More awkward silence.)\nMonica: Tea gives Phoebe the trots.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Phoebe is holding a book as she, Rachel, and Monica drink some tea as Chandler looks on.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, so when youre done with your tea Ill look at your leaves and tell you your fortune."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "I didnt know you read tea leaves."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh yeah, Ive done it for years. I actually stopped because I was so accurate. Yknow, and-and yknow, one of the great joys of life is its-its wondrous unpredictability. Yknow? And also tea tends to give me the trots."}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Okay, Im done. Read mine."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (Looks at the leaves.) Ooh, I see a ladder. (Checks the book) Which can mean either a promotion or a violent death."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "(stunned) I-Im the head chef. I-I cant get promoted."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Uh-hmm. Uh-hmm, whos next?"}, {"line_number": 9, "type": "dialogue", "speaker": "Rachel", "text": "Okay, Im done. Do mine."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. (Reads the leaves) Umm, oh! Okay, I see a circle."}, {"line_number": 11, "type": "dialogue", "speaker": "Rachel", "text": "Ah."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Oh! (Checking the book) Which can either mean youre having a baby or youre gonna make a scientific discovery!"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "Well, I have been spending a lot of time in the lab."}, {"line_number": 14, "type": "dialogue", "speaker": "Chandler", "text": "What does yours say Pheebs?"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "Umm Wow, all right. (Checks the book.) Wow! Yay! Ooh, Im gonna meet a guy! And really soon! And hes gonna be the man of my dreams. Probably not the guy I had a dream about last night. (Points at Chandler.)"}, {"line_number": 16, "type": "dialogue", "speaker": "Ross", "text": "(entering) Hey! Has anyone seen my shirt? Its a button down, like a, like a faded salmon?"}, {"line_number": 17, "type": "dialogue", "speaker": "Monica", "text": "You mean your pink shirt?"}, {"line_number": 18, "type": "dialogue", "speaker": "Ross", "text": "Faded salmon color."}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "No, I-I havent seen your pink shirt."}, {"line_number": 20, "type": "dialogue", "speaker": "Ross", "text": "Great! Great. Then I mustve left it at Monas. I knew it!"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Well, Im sure you get another one at Ann Taylors."}, {"line_number": 22, "type": "dialogue", "speaker": "Ross", "text": "Thats my favorite shirt! Okay? I love that shirt!"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Well just ask Mona to give it back!"}, {"line_number": 24, "type": "dialogue", "speaker": "Ross", "text": "I dont know. I mean I-I guess I could. Its just that we didnt really end things such good terms. And if I go over there Id be ignoring the one thing she asked me to do when we broke up, jump up my own ass and die. (Walks away.)"}, {"line_number": 25, "type": "dialogue", "speaker": "Phoebe", "text": "(noticing a guy sitting by the green post looking at her) Oh wait a second you guysfor the last couple weeks Ive been that guy everywhere I go. We take the same bus. We go to the same bookstore, the same dry cleaners; maybe hes the tea guy. (He gets up to leave, and smiles at Phoebe.)"}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Phoebe, did you see that?! He totally checked you out! He is so cute! (Looking at his tea.) Mine has a picture of The Village People, what does that mean?"}, {"line_number": 27, "type": "action", "text": "(Joey enters.)"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Hi!"}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "Hey."}, {"line_number": 30, "type": "action", "text": "(He slowly walks to the other side of the couch and sits down at the table, an awkward silence follows.)"}, {"line_number": 31, "type": "dialogue", "speaker": "Rachel", "text": "Hi."}, {"line_number": 32, "type": "dialogue", "speaker": "Joey", "text": "Hi."}, {"line_number": 33, "type": "action", "text": "(More awkward silence.)"}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "Tea gives Phoebe the trots."}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 4, "scene_id": "S08E17_004", "location": "Monica and Chandler's", "scene_description": "Chandler is cooking as Rachel paces nervously.", "characters": ["Chandler", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_004", "raw_text": "[Scene: Monica and Chandler's, Chandler is cooking as Rachel paces nervously.]\nRachel: So I thought Joey and I would be okay once we hung out, but its not even like we know how to be with each other anymore.\nChandler: I know its tough now, but things will get better.\nRachel: How do you know that? What if it just gets worse and worse and worse, to the point where we cant even be in the same room with each other?!\nChandler: Im not great at the advice, can I interest you in a sarcastic comment? Some cheese?\nMonica: Honey, what is the Bruce Springsteen CD in the Kat Stevens case?\nChandler: Lets just say if I cant find the right CD case I just put it in the nearest one.\nMonica: Okay, where is the Kat Stevens CD?\nChandler: In the James Taylor case.\nMonica: Where is the James Taylor CD?\nChandler: Honey, Im gonna save you some time, 200 CDs, not one of them in the right case.\nMonica: Okay. No need to panic. Deep breathes everyone. Okay umm uh, were just gonna have to spend some time and put the CDs in the right cases.\nChandler: Well, if were gonna do that we should come up with some kind of order. Yknow alphabetically or by genre?\nMonica: Hmm, I dont know. We really have to talk this through.\nRachel: Oh my God!! You guys have such problems!! I feel so terrible for you!\nMonica: Okay, I-Im sorry. You and Joey, your both focusing on this uncomfortable thing, what you need to do is to change the subject. Next time you see him try to get him talking about something else.\nRachel: Oh yeah. That makes sense.\nMonica: Yeah, like I dont know, maybe you have a work problem that you need his advice on.\nRachel: Ooh, I can do that.\nMonica: Good. (To Chandler) Uh honey, the Miami Vice soundtrack? Really?\nChandler: They were just giving those away at the store (off Monicas look) in exchange for money.\nJoey: (entering) Hey!\nRachel: Hi.\nMonica: Uh I really dont know what to tell you Rach, I really dont. I mean, maybe Joey can help you out with your, with your big work problem.\nRachel: What?\nMonica: Yeah Joey shesRachels got this really big work problem, and it is a head scratcher. Wow! (To Chandler) Yknow what, if were gonna make dinner were gonna have to leave. Yeah. (She and Chandler exit.)\nJoey: So you uh, have abig work problem?\nRachel: Yeah its umm Yeah its uh It-its yknowIts nothing.\nJoey: Huh. Okay. (Awkward silence.) So uh, I think Im gonna take off.\nRachel: YeahNo wait! Joey no wait it is. Its something. Its-its ummits my boss.\nJoey: Yeah?\nRachel: Yeah, and umm my baby.\nJoey: Yeah?\nRachel: My boss wants to buy my baby!\nJoey: What?! Oh my-oh my God!\nRachel: I know I told you, its a really big problem.\nJoey: What he wants to buy your baby?!\nRachel: Can you believe that?!\nJoey: Thats crazy!\nRachel: Thats what I told him!\nJoey: Okay, how did this even happen?\nRachel: Well Ill tell ya! (Pause) See uh my-my boss and his wifeThey-they cant have children. So umm, and thatwe were at the Christmas party, and he got drunk, and he said to me, \"Rachel, I want to buy your baby.\"\nJoey: Man! When you said it was a problem about your boss and the baby I figured it was something about maternity leave.\nRachel: Ohh! Yeah! (Pause) Yeah that-that wouldve been a much simpler problem.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is cooking as Rachel paces nervously.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "So I thought Joey and I would be okay once we hung out, but its not even like we know how to be with each other anymore."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "I know its tough now, but things will get better."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "How do you know that? What if it just gets worse and worse and worse, to the point where we cant even be in the same room with each other?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Im not great at the advice, can I interest you in a sarcastic comment? Some cheese?"}, {"line_number": 6, "type": "dialogue", "speaker": "Monica", "text": "Honey, what is the Bruce Springsteen CD in the Kat Stevens case?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Lets just say if I cant find the right CD case I just put it in the nearest one."}, {"line_number": 8, "type": "dialogue", "speaker": "Monica", "text": "Okay, where is the Kat Stevens CD?"}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "In the James Taylor case."}, {"line_number": 10, "type": "dialogue", "speaker": "Monica", "text": "Where is the James Taylor CD?"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Honey, Im gonna save you some time, 200 CDs, not one of them in the right case."}, {"line_number": 12, "type": "dialogue", "speaker": "Monica", "text": "Okay. No need to panic. Deep breathes everyone. Okay umm uh, were just gonna have to spend some time and put the CDs in the right cases."}, {"line_number": 13, "type": "dialogue", "speaker": "Chandler", "text": "Well, if were gonna do that we should come up with some kind of order. Yknow alphabetically or by genre?"}, {"line_number": 14, "type": "dialogue", "speaker": "Monica", "text": "Hmm, I dont know. We really have to talk this through."}, {"line_number": 15, "type": "dialogue", "speaker": "Rachel", "text": "Oh my God!! You guys have such problems!! I feel so terrible for you!"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "Okay, I-Im sorry. You and Joey, your both focusing on this uncomfortable thing, what you need to do is to change the subject. Next time you see him try to get him talking about something else."}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "Oh yeah. That makes sense."}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "Yeah, like I dont know, maybe you have a work problem that you need his advice on."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Ooh, I can do that."}, {"line_number": 20, "type": "dialogue", "speaker": "Monica", "text": "Good. (To Chandler) Uh honey, the Miami Vice soundtrack? Really?"}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "They were just giving those away at the store (off Monicas look) in exchange for money."}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey!"}, {"line_number": 23, "type": "dialogue", "speaker": "Rachel", "text": "Hi."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "Uh I really dont know what to tell you Rach, I really dont. I mean, maybe Joey can help you out with your, with your big work problem."}, {"line_number": 25, "type": "dialogue", "speaker": "Rachel", "text": "What?"}, {"line_number": 26, "type": "dialogue", "speaker": "Monica", "text": "Yeah Joey shesRachels got this really big work problem, and it is a head scratcher. Wow! (To Chandler) Yknow what, if were gonna make dinner were gonna have to leave. Yeah. (She and Chandler exit.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "So you uh, have abig work problem?"}, {"line_number": 28, "type": "dialogue", "speaker": "Rachel", "text": "Yeah its umm Yeah its uh It-its yknowIts nothing."}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "Huh. Okay. (Awkward silence.) So uh, I think Im gonna take off."}, {"line_number": 30, "type": "dialogue", "speaker": "Rachel", "text": "YeahNo wait! Joey no wait it is. Its something. Its-its ummits my boss."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "Yeah?"}, {"line_number": 32, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, and umm my baby."}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "Yeah?"}, {"line_number": 34, "type": "dialogue", "speaker": "Rachel", "text": "My boss wants to buy my baby!"}, {"line_number": 35, "type": "dialogue", "speaker": "Joey", "text": "What?! Oh my-oh my God!"}, {"line_number": 36, "type": "dialogue", "speaker": "Rachel", "text": "I know I told you, its a really big problem."}, {"line_number": 37, "type": "dialogue", "speaker": "Joey", "text": "What he wants to buy your baby?!"}, {"line_number": 38, "type": "dialogue", "speaker": "Rachel", "text": "Can you believe that?!"}, {"line_number": 39, "type": "dialogue", "speaker": "Joey", "text": "Thats crazy!"}, {"line_number": 40, "type": "dialogue", "speaker": "Rachel", "text": "Thats what I told him!"}, {"line_number": 41, "type": "dialogue", "speaker": "Joey", "text": "Okay, how did this even happen?"}, {"line_number": 42, "type": "dialogue", "speaker": "Rachel", "text": "Well Ill tell ya! (Pause) See uh my-my boss and his wifeThey-they cant have children. So umm, and thatwe were at the Christmas party, and he got drunk, and he said to me, \"Rachel, I want to buy your baby.\""}, {"line_number": 43, "type": "dialogue", "speaker": "Joey", "text": "Man! When you said it was a problem about your boss and the baby I figured it was something about maternity leave."}, {"line_number": 44, "type": "dialogue", "speaker": "Rachel", "text": "Ohh! Yeah! (Pause) Yeah that-that wouldve been a much simpler problem."}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 5, "scene_id": "S08E17_005", "location": "A newsstand", "scene_description": "Phoebe is looking at a magazine as the guy from before walks by and picks up a newspaper.", "characters": ["Guy", "Jim", "Phoebe"], "firestore_path": "/episodes/S08E17/scenes/S08E17_005", "raw_text": "[Scene: A newsstand, Phoebe is looking at a magazine as the guy from before walks by and picks up a newspaper.]\nPhoebe: Oh hello.\nGuy: Oh, its you. I see you everywhere. Im Jim, Jim Nelson.\nPhoebe: Oh Jim, Jim Nelson Im Phoebe, Phoebe Buffay. We certainly have been seeing a lot of each other lately. \nJim: We have. Maybe well be seeing each other at dinner tomorrow night, say around 8 oclock?\nPhoebe: Well, maybe we will. (Starts to walk away.) Oh! (She turns around and the exchange information.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A newsstand, Phoebe is looking at a magazine as the guy from before walks by and picks up a newspaper.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Oh hello."}, {"line_number": 3, "type": "dialogue", "speaker": "Guy", "text": "Oh, its you. I see you everywhere. Im Jim, Jim Nelson."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh Jim, Jim Nelson Im Phoebe, Phoebe Buffay. We certainly have been seeing a lot of each other lately. "}, {"line_number": 5, "type": "dialogue", "speaker": "Jim", "text": "We have. Maybe well be seeing each other at dinner tomorrow night, say around 8 oclock?"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Well, maybe we will. (Starts to walk away.) Oh! (She turns around and the exchange information.)"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 6, "scene_id": "S08E17_006", "location": "Outside Monas Apartment", "scene_description": "Ross is knocking on the door.", "characters": ["Mona", "Ross"], "firestore_path": "/episodes/S08E17/scenes/S08E17_006", "raw_text": "[Scene: Outside Monas Apartment, Ross is knocking on the door.]\nRoss: Mona? (Theres no answer, so he starts to leave but remembers where her extra key is. He reaches atop a hall light just outside her door and grabs the key. He looks at in triumph as the pain from it being hot moves along his nervous system to his brain, and when it arrives his brain orders his hand to drop the hot key and his mouth to squeal in pain. After dropping the key he pulls his shirtsleeve over his hand and uses the key to open the door and enter Monas apartment.) Okay, if I were a salmon shirt, where would I be? (He hears a key in the door and as it opens he dives behind the couch.)\nMona: (entering, with her date) I am so sorry I spilled wine all over your shirt.\nMona's Date: Oh, its okay.\nMona: No, its still wet. Yknow what? Let me get it out before it sets. Ooh, I have something you can wear. Here. (Hands him Rosss shirt.) \nMona's Date: Oh umm, I-I dont know if I want to wear a womans shirt.\nMona: No-no thats a mans shirt.\nMona's Date: Its awfully pink. (Ross mouths, \"Its salmon!\")", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Outside Monas Apartment, Ross is knocking on the door.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "Mona? (Theres no answer, so he starts to leave but remembers where her extra key is. He reaches atop a hall light just outside her door and grabs the key. He looks at in triumph as the pain from it being hot moves along his nervous system to his brain, and when it arrives his brain orders his hand to drop the hot key and his mouth to squeal in pain. After dropping the key he pulls his shirtsleeve over his hand and uses the key to open the door and enter Monas apartment.) Okay, if I were a salmon shirt, where would I be? (He hears a key in the door and as it opens he dives behind the couch.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Mona", "text": "(entering, with her date) I am so sorry I spilled wine all over your shirt."}, {"line_number": 4, "type": "narration", "text": "Mona's Date: Oh, its okay."}, {"line_number": 5, "type": "dialogue", "speaker": "Mona", "text": "No, its still wet. Yknow what? Let me get it out before it sets. Ooh, I have something you can wear. Here. (Hands him Rosss shirt.) "}, {"line_number": 6, "type": "narration", "text": "Mona's Date: Oh umm, I-I dont know if I want to wear a womans shirt."}, {"line_number": 7, "type": "dialogue", "speaker": "Mona", "text": "No-no thats a mans shirt."}, {"line_number": 8, "type": "narration", "text": "Mona's Date: Its awfully pink. (Ross mouths, \"Its salmon!\")"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 7, "scene_id": "S08E17_007", "location": "Monica and Chandler's", "scene_description": "Monica and Chandler are sorting their CDs.", "characters": ["Chandler", "Monica", "Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_007", "raw_text": "[Scene: Monica and Chandler's, Monica and Chandler are sorting their CDs.]\nChandler: Oh my God, honey we are so meant to be together. We both have copies of the Annie soundtrack.\nMonica: Honey, both yours.\nRachel: (entering) Hey! Great advice on that Joey thing!\nMonica: Yeah? The work problem?\nRachel: Oh it was perfect! I mean it really felt like he was my friend again.\nChandler: What problem did you tell him you had?\nRachel: Oh thats not important. The point is, I reallyI think everythings gonna be okay.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica and Chandler are sorting their CDs.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "Oh my God, honey we are so meant to be together. We both have copies of the Annie soundtrack."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Honey, both yours."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "(entering) Hey! Great advice on that Joey thing!"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "Yeah? The work problem?"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Oh it was perfect! I mean it really felt like he was my friend again."}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "What problem did you tell him you had?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh thats not important. The point is, I reallyI think everythings gonna be okay."}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 8, "scene_id": "S08E17_008", "location": "Mr. Zelners Office", "scene_description": "hes in a meeting as Joey bursts in.", "characters": ["Joey"], "firestore_path": "/episodes/S08E17/scenes/S08E17_008", "raw_text": "[Scene: Mr. Zelners Office, hes in a meeting as Joey bursts in.]\nMr. Zelner: May I help you?\nJoey: Do you think you can just buy my friends baby?!\nCommercial Break", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Mr. Zelners Office, hes in a meeting as Joey bursts in.]"}, {"line_number": 2, "type": "narration", "text": "Mr. Zelner: May I help you?"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Do you think you can just buy my friends baby?!"}, {"line_number": 4, "type": "narration", "text": "Commercial Break"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 9, "scene_id": "S08E17_009", "location": "A restaurant", "scene_description": "Phoebe and Jim are on their date.", "characters": ["Jim", "Phoebe"], "firestore_path": "/episodes/S08E17/scenes/S08E17_009", "raw_text": "[Scene: A restaurant, Phoebe and Jim are on their date.]\nPhoebe: Isnt it funny how we kept running into each other? Its as if someone really wants us to be together.\nJim: Someone does. Me.\nPhoebe: Oh, witty banter. Well done.\nJim: So, tell me a little bit about yourself.\nPhoebe: Oh okay, well Im a masseuse, and I used to work at this place\nJim: Do you like to party?\nPhoebe: I-I-I like, I like parties.\nJim: Youre wild, arent ya?\nPhoebe: Yeah I guess, a little.\nJim: It aint no thing, Im wild too.\nPhoebe: (a little freaked out) So! Umm, anyway I-I lived in New York, someone wildly I guess, for ummWell since I was fourteen.\nJim: Im sorry. Im staring. Its just that you have the most beautiful eyes.\nPhoebe: Oh stop it.\nJim: And your breasts! Hmm!!!\nPhoebe: Okay. Umm look, youre coming on a little strong. But Im going to give you the benefit of the doubt, because it seems the universe really wants to be together. So, why dont we just start over okay? And you can just tell me about yourself.\nJim: All right.\nPhoebe: Okay.\nJim: I write erotic novels, for children.\nPhoebe: What?!\nJim: Theyre wildly unpopular.\nPhoebe: Oh my God!\nJim: Oh also, you might be interested to know that I have a Ph.D.\nPhoebe: Wow! You do?\nJim: Yeah, (looks at his crotch) a Pretty Huge\nPhoebe: All right. (Gets up and walks out.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A restaurant, Phoebe and Jim are on their date.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Isnt it funny how we kept running into each other? Its as if someone really wants us to be together."}, {"line_number": 3, "type": "dialogue", "speaker": "Jim", "text": "Someone does. Me."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, witty banter. Well done."}, {"line_number": 5, "type": "dialogue", "speaker": "Jim", "text": "So, tell me a little bit about yourself."}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "Oh okay, well Im a masseuse, and I used to work at this place"}, {"line_number": 7, "type": "dialogue", "speaker": "Jim", "text": "Do you like to party?"}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "I-I-I like, I like parties."}, {"line_number": 9, "type": "dialogue", "speaker": "Jim", "text": "Youre wild, arent ya?"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah I guess, a little."}, {"line_number": 11, "type": "dialogue", "speaker": "Jim", "text": "It aint no thing, Im wild too."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "(a little freaked out) So! Umm, anyway I-I lived in New York, someone wildly I guess, for ummWell since I was fourteen."}, {"line_number": 13, "type": "dialogue", "speaker": "Jim", "text": "Im sorry. Im staring. Its just that you have the most beautiful eyes."}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Oh stop it."}, {"line_number": 15, "type": "dialogue", "speaker": "Jim", "text": "And your breasts! Hmm!!!"}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Okay. Umm look, youre coming on a little strong. But Im going to give you the benefit of the doubt, because it seems the universe really wants to be together. So, why dont we just start over okay? And you can just tell me about yourself."}, {"line_number": 17, "type": "dialogue", "speaker": "Jim", "text": "All right."}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 19, "type": "dialogue", "speaker": "Jim", "text": "I write erotic novels, for children."}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "What?!"}, {"line_number": 21, "type": "dialogue", "speaker": "Jim", "text": "Theyre wildly unpopular."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "Oh my God!"}, {"line_number": 23, "type": "dialogue", "speaker": "Jim", "text": "Oh also, you might be interested to know that I have a Ph.D."}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "Wow! You do?"}, {"line_number": 25, "type": "dialogue", "speaker": "Jim", "text": "Yeah, (looks at his crotch) a Pretty Huge"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "All right. (Gets up and walks out.)"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 10, "scene_id": "S08E17_010", "location": "Monica and Chandler's", "scene_description": "Monica, Chandler, and now Rachel are organizing CDs.", "characters": ["Chandler", "Chandler and Monica", "Joey", "Monica", "Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_010", "raw_text": "[Scene: Monica and Chandler's, Monica, Chandler, and now Rachel are organizing CDs.]\nChandler: (singing) The sunll come outtomorrow! Betyour bottom dollar that tomorrow (The girls start laughing, and in a deep voice) therell be sun.\nJoey: (entering) Hey!\nRachel: Hey! Oh Joey, honey listen, thank you for talking to my yesterday about that thing with my boss. That really meant a lot.\nJoey: Not a problem. Oh, and just so you know, that guys not going to be bothering you about that baby thing anymore.\nRachel: (worried) What?\nJoey: Lets just say I took care of it.\nRachel: Whoa-whoa-whoa, lets say more!\nJoey: Dont worry! Dont worry. I just told him, very nicely, \"You dont go buying peoples babies, so back off!!\"\nRachel: What?!\nChandler and Monica: What?!\nRachel: No! No, no-no-no Joey he doesnt want to buy my baby! I made that up!\nJoey: What?! Why?!\nRachel: So that we would have something to talk about! So it wouldnt be awkward!\nJoey: And you couldnt think of anything else?!\nMonica: You said your boss wants to buy your baby?!\nRachel: (To Joey) I cant believe that you yelled at my boss! Im-Im gonna lose my job! What am I going to do?!\nChandler: You can always sell your baby.\nRachel: Oh Joey, I cant believe you brought my boss into this! Im gonna get fired!\nJoey: You lied to me!\nRachel: Well, she told me too! (Points to Monica and Joey glares at her.)\nMonica: Chandler has two copies of Annie!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Monica, Chandler, and now Rachel are organizing CDs.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Chandler", "text": "(singing) The sunll come outtomorrow! Betyour bottom dollar that tomorrow (The girls start laughing, and in a deep voice) therell be sun."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "(entering) Hey!"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Hey! Oh Joey, honey listen, thank you for talking to my yesterday about that thing with my boss. That really meant a lot."}, {"line_number": 5, "type": "dialogue", "speaker": "Joey", "text": "Not a problem. Oh, and just so you know, that guys not going to be bothering you about that baby thing anymore."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "(worried) What?"}, {"line_number": 7, "type": "dialogue", "speaker": "Joey", "text": "Lets just say I took care of it."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Whoa-whoa-whoa, lets say more!"}, {"line_number": 9, "type": "dialogue", "speaker": "Joey", "text": "Dont worry! Dont worry. I just told him, very nicely, \"You dont go buying peoples babies, so back off!!\""}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "What?!"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler and Monica", "text": "What?!"}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "No! No, no-no-no Joey he doesnt want to buy my baby! I made that up!"}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "What?! Why?!"}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "So that we would have something to talk about! So it wouldnt be awkward!"}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "And you couldnt think of anything else?!"}, {"line_number": 16, "type": "dialogue", "speaker": "Monica", "text": "You said your boss wants to buy your baby?!"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "(To Joey) I cant believe that you yelled at my boss! Im-Im gonna lose my job! What am I going to do?!"}, {"line_number": 18, "type": "dialogue", "speaker": "Chandler", "text": "You can always sell your baby."}, {"line_number": 19, "type": "dialogue", "speaker": "Rachel", "text": "Oh Joey, I cant believe you brought my boss into this! Im gonna get fired!"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "You lied to me!"}, {"line_number": 21, "type": "dialogue", "speaker": "Rachel", "text": "Well, she told me too! (Points to Monica and Joey glares at her.)"}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "Chandler has two copies of Annie!"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 11, "scene_id": "S08E17_011", "location": "Monas Apartment", "scene_description": "she and her date are making out as Ross flips through a magazine while lying behind the couch and sees something that he likes. Meanwhile, Monas date takes off Rosss shirt and Mona throws it on the floor. While they start making out again, Ross tries to pull the rug the shirt is on over to him, but while he does that he moves the coffee table and it bumps into the couch.", "characters": ["Mona", "Ross"], "firestore_path": "/episodes/S08E17/scenes/S08E17_011", "raw_text": "[Scene: Monas Apartment, she and her date are making out as Ross flips through a magazine while lying behind the couch and sees something that he likes. Meanwhile, Monas date takes off Rosss shirt and Mona throws it on the floor. While they start making out again, Ross tries to pull the rug the shirt is on over to him, but while he does that he moves the coffee table and it bumps into the couch.]\nMona: (seeing Ross) Oh my God! Ross!!!\nRoss: Hello!!\nMona: Ross, what are you doing?!\nRoss: Not touching myself if that makes anyone less uncomfortable.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monas Apartment, she and her date are making out as Ross flips through a magazine while lying behind the couch and sees something that he likes. Meanwhile, Monas date takes off Rosss shirt and Mona throws it on the floor. While they start making out again, Ross tries to pull the rug the shirt is on over to him, but while he does that he moves the coffee table and it bumps into the couch.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Mona", "text": "(seeing Ross) Oh my God! Ross!!!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Hello!!"}, {"line_number": 4, "type": "dialogue", "speaker": "Mona", "text": "Ross, what are you doing?!"}, {"line_number": 5, "type": "dialogue", "speaker": "Ross", "text": "Not touching myself if that makes anyone less uncomfortable."}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 12, "scene_id": "S08E17_012", "location": "Mr. Zelners Office", "scene_description": "Rachel is knocking on the door.", "characters": ["Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_012", "raw_text": "[Scene: Mr. Zelners Office, Rachel is knocking on the door.]\nRachel: Morning. You wanted to see me?\nMr. Zelner: Please, come in. Have a seat. (She does so.)\nRachel: Okay look Mr. Zelner\nMr. Zelner: Oh I think its best that I speak first.\nRachel: Yeah. (Motions for him to continue.)\nMr. Zelner: Ive asked Lee from human resources to be here as a witness to our conversation.\nRachel: Oh God.\nMr. Zelner: If I in any way implied that I wanted to buy your babyI am sorry. Okay? Last week when I asked you when your due date was uh, I certainly did not mean that I felt that I was due your baby. Yeah, I want to be very clear that I understand that its your baby, and it is not mine to purchase.\nRachel: Well, as long as we are clear about that. (Exits smugly.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Mr. Zelners Office, Rachel is knocking on the door.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Morning. You wanted to see me?"}, {"line_number": 3, "type": "narration", "text": "Mr. Zelner: Please, come in. Have a seat. (She does so.)"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Okay look Mr. Zelner"}, {"line_number": 5, "type": "narration", "text": "Mr. Zelner: Oh I think its best that I speak first."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Yeah. (Motions for him to continue.)"}, {"line_number": 7, "type": "narration", "text": "Mr. Zelner: Ive asked Lee from human resources to be here as a witness to our conversation."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh God."}, {"line_number": 9, "type": "narration", "text": "Mr. Zelner: If I in any way implied that I wanted to buy your babyI am sorry. Okay? Last week when I asked you when your due date was uh, I certainly did not mean that I felt that I was due your baby. Yeah, I want to be very clear that I understand that its your baby, and it is not mine to purchase."}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Well, as long as we are clear about that. (Exits smugly.)"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 13, "scene_id": "S08E17_013", "location": "A Street", "scene_description": "Phoebe and Monica are walking down it.", "characters": ["Guy", "Monica", "Phoebe"], "firestore_path": "/episodes/S08E17/scenes/S08E17_013", "raw_text": "[Scene: A Street, Phoebe and Monica are walking down it.]\nPhoebe: Oh there it is.\nMonica: Thats not your regular dry cleaners.\nPhoebe: I know, but that creep that I went on that date with goes to there so I have to find a new one. I also have to find a new video store, a new bank, a new adult bookstore, a new grocery store\nMonica: What?!\nPhoebe: A new grocery store. The universe said I was going to meet a nice guy and thats what they gave me? (Looks up) When I get up there Im going to kick some ass.\nMonica: Dont worry Phoebe, youre gonna meet someone. If I can meet a great guy, so can you.\nPhoebe: Yeah, we both can. And we both will.\n(They enter the dry cleaners.)\nPhoebe: Oh, you didnt have to come in with me.\nMonica: Are you kidding? This is where they get out stains! Okay? This is like Disneyland for me. Im-Im gonna be over here watching the dance of the clean shirts. (She points to and walks over to the electric clothes rack they have.)\nPhoebe: Okay.\n(A guy enters that looks suspiciously like Alec Baldwin from The Hunt for Red October, Pearl Harbor, and Beetlejuice.)\nGuy: (To Phoebe) Oh, excuse me! I think you dropped s(looks at Phoebe.) Wow!\nPhoebe: What?\nGuy: Im sorry, its just that youre so incredibly beautiful.\nPhoebe: Oh yeah well, Im sorry about that too, but what are you going to do?\nGuy: I hope you dont think Im crazy but I feel like I was meant to pick this up, do you believe in that kind of thing?\nPhoebe: A little. (She turns around and looks up.) (To the universe) Now youre talking.\nGuy: Would you like to go out and have a cup of coffee?\nPhoebe: I-I-Id love to. Let me just tell my friend.\nMonica: (to the clerk) Ooh, an ink stain! Hey, can I watch how you get this out?\nPhoebe: (looking around) She mustve left.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: A Street, Phoebe and Monica are walking down it.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Phoebe", "text": "Oh there it is."}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "Thats not your regular dry cleaners."}, {"line_number": 4, "type": "dialogue", "speaker": "Phoebe", "text": "I know, but that creep that I went on that date with goes to there so I have to find a new one. I also have to find a new video store, a new bank, a new adult bookstore, a new grocery store"}, {"line_number": 5, "type": "dialogue", "speaker": "Monica", "text": "What?!"}, {"line_number": 6, "type": "dialogue", "speaker": "Phoebe", "text": "A new grocery store. The universe said I was going to meet a nice guy and thats what they gave me? (Looks up) When I get up there Im going to kick some ass."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Dont worry Phoebe, youre gonna meet someone. If I can meet a great guy, so can you."}, {"line_number": 8, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah, we both can. And we both will."}, {"line_number": 9, "type": "action", "text": "(They enter the dry cleaners.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, you didnt have to come in with me."}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Are you kidding? This is where they get out stains! Okay? This is like Disneyland for me. Im-Im gonna be over here watching the dance of the clean shirts. (She points to and walks over to the electric clothes rack they have.)"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Okay."}, {"line_number": 13, "type": "action", "text": "(A guy enters that looks suspiciously like Alec Baldwin from The Hunt for Red October, Pearl Harbor, and Beetlejuice.)"}, {"line_number": 14, "type": "dialogue", "speaker": "Guy", "text": "(To Phoebe) Oh, excuse me! I think you dropped s(looks at Phoebe.) Wow!"}, {"line_number": 15, "type": "dialogue", "speaker": "Phoebe", "text": "What?"}, {"line_number": 16, "type": "dialogue", "speaker": "Guy", "text": "Im sorry, its just that youre so incredibly beautiful."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Oh yeah well, Im sorry about that too, but what are you going to do?"}, {"line_number": 18, "type": "dialogue", "speaker": "Guy", "text": "I hope you dont think Im crazy but I feel like I was meant to pick this up, do you believe in that kind of thing?"}, {"line_number": 19, "type": "dialogue", "speaker": "Phoebe", "text": "A little. (She turns around and looks up.) (To the universe) Now youre talking."}, {"line_number": 20, "type": "dialogue", "speaker": "Guy", "text": "Would you like to go out and have a cup of coffee?"}, {"line_number": 21, "type": "dialogue", "speaker": "Phoebe", "text": "I-I-Id love to. Let me just tell my friend."}, {"line_number": 22, "type": "dialogue", "speaker": "Monica", "text": "(to the clerk) Ooh, an ink stain! Hey, can I watch how you get this out?"}, {"line_number": 23, "type": "dialogue", "speaker": "Phoebe", "text": "(looking around) She mustve left."}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 14, "scene_id": "S08E17_014", "location": "Monica and Chandler's", "scene_description": "Chandler is watching Joey pace nervously as Rachel enters.", "characters": ["Chandler", "Joey", "Rachel"], "firestore_path": "/episodes/S08E17/scenes/S08E17_014", "raw_text": "[Scene: Monica and Chandler's, Chandler is watching Joey pace nervously as Rachel enters.]\nRachel: Hi.\nJoey: So? What-what-what happened?\nRachel: Its all gonna be okay. Theyre just so happy that Im not suing them that they gave me one extra month paid maternity leave. So long as I understand that the money should not construed as a down payment on this or any other child I should bear.\nChandler: Wow, Ralph Lauren is really going out of there way to show theyre not in the baby buying business.\nRachel: Chandler, can you give us a minute?\nChandler: Oh Im sorry, youre kicking me out of my own living room?\nRachel: Yeah.\nChandler: Ill be in there. (Goes into the bedroom.)\nRachel: Joey, Im really sorry that I lied to you. I was just trying to make things\nJoey: I know. I know.\nRachel: It kinda worked. I mean yknow, I dont know about you buy I havent thought about our thing since all this.\nJoey: Hey youre right. Yeah, its kinda been like us again a little bit.\nRachel: Yeah I know! I miss that.\nJoey: Me too. I mean Ihavent thought at all about how I put myself out there and said all that stuff and how you didnt feel the same way about me and-and how it was really awkward.\n(Awkward silence.)\nRachel: My gynecologist tried to kill me.\nClosing Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Chandler's, Chandler is watching Joey pace nervously as Rachel enters.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "Hi."}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "So? What-what-what happened?"}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "Its all gonna be okay. Theyre just so happy that Im not suing them that they gave me one extra month paid maternity leave. So long as I understand that the money should not construed as a down payment on this or any other child I should bear."}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Wow, Ralph Lauren is really going out of there way to show theyre not in the baby buying business."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "Chandler, can you give us a minute?"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "Oh Im sorry, youre kicking me out of my own living room?"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yeah."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Ill be in there. (Goes into the bedroom.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Joey, Im really sorry that I lied to you. I was just trying to make things"}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "I know. I know."}, {"line_number": 12, "type": "dialogue", "speaker": "Rachel", "text": "It kinda worked. I mean yknow, I dont know about you buy I havent thought about our thing since all this."}, {"line_number": 13, "type": "dialogue", "speaker": "Joey", "text": "Hey youre right. Yeah, its kinda been like us again a little bit."}, {"line_number": 14, "type": "dialogue", "speaker": "Rachel", "text": "Yeah I know! I miss that."}, {"line_number": 15, "type": "dialogue", "speaker": "Joey", "text": "Me too. I mean Ihavent thought at all about how I put myself out there and said all that stuff and how you didnt feel the same way about me and-and how it was really awkward."}, {"line_number": 16, "type": "action", "text": "(Awkward silence.)"}, {"line_number": 17, "type": "dialogue", "speaker": "Rachel", "text": "My gynecologist tried to kill me."}, {"line_number": 18, "type": "narration", "text": "Closing Credits"}]}
{"episode_id": "S08E17", "season": 8, "episode_number": 17, "episode_title": "THE ONE WITH THE TEA LEAVES", "scene_number": 15, "scene_id": "S08E17_015", "location": "Ross and Rachel's", "scene_description": "Ross is ordering something over the phone from a catalog.", "characters": ["Mona", "Ross"], "firestore_path": "/episodes/S08E17/scenes/S08E17_015", "raw_text": "[Scene: Ross and Rachel's, Ross is ordering something over the phone from a catalog.]\nRoss: (on phone) Item J437-A, color: winterberry. (Theres a knock on the door as he hangs up the phone. He answers it to Mona.) Hi umm, listen come here, come in. (She does so.) Im so-so sorry about yesterday. I-Im really sorry. Its just that I (He picks up the pink shirt.)\nMona: (interrupting him) Listen Ross, you dont have to apologize. I understand why you were there.\nRoss: You do?\nMona: Yeah, you still have feelings for me. And-and to be honest, I-I still have feelings for you. And I wish that we can work it out Ross, but we cant. Its too complicated with you and Rachel and the baby, I-I just It just wasnt meant to be.\nRoss: (faking starting to cry) Oh God youre right.\nMona: Ross, wewe have to be strong. Okay, I-Im gonna go. (She picks up the shirt Ross has just set down.) Can I? To remember you?\nRoss: (laughs) No. (Takes the shirt back.)\nEnd", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ross and Rachel's, Ross is ordering something over the phone from a catalog.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Ross", "text": "(on phone) Item J437-A, color: winterberry. (Theres a knock on the door as he hangs up the phone. He answers it to Mona.) Hi umm, listen come here, come in. (She does so.) Im so-so sorry about yesterday. I-Im really sorry. Its just that I (He picks up the pink shirt.)"}, {"line_number": 3, "type": "dialogue", "speaker": "Mona", "text": "(interrupting him) Listen Ross, you dont have to apologize. I understand why you were there."}, {"line_number": 4, "type": "dialogue", "speaker": "Ross", "text": "You do?"}, {"line_number": 5, "type": "dialogue", "speaker": "Mona", "text": "Yeah, you still have feelings for me. And-and to be honest, I-I still have feelings for you. And I wish that we can work it out Ross, but we cant. Its too complicated with you and Rachel and the baby, I-I just It just wasnt meant to be."}, {"line_number": 6, "type": "dialogue", "speaker": "Ross", "text": "(faking starting to cry) Oh God youre right."}, {"line_number": 7, "type": "dialogue", "speaker": "Mona", "text": "Ross, wewe have to be strong. Okay, I-Im gonna go. (She picks up the shirt Ross has just set down.) Can I? To remember you?"}, {"line_number": 8, "type": "dialogue", "speaker": "Ross", "text": "(laughs) No. (Takes the shirt back.)"}, {"line_number": 9, "type": "narration", "text": "End"}]}
