{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 1, "scene_id": "S10E04_001", "location": "", "scene_description": "", "characters": ["Written by"], "firestore_path": "/episodes/S10E04/scenes/S10E04_001", "raw_text": "The One with the Cake\nWritten by: Michael Curtis Transcribed by: Eric Aasen", "lines": [{"line_number": 1, "type": "narration", "text": "The One with the Cake"}, {"line_number": 2, "type": "dialogue", "speaker": "Written by", "text": "Michael Curtis Transcribed by: Eric Aasen"}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 2, "scene_id": "S10E04_002", "location": "Central Perk", "scene_description": "Joey, Chandler, Monica, and Phoebe are there. Joey is holding a deck of cards out to Chandler.", "characters": ["Ben", "Carol", "Chandler", "Joey", "Phoebe", "Ross"], "firestore_path": "/episodes/S10E04/scenes/S10E04_002", "raw_text": "[Scene: Central Perk, Joey, Chandler, Monica, and Phoebe are there. Joey is holding a deck of cards out to Chandler.]\nJoey: Okay, pick a card.\nChandler: Okay. (He picks the 9 of Spades)\nJoey: All right now, memorize it. (Pause) You got it?\nChandler: Oh yes.\nJoey: (holding up the Queen of Clubs) Is that your card? (He winks and smiles.)\nChandler: (pause) Yes. \n(Joey laughs then realizes the trick didn't work when Chandler hands him his card back.) \nCarol: (entering with Ben and Ross) Hey guys!\nRoss: Hi!\nChandler: Hi there!\nBen: Hi!!\nCarol: Guess what? Ben is going to be in a TV commercial!\nPhoebe: What are you talking about?!\nRoss: (sets Ben down) Well, it's not for sure but umm, we met this guy in the park who thought Ben was really cute--y'know, which he is--so umm anyhoo, he uh, he gave us his card and told us to bring him down for this commercial he's auditioning.\nJoey: (reading the card) Whoa! This guy is like the biggest commercial casting director in town! (Ross gasps) Ben takes one lousy walk in the park and gets an audition!! (Ross and Carol stare at him, then Joey realizes what he just said.) I mean, way to go Ben! (Gives Ben the thumbs up, which Ben returns.) Man! I've been in that park a million times and no one offered me an audition.\nRoss: I know, it's crazy! We were just pushing Ben on the swings\nJoey: I'm always on the swings! What am I doing wrong?!\nChandler: That.\nOpening Credits", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Central Perk, Joey, Chandler, Monica, and Phoebe are there. Joey is holding a deck of cards out to Chandler.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Okay, pick a card."}, {"line_number": 3, "type": "dialogue", "speaker": "Chandler", "text": "Okay. (He picks the 9 of Spades)"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "All right now, memorize it. (Pause) You got it?"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Oh yes."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "(holding up the Queen of Clubs) Is that your card? (He winks and smiles.)"}, {"line_number": 7, "type": "dialogue", "speaker": "Chandler", "text": "(pause) Yes. "}, {"line_number": 8, "type": "narration", "text": "(Joey laughs then realizes the trick didn't work when Chandler hands him his card back.) "}, {"line_number": 9, "type": "dialogue", "speaker": "Carol", "text": "(entering with Ben and Ross) Hey guys!"}, {"line_number": 10, "type": "dialogue", "speaker": "Ross", "text": "Hi!"}, {"line_number": 11, "type": "dialogue", "speaker": "Chandler", "text": "Hi there!"}, {"line_number": 12, "type": "dialogue", "speaker": "Ben", "text": "Hi!!"}, {"line_number": 13, "type": "dialogue", "speaker": "Carol", "text": "Guess what? Ben is going to be in a TV commercial!"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "What are you talking about?!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "(sets Ben down) Well, it's not for sure but umm, we met this guy in the park who thought Ben was really cute--y'know, which he is--so umm anyhoo, he uh, he gave us his card and told us to bring him down for this commercial he's auditioning."}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "(reading the card) Whoa! This guy is like the biggest commercial casting director in town! (Ross gasps) Ben takes one lousy walk in the park and gets an audition!! (Ross and Carol stare at him, then Joey realizes what he just said.) I mean, way to go Ben! (Gives Ben the thumbs up, which Ben returns.) Man! I've been in that park a million times and no one offered me an audition."}, {"line_number": 17, "type": "dialogue", "speaker": "Ross", "text": "I know, it's crazy! We were just pushing Ben on the swings"}, {"line_number": 18, "type": "dialogue", "speaker": "Joey", "text": "I'm always on the swings! What am I doing wrong?!"}, {"line_number": 19, "type": "dialogue", "speaker": "Chandler", "text": "That."}, {"line_number": 20, "type": "narration", "text": "Opening Credits"}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 3, "scene_id": "S10E04_003", "location": "Monica and Rachel's", "scene_description": "everyone is eating breakfast, Ross is heading for the bathroom.", "characters": ["All", "Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E04/scenes/S10E04_003", "raw_text": "[Scene: Monica and Rachel's, everyone is eating breakfast, Ross is heading for the bathroom.]\nRachel: (entering from her room) Okay, gotta go! Wish me luck!\nJoey: Luck!\nChandler: Hey Rach, now that you're working at Ralph Lauren, can you bring me back some of those polo shirts?\nRachel: Uh well, y'know what? I don't think if I feel comfortable stealing on my very first day\nChandler: Unwilling to steal from work, interesting.\nMonica: Besides, if anybody's gonna get free stuff, it's gonna be me.\nRachel: Okay guys, way to wish me luck!\nAll: Good luck! Go get 'em! (Rachel exits.)\nPhoebe: Okay, let's discuss Rachel's birthday. I say we throw a surprise party this weekend.\nJoey: Whoa-whoa, but her birthday isn't like for another month.\nPhoebe: Yeah but if we throw her a party on her birthday, then it's not a surprise.\nMonica: I think it's a great idea. Yeah, we could have a dinner party and just invite her close friends.\nJoey: Ross!! We're having a surprise party for Rachel!!\nRoss: (from the bathroom) Okay!!\nJoey: Done.\nPhoebe: Okay, great so do you want to do it together?\nMonica: I would love to do it together!\n(Joey starts to giggle.)\nJoey: They're gonna do it together.\nChandler: Dude! That's my girlfriend!\nJoey: What, so I gotta shut it down now?\nRoss: All right, I gotta take off. I'm picking up Ben then we're off to the big audition.\nMonica: It's gonna be weird to watch some actor pretending to be Ben's dad.\nRoss: Yeah.\nChandler: Weirder than watching his two moms make out? (Monica nods in agreement.)\nJoey: Whoa-whoa dad? There's a dad in the commercial?\nRoss: Yeah the dad and Ben eat soup and pretend to enjoy it.\nJoey: Whoa, hey, maybe I'll go down there with ya and see if I can get an audition to play the dad. I mean who better to play Ben's father than his godfather.\nRoss: You're not his godfather.\nJoey: What?! Are you kidding?!\nRoss: (Pause) Of course I am! (Joey is relieved) Okay, let's go godfather.\nJoey: All right!\n(As they walk out he motions to Chandler that he is still Ben's godfather.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, everyone is eating breakfast, Ross is heading for the bathroom.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "(entering from her room) Okay, gotta go! Wish me luck!"}, {"line_number": 3, "type": "dialogue", "speaker": "Joey", "text": "Luck!"}, {"line_number": 4, "type": "dialogue", "speaker": "Chandler", "text": "Hey Rach, now that you're working at Ralph Lauren, can you bring me back some of those polo shirts?"}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Uh well, y'know what? I don't think if I feel comfortable stealing on my very first day"}, {"line_number": 6, "type": "dialogue", "speaker": "Chandler", "text": "Unwilling to steal from work, interesting."}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Besides, if anybody's gonna get free stuff, it's gonna be me."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Okay guys, way to wish me luck!"}, {"line_number": 9, "type": "dialogue", "speaker": "All", "text": "Good luck! Go get 'em! (Rachel exits.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, let's discuss Rachel's birthday. I say we throw a surprise party this weekend."}, {"line_number": 11, "type": "dialogue", "speaker": "Joey", "text": "Whoa-whoa, but her birthday isn't like for another month."}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Yeah but if we throw her a party on her birthday, then it's not a surprise."}, {"line_number": 13, "type": "dialogue", "speaker": "Monica", "text": "I think it's a great idea. Yeah, we could have a dinner party and just invite her close friends."}, {"line_number": 14, "type": "dialogue", "speaker": "Joey", "text": "Ross!! We're having a surprise party for Rachel!!"}, {"line_number": 15, "type": "dialogue", "speaker": "Ross", "text": "(from the bathroom) Okay!!"}, {"line_number": 16, "type": "dialogue", "speaker": "Joey", "text": "Done."}, {"line_number": 17, "type": "dialogue", "speaker": "Phoebe", "text": "Okay, great so do you want to do it together?"}, {"line_number": 18, "type": "dialogue", "speaker": "Monica", "text": "I would love to do it together!"}, {"line_number": 19, "type": "action", "text": "(Joey starts to giggle.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Joey", "text": "They're gonna do it together."}, {"line_number": 21, "type": "dialogue", "speaker": "Chandler", "text": "Dude! That's my girlfriend!"}, {"line_number": 22, "type": "dialogue", "speaker": "Joey", "text": "What, so I gotta shut it down now?"}, {"line_number": 23, "type": "dialogue", "speaker": "Ross", "text": "All right, I gotta take off. I'm picking up Ben then we're off to the big audition."}, {"line_number": 24, "type": "dialogue", "speaker": "Monica", "text": "It's gonna be weird to watch some actor pretending to be Ben's dad."}, {"line_number": 25, "type": "dialogue", "speaker": "Ross", "text": "Yeah."}, {"line_number": 26, "type": "dialogue", "speaker": "Chandler", "text": "Weirder than watching his two moms make out? (Monica nods in agreement.)"}, {"line_number": 27, "type": "dialogue", "speaker": "Joey", "text": "Whoa-whoa dad? There's a dad in the commercial?"}, {"line_number": 28, "type": "dialogue", "speaker": "Ross", "text": "Yeah the dad and Ben eat soup and pretend to enjoy it."}, {"line_number": 29, "type": "dialogue", "speaker": "Joey", "text": "Whoa, hey, maybe I'll go down there with ya and see if I can get an audition to play the dad. I mean who better to play Ben's father than his godfather."}, {"line_number": 30, "type": "dialogue", "speaker": "Ross", "text": "You're not his godfather."}, {"line_number": 31, "type": "dialogue", "speaker": "Joey", "text": "What?! Are you kidding?!"}, {"line_number": 32, "type": "dialogue", "speaker": "Ross", "text": "(Pause) Of course I am! (Joey is relieved) Okay, let's go godfather."}, {"line_number": 33, "type": "dialogue", "speaker": "Joey", "text": "All right!"}, {"line_number": 34, "type": "action", "text": "(As they walk out he motions to Chandler that he is still Ben's godfather.)"}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 4, "scene_id": "S10E04_004", "location": "Ben's audition", "scene_description": "Carol, Ross, and Ben along with about 10 more families are in a waiting room as Joey enters happily.", "characters": ["Carol", "Joey", "Ross"], "firestore_path": "/episodes/S10E04/scenes/S10E04_004", "raw_text": "[Scene: Ben's audition, Carol, Ross, and Ben along with about 10 more families are in a waiting room as Joey enters happily.]\nJoey: Hey! I'm in, they're gonna let me audition!\nRoss: Really? That's great!\nJoey: I know! I know! It turns out that one of the casting ladies has actually seen me in a play, so I steered clear of her\nCarol: (noticing a kid who has picked up a copy of Variety to read) Hey, that kid looks familiar.\nJoey: Oh yeah, yeah! He's done tons of commercials. I've seen him in like Sugar Smacks, Playstation, and that one for the phone company. In fact he was so good in that one, he actually convinced me to switch phone companies. Chandler was mad.\nRoss: Yeah well, he's not gonna get this one. Ben is way cuter than that kid. I mean look at him, look at you, (Starts to whine like a baby and Joey just glares at him.)\nJoey: That's great. Listen, wouldn't it be great though if I got to play Ben's dad?\nRoss: Joey, you look nothing like Ben.\nJoey: I look more like him than you do! (He winks at Carol.)\nCarol: Y'know, I don't really know you well enough for you to do that.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Ben's audition, Carol, Ross, and Ben along with about 10 more families are in a waiting room as Joey enters happily.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Joey", "text": "Hey! I'm in, they're gonna let me audition!"}, {"line_number": 3, "type": "dialogue", "speaker": "Ross", "text": "Really? That's great!"}, {"line_number": 4, "type": "dialogue", "speaker": "Joey", "text": "I know! I know! It turns out that one of the casting ladies has actually seen me in a play, so I steered clear of her"}, {"line_number": 5, "type": "dialogue", "speaker": "Carol", "text": "(noticing a kid who has picked up a copy of Variety to read) Hey, that kid looks familiar."}, {"line_number": 6, "type": "dialogue", "speaker": "Joey", "text": "Oh yeah, yeah! He's done tons of commercials. I've seen him in like Sugar Smacks, Playstation, and that one for the phone company. In fact he was so good in that one, he actually convinced me to switch phone companies. Chandler was mad."}, {"line_number": 7, "type": "dialogue", "speaker": "Ross", "text": "Yeah well, he's not gonna get this one. Ben is way cuter than that kid. I mean look at him, look at you, (Starts to whine like a baby and Joey just glares at him.)"}, {"line_number": 8, "type": "dialogue", "speaker": "Joey", "text": "That's great. Listen, wouldn't it be great though if I got to play Ben's dad?"}, {"line_number": 9, "type": "dialogue", "speaker": "Ross", "text": "Joey, you look nothing like Ben."}, {"line_number": 10, "type": "dialogue", "speaker": "Joey", "text": "I look more like him than you do! (He winks at Carol.)"}, {"line_number": 11, "type": "dialogue", "speaker": "Carol", "text": "Y'know, I don't really know you well enough for you to do that."}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 5, "scene_id": "S10E04_005", "location": "Rachel's new job", "scene_description": "she's in her new boss's office (Kim's) and with the other assistant (Nancy). Together they're deciding what clothes to buy or something, who knows, let's all watch/read to find out.", "characters": ["Kim", "Nancy", "Rachel"], "firestore_path": "/episodes/S10E04/scenes/S10E04_005", "raw_text": "[Scene: Rachel's new job, she's in her new boss's office (Kim's) and with the other assistant (Nancy). Together they're deciding what clothes to buy or something, who knows, let's all watch/read to find out.]\nKim: So it's down to these two, Nancy I know you like this one and I think I agree. Rachel, what do you think?\nRachel: Well umm, that one is pretty but uh, I just, I just love this fabric (On the other one.) Sorry.\nKim: Oh don't be sorry, that's part of your job here to give your opinions and then I take credit for them--I'm kidding.\nNancy: She is kidding, but don't ever disagree with her again. Okay, now I'm kidding!\nRachel: (laughing nervously) Oh, what a fun office.\nKim: I don't know which one, but I do know I need a cigarette. So what do you say we take a break, we go outside, and we'll figure this out when we come back?\n(They all get up to leave.)\nKim: (at the door) Rachel? Do you smoke?\nRachel: Oh no, my dad's a doctor and he would always tell me just horror stories(stops and tries to change directions)about ghosts and goblins who totally supported the princess's right to smoke.", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Rachel's new job, she's in her new boss's office (Kim's) and with the other assistant (Nancy). Together they're deciding what clothes to buy or something, who knows, let's all watch/read to find out.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Kim", "text": "So it's down to these two, Nancy I know you like this one and I think I agree. Rachel, what do you think?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Well umm, that one is pretty but uh, I just, I just love this fabric (On the other one.) Sorry."}, {"line_number": 4, "type": "dialogue", "speaker": "Kim", "text": "Oh don't be sorry, that's part of your job here to give your opinions and then I take credit for them--I'm kidding."}, {"line_number": 5, "type": "dialogue", "speaker": "Nancy", "text": "She is kidding, but don't ever disagree with her again. Okay, now I'm kidding!"}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "(laughing nervously) Oh, what a fun office."}, {"line_number": 7, "type": "dialogue", "speaker": "Kim", "text": "I don't know which one, but I do know I need a cigarette. So what do you say we take a break, we go outside, and we'll figure this out when we come back?"}, {"line_number": 8, "type": "action", "text": "(They all get up to leave.)"}, {"line_number": 9, "type": "dialogue", "speaker": "Kim", "text": "(at the door) Rachel? Do you smoke?"}, {"line_number": 10, "type": "dialogue", "speaker": "Rachel", "text": "Oh no, my dad's a doctor and he would always tell me just horror stories(stops and tries to change directions)about ghosts and goblins who totally supported the princess's right to smoke."}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 6, "scene_id": "S10E04_006", "location": "Monica and Rachel's", "scene_description": "Rachel is telling Chandler and Monica about her day.", "characters": ["Chandler", "Joey", "Monica", "Phoebe", "Rachel", "Ross"], "firestore_path": "/episodes/S10E04/scenes/S10E04_006", "raw_text": "[Scene: Monica and Rachel's, Rachel is telling Chandler and Monica about her day.]\nRachel: and then they came back from smoking and they had made all of the decisions without me!\nMonica: That doesn't seem fair.\nRachel: I know! It's like I'm being punished for not having this disgusting, poisoning habit!\nChandler: Yeah, it is the best.\nRachel: I mean what if this keeps happening? Y'know, they'll-they'll be outside smoking, making all the decisions and I'll just be up in my office breathing my stupid clean air, y'know? And then when the day comes when Kim wants to promote one of us, who do you think she's gonna pick? Me or Smokey Smokerson?\nMonica: Rachel, you can go down there, you don't have to smoke. Just say you wanna get some fresh air.\nRachel: Yeah, I can do that.\nChandler: Yeah, or you can do the easy thing and smoke.\nPhoebe: (entering) Hey!\nMonica: Hey!\nPhoebe: Hey Rach, you wanna get some coffee?\nRachel: I would love to!\nPhoebe: Oh good!\nChandler: Yeah, I wanna go to babe.\nPhoebe: Oh good.\n(They all start out.)\nPhoebe: Oh wait, I change my mind! (She slams the door on them.) Okay, let's talk about the party! I have so many ideas! (Holds up a cocktail napkin.)\nMonica: Yeah, me too! (Runs and grabs her 3-ring binder of ideas.)\nPhoebe: Oh, look at that.\nMonica: All right, that's a little sketch of the cake, umm some sample menus, umm y'know what I thought we would start out with Tuscan style finger food, and for music, here's an alphabetized list of all my CDs! I've highlighted the ones that would go really good with the food.\nPhoebe: What happened to the intimate dinner party?\nMonica: Oh, we're not doing that. Okay\nPhoebe: So wow, it looks like you took care of everything. Thanks a lot, co-host.\nMonica: What?! I didn't take care of everything, there's-there's plenty of things for you to do!\nPhoebe: Like what?\nMonica: (Thinks) Cups.\nPhoebe: Cups? You're giving me cups?\nMonica: And ice!\nPhoebe: Cups and ice? Ooh, I get to be in charge of cups and ice? (Thinks of something) All right. Fine, okay, I will be in charge of cups and ice!\nMonica: Wait a minute, I can get ice at the restaurant\nPhoebe: I got it! Mine!\nRoss: (entering, downtrodden) Hi.\nMonica: Hey! How'd the audition go?!\nRoss: Not so good.\nMonica: Wait a minute, are you doing Joey's (sadly) \"Audition didn't go so well. (Happily) Yeah it did?\"\nRoss: (Pause) Yeah I am! Yeah, Ben got a second audition!\nJoey: (also downtrodden) Yeah, I had to teach Ross my bit because I actually didn't get a callback.\nMonica: You got a callback too didn't you?\nJoey: (Happily) Yeah I did!", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: Monica and Rachel's, Rachel is telling Chandler and Monica about her day.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Rachel", "text": "and then they came back from smoking and they had made all of the decisions without me!"}, {"line_number": 3, "type": "dialogue", "speaker": "Monica", "text": "That doesn't seem fair."}, {"line_number": 4, "type": "dialogue", "speaker": "Rachel", "text": "I know! It's like I'm being punished for not having this disgusting, poisoning habit!"}, {"line_number": 5, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, it is the best."}, {"line_number": 6, "type": "dialogue", "speaker": "Rachel", "text": "I mean what if this keeps happening? Y'know, they'll-they'll be outside smoking, making all the decisions and I'll just be up in my office breathing my stupid clean air, y'know? And then when the day comes when Kim wants to promote one of us, who do you think she's gonna pick? Me or Smokey Smokerson?"}, {"line_number": 7, "type": "dialogue", "speaker": "Monica", "text": "Rachel, you can go down there, you don't have to smoke. Just say you wanna get some fresh air."}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Yeah, I can do that."}, {"line_number": 9, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, or you can do the easy thing and smoke."}, {"line_number": 10, "type": "dialogue", "speaker": "Phoebe", "text": "(entering) Hey!"}, {"line_number": 11, "type": "dialogue", "speaker": "Monica", "text": "Hey!"}, {"line_number": 12, "type": "dialogue", "speaker": "Phoebe", "text": "Hey Rach, you wanna get some coffee?"}, {"line_number": 13, "type": "dialogue", "speaker": "Rachel", "text": "I would love to!"}, {"line_number": 14, "type": "dialogue", "speaker": "Phoebe", "text": "Oh good!"}, {"line_number": 15, "type": "dialogue", "speaker": "Chandler", "text": "Yeah, I wanna go to babe."}, {"line_number": 16, "type": "dialogue", "speaker": "Phoebe", "text": "Oh good."}, {"line_number": 17, "type": "action", "text": "(They all start out.)"}, {"line_number": 18, "type": "dialogue", "speaker": "Phoebe", "text": "Oh wait, I change my mind! (She slams the door on them.) Okay, let's talk about the party! I have so many ideas! (Holds up a cocktail napkin.)"}, {"line_number": 19, "type": "dialogue", "speaker": "Monica", "text": "Yeah, me too! (Runs and grabs her 3-ring binder of ideas.)"}, {"line_number": 20, "type": "dialogue", "speaker": "Phoebe", "text": "Oh, look at that."}, {"line_number": 21, "type": "dialogue", "speaker": "Monica", "text": "All right, that's a little sketch of the cake, umm some sample menus, umm y'know what I thought we would start out with Tuscan style finger food, and for music, here's an alphabetized list of all my CDs! I've highlighted the ones that would go really good with the food."}, {"line_number": 22, "type": "dialogue", "speaker": "Phoebe", "text": "What happened to the intimate dinner party?"}, {"line_number": 23, "type": "dialogue", "speaker": "Monica", "text": "Oh, we're not doing that. Okay"}, {"line_number": 24, "type": "dialogue", "speaker": "Phoebe", "text": "So wow, it looks like you took care of everything. Thanks a lot, co-host."}, {"line_number": 25, "type": "dialogue", "speaker": "Monica", "text": "What?! I didn't take care of everything, there's-there's plenty of things for you to do!"}, {"line_number": 26, "type": "dialogue", "speaker": "Phoebe", "text": "Like what?"}, {"line_number": 27, "type": "dialogue", "speaker": "Monica", "text": "(Thinks) Cups."}, {"line_number": 28, "type": "dialogue", "speaker": "Phoebe", "text": "Cups? You're giving me cups?"}, {"line_number": 29, "type": "dialogue", "speaker": "Monica", "text": "And ice!"}, {"line_number": 30, "type": "dialogue", "speaker": "Phoebe", "text": "Cups and ice? Ooh, I get to be in charge of cups and ice? (Thinks of something) All right. Fine, okay, I will be in charge of cups and ice!"}, {"line_number": 31, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, I can get ice at the restaurant"}, {"line_number": 32, "type": "dialogue", "speaker": "Phoebe", "text": "I got it! Mine!"}, {"line_number": 33, "type": "dialogue", "speaker": "Ross", "text": "(entering, downtrodden) Hi."}, {"line_number": 34, "type": "dialogue", "speaker": "Monica", "text": "Hey! How'd the audition go?!"}, {"line_number": 35, "type": "dialogue", "speaker": "Ross", "text": "Not so good."}, {"line_number": 36, "type": "dialogue", "speaker": "Monica", "text": "Wait a minute, are you doing Joey's (sadly) \"Audition didn't go so well. (Happily) Yeah it did?\""}, {"line_number": 37, "type": "dialogue", "speaker": "Ross", "text": "(Pause) Yeah I am! Yeah, Ben got a second audition!"}, {"line_number": 38, "type": "dialogue", "speaker": "Joey", "text": "(also downtrodden) Yeah, I had to teach Ross my bit because I actually didn't get a callback."}, {"line_number": 39, "type": "dialogue", "speaker": "Monica", "text": "You got a callback too didn't you?"}, {"line_number": 40, "type": "dialogue", "speaker": "Joey", "text": "(Happily) Yeah I did!"}]}
{"episode_id": "S10E04", "season": 10, "episode_number": 4, "episode_title": null, "scene_number": 7, "scene_id": "S10E04_007", "location": "The smoker's balcony", "scene_description": "Rachel is out to join Kim and Nancy.", "characters": ["Kim", "Nancy", "Rachel"], "firestore_path": "/episodes/S10E04/scenes/S10E04_007", "raw_text": "[Scene: The smoker's balcony, Rachel is out to join Kim and Nancy.]\nKim: Hey Rachel, what are you doing out here?\nRachel: Oh well, it's kinda lonely up there, so I just thought I would come out here and get some fresh air.\nKim: Nancy and I were talking about the fall collection.\nRachel: Oh great!\nKim: So anyway we really (Someone exhales and Rachel turns and coughs.) Honey, we're just smoking all over you.\nNancy: Oh, sorry!\nRachel: Oh that's okay.\nKim: No-no-no, we'll move you just stay right there. (They walk away.)\nNancy: So anyway I sent the designs over to Ralph and he's very excited about the line.\nKim: Oh that's great! You are the best!\n(Rachel gets fed up and heads over to another smoker.)", "lines": [{"line_number": 1, "type": "narration", "text": "[Scene: The smoker's balcony, Rachel is out to join Kim and Nancy.]"}, {"line_number": 2, "type": "dialogue", "speaker": "Kim", "text": "Hey Rachel, what are you doing out here?"}, {"line_number": 3, "type": "dialogue", "speaker": "Rachel", "text": "Oh well, it's kinda lonely up there, so I just thought I would come out here and get some fresh air."}, {"line_number": 4, "type": "dialogue", "speaker": "Kim", "text": "Nancy and I were talking about the fall collection."}, {"line_number": 5, "type": "dialogue", "speaker": "Rachel", "text": "Oh great!"}, {"line_number": 6, "type": "dialogue", "speaker": "Kim", "text": "So anyway we really (Someone exhales and Rachel turns and coughs.) Honey, we're just smoking all over you."}, {"line_number": 7, "type": "dialogue", "speaker": "Nancy", "text": "Oh, sorry!"}, {"line_number": 8, "type": "dialogue", "speaker": "Rachel", "text": "Oh that's okay."}, {"line_number": 9, "type": "dialogue", "speaker": "Kim", "text": "No-no-no, we'll move you just stay right there. (They walk away.)"}, {"line_number": 10, "type": "dialogue", "speaker": "Nancy", "text": "So anyway I sent the designs over to Ralph and he's very excited about the line."}, {"line_number": 11, "type": "dialogue", "speaker": "Kim", "text": "Oh that's great! You are the best!"}, {"line_number": 12, "type": "action", "text": "(Rachel gets fed up and heads over to another smoker.)"}]}
